Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: The default permissions are <literal>0777</literal>, meaning anyone can connect. Reasonable alternatives are <literal>0770</literal> (only user and group, see also <varname>unix_socket_group</varname>) and <literal>0700</literal> (only user). (Note that for a Unix-domain socket, only write permission matters, so there is no point in setting or revoking read or execute permissions.)
ru: По умолчанию действуют разрешения <literal>0777</literal>, при которых подключаться к сокету могут все. Другие разумные варианты — <literal>0770</literal> (доступ имеет только пользователь и группа, см. также <varname>unix_socket_group</varname>) и <literal>0700</literal> (только пользователь). (Заметьте, что для доменных сокетов требуется только право на запись, так что добавлять или отзывать права на чтение/выполнение не имеет смысла.)

source: This access control mechanism is independent of the one described in <xref linkend="client-authentication"/>.
ru: Этот механизм управления доступом не зависит от описанного в <xref remap="6" linkend="client-authentication"/>.

source: This parameter can only be set at server start.
ru: Этот параметр можно задать только при запуске сервера.

source: This parameter is irrelevant on systems, notably Solaris as of Solaris 10, that ignore socket permissions entirely. There, one can achieve a similar effect by pointing <varname>unix_socket_directories</varname> to a directory having search permission limited to the desired audience. This parameter is also irrelevant on Windows, which does not have Unix-domain sockets.
ru: Данный параметр неприменим для некоторых систем, в частности, Solaris (а именно Solaris 10), которые полностью игнорируют разрешения для сокетов. В таких системах примерно тот же эффект можно получить, указав в параметре <varname>unix_socket_directories</varname> каталог, доступ к которому ограничен должным образом. Этот параметр также неприменим в Windows, где нет доменных сокетов Unix.

source: <primary><varname>bonjour</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>bonjour</varname></primary>

source: Enables advertising the server's existence via <productname>Bonjour</productname>. The default is off. This parameter can only be set at server start.
ru: Включает объявления о существовании сервера посредством <productname>Bonjour</productname>. По умолчанию выключен. Задать этот параметр можно только при запуске сервера.

source: <primary><varname>bonjour_name</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>bonjour_name</varname></primary>

source: Specifies the <productname>Bonjour</productname> service name. The computer name is used if this parameter is set to the empty string <literal>''</literal> (which is the default). This parameter is ignored if the server was not compiled with <productname>Bonjour</productname> support. This parameter can only be set at server start.
ru: Задаёт имя службы в среде <productname>Bonjour</productname>. Если значение этого параметра — пустая строка (<literal>''</literal>) (это значение по умолчанию), в качестве этого имени используется имя компьютера. Этот параметр игнорируется, если сервер был скомпилирован без поддержки <productname>Bonjour</productname>. Задать этот параметр можно только при запуске сервера.

source: <primary><varname>tcp_keepalives_idle</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>tcp_keepalives_idle</varname></primary>

source: Specifies the number of seconds of inactivity after which TCP should send a keepalive message to the client. A value of 0 uses the system default. This parameter is supported only on systems that support <symbol>TCP_KEEPIDLE</symbol> or an equivalent socket option, and on Windows; on other systems, it must be zero. In sessions connected via a Unix-domain socket, this parameter is ignored and always reads as zero.
ru: Задаёт период неактивности (в секундах), после которого по TCP клиенту должен отправляться сигнал сохранения соединения. При значении 0 действует системное значение. Этот параметр поддерживается только в системах, воспринимающих параметр сокета <symbol>TCP_KEEPIDLE</symbol> или равнозначный, и в Windows; в других системах он должен быть равен нулю. В сеансах, подключённых через доменные сокеты Unix, он игнорируется и всегда считается равным 0.

source: On Windows, a value of 0 will set this parameter to 2 hours, since Windows does not provide a way to read the system default value.
ru: В Windows при нулевом значении этот период устанавливается равным 2 часам, так как Windows не позволяет прочитать системное значение по умолчанию.

source: <primary><varname>tcp_keepalives_interval</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>tcp_keepalives_interval</varname></primary>

source: Specifies the number of seconds after which a TCP keepalive message that is not acknowledged by the client should be retransmitted. A value of 0 uses the system default. This parameter is supported only on systems that support <symbol>TCP_KEEPINTVL</symbol> or an equivalent socket option, and on Windows; on other systems, it must be zero. In sessions connected via a Unix-domain socket, this parameter is ignored and always reads as zero.
ru: Задаёт интервал (в секундах), по истечении которого следует повторять сигнал сохранения соединения, если ответ от клиента не был получен. При значении 0 действует системное значение. Этот параметр поддерживается только в системах, воспринимающих параметр сокета <symbol>TCP_KEEPINTVL</symbol> или равнозначный, и в Windows; в других системах он должен быть равен нулю. В сеансах, подключённых через доменные сокеты Unix, он игнорируется и всегда считается равным 0.

source: On Windows, a value of 0 will set this parameter to 1 second, since Windows does not provide a way to read the system default value.
ru: В Windows при нулевом значении этот интервал устанавливается равным 1 секунде, так как Windows не позволяет прочитать системное значение по умолчанию.

source: <primary><varname>tcp_keepalives_count</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>tcp_keepalives_count</varname></primary>

source: Specifies the number of TCP keepalives that can be lost before the server's connection to the client is considered dead. A value of 0 uses the system default. This parameter is supported only on systems that support <symbol>TCP_KEEPCNT</symbol> or an equivalent socket option; on other systems, it must be zero. In sessions connected via a Unix-domain socket, this parameter is ignored and always reads as zero.
ru: Задаёт число TCP-сигналов сохранения соединения, которые могут быть потеряны до того, как соединение сервера с клиентом будет признано прерванным. При значении 0 действует системное значение. Этот параметр поддерживается только в системах, воспринимающих параметр сокета <symbol>TCP_KEEPCNT</symbol> или равнозначный; в других системах он должен быть равен нулю. В сеансах, подключённых через доменные сокеты Unix, он игнорируется и всегда считается равным 0.

source: This parameter is not supported on Windows, and must be zero.
ru: В Windows данный параметр не поддерживается и должен быть равен нулю.

source: Security and Authentication
ru: Безопасность и аутентификация

source: <primary>timeout</primary><secondary>client authentication</secondary>
ru: <primary>тайм-аут</primary> <secondary>проверка подлинности клиента</secondary>

source: <primary>client authentication</primary><secondary>timeout during</secondary>
ru: <primary>проверке подлинности</primary> <secondary>тайм-аут при</secondary>

source: <primary><varname>authentication_timeout</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>authentication_timeout</varname></primary>

source: Maximum time to complete client authentication, in seconds. If a would-be client has not completed the authentication protocol in this much time, the server closes the connection. This prevents hung clients from occupying a connection indefinitely. The default is one minute (<literal>1m</literal>). This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Максимальное время, за которое должна произойти аутентификация (в секундах). Если потенциальный клиент не сможет пройти проверку подлинности за это время, сервер закроет соединение. Благодаря этому, зависшие при подключении клиенты не будут занимать соединения неограниченно долго. Значение этого параметра по умолчанию — одна минута (<literal>1m</literal>). Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>ssl</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>ssl</varname></primary>

source: Enables <acronym>SSL</acronym> connections. Please read <xref linkend="ssl-tcp"/> before using this. The default is <literal>off</literal>. This parameter can only be set at server start. <acronym>SSL</acronym> communication is only possible with TCP/IP connections.
ru: Разрешает <acronym>SSL</acronym>-подключения. Прежде чем включать SSL, прочитайте <xref remap="4" linkend="ssl-tcp"/>. По умолчанию он выключен (<literal>off</literal>). Этот параметр можно задать только при запуске сервера. <acronym>SSL</acronym>-подключения поддерживаются только для соединений по TCP/IP.

source: <primary><varname>ssl_ca_file</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>ssl_ca_file</varname></primary>

source: Specifies the name of the file containing the SSL server certificate authority (CA). The default is empty, meaning no CA file is loaded, and client certificate verification is not performed. (In previous releases of PostgreSQL, the name of this file was hard-coded as <filename>root.crt</filename>.) Relative paths are relative to the data directory. This parameter can only be set at server start.
ru: Задаёт имя файла, содержащего сертификаты центров сертификации (ЦС) для SSL-сервера. По умолчанию этот параметр пуст; то есть информация о ЦС не загружается и проверка клиентских сертификатов не выполняется. (В предыдущих выпусках PostgreSQL это имя было фиксированным: <filename>root.crt</filename>.) При указании относительного пути он рассматривается от каталога данных. Задать этот параметр можно только при запуске сервера.

source: <primary><varname>ssl_cert_file</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>ssl_cert_file</varname></primary>

source: Specifies the name of the file containing the SSL server certificate. The default is <filename>server.crt</filename>. Relative paths are relative to the data directory. This parameter can only be set at server start.
ru: Задаёт имя файла, содержащего сертификат SSL-сервера. Имя по умолчанию — <filename>server.crt</filename>. Относительные пути рассматриваются от каталога данных. Задать этот параметр можно только при запуске сервера.

source: <primary><varname>ssl_crl_file</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>ssl_crl_file</varname></primary>

source: Specifies the name of the file containing the SSL server certificate revocation list (CRL). The default is empty, meaning no CRL file is loaded. (In previous releases of PostgreSQL, the name of this file was hard-coded as <filename>root.crl</filename>.) Relative paths are relative to the data directory. This parameter can only be set at server start.
ru: Задаёт имя файла, содержащего список отзыва сертификатов (CRL) для SSL-сервера. По умолчанию не определён, то есть файл CRL не загружается. (В предыдущих выпусках PostgreSQL это имя было фиксированным: <filename>root.crl</filename>.) При указании относительного пути он рассматривается от каталога данных. Задать этот параметр можно только при запуске сервера.

source: <primary><varname>ssl_key_file</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>ssl_key_file</varname></primary>

source: Specifies the name of the file containing the SSL server private key. The default is <filename>server.key</filename>. Relative paths are relative to the data directory. This parameter can only be set at server start.
ru: Задаёт имя файла, содержащего закрытый ключ SSL-сервера. По умолчанию имеет значение <filename>server.key</filename>. При указании относительного пути он рассматривается от каталога данных. Задать этот параметр можно только при запуске сервера.

source: <primary><varname>ssl_ciphers</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>ssl_ciphers</varname></primary>

source: Specifies a list of <acronym>SSL</acronym> cipher suites that are allowed to be used on secure connections. See the <citerefentry><refentrytitle>ciphers</refentrytitle></citerefentry> manual page in the <application>OpenSSL</application> package for the syntax of this setting and a list of supported values. The default value is <literal>HIGH:MEDIUM:+3DES:!aNULL</literal>. It is usually reasonable, unless you have specific security requirements. This parameter can only be set at server start.
ru: Задаёт список наборов шифров <acronym>SSL</acronym>, которые могут применяться для защиты соединений. Синтаксис этого параметра и список поддерживаемых значений можно найти на странице <citerefentry><refentrytitle>ciphers</refentrytitle></citerefentry> руководства по <application>OpenSSL</application>. По умолчанию этот параметр имеет значение <literal>HIGH:MEDIUM:+3DES:!aNULL</literal>. Обычно оно вполне приемлемо при отсутствии особых требований по безопасности. Этот параметр можно задать только при запуске сервера.

source: Cipher suites that use ciphers from <literal>HIGH</literal> group (e.g., AES, Camellia, 3DES)
ru: Наборы шифров, в которых используются шифры из группы высокого уровня (<literal>HIGH</literal>), (например: AES, Camellia, 3DES)

source: Cipher suites that use ciphers from <literal>MEDIUM</literal> group (e.g., RC4, SEED)
ru: Наборы шифров, в которых используются шифры из группы среднего уровня (<literal>MEDIUM</literal>) (например, RC4, SEED)

source: The OpenSSL default order for <literal>HIGH</literal> is problematic because it orders 3DES higher than AES128. This is wrong because 3DES offers less security than AES128, and it is also much slower. <literal>+3DES</literal> reorders it after all other <literal>HIGH</literal> and <literal>MEDIUM</literal> ciphers.
ru: Порядок шифров для группы <literal>HIGH</literal> по умолчанию в OpenSSL определён некорректно. В нём 3DES оказывается выше AES128, что неправильно, так как он считается менее безопасным, чем AES128, и работает гораздо медленнее. Включение <literal>+3DES</literal> меняет этот порядок, чтобы данный алгоритм следовал после всех шифров групп <literal>HIGH</literal> и <literal>MEDIUM</literal>.

source: Disables anonymous cipher suites that do no authentication. Such cipher suites are vulnerable to man-in-the-middle attacks and therefore should not be used.
ru: Отключает наборы анонимных шифров, не требующие проверки подлинности. Такие наборы уязвимы для атак с посредником, поэтому использовать их не следует.

source: Explanation of the default value: <placeholder-1/>
ru: Объяснение значения по умолчанию: <placeholder-1/>

source: Available cipher suite details will vary across OpenSSL versions. Use the command <literal>openssl ciphers -v 'HIGH:MEDIUM:+3DES:!aNULL'</literal> to see actual details for the currently installed <application>OpenSSL</application> version. Note that this list is filtered at run time based on the server key type.
ru: Конкретные наборы шифров и их свойства очень различаются от версии к версии OpenSSL. Чтобы получить фактическую информацию о них для текущей установленной версии <application>OpenSSL</application>, выполните команду <literal>openssl ciphers -v 'HIGH:MEDIUM:+3DES:!aNULL'</literal>. Учтите, что этот список фильтруется во время выполнения, в зависимости от типа ключа сервера.

source: <primary><varname>ssl_prefer_server_ciphers</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>ssl_prefer_server_ciphers</varname></primary>

source: Specifies whether to use the server's SSL cipher preferences, rather than the client's. The default is true. This parameter can only be set at server start.
ru: Определяет, должны ли шифры SSL сервера предпочитаться клиентским. По умолчанию предпочтение отдаётся шифрам сервера. Этот параметр можно задать только при запуске сервера.

source: Older PostgreSQL versions do not have this setting and always use the client's preferences. This setting is mainly for backward compatibility with those versions. Using the server's preferences is usually better because it is more likely that the server is appropriately configured.
ru: В старых версиях PostgreSQL этот параметр отсутствовал и предпочтение отдавалось выбору клиента. Введён этот параметр в основном для обеспечения совместимости с этими версиями. Вообще же обычно лучше использовать конфигурацию сервера, так как в конфигурации на стороне клиента более вероятны ошибки.

source: <primary><varname>ssl_ecdh_curve</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>ssl_ecdh_curve</varname></primary>

source: Specifies the name of the curve to use in <acronym>ECDH</acronym> key exchange. It needs to be supported by all clients that connect. It does not need to be same curve as used by server's Elliptic Curve key. The default is <literal>prime256v1</literal>. This parameter can only be set at server start.
ru: Задаёт имя кривой для использования при обмене ключами <acronym>ECDH</acronym>. Эту кривую должны поддерживать все подключающиеся клиенты. Это не обязательно должна быть кривая, с которой был получен ключ сервера. По умолчанию выбирается кривая <literal>prime256v1</literal>. Этот параметр можно задать только при запуске сервера.

source: OpenSSL names for most common curves: <literal>prime256v1</literal> (NIST P-256), <literal>secp384r1</literal> (NIST P-384), <literal>secp521r1</literal> (NIST P-521).
ru: Наиболее популярные кривые OpenSSL: <literal>prime256v1</literal> (NIST P-256), <literal>secp384r1</literal> (NIST P-384) и <literal>secp521r1</literal> (NIST P-521).

source: The full list of available curves can be shown with the command <command>openssl ecparam -list_curves</command>. Not all of them are usable in <acronym>TLS</acronym> though.
ru: Полный список доступных кривых можно получить командой <command>openssl ecparam -list_curves</command>. Однако не все из них пригодны для <acronym>TLS</acronym>.

source: <primary><varname>password_encryption</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>password_encryption</varname></primary>

source: When a password is specified in <xref linkend="sql-createuser"/> or <xref linkend="sql-alterrole"/> without writing either <literal>ENCRYPTED</literal> or <literal>UNENCRYPTED</literal>, this parameter determines whether the password is to be encrypted. The default is <literal>on</literal> (encrypt the password).
ru: Этот параметр определяет, будет ли пароль шифроваться, когда он передаётся в <xref linkend="sql-createuser"/> или <xref linkend="sql-alterrole"/> без указания <literal>ENCRYPTED</literal> или <literal>UNENCRYPTED</literal>. По умолчанию этот параметр установлен (<literal>on</literal>), то есть пароль шифруется.

source: <primary><varname>krb_server_keyfile</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>krb_server_keyfile</varname></primary>

source: Sets the location of the Kerberos server key file. See <xref linkend="gssapi-auth"/> for details. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Задаёт размещение файла ключей для сервера Kerberos. За подробностями обратитесь к <xref remap="3" linkend="gssapi-auth"/>. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>krb_caseins_users</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>krb_caseins_users</varname></primary>

source: Sets whether GSSAPI user names should be treated case-insensitively. The default is <literal>off</literal> (case sensitive). This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Определяет, должны ли имена пользователей GSSAPI обрабатываться без учёта регистра. По умолчанию значение этого параметра — <literal>off</literal> (регистр учитывается). Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>db_user_namespace</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>db_user_namespace</varname></primary>

source: This parameter enables per-database user names. It is off by default. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Этот параметр позволяет относить имена пользователей к базам данных. По умолчанию он имеет значение off (выключен). Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: If this is on, you should create users as <replaceable>username@dbname</replaceable>. When <replaceable>username</replaceable> is passed by a connecting client, <literal>@</literal> and the database name are appended to the user name and that database-specific user name is looked up by the server. Note that when you create users with names containing <literal>@</literal> within the SQL environment, you will need to quote the user name.
ru: Если он включён, имена создаваемых пользователей должны иметь вид <replaceable>имя_пользователя@база_данных</replaceable>. Когда подключающийся клиент передаёт <replaceable>имя_пользователя</replaceable>, к этому имени добавляется <literal>@</literal> с именем базы данных, и сервер идентифицирует пользователя по этому полному имени. Заметьте, что для создания пользователя с именем, содержащим <literal>@</literal>, в среде SQL потребуется заключить это имя в кавычки.

source: With this parameter enabled, you can still create ordinary global users. Simply append <literal>@</literal> when specifying the user name in the client, e.g. <literal>joe@</literal>. The <literal>@</literal> will be stripped off before the user name is looked up by the server.
ru: Когда этот параметр включён, он не мешает создавать и использовать обычных глобальных пользователей. Чтобы подключиться с таким именем пользователя, достаточно добавить к имени <literal>@</literal>, например так: <literal>joe@</literal>. Получив такое имя, сервер отбросит <literal>@</literal>, и будет идентифицировать пользователя по начальному имени.
