Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: Server Configuration
ru: Настройка сервера

source: <primary>configuration</primary> <secondary>of the server</secondary>
ru: <primary>настройка</primary> <secondary>сервера</secondary>

source: There are many configuration parameters that affect the behavior of the database system. In the first section of this chapter we describe how to interact with configuration parameters. The subsequent sections discuss each parameter in detail.
ru: На работу системы баз данных оказывают влияние множество параметров конфигурации. В первом разделе этой главы рассказывается, как управлять этими параметрами, а в последующих разделах подробно описывается каждый из них.

source: Setting Parameters
ru: Изменение параметров

source: Parameter Names and Values
ru: Имена и значения параметров

source: All parameter names are case-insensitive. Every parameter takes a value of one of five types: boolean, string, integer, floating point, or enumerated (enum). The type determines the syntax for setting the parameter:
ru: Имена всех параметров являются регистронезависимыми. Каждый параметр принимает значение одного из пяти типов: логический, строка, целое, число с плавающей точкой или перечисление. От типа значения зависит синтаксис установки этого параметра:

source: <emphasis>Boolean:</emphasis> Values can be written as <literal>on</literal>, <literal>off</literal>, <literal>true</literal>, <literal>false</literal>, <literal>yes</literal>, <literal>no</literal>, <literal>1</literal>, <literal>0</literal> (all case-insensitive) or any unambiguous prefix of one of these.
ru: <emphasis>Логический:</emphasis> Значения могут задаваться строками <literal>on</literal>, <literal>off</literal>, <literal>true</literal>, <literal>false</literal>, <literal>yes</literal>, <literal>no</literal>, <literal>1</literal>, <literal>0</literal> (регистр не имеет значения), либо как достаточно однозначный префикс одной из этих строк.

source: <emphasis>String:</emphasis> In general, enclose the value in single quotes, doubling any single quotes within the value. Quotes can usually be omitted if the value is a simple number or identifier, however.
ru: <emphasis>Строка:</emphasis> Обычно строковое значение заключается в апострофы (при этом внутренние апострофы дублируются). Однако, если значение является простым числом или идентификатором, апострофы обычно можно опустить.

source: <emphasis>Numeric (integer and floating point):</emphasis> A decimal point is permitted only for floating-point parameters. Do not use thousands separators. Quotes are not required.
ru: <emphasis>Число (целое или с плавающей точкой):</emphasis> Десятичная точка как разделитель целой и дробной части допускается только для параметров, принимающих числа с плавающей точкой. Разделители разрядов в записи числа не принимаются. Заключать в апострофы число не требуется.

source: Valid memory units are <literal>kB</literal> (kilobytes), <literal>MB</literal> (megabytes), <literal>GB</literal> (gigabytes), and <literal>TB</literal> (terabytes). The multiplier for memory units is 1024, not 1000.
ru: Допустимые единицы информации: <literal>kB</literal> (килобайты), <literal>MB</literal> (мегабайты), <literal>GB</literal> (гигабайты) и <literal>TB</literal> (терабайты). Множителем единиц информации считается 1024, не 1000.

source: Valid time units are <literal>ms</literal> (milliseconds), <literal>s</literal> (seconds), <literal>min</literal> (minutes), <literal>h</literal> (hours), and <literal>d</literal> (days).
ru: Допустимые единицы времени: <literal>ms</literal> (миллисекунды), <literal>s</literal> (секунды), <literal>min</literal> (минуты), <literal>h</literal> (часы) и <literal>d</literal> (дни).

source: <emphasis>Numeric with Unit:</emphasis> Some numeric parameters have an implicit unit, because they describe quantities of memory or time. The unit might be kilobytes, blocks (typically eight kilobytes), milliseconds, seconds, or minutes. An unadorned numeric value for one of these settings will use the setting's default unit, which can be learned from <structname>pg_settings</structname>.<structfield>unit</structfield>. For convenience, settings can be given with a unit specified explicitly, for example <literal>'120 ms'</literal> for a time value, and they will be converted to whatever the parameter's actual unit is. Note that the value must be written as a string (with quotes) to use this feature. The unit name is case-sensitive, and there can be whitespace between the numeric value and the unit. <placeholder-1/>
ru: <emphasis>Число с единицей измерения:</emphasis> Некоторые числовые параметры задаются с единицами измерения, так как они описывают количества информации или времени. Единицами могут быть килобайты, блоки (обычно восемь килобайт), миллисекунды, секунды или минуты. При указании только числового значения для такого параметра единицей измерения будет считаться единица по умолчанию для параметра, которая указывается в <structname>pg_settings</structname>.<structfield>unit</structfield>. Для удобства параметры также можно задавать, указывая единицу измерения явно, например, задать <literal>'120 ms'</literal> для значения времени, при этом такое значение будет переведено в основную единицу измерения параметра. Заметьте, что для этого значение должно записываться в виде строки (в апострофах). Имя единицы является регистронезависимым, а между ним и числом допускаются пробельные символы. <placeholder-1/>

source: <emphasis>Enumerated:</emphasis> Enumerated-type parameters are written in the same way as string parameters, but are restricted to have one of a limited set of values. The values allowable for such a parameter can be found from <structname>pg_settings</structname>.<structfield>enumvals</structfield>. Enum parameter values are case-insensitive.
ru: <emphasis>Перечисление:</emphasis> Параметры, имеющие тип перечисление, записываются так же, как строковые параметры, но могут иметь только ограниченный набор значений. Список допустимых значений такого параметра задаётся в <structname>pg_settings</structname>.<structfield>enumvals</structfield>. В значениях перечислений регистр не учитывается.

source: Parameter Interaction via the Configuration File
ru: Определение параметров в файле конфигурации

source: # This is a comment log_connections = yes log_destination = 'syslog' search_path = '"$user", public' shared_buffers = 128MB
ru: # Это комментарий log_connections = yes log_destination = 'syslog' search_path = '"$user", public' shared_buffers = 128MB

source: The most fundamental way to set these parameters is to edit the file <filename>postgresql.conf</filename><placeholder-1/>, which is normally kept in the data directory. A default copy is installed when the database cluster directory is initialized. An example of what this file might look like is: <placeholder-2/> One parameter is specified per line. The equal sign between name and value is optional. Whitespace is insignificant (except within a quoted parameter value) and blank lines are ignored. Hash marks (<literal>#</literal>) designate the remainder of the line as a comment. Parameter values that are not simple identifiers or numbers must be single-quoted. To embed a single quote in a parameter value, write either two quotes (preferred) or backslash-quote.
ru: Самый основной способ установки этих параметров — определение их значений в файле <filename>postgresql.conf</filename><placeholder-1/>, который обычно находится в каталоге данных. При инициализации каталога кластера БД в этот каталог помещается копия стандартного файла. Например, он может выглядеть так: <placeholder-2/> Каждый параметр определяется в отдельной строке. Знак равенства в ней между именем и значением является необязательным. Пробельные символы в строке не играют роли (кроме значений, заключённых в апострофы), а пустые строки игнорируются. Знаки решётки (<literal>#</literal>) обозначают продолжение строки как комментарий. Значения параметров, не являющиеся простыми идентификаторами или числами, должны заключаться в апострофы. Чтобы включить в такое значение собственно апостроф, его следует продублировать (предпочтительнее) или предварить обратной косой чертой.

source: Parameters set in this way provide default values for the cluster. The settings seen by active sessions will be these values unless they are overridden. The following sections describe ways in which the administrator or user can override these defaults.
ru: Параметры, установленные таким образом, задают значения по умолчанию для данного кластера. Эти значения будут действовать в активных сеансах, если не будут переопределены. В следующих разделах описывается, как их может переопределить администратор или пользователь.

source: <placeholder-1/> The configuration file is reread whenever the main server process receives a <systemitem>SIGHUP</systemitem> signal; this signal is most easily sent by running <literal>pg_ctl reload</literal> from the command line or by calling the SQL function <function>pg_reload_conf()</function>. The main server process also propagates this signal to all currently running server processes, so that existing sessions also adopt the new values (this will happen after they complete any currently-executing client command). Alternatively, you can send the signal to a single server process directly. Some parameters can only be set at server start; any changes to their entries in the configuration file will be ignored until the server is restarted. Invalid parameter settings in the configuration file are likewise ignored (but logged) during <systemitem>SIGHUP</systemitem> processing.
ru: <placeholder-1/> Основной процесс сервера перечитывает файл конфигурации заново, получая сигнал <systemitem>SIGHUP</systemitem>; послать его проще всего можно, запустив <literal>pg_ctl reload</literal> в командной строке или вызвав SQL-функцию <function>pg_reload_conf()</function>. Основной процесс сервера передаёт этот сигнал всем остальным запущенным серверным процессам, так что существующие сеансы тоже получают новые значения (после того, как завершится выполнение текущей команды клиента). Также возможно послать этот сигнал напрямую одному из серверных процессов. Учтите, что некоторые параметры можно установить только при запуске сервера; любые изменения их значений в файле конфигурации не будут учитываться до перезапуска сервера. Более того, при обработке <systemitem>SIGHUP</systemitem> игнорируются неверные значения параметров (но об этом сообщается в журнале).

source: In addition to <filename>postgresql.conf</filename>, a <productname>PostgreSQL</productname> data directory contains a file <filename>postgresql.auto.conf</filename><placeholder-1/>, which has the same format as <filename>postgresql.conf</filename> but should never be edited manually. This file holds settings provided through the <xref linkend="sql-altersystem"/> command. This file is automatically read whenever <filename>postgresql.conf</filename> is, and its settings take effect in the same way. Settings in <filename>postgresql.auto.conf</filename> override those in <filename>postgresql.conf</filename>.
ru: В дополнение к <filename>postgresql.conf</filename> в каталоге данных <productname>PostgreSQL</productname> содержится файл <filename>postgresql.auto.conf</filename><placeholder-1/>, который имеет тот же формат, что и <filename>postgresql.conf</filename>, но не должен редактироваться вручную. Этот файл содержит параметры, задаваемые командой <xref linkend="sql-altersystem"/>. Он считывается автоматически одновременно с <filename>postgresql.conf</filename> и заданные в нём параметры действуют таким же образом. Параметры в <filename>postgresql.auto.conf</filename> переопределяют те, что указаны в <filename>postgresql.conf</filename>.

source: The system view <link linkend="view-pg-file-settings"><structname>pg_file_settings</structname></link> can be helpful for pre-testing changes to the configuration file, or for diagnosing problems if a <systemitem>SIGHUP</systemitem> signal did not have the desired effects.
ru: Системное представление <link linkend="view-pg-file-settings"><structname>pg_file_settings</structname></link> может быть полезным для предварительной проверки изменений в файле конфигурации или диагностики проблем, если сигнал <systemitem>SIGHUP</systemitem> не даёт желаемого эффекта.

source: Parameter Interaction via SQL
ru: Управление параметрами через SQL

source: <productname>PostgreSQL</productname> provides three SQL commands to establish configuration defaults. The already-mentioned <xref linkend="sql-altersystem"/> command provides a SQL-accessible means of changing global defaults; it is functionally equivalent to editing <filename>postgresql.conf</filename>. In addition, there are two commands that allow setting of defaults on a per-database or per-role basis:
ru: В <productname>PostgreSQL</productname> есть три SQL-команды, задающие для параметров значения по умолчанию. Уже упомянутая команда <xref linkend="sql-altersystem"/> даёт возможность изменять глобальные значения средствами SQL; она функционально равнозначна редактированию <filename>postgresql.conf</filename>. Кроме того, есть ещё две команды, которые позволяют задавать значения по умолчанию на уровне баз данных и ролей:

source: The <xref linkend="sql-alterdatabase"/> command allows global settings to be overridden on a per-database basis.
ru: Команда <xref linkend="sql-alterdatabase"/> позволяет переопределить глобальные параметры на уровне базы данных.

source: The <xref linkend="sql-alterrole"/> command allows both global and per-database settings to be overridden with user-specific values.
ru: Команда <xref linkend="sql-alterrole"/> позволяет переопределить для конкретного пользователя как глобальные, так и локальные для базы данных параметры.

source: Values set with <command>ALTER DATABASE</command> and <command>ALTER ROLE</command> are applied only when starting a fresh database session. They override values obtained from the configuration files or server command line, and constitute defaults for the rest of the session. Note that some settings cannot be changed after server start, and so cannot be set with these commands (or the ones listed below).
ru: Значения, установленные командами <command>ALTER DATABASE</command> и <command>ALTER ROLE</command>, применяются только при новом подключении к базе данных. Они переопределяют значения, полученные из файлов конфигурации или командной строки сервера, и применяются по умолчанию в рамках сеанса. Заметьте, что некоторые параметры невозможно изменить после запуска сервера, поэтому их нельзя установить этими командами (или командами, перечисленными ниже).

source: Once a client is connected to the database, <productname>PostgreSQL</productname> provides two additional SQL commands (and equivalent functions) to interact with session-local configuration settings:
ru: Когда клиент подключён к базе данных, он может воспользоваться двумя дополнительными командами SQL (и равнозначными функциями), которые предоставляет <productname>PostgreSQL</productname> для управления параметрами конфигурации:

source: The <xref linkend="sql-show"/> command allows inspection of the current value of all parameters. The corresponding function is <function>current_setting(setting_name text)</function>.
ru: Команда <xref linkend="sql-show"/> позволяет узнать текущее значение всех параметров. Соответствующая ей функция — <function>current_setting(имя_параметра text)</function>.

source: The <xref linkend="sql-set"/> command allows modification of the current value of those parameters that can be set locally to a session; it has no effect on other sessions. The corresponding function is <function>set_config(setting_name, new_value, is_local)</function>.
ru: Команда <xref linkend="sql-set"/> позволяет изменить текущее значение параметров, которые действуют локально в рамках сеанса; на другие сеансы она не влияет. Соответствующая ей функция — <function>set_config(имя_параметра, новое_значение, локально)</function>.

source: In addition, the system view <link linkend="view-pg-settings"><structname>pg_settings</structname></link> can be used to view and change session-local values:
ru: Кроме того, просмотреть и изменить значения параметров для текущего сеанса можно в системном представлении <link linkend="view-pg-settings"><structname>pg_settings</structname></link>:

source: Querying this view is similar to using <command>SHOW ALL</command> but provides more detail. It is also more flexible, since it's possible to specify filter conditions or join against other relations.
ru: Запрос на чтение представления выдаёт ту же информацию, что и <command>SHOW ALL</command>, но более подробно. Этот подход и более гибкий, так как в нём можно указать условия фильтра или связать результат с другими отношениями.

source: Using <xref linkend="sql-update"/> on this view, specifically updating the <structname>setting</structname> column, is the equivalent of issuing <command>SET</command> commands. For example, the equivalent of <placeholder-1/> is: <placeholder-2/>
ru: Выполнение <xref linkend="sql-update"/> для этого представления, а именно присвоение значения столбцу, равносильно выполнению команды <command>SET</command>. Например, команде <placeholder-1/> равнозначен запрос: <placeholder-2/>

source: Parameter Interaction via the Shell
ru: Управление параметрами в командной строке

source: In addition to setting global defaults or attaching overrides at the database or role level, you can pass settings to <productname>PostgreSQL</productname> via shell facilities. Both the server and <application>libpq</application> client library accept parameter values via the shell.
ru: Помимо изменения глобальных значений по умолчанию и переопределения их на уровне базы данных или роли, параметры <productname>PostgreSQL</productname> можно изменить, используя средства командной строки. Управление через командную строку поддерживают и сервер, и клиентская библиотека <application>libpq</application>.

source: During server startup, parameter settings can be passed to the <command>postgres</command> command via the <option>-c</option> command-line parameter. For example, <placeholder-1/> Settings provided in this way override those set via <filename>postgresql.conf</filename> or <command>ALTER SYSTEM</command>, so they cannot be changed globally without restarting the server.
ru: При запуске сервера, значения параметров можно передать команде <command>postgres</command> в аргументе командной строки <option>-c</option>. Например: <placeholder-1/> Параметры, заданные таким образом, переопределяют те, что были установлены в <filename>postgresql.conf</filename> или командой <command>ALTER SYSTEM</command>, так что их нельзя изменить глобально без перезапуска сервера.

source: When starting a client session via <application>libpq</application>, parameter settings can be specified using the <envar>PGOPTIONS</envar> environment variable. Settings established in this way constitute defaults for the life of the session, but do not affect other sessions. For historical reasons, the format of <envar>PGOPTIONS</envar> is similar to that used when launching the <command>postgres</command> command; specifically, the <option>-c</option> flag must be specified. For example, <placeholder-1/>
ru: При запуске клиентского сеанса, использующего <application>libpq</application>, значения параметров можно указать в переменной окружения <envar>PGOPTIONS</envar>. Заданные таким образом параметры будут определять значения по умолчанию на время сеанса, но никак не влияют на другие сеансы. По историческим причинам формат <envar>PGOPTIONS</envar> похож на тот, что применяется при запуске команды <command>postgres</command>; в частности, в нём должен присутствовать флаг <option>-c</option>. Например: <placeholder-1/>

source: Other clients and libraries might provide their own mechanisms, via the shell or otherwise, that allow the user to alter session settings without direct use of SQL commands.
ru: Другие клиенты и библиотеки могут иметь собственные механизмы управления параметрами, через командную строку или как-то иначе, используя которые пользователь сможет менять параметры сеанса, не выполняя непосредственно команды SQL.

source: Managing Configuration File Contents
ru: Упорядочение содержимого файлов конфигурации

source: <productname>PostgreSQL</productname> provides several features for breaking down complex <filename>postgresql.conf</filename> files into sub-files. These features are especially useful when managing multiple servers with related, but not identical, configurations.
ru: <productname>PostgreSQL</productname> предоставляет несколько возможностей для разделения сложных файлов <filename>postgresql.conf</filename> на вложенные файлы. Эти возможности особенно полезны при управлении множеством серверов с похожими, но не одинаковыми конфигурациями.

source: <primary><literal>include</literal></primary> <secondary>in configuration file</secondary>
ru: <primary><literal>включение</literal></primary> <secondary>в файл конфигурации</secondary>

source: include 'filename'
ru: include 'имя_файла'

source: <placeholder-1/> In addition to individual parameter settings, the <filename>postgresql.conf</filename> file can contain <firstterm>include directives</firstterm>, which specify another file to read and process as if it were inserted into the configuration file at this point. This feature allows a configuration file to be divided into physically separate parts. Include directives simply look like: <placeholder-2/> If the file name is not an absolute path, it is taken as relative to the directory containing the referencing configuration file. Inclusions can be nested.
ru: <placeholder-1/> Помимо присвоений значений параметров, <filename>postgresql.conf</filename> может содержать <firstterm>директивы включения</firstterm> файлов, которые будут прочитаны и обработаны, как если бы их содержимое было вставлено в данном месте файла конфигурации. Это позволяет разбивать файл конфигурации на физически отдельные части. Директивы включения записываются просто: <placeholder-2/> Если имя файла задаётся не абсолютным путём, оно рассматривается относительно каталога, в котором находится включающий файл конфигурации. Включения файлов могут быть вложенными.

source: <primary><literal>include_if_exists</literal></primary> <secondary>in configuration file</secondary>
ru: <primary><literal>include_if_exists</literal></primary> <secondary>в файле конфигурации</secondary>

source: <placeholder-1/> There is also an <literal>include_if_exists</literal> directive, which acts the same as the <literal>include</literal> directive, except when the referenced file does not exist or cannot be read. A regular <literal>include</literal> will consider this an error condition, but <literal>include_if_exists</literal> merely logs a message and continues processing the referencing configuration file.
ru: <placeholder-1/> Кроме того, есть директива <literal>include_if_exists</literal>, которая работает подобно <literal>include</literal>, за исключением случаев, когда включаемый файл не существует или не может быть прочитан. Обычная директива <literal>include</literal> считает это критической ошибкой, но <literal>include_if_exists</literal> просто выводит сообщение и продолжает обрабатывать текущий файл конфигурации.

source: <primary><literal>include_dir</literal></primary> <secondary>in configuration file</secondary>
ru: <primary><literal>include_dir</literal></primary> <secondary>в файле конфигурации</secondary>

source: include_dir 'directory'
ru: include_dir 'каталог'
