Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: When logging to <application>event log</application> is enabled, this parameter determines the program name used to identify <productname>PostgreSQL</productname> messages in the log. The default is <literal>PostgreSQL</literal>. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: При включённом протоколировании в <application>event log</application>, этот параметр задаёт имя программы, которое будет использоваться в журнале событий для идентификации сообщений относящихся к <productname>PostgreSQL</productname>. По умолчанию используется <literal>PostgreSQL</literal>. Параметр можно задать только в конфигурационных файлах или в командной строке при запуске сервера.

source: When To Log
ru: Когда протоколировать

source: <primary><varname>client_min_messages</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>client_min_messages</varname></primary>

source: Controls which message levels are sent to the client. Valid values are <literal>DEBUG5</literal>, <literal>DEBUG4</literal>, <literal>DEBUG3</literal>, <literal>DEBUG2</literal>, <literal>DEBUG1</literal>, <literal>LOG</literal>, <literal>NOTICE</literal>, <literal>WARNING</literal>, <literal>ERROR</literal>, <literal>FATAL</literal>, and <literal>PANIC</literal>. Each level includes all the levels that follow it. The later the level, the fewer messages are sent. The default is <literal>NOTICE</literal>. Note that <literal>LOG</literal> has a different rank here than in <varname>log_min_messages</varname>.
ru: Управляет минимальным уровнем сообщений, посылаемых клиенту. Допустимые значения <literal>DEBUG5</literal>, <literal>DEBUG4</literal>, <literal>DEBUG3</literal>, <literal>DEBUG2</literal>, <literal>DEBUG1</literal>, <literal>LOG</literal>, <literal>NOTICE</literal>, <literal>WARNING</literal>, <literal>ERROR</literal>, <literal>FATAL</literal> и <literal>PANIC</literal>. Каждый из перечисленных уровней включает все идущие после него. Чем дальше в этом списке уровень сообщения, тем меньше сообщений будет посылаться клиенту. По умолчанию используется <literal>NOTICE</literal>. Обратите внимание, что <literal>LOG</literal> расположен по-разному здесь и в <varname>log_min_messages</varname>.

source: <primary><varname>log_min_messages</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_min_messages</varname></primary>

source: Controls which message levels are written to the server log. Valid values are <literal>DEBUG5</literal>, <literal>DEBUG4</literal>, <literal>DEBUG3</literal>, <literal>DEBUG2</literal>, <literal>DEBUG1</literal>, <literal>INFO</literal>, <literal>NOTICE</literal>, <literal>WARNING</literal>, <literal>ERROR</literal>, <literal>LOG</literal>, <literal>FATAL</literal>, and <literal>PANIC</literal>. Each level includes all the levels that follow it. The later the level, the fewer messages are sent to the log. The default is <literal>WARNING</literal>. Note that <literal>LOG</literal> has a different rank here than in <varname>client_min_messages</varname>. Only superusers can change this setting.
ru: Управляет минимальным уровнем сообщений, записываемых в журнал сервера. Допустимые значения <literal>DEBUG5</literal>, <literal>DEBUG4</literal>, <literal>DEBUG3</literal>, <literal>DEBUG2</literal>, <literal>DEBUG1</literal>, <literal>INFO</literal>, <literal>NOTICE</literal>, <literal>WARNING</literal>, <literal>ERROR</literal>, <literal>LOG</literal>, <literal>FATAL</literal> и <literal>PANIC</literal>. Каждый из перечисленных уровней включает все идущие после него. Чем дальше в этом списке уровень сообщения, тем меньше сообщений будет записано в журнал сервера. По умолчанию используется <literal>WARNING</literal>. Обратите внимание, что <literal>LOG</literal> расположен по-разному здесь и в <varname>client_min_messages</varname>. Только суперпользователи могут изменить этот параметр.

source: <primary><varname>log_min_error_statement</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_min_error_statement</varname></primary>

source: Controls which SQL statements that cause an error condition are recorded in the server log. The current SQL statement is included in the log entry for any message of the specified severity or higher. Valid values are <literal>DEBUG5</literal>, <literal>DEBUG4</literal>, <literal>DEBUG3</literal>, <literal>DEBUG2</literal>, <literal>DEBUG1</literal>, <literal>INFO</literal>, <literal>NOTICE</literal>, <literal>WARNING</literal>, <literal>ERROR</literal>, <literal>LOG</literal>, <literal>FATAL</literal>, and <literal>PANIC</literal>. The default is <literal>ERROR</literal>, which means statements causing errors, log messages, fatal errors, or panics will be logged. To effectively turn off logging of failing statements, set this parameter to <literal>PANIC</literal>. Only superusers can change this setting.
ru: Управляет тем, какие SQL-операторы, завершившиеся ошибкой, записываются в журнал сервера. SQL-оператор будет записан в журнал, если он завершится ошибкой с указанным уровнем важности или выше. Допустимые значения: <literal>DEBUG5</literal>, <literal>DEBUG4</literal>, <literal>DEBUG3</literal>, <literal>DEBUG2</literal>, <literal>DEBUG1</literal>, <literal>INFO</literal>, <literal>NOTICE</literal>, <literal>WARNING</literal>, <literal>ERROR</literal>, <literal>LOG</literal>, <literal>FATAL</literal> и <literal>PANIC</literal>. По умолчанию используется <literal>ERROR</literal>. Это означает, что в журнал сервера будут записаны все операторы, завершившиеся сообщением с уровнем важности <literal>ERROR</literal>, <literal>LOG</literal>, <literal>FATAL</literal> и <literal>PANIC</literal>. Чтобы фактически отключить запись операторов с ошибками, установите для этого параметра значение <literal>PANIC</literal>. Изменить этот параметр могут только суперпользователи.

source: <primary><varname>log_min_duration_statement</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_min_duration_statement</varname></primary>

source: Causes the duration of each completed statement to be logged if the statement ran for at least the specified number of milliseconds. Setting this to zero prints all statement durations. Minus-one (the default) disables logging statement durations. For example, if you set it to <literal>250ms</literal> then all SQL statements that run 250ms or longer will be logged. Enabling this parameter can be helpful in tracking down unoptimized queries in your applications. Only superusers can change this setting.
ru: Записывает в журнал продолжительность выполнения всех команд, время работы которых равно или превышает указанное количество миллисекунд. Значение 0 (ноль) заставляет записывать продолжительность работы всех команд. Значение -1 (по умолчанию) запрещает регистрировать продолжительность выполнения операторов. Например, при значении <literal>250ms</literal>, все команды, которые выполняются за 250 миллисекунд и дольше будут записаны в журнал сервера. Включение параметра полезно для выявления плохо оптимизированных запросов в приложении. Только суперпользователи могут изменить этот параметр.

source: For clients using extended query protocol, durations of the Parse, Bind, and Execute steps are logged independently.
ru: Для клиентов, использующих расширенный протокол запросов, будет записываться продолжительность фаз: разбор, связывание и выполнение.

source: When using this option together with <xref linkend="guc-log-statement"/>, the text of statements that are logged because of <varname>log_statement</varname> will not be repeated in the duration log message. If you are not using <application>syslog</application>, it is recommended that you log the PID or session ID using <xref linkend="guc-log-line-prefix"/> so that you can link the statement message to the later duration message using the process ID or session ID.
ru: При использовании совместно с <xref linkend="guc-log-statement"/>, текст SQL-операторов будет записываться только один раз (от использования <varname>log_statement</varname>) и не будет задублирован в сообщении о длительности выполнения. Если не используется вывод в <application>syslog</application>, то рекомендуется в <xref linkend="guc-log-line-prefix"/> включить идентификатор процесса или сессии. Это позволит связать текст запроса с записью о продолжительности выполнения, которая появится позже.

source: <xref linkend="runtime-config-severity-levels"/> explains the message severity levels used by <productname>PostgreSQL</productname>. If logging output is sent to <systemitem>syslog</systemitem> or Windows' <systemitem>eventlog</systemitem>, the severity levels are translated as shown in the table.
ru: В <xref remap="6" linkend="runtime-config-severity-levels"/> поясняются уровни важности сообщений в <productname>PostgreSQL</productname>. Также в этой таблице показано, как эти уровни транслируются в системные при использовании <systemitem>syslog</systemitem> или <systemitem>eventlog</systemitem> в Windows.

source: Message Severity Levels
ru: Уровни важности сообщений

source: Severity
ru: Уровень

source: Usage
ru: Использование

source: Provides successively-more-detailed information for use by developers.
ru: Более детальная информация для разработчиков. Чем больше номер, тем детальнее.

source: Provides information implicitly requested by the user, e.g., output from <command>VACUUM VERBOSE</command>.
ru: Неявно запрошенная пользователем информация, например вывод команды <command>VACUUM VERBOSE</command>.

source: Provides information that might be helpful to users, e.g., notice of truncation of long identifiers.
ru: Информация, которая может быть полезной пользователям. Например, уведомления об усечении длинных идентификаторов.

source: Provides warnings of likely problems, e.g., <command>COMMIT</command> outside a transaction block.
ru: Предупреждения о возможных проблемах. Например, <command>COMMIT</command> вне транзакционного блока.

source: Reports an error that caused the current command to abort.
ru: Сообщает об ошибке, из-за которой прервана текущая команда.

source: Reports information of interest to administrators, e.g., checkpoint activity.
ru: Информация, полезная для администраторов. Например, выполнение контрольных точек.

source: Reports an error that caused the current session to abort.
ru: Сообщает об ошибке, из-за которой прервана текущая сессия.

source: Reports an error that caused all database sessions to abort.
ru: Сообщает об ошибке, из-за которой прерваны все сессии.

source: What To Log
ru: Что протоколировать

source: <primary><varname>application_name</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>application_name</varname></primary>

source: The <varname>application_name</varname> can be any string of less than <symbol>NAMEDATALEN</symbol> characters (64 characters in a standard build). It is typically set by an application upon connection to the server. The name will be displayed in the <structname>pg_stat_activity</structname> view and included in CSV log entries. It can also be included in regular log entries via the <xref linkend="guc-log-line-prefix"/> parameter. Only printable ASCII characters may be used in the <varname>application_name</varname> value. Other characters will be replaced with question marks (<literal>?</literal>).
ru: <varname>application_name</varname> это любая строка, не превышающая <symbol>NAMEDATALEN</symbol> символов (64 символа при стандартной сборке). Обычно устанавливается приложением при подключении к серверу. Значение отображается в представлении <structname>pg_stat_activity</structname> и добавляется в журнал сервера, при использовании формата CSV. Для прочих форматов, <varname>application_name</varname> можно добавить в журнал через параметр <xref linkend="guc-log-line-prefix"/>. Значение <varname>application_name</varname> может содержать только печатные ASCII символы. Остальные символы будут заменены знаками вопроса (<literal>?</literal>).

source: <primary><varname>debug_print_parse</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>debug_print_parse</varname></primary>

source: <primary><varname>debug_print_rewritten</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>debug_print_rewritten</varname></primary>

source: <primary><varname>debug_print_plan</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>debug_print_plan</varname></primary>

source: These parameters enable various debugging output to be emitted. When set, they print the resulting parse tree, the query rewriter output, or the execution plan for each executed query. These messages are emitted at <literal>LOG</literal> message level, so by default they will appear in the server log but will not be sent to the client. You can change that by adjusting <xref linkend="guc-client-min-messages"/> and/or <xref linkend="guc-log-min-messages"/>. These parameters are off by default.
ru: Эти параметры включают вывод различной отладочной информации. А именно: вывод дерева запроса, дерево запроса после применения правил или плана выполнения запроса, соответственно. Все эти сообщения имеют уровень <literal>LOG</literal>. Поэтому, по умолчанию, они записываются в журнал сервера, но не отправляются клиенту. Отправку клиенту можно настроить через <xref linkend="guc-client-min-messages"/> и/или <xref linkend="guc-log-min-messages"/>. По умолчанию параметры выключены.

source: <primary><varname>debug_pretty_print</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>debug_pretty_print</varname></primary>

source: When set, <varname>debug_pretty_print</varname> indents the messages produced by <varname>debug_print_parse</varname>, <varname>debug_print_rewritten</varname>, or <varname>debug_print_plan</varname>. This results in more readable but much longer output than the <quote>compact</quote> format used when it is off. It is on by default.
ru: Включает выравнивание сообщений, выводимых <varname>debug_print_parse</varname>, <varname>debug_print_rewritten</varname> или <varname>debug_print_plan</varname>. В результате сообщения легче читать, но они значительно длиннее, чем в формате <quote>compact</quote>, который используется при выключенном значении. По умолчанию включён.

source: <primary><varname>log_checkpoints</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_checkpoints</varname></primary>

source: Causes checkpoints and restartpoints to be logged in the server log. Some statistics are included in the log messages, including the number of buffers written and the time spent writing them. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line. The default is off.
ru: Включает протоколирование выполнения контрольных точек и точек перезапуска сервера. При этом записывается некоторая статистическая информация. Например, число записанных буферов и время, затраченное на их запись. Параметр можно задать только в конфигурационных файлах или в командной строке при запуске сервера. По умолчанию выключен.

source: <primary><varname>log_connections</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_connections</varname></primary>

source: Causes each attempted connection to the server to be logged, as well as successful completion of client authentication. Only superusers can change this parameter at session start, and it cannot be changed at all within a session. The default is <literal>off</literal>.
ru: Включает протоколирование всех попыток подключения к серверу, в том числе успешного завершения аутентификации клиентов. Изменить его можно только в начале сеанса и сделать это могут только суперпользователи. Значение по умолчанию — <literal>off</literal>.

source: Some client programs, like <application>psql</application>, attempt to connect twice while determining if a password is required, so duplicate <quote>connection received</quote> messages do not necessarily indicate a problem.
ru: Некоторые программы, например <application>psql</application>, предпринимают две попытки подключения (первая для определения, нужен ли пароль). Поэтому дублирование сообщения <quote>connection received</quote> не обязательно говорит о наличии проблемы.

source: <primary><varname>log_disconnections</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_disconnections</varname></primary>

source: Causes session terminations to be logged. The log output provides information similar to <varname>log_connections</varname>, plus the duration of the session. Only superusers can change this parameter at session start, and it cannot be changed at all within a session. The default is <literal>off</literal>.
ru: Включает протоколирование завершения сеанса. В журнал выводится примерно та же информация, что и с <varname>log_connections</varname>, плюс длительность сеанса. Изменить этот параметр можно только в начале сеанса и сделать это могут только суперпользователи. Значение по умолчанию — <literal>off</literal>.

source: <primary><varname>log_duration</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_duration</varname></primary>

source: Causes the duration of every completed statement to be logged. The default is <literal>off</literal>. Only superusers can change this setting.
ru: Записывает продолжительность каждой завершённой команды. По умолчанию выключен. Только суперпользователи могут изменить этот параметр.

source: The difference between setting this option and setting <xref linkend="guc-log-min-duration-statement"/> to zero is that exceeding <varname>log_min_duration_statement</varname> forces the text of the query to be logged, but this option doesn't. Thus, if <varname>log_duration</varname> is <literal>on</literal> and <varname>log_min_duration_statement</varname> has a positive value, all durations are logged but the query text is included only for statements exceeding the threshold. This behavior can be useful for gathering statistics in high-load installations.
ru: Включение этого параметра и установка <xref linkend="guc-log-min-duration-statement"/> в 0 (ноль) различаются. Разница в том, что при превышении значения <varname>log_min_duration_statement</varname>, в журнал записывается текст запроса, а при включении <varname>log_duration</varname> нет. Таким образом, при <varname>log_duration</varname> = <literal>on</literal> и <varname>log_min_duration_statement</varname> больше нуля, в журнал сервера будет записываться продолжительность выполнения всех команд, а текст запросов только для команд, превысивших заданное значение. Такое поведение может оказаться полезным при сборе статистики в условиях большой нагрузки.

source: <primary><varname>log_error_verbosity</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_error_verbosity</varname></primary>

source: Controls the amount of detail written in the server log for each message that is logged. Valid values are <literal>TERSE</literal>, <literal>DEFAULT</literal>, and <literal>VERBOSE</literal>, each adding more fields to displayed messages. <literal>TERSE</literal> excludes the logging of <literal>DETAIL</literal>, <literal>HINT</literal>, <literal>QUERY</literal>, and <literal>CONTEXT</literal> error information. <literal>VERBOSE</literal> output includes the <symbol>SQLSTATE</symbol> error code (see also <xref linkend="errcodes-appendix"/>) and the source code file name, function name, and line number that generated the error. Only superusers can change this setting.
ru: Управляет количеством детальной информации, записываемой в журнал сервера для каждого сообщения. Допустимые значения: <literal>TERSE</literal>, <literal>DEFAULT</literal> и <literal>VERBOSE</literal>. Каждое последующее значение добавляет больше полей в выводимое сообщение. Для <literal>TERSE</literal> из сообщения об ошибке исключаются поля <literal>DETAIL</literal>, <literal>HINT</literal>, <literal>QUERY</literal> и <literal>CONTEXT</literal>. Для <literal>VERBOSE</literal> в сообщение включается код ошибки <symbol>SQLSTATE</symbol> (см. <xref remap="4" linkend="errcodes-appendix"/>), а также имя файла с исходным кодом, имя функции и номер строки сгенерировавшей ошибку. Только суперпользователи могут изменить этот параметр.

source: <primary><varname>log_hostname</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_hostname</varname></primary>

source: By default, connection log messages only show the IP address of the connecting host. Turning this parameter on causes logging of the host name as well. Note that depending on your host name resolution setup this might impose a non-negligible performance penalty. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: По умолчанию, сообщения журнала содержат лишь IP-адрес подключившегося клиента. При включении этого параметра, дополнительно будет фиксироваться и имя сервера. Обратите внимание, что в зависимости от применяемого способа разрешения имён, это может отрицательно сказаться на производительности. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>log_line_prefix</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_line_prefix</varname></primary>

source: Escape
ru: Спецсимвол

source: Effect
ru: Назначение

source: Session only
ru: Только для пользовательского процесса

source: Application name
ru: Имя приложения (<xref linkend="guc-application-name"/>)

source: yes
ru: да

source: User name
ru: Имя пользователя

source: Database name
ru: Имя базы данных

source: Remote host name or IP address, and remote port
ru: Имя удалённого узла или IP-адрес, а также номер порта

source: Remote host name or IP address
ru: Имя удалённого узла или IP-адрес

source: Process ID
ru: Идентификатор процесса

source: no
ru: нет

source: Time stamp without milliseconds
ru: Штамп времени, без миллисекунд

source: Time stamp with milliseconds
ru: Штамп времени, с миллисекундами

source: Time stamp with milliseconds (as a Unix epoch)
ru: Штамп времени, с миллисекундами (в виде времени Unix)

source: Command tag: type of session's current command
ru: Тег команды: тип текущей команды в сессии

source: SQLSTATE error code
ru: Код ошибки SQLSTATE

source: Session ID: see below
ru: Идентификатор сессии. Подробности ниже

source: Number of the log line for each session or process, starting at 1
ru: Номер строки журнала для каждой сессии или процесса. Начинается с 1

source: Process start time stamp
ru: Штамп времени начала процесса

source: Virtual transaction ID (backendID/localXID)
ru: Идентификатор виртуальной транзакции (backendID/localXID)

source: Transaction ID (0 if none is assigned)
ru: Идентификатор транзакции (0 если не присвоен)

source: Produces no output, but tells non-session processes to stop at this point in the string; ignored by session processes
ru: Ничего не выводит. Непользовательские процессы останавливаются в этой точке. Игнорируется пользовательскими процессами

source: Literal <literal>%</literal>
ru: Выводит <literal>%</literal>
