Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: <primary><varname>max_worker_processes</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_worker_processes</varname></primary>

source: Sets the maximum number of background processes that the system can support. This parameter can only be set at server start. The default is 8.
ru: Задаёт максимальное число фоновых процессов, которое можно запустить в текущей системе. Этот параметр можно задать только при запуске сервера. Значение по умолчанию — 8.

source: <primary><varname>max_parallel_workers_per_gather</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_parallel_workers_per_gather</varname></primary>

source: Sets the maximum number of workers that can be started by a single <literal>Gather</literal> node. Parallel workers are taken from the pool of processes established by <xref linkend="guc-max-worker-processes"/>. Note that the requested number of workers may not actually be available at run time. If this occurs, the plan will run with fewer workers than expected, which may be inefficient. Setting this value to 0, which is the default, disables parallel query execution.
ru: Задаёт максимальное число рабочих процессов, которые могут запускаться одним узлом <literal>Gather</literal>. Параллельные рабочие процессы берутся из пула процессов, контролируемого параметром <xref linkend="guc-max-worker-processes"/>. Учтите, что запрошенное количество рабочих процессов может быть недоступно во время выполнения. В этом случае план будет выполняться с меньшим числом процессов, что может быть неэффективно. Значение 0 (заданное по умолчанию) отключает параллельное выполнение запросов.

source: Note that parallel queries may consume very substantially more resources than non-parallel queries, because each worker process is a completely separate process which has roughly the same impact on the system as an additional user session. This should be taken into account when choosing a value for this setting, as well as when configuring other settings that control resource utilization, such as <xref linkend="guc-work-mem"/>. Resource limits such as <varname>work_mem</varname> are applied individually to each worker, which means the total utilization may be much higher across all processes than it would normally be for any single process. For example, a parallel query using 4 workers may use up to 5 times as much CPU time, memory, I/O bandwidth, and so forth as a query which uses no workers at all.
ru: Учтите, что параллельные запросы могут потреблять значительно больше ресурсов, чем не параллельные, так как каждый рабочий процесс является отдельным процессом и оказывает на систему примерно такое же влияние, как дополнительный пользовательский сеанс. Это следует учитывать, выбирая значение этого параметра, а также настраивая другие параметры, управляющие использованием ресурсов, например <xref linkend="guc-work-mem"/>. Ограничения ресурсов, такие как <varname>work_mem</varname>, применяются к каждому рабочему процессу отдельно, что означает, что общая нагрузка для всех процессов может оказаться гораздо больше, чем при обычном использовании одного процесса. Например, параллельный запрос, задействующий 4 рабочих процесса, может использовать в 5 раз больше времени процессора, объёма памяти, ввода/вывода и т. д., по сравнению с запросом, не задействующим рабочие процессы вовсе.

source: For more information on parallel query, see <xref linkend="parallel-query"/>.
ru: За дополнительными сведениями о параллельных запросах обратитесь к <xref remap="3" linkend="parallel-query"/>.

source: <primary><varname>backend_flush_after</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>backend_flush_after</varname></primary>

source: Whenever more than <varname>backend_flush_after</varname> bytes have been written by a single backend, attempt to force the OS to issue these writes to the underlying storage. Doing so will limit the amount of dirty data in the kernel's page cache, reducing the likelihood of stalls when an fsync is issued at the end of a checkpoint, or when the OS writes data back in larger batches in the background. Often that will result in greatly reduced transaction latency, but there also are some cases, especially with workloads that are bigger than <xref linkend="guc-shared-buffers"/>, but smaller than the OS's page cache, where performance might degrade. This setting may have no effect on some platforms. The valid range is between <literal>0</literal>, which disables forced writeback, and <literal>2MB</literal>. The default is <literal>0</literal>, i.e., no forced writeback. (If <symbol>BLCKSZ</symbol> is not 8kB, the maximum value scales proportionally to it.)
ru: Когда одним обслуживающим процессом записывается больше <varname>backend_flush_after</varname> байт, сервер даёт указание ОС произвести запись этих данных в нижележащее хранилище. Это ограничивает объём &laquo;грязных&raquo; данных в страничном кеше ядра и уменьшает вероятность затормаживания при выполнении fsync в конце контрольной точки или когда ОС сбрасывает данные на диск большими блоками в фоне. Часто это значительно сокращает задержки транзакций, но бывают ситуации, особенно когда объём рабочей нагрузки больше <xref linkend="guc-shared-buffers"/>, но меньше страничного кеша ОС, когда производительность может упасть. Этот параметр действует не на всех платформах. Он может принимать значение от <literal>0</literal> (при этом управление отложенной записью отключается) до 2 Мбайт (<literal>2MB</literal>). По умолчанию он имеет значение <literal>0</literal>, то есть это поведение отключено. (Если <symbol>BLCKSZ</symbol> отличен от 8 Кбайт, максимальное значение корректируется пропорционально.)

source: <primary><varname>old_snapshot_threshold</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>old_snapshot_threshold</varname></primary>

source: Sets the minimum time that a snapshot can be used without risk of a <literal>snapshot too old</literal> error occurring when using the snapshot. This parameter can only be set at server start.
ru: Задаёт минимальное время, которое можно пользоваться снимком без риска получить ошибку <literal>снимок слишком стар</literal>. Этот параметр можно задать только при запуске сервера.

source: Beyond the threshold, old data may be vacuumed away. This can help prevent bloat in the face of snapshots which remain in use for a long time. To prevent incorrect results due to cleanup of data which would otherwise be visible to the snapshot, an error is generated when the snapshot is older than this threshold and the snapshot is used to read a page which has been modified since the snapshot was built.
ru: По истечении этого времени старые данные могут вычищены. Это предотвращает замусоривание данными снимков, которые остаются задействованными долгое время. Во избежание получения некорректных результатов из-за очистки данных, которые должны были бы наблюдаться в снимке, клиенту будет выдана ошибка, если возраст снимка превысит заданный предел и из этого снимка будет запрошена страница, изменённая со времени его создания.

source: A value of <literal>-1</literal> disables this feature, and is the default. Useful values for production work probably range from a small number of hours to a few days. The setting will be coerced to a granularity of minutes, and small numbers (such as <literal>0</literal> or <literal>1min</literal>) are only allowed because they may sometimes be useful for testing. While a setting as high as <literal>60d</literal> is allowed, please note that in many workloads extreme bloat or transaction ID wraparound may occur in much shorter time frames.
ru: Значение <literal>-1</literal> (по умолчанию) отключает это поведение. Полезные значения для производственной среды могут лежать в интервале от нескольких часов до нескольких дней. Заданное значение округляется до минут, а минимальные значения (как например, <literal>0</literal> или <literal>1min</literal>) допускаются только потому, что они могут быть полезны при тестировании. Хотя допустимым будет и значение <literal>60d</literal> (60 дней), учтите, что при многих видах нагрузки критичное замусоривание базы или зацикливание идентификаторов транзакций может происходить в намного меньших временных отрезках.

source: When this feature is enabled, freed space at the end of a relation cannot be released to the operating system, since that could remove information needed to detect the <literal>snapshot too old</literal> condition. All space allocated to a relation remains associated with that relation for reuse only within that relation unless explicitly freed (for example, with <command>VACUUM FULL</command>).
ru: Когда это ограничение действует, освобождённое пространство в конце отношения не может быть отдано операционной системе, так как при этом будет удалена информация, необходимая для выявления условия <literal>снимок слишком стар</literal>. Всё пространство, выделенное отношению, останется связанным с ним до тех пор, пока не будет освобождено явно (например, с помощью команды <command>VACUUM FULL</command>).

source: This setting does not attempt to guarantee that an error will be generated under any particular circumstances. In fact, if the correct results can be generated from (for example) a cursor which has materialized a result set, no error will be generated even if the underlying rows in the referenced table have been vacuumed away. Some tables cannot safely be vacuumed early, and so will not be affected by this setting. Examples include system catalogs and any table which has a hash index. For such tables this setting will neither reduce bloat nor create a possibility of a <literal>snapshot too old</literal> error on scanning.
ru: Установка этого параметра не гарантирует, что обозначенная ошибка будет выдаваться при всех возможных обстоятельствах. На самом деле, если можно получить корректные результаты, например, из курсора, материализовавшего результирующий набор, ошибка не будет выдана, даже если нижележащие строки в целевой таблице были ликвидированы при очистке. Некоторые таблицы не могут быть безопасно очищены в сжатые сроки, так что на них этот параметр не распространяется. В частности, это касается системных каталогов и таблиц с хеш-индексами. Для таких таблиц этот параметр не сокращает раздувание, но и не чреват ошибкой <literal>снимок слишком стар</literal> при сканировании.

source: Write Ahead Log
ru: Журнал упреждающей записи

source: For additional information on tuning these settings, see <xref linkend="wal-configuration"/>.
ru: За дополнительной информацией о настройке этих параметров обратитесь к <xref remap="3" linkend="wal-configuration"/>.

source: Settings
ru: Параметры

source: <primary><varname>wal_level</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_level</varname></primary>

source: <varname>wal_level</varname> determines how much information is written to the WAL. The default value is <literal>minimal</literal>, which writes only the information needed to recover from a crash or immediate shutdown. <literal>replica</literal> adds logging required for WAL archiving as well as information required to run read-only queries on a standby server. Finally, <literal>logical</literal> adds information necessary to support logical decoding. Each level includes the information logged at all lower levels. This parameter can only be set at server start.
ru: Параметр <varname>wal_level</varname> определяет, как много информации записывается в WAL. Со значением <literal>minimal</literal> (по умолчанию) в журнал записывается только информация, необходимая для восстановления после сбоя или аварийного отключения. Вариант <literal>replica</literal> добавляет в него то, что необходимо для архивирования WAL, а также информацию, необходимую для выполнения запросов на резервном сервере в режиме &laquo;только чтение&raquo;. Наконец, <literal>logical</literal> добавляет информацию, требуемую для поддержки логического декодирования. Каждый последующий уровень включает всю информацию, записываемую на всех предыдущих. Задать этот параметр можно только при запуске сервера.

source: <placeholder-1/> into tables that were created or truncated in the same transaction
ru: <placeholder-1/> с таблицами, которые были созданы или опустошены в той же транзакции

source: In <literal>minimal</literal> level, WAL-logging of some bulk operations can be safely skipped, which can make those operations much faster (see <xref linkend="populate-pitr"/>). Operations in which this optimization can be applied include: <placeholder-1/> But minimal WAL does not contain enough information to reconstruct the data from a base backup and the WAL logs, so <literal>replica</literal> or higher must be used to enable WAL archiving (<xref linkend="guc-archive-mode"/>) and streaming replication.
ru: На уровне <literal>minimal</literal> некоторые массовые операции могут выполняться в обход журнала без риска потери данных, и при этом они выполнятся гораздо быстрее (см. <xref remap="4" linkend="populate-pitr"/>). В частности, такая оптимизация возможна с операциями: <placeholder-1/> Однако такой минимальный журнал не будет содержать достаточно информации для восстановления данных из базовой копии и журналов, поэтому для реализации стратегии архивации WAL (см. <xref remap="4" linkend="guc-archive-mode"/>) и потоковой репликации необходим уровень <literal>replica</literal> или более высокий.

source: In <literal>logical</literal> level, the same information is logged as with <literal>replica</literal>, plus information needed to allow extracting logical change sets from the WAL. Using a level of <literal>logical</literal> will increase the WAL volume, particularly if many tables are configured for <literal>REPLICA IDENTITY FULL</literal> and many <command>UPDATE</command> and <command>DELETE</command> statements are executed.
ru: На уровне <literal>logical</literal> в журнал записывается та же информация, что и на уровне <literal>replica</literal>, плюс информация, необходимая для извлечения из журнала наборов логических изменений. Повышение уровня до <literal>logical</literal> приводит к значительному увеличению объёма WAL, особенно если многие таблицы имеют характеристику <literal>REPLICA IDENTITY FULL</literal> и выполняется множество команд <command>UPDATE</command> и <command>DELETE</command>.

source: In releases prior to 9.6, this parameter also allowed the values <literal>archive</literal> and <literal>hot_standby</literal>. These are still accepted but mapped to <literal>replica</literal>.
ru: В выпусках до 9.6 для этого параметра допускались значения <literal>archive</literal> и <literal>hot_standby</literal>. Эти значения по-прежнему принимаются, но теперь отображаются в значение <literal>replica</literal>.

source: <primary><varname>fsync</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>fsync</varname></primary>

source: If this parameter is on, the <productname>PostgreSQL</productname> server will try to make sure that updates are physically written to disk, by issuing <function>fsync()</function> system calls or various equivalent methods (see <xref linkend="guc-wal-sync-method"/>). This ensures that the database cluster can recover to a consistent state after an operating system or hardware crash.
ru: Если этот параметр установлен, сервер <productname>PostgreSQL</productname> старается добиться, чтобы изменения были записаны на диск физически, выполняя системные вызовы <function>fsync()</function> или другими подобными методами (см. <xref remap="4" linkend="guc-wal-sync-method"/>). Это даёт гарантию, что кластер баз данных сможет вернуться в согласованное состояние после сбоя оборудования или операционной системы.

source: While turning off <varname>fsync</varname> is often a performance benefit, this can result in unrecoverable data corruption in the event of a power failure or system crash. Thus it is only advisable to turn off <varname>fsync</varname> if you can easily recreate your entire database from external data.
ru: Хотя отключение <varname>fsync</varname> часто даёт выигрыш в скорости, это может привести к неисправимой порче данных в случае отключения питания или сбоя системы. Поэтому отключать <varname>fsync</varname> рекомендуется, только если вы легко сможет восстановить всю базу из внешнего источника.

source: Examples of safe circumstances for turning off <varname>fsync</varname> include the initial loading of a new database cluster from a backup file, using a database cluster for processing a batch of data after which the database will be thrown away and recreated, or for a read-only database clone which gets recreated frequently and is not used for failover. High quality hardware alone is not a sufficient justification for turning off <varname>fsync</varname>.
ru: В качестве примеров, когда отключение <varname>fsync</varname> неопасно, можно привести начальное наполнение нового кластера данными из копии, обработку массива данных, после которой базу данных можно удалить и создать заново, либо эксплуатацию копии базы данных только для чтения, которая регулярно пересоздаётся и не используется для отработки отказа. Качественное оборудование само по себе не является достаточной причиной для отключения <varname>fsync</varname>.

source: For reliable recovery when changing <varname>fsync</varname> off to on, it is necessary to force all modified buffers in the kernel to durable storage. This can be done while the cluster is shutdown or while fsync is on by running <command>initdb --sync-only</command>, running <command>sync</command>, unmounting the file system, or rebooting the server.
ru: При смене значения <varname>fsync</varname> с off на on для надёжного восстановления также необходимо сбросить все изменённые буферы из ядра в надёжное хранилище. Это можно сделать, когда сервер остановлен или когда режим fsync включён, с помощью команды <command>initdb --sync-only</command>, либо выполнить команду <command>sync</command>, размонтировать файловую систему или перезагрузить сервер.

source: In many situations, turning off <xref linkend="guc-synchronous-commit"/> for noncritical transactions can provide much of the potential performance benefit of turning off <varname>fsync</varname>, without the attendant risks of data corruption.
ru: Во многих случаях отключение <xref linkend="guc-synchronous-commit"/> для некритичных транзакций может дать больший выигрыш в скорости, чем отключение <varname>fsync</varname>, при этом не добавляя риски повреждения данных.

source: <varname>fsync</varname> can only be set in the <filename>postgresql.conf</filename> file or on the server command line. If you turn this parameter off, also consider turning off <xref linkend="guc-full-page-writes"/>.
ru: Параметр <varname>fsync</varname> можно задать только в файле <filename>postgresql.conf</filename> или в командной строке при запуске сервера. Если вы отключаете этот параметр, возможно, имеет смысл отключить также и <xref linkend="guc-full-page-writes"/>.

source: <primary><varname>synchronous_commit</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>synchronous_commit</varname></primary>

source: Specifies whether transaction commit will wait for WAL records to be written to disk before the command returns a <quote>success</quote> indication to the client. Valid values are <literal>on</literal>, <literal>remote_apply</literal>, <literal>remote_write</literal>, <literal>local</literal>, and <literal>off</literal>. The default, and safe, setting is <literal>on</literal>. When <literal>off</literal>, there can be a delay between when success is reported to the client and when the transaction is really guaranteed to be safe against a server crash. (The maximum delay is three times <xref linkend="guc-wal-writer-delay"/>.) Unlike <xref linkend="guc-fsync"/>, setting this parameter to <literal>off</literal> does not create any risk of database inconsistency: an operating system or database crash might result in some recent allegedly-committed transactions being lost, but the database state will be just the same as if those transactions had been aborted cleanly. So, turning <varname>synchronous_commit</varname> off can be a useful alternative when performance is more important than exact certainty about the durability of a transaction. For more discussion see <xref linkend="wal-async-commit"/>.
ru: Определяет, будет ли сервер при фиксировании транзакции ждать, пока записи из WAL сохранятся на диске, прежде чем сообщить клиенту об успешном завершении операции. Допустимые значения: <literal>on</literal>, <literal>remote_apply</literal>, <literal>remote_write</literal>, <literal>local</literal> и <literal>off</literal>. Значение по умолчанию (оно же самое безопасное) — <literal>on</literal>. Со значением <literal>off</literal> может образоваться окно от момента, когда клиент узнаёт об успешном завершении, до момента, когда транзакция действительно гарантированно защищена от сбоя. (Максимальный размер окна равен тройному значению <xref linkend="guc-wal-writer-delay"/>.) В отличие от <xref linkend="guc-fsync"/>, значение <literal>off</literal> для этого параметра не угрожает целостности данных: сбой операционной системы или базы данных может привести к потере последних транзакций, считавшихся зафиксированными, но состояние базы данных будет точно таким же, как и в случае штатного прерывания этих транзакций. Поэтому выключение режима <varname>synchronous_commit</varname> может быть полезной альтернативой отключению <xref linkend="guc-fsync"/>, когда производительность важнее, чем надёжная гарантия сохранности каждой транзакции. Подробнее это обсуждается в <xref remap="6" linkend="wal-async-commit"/>.
