Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: <primary><varname>wal_receiver_timeout</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_receiver_timeout</varname></primary>

source: Terminate replication connections that are inactive longer than the specified number of milliseconds. This is useful for the receiving standby server to detect a primary node crash or network outage. A value of zero disables the timeout mechanism. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line. The default value is 60 seconds.
ru: Задаёт период времени (в миллисекундах), по истечении которого прерываются неактивные соединения репликации. Это помогает принимающему резервному серверу обнаружить сбой ведущего узла или разрыв сети. При значении, равном нулю, тайм-аут отключается. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера. Значение по умолчанию — 60 секунд.

source: <primary><varname>wal_retrieve_retry_interval</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_retrieve_retry_interval</varname></primary>

source: Specify how long the standby server should wait when WAL data is not available from any sources (streaming replication, local <filename>pg_xlog</filename> or WAL archive) before retrying to retrieve WAL data. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line. The default value is 5 seconds. Units are milliseconds if not specified.
ru: Определяет, сколько резервный сервер должен ждать поступления данных WAL из любых источников (потоковая репликация, локальный <filename>pg_xlog</filename> или архив WAL), прежде чем повторять попытку получения WAL. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке сервера. Значение по умолчанию — 5 секунд. Если единицы не задаются, подразумеваются миллисекунды.

source: This parameter is useful in configurations where a node in recovery needs to control the amount of time to wait for new WAL data to be available. For example, in archive recovery, it is possible to make the recovery more responsive in the detection of a new WAL log file by reducing the value of this parameter. On a system with low WAL activity, increasing it reduces the amount of requests necessary to access WAL archives, something useful for example in cloud environments where the amount of times an infrastructure is accessed is taken into account.
ru: Этот параметр полезен в конфигурациях, когда для узла в схеме восстановления нужно регулировать время ожидания новых данных WAL. Например, при восстановлении архива можно ускорить реакцию на появление нового файла WAL, уменьшив значение этого параметра. В системе с низкой активностью WAL увеличение этого параметра приведёт к сокращению числа запросов, необходимых для отслеживания архивов WAL, что может быть полезно в облачных окружениях, где учитывается число обращений к инфраструктуре.

source: Query Planning
ru: Планирование запросов

source: Planner Method Configuration
ru: Конфигурация методов планировщика

source: These configuration parameters provide a crude method of influencing the query plans chosen by the query optimizer. If the default plan chosen by the optimizer for a particular query is not optimal, a <emphasis>temporary</emphasis> solution is to use one of these configuration parameters to force the optimizer to choose a different plan. Better ways to improve the quality of the plans chosen by the optimizer include adjusting the planer cost constants (see <xref linkend="runtime-config-query-constants"/>), running <xref linkend="sql-analyze"/> manually, increasing the value of the <xref linkend="guc-default-statistics-target"/> configuration parameter, and increasing the amount of statistics collected for specific columns using <command>ALTER TABLE SET STATISTICS</command>.
ru: Эти параметры конфигурации дают возможность грубо влиять на планы, выбираемые оптимизатором запросов. Если автоматически выбранный оптимизатором план конкретного запроса оказался неоптимальным, в качестве <emphasis>временного</emphasis> решения можно воспользоваться одним из этих параметров и вынудить планировщик выбрать другой план. Улучшить качество планов, выбираемых планировщиком, можно и более подходящими способами, в частности, скорректировать константы стоимости (см. <xref remap="4" linkend="runtime-config-query-constants"/>), выполнить <xref linkend="sql-analyze"/> вручную, изменить значение параметра конфигурации <xref linkend="guc-default-statistics-target"/> и увеличить объём статистики, собираемой для отдельных столбцов, воспользовавшись командой <command>ALTER TABLE SET STATISTICS</command>.

source: <primary>bitmap scan</primary>
ru: <primary>сканирование по битовой карте</primary>

source: <primary><varname>enable_bitmapscan</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>enable_bitmapscan</varname></primary>

source: Enables or disables the query planner's use of bitmap-scan plan types. The default is <literal>on</literal>.
ru: Включает или отключает использование планов сканирования по битовой карте. По умолчанию имеет значение <literal>on</literal> (вкл.).

source: <primary><varname>enable_hashagg</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>enable_hashagg</varname></primary>

source: Enables or disables the query planner's use of hashed aggregation plan types. The default is <literal>on</literal>.
ru: Включает или отключает использование планов агрегирования по хешу. По умолчанию имеет значение <literal>on</literal> (вкл.).

source: <primary><varname>enable_hashjoin</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>enable_hashjoin</varname></primary>

source: Enables or disables the query planner's use of hash-join plan types. The default is <literal>on</literal>.
ru: Включает или отключает использование планов соединения по хешу. По умолчанию имеет значение <literal>on</literal> (вкл.).

source: <primary>index scan</primary>
ru: <primary>сканирование по индексу</primary>

source: <primary><varname>enable_indexscan</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>enable_indexscan</varname></primary>

source: Enables or disables the query planner's use of index-scan plan types. The default is <literal>on</literal>.
ru: Включает или отключает использование планов сканирования по индексу. По умолчанию имеет значение <literal>on</literal> (вкл.).

source: <primary><varname>enable_indexonlyscan</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>enable_indexonlyscan</varname></primary>

source: Enables or disables the query planner's use of index-only-scan plan types (see <xref linkend="indexes-index-only-scans"/>). The default is <literal>on</literal>.
ru: Включает или отключает использование планов сканирования только индекса (см. <xref remap="4" linkend="indexes-index-only-scans"/>). По умолчанию имеет значение <literal>on</literal> (вкл.).

source: <primary><varname>enable_material</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>enable_material</varname></primary>

source: Enables or disables the query planner's use of materialization. It is impossible to suppress materialization entirely, but turning this variable off prevents the planner from inserting materialize nodes except in cases where it is required for correctness. The default is <literal>on</literal>.
ru: Включает или отключает использование материализации при планировании запросов. Полностью исключить материализацию невозможно, но при выключении этого параметра планировщик не будет вставлять узлы материализации, за исключением случаев, где они требуются для правильности. По умолчанию этот параметр имеет значение <literal>on</literal> (вкл.).

source: <primary><varname>enable_mergejoin</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>enable_mergejoin</varname></primary>

source: Enables or disables the query planner's use of merge-join plan types. The default is <literal>on</literal>.
ru: Включает или отключает использование планов соединения слиянием. По умолчанию имеет значение <literal>on</literal> (вкл.).

source: <primary><varname>enable_nestloop</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>enable_nestloop</varname></primary>

source: Enables or disables the query planner's use of nested-loop join plans. It is impossible to suppress nested-loop joins entirely, but turning this variable off discourages the planner from using one if there are other methods available. The default is <literal>on</literal>.
ru: Включает или отключает использование планировщиком планов соединения с вложенными циклами. Полностью исключить вложенные циклы невозможно, но при выключении этого параметра планировщик не будет использовать данный метод, если можно применить другие. По умолчанию этот параметр имеет значение <literal>on</literal>.

source: <primary>sequential scan</primary>
ru: <primary>последовательное сканирование</primary>

source: <primary><varname>enable_seqscan</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>enable_seqscan</varname></primary>

source: Enables or disables the query planner's use of sequential scan plan types. It is impossible to suppress sequential scans entirely, but turning this variable off discourages the planner from using one if there are other methods available. The default is <literal>on</literal>.
ru: Включает или отключает использование планировщиком планов последовательного сканирования. Полностью исключить последовательное сканирование невозможно, но при выключении этого параметра планировщик не будет использовать данный метод, если можно применить другие. По умолчанию этот параметр имеет значение <literal>on</literal>.

source: <primary><varname>enable_sort</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>enable_sort</varname></primary>

source: Enables or disables the query planner's use of explicit sort steps. It is impossible to suppress explicit sorts entirely, but turning this variable off discourages the planner from using one if there are other methods available. The default is <literal>on</literal>.
ru: Включает или отключает использование планировщиком шагов с явной сортировкой. Полностью исключить явную сортировку невозможно, но при выключении этого параметра планировщик не будет использовать данный метод, если можно применить другие. По умолчанию этот параметр имеет значение <literal>on</literal>.

source: <primary><varname>enable_tidscan</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>enable_tidscan</varname></primary>

source: Enables or disables the query planner's use of <acronym>TID</acronym> scan plan types. The default is <literal>on</literal>.
ru: Включает или отключает использование планов сканирования <acronym>TID</acronym>. По умолчанию имеет значение <literal>on</literal> (вкл.).

source: Planner Cost Constants
ru: Константы стоимости для планировщика

source: The <firstterm>cost</firstterm> variables described in this section are measured on an arbitrary scale. Only their relative values matter, hence scaling them all up or down by the same factor will result in no change in the planner's choices. By default, these cost variables are based on the cost of sequential page fetches; that is, <varname>seq_page_cost</varname> is conventionally set to <literal>1.0</literal> and the other cost variables are set with reference to that. But you can use a different scale if you prefer, such as actual execution times in milliseconds on a particular machine.
ru: Переменные <firstterm>стоимости</firstterm>, описанные в данном разделе, задаются по произвольной шкале. Значение имеют только их отношения, поэтому умножение или деление всех переменных на один коэффициент никак не повлияет на выбор планировщика. По умолчанию эти переменные определяются относительно стоимости чтения последовательной страницы: то есть, переменную <varname>seq_page_cost</varname> удобно задать равной <literal>1.0</literal>, а все другие переменные стоимости определить относительно неё. Но при желании можно использовать и другую шкалу, например, выразить в миллисекундах фактическое время выполнения запросов на конкретной машине.

source: Unfortunately, there is no well-defined method for determining ideal values for the cost variables. They are best treated as averages over the entire mix of queries that a particular installation will receive. This means that changing them on the basis of just a few experiments is very risky.
ru: К сожалению, какого-либо чётко определённого способа определения идеальных значений стоимости не существует. Лучше всего выбирать их как средние показатели при выполнении целого ряда разнообразных запросов, которые будет обрабатывать конкретная СУБД. Это значит, что менять их по результатам всего нескольких экспериментов очень рискованно.

source: <primary><varname>seq_page_cost</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>seq_page_cost</varname></primary>

source: Sets the planner's estimate of the cost of a disk page fetch that is part of a series of sequential fetches. The default is 1.0. This value can be overridden for tables and indexes in a particular tablespace by setting the tablespace parameter of the same name (see <xref linkend="sql-altertablespace"/>).
ru: Задаёт приблизительную стоимость чтения одной страницы с диска, которое выполняется в серии последовательных чтений. Значение по умолчанию равно 1.0. Это значение можно переопределить для таблиц и индексов в определённом табличном пространстве, установив одноимённый параметр табличного пространства (см. <xref remap="4" linkend="sql-altertablespace"/>).

source: <primary><varname>random_page_cost</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>random_page_cost</varname></primary>

source: Sets the planner's estimate of the cost of a non-sequentially-fetched disk page. The default is 4.0. This value can be overridden for tables and indexes in a particular tablespace by setting the tablespace parameter of the same name (see <xref linkend="sql-altertablespace"/>).
ru: Задаёт приблизительную стоимость чтения одной произвольной страницы с диска. Значение по умолчанию равно 4.0. Это значение можно переопределить для таблиц и индексов в определённом табличном пространстве, установив одноимённый параметр табличного пространства (см. <xref remap="4" linkend="sql-altertablespace"/>).

source: Reducing this value relative to <varname>seq_page_cost</varname> will cause the system to prefer index scans; raising it will make index scans look relatively more expensive. You can raise or lower both values together to change the importance of disk I/O costs relative to CPU costs, which are described by the following parameters.
ru: При уменьшении этого значения по отношению к <varname>seq_page_cost</varname> система начинает предпочитать сканирование по индексу; при увеличении такое сканирование становится более дорогостоящим. Оба эти значения также можно увеличить или уменьшить одновременно, чтобы изменить стоимость операций ввода/вывода по отношению к стоимости процессорных операций, которая определяется следующими параметрами.

source: Random access to mechanical disk storage is normally much more expensive than four times sequential access. However, a lower default is used (4.0) because the majority of random accesses to disk, such as indexed reads, are assumed to be in cache. The default value can be thought of as modeling random access as 40 times slower than sequential, while expecting 90% of random reads to be cached.
ru: Произвольный доступ к механическому дисковому хранилищу обычно гораздо дороже последовательного доступа, более чем в четыре раза. Однако по умолчанию выбран небольшой коэффициент (4.0), в предположении, что большой объём данных при произвольном доступе, например, при чтении индекса, окажется в кеше. Таким образом, можно считать, что значение по умолчанию моделирует ситуацию, когда произвольный доступ в 40 раз медленнее последовательного, но 90% операций произвольного чтения удовлетворяются из кеша.

source: If you believe a 90% cache rate is an incorrect assumption for your workload, you can increase random_page_cost to better reflect the true cost of random storage reads. Correspondingly, if your data is likely to be completely in cache, such as when the database is smaller than the total server memory, decreasing random_page_cost can be appropriate. Storage that has a low random read cost relative to sequential, e.g. solid-state drives, might also be better modeled with a lower value for random_page_cost.
ru: Если вы считаете, что для вашей рабочей нагрузки процент попаданий не достигает 90%, вы можете увеличить параметр random_page_cost, чтобы он больше соответствовал реальной стоимости произвольного чтения. И напротив, если ваши данные могут полностью поместиться в кеше, например, когда размер базы меньше общего объёма памяти сервера, может иметь смысл уменьшить random_page_cost. С хранилищем, у которого стоимость произвольного чтения не намного выше последовательного, как например, у твердотельных накопителей, так же лучше выбрать меньшее значение random_page_cost.

source: Although the system will let you set <varname>random_page_cost</varname> to less than <varname>seq_page_cost</varname>, it is not physically sensible to do so. However, setting them equal makes sense if the database is entirely cached in RAM, since in that case there is no penalty for touching pages out of sequence. Also, in a heavily-cached database you should lower both values relative to the CPU parameters, since the cost of fetching a page already in RAM is much smaller than it would normally be.
ru: Хотя система позволяет сделать <varname>random_page_cost</varname> меньше, чем <varname>seq_page_cost</varname>, это лишено физического смысла. Однако сделать их равными имеет смысл, если база данных полностью кешируется в ОЗУ, так как в этом случае с обращением к страницам в произвольном порядке не связаны никакие дополнительные издержки. Кроме того, для сильно загруженной базы данных оба этих параметра следует понизить по отношению к стоимости процессорных операций, так как стоимость выборки страницы, уже находящейся в ОЗУ, оказывается намного меньше, чем обычно.

source: <primary><varname>cpu_tuple_cost</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>cpu_tuple_cost</varname></primary>

source: Sets the planner's estimate of the cost of processing each row during a query. The default is 0.01.
ru: Задаёт приблизительную стоимость обработки каждой строки при выполнении запроса. Значение по умолчанию — 0.01.

source: <primary><varname>cpu_index_tuple_cost</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>cpu_index_tuple_cost</varname></primary>

source: Sets the planner's estimate of the cost of processing each index entry during an index scan. The default is 0.005.
ru: Задаёт приблизительную стоимость обработки каждой записи индекса при сканировании индекса. Значение по умолчанию — 0.005.

source: <primary><varname>cpu_operator_cost</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>cpu_operator_cost</varname></primary>

source: Sets the planner's estimate of the cost of processing each operator or function executed during a query. The default is 0.0025.
ru: Задаёт приблизительную стоимость обработки оператора или функции при выполнении запроса. Значение по умолчанию — 0.0025.

source: <primary><varname>parallel_setup_cost</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>parallel_setup_cost</varname></primary>

source: Sets the planner's estimate of the cost of launching parallel worker processes. The default is 1000.
ru: Задаёт приблизительную стоимость запуска параллельных рабочих процессов. Значение по умолчанию — 1000.

source: <primary><varname>parallel_tuple_cost</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>parallel_tuple_cost</varname></primary>

source: Sets the planner's estimate of the cost of transferring one tuple from a parallel worker process to another process. The default is 0.1.
ru: Задаёт приблизительную стоимость передачи одного кортежа от параллельного рабочего процесса другому процессу. Значение по умолчанию — 0.01.

source: <primary><varname>min_parallel_relation_size</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>min_parallel_relation_size</varname></primary>

source: Sets the minimum size of relations to be considered for parallel scan. The default is 8 megabytes (<literal>8MB</literal>).
ru: Задаёт минимальный размер отношения, при котором возможно распараллеливание сканирования. Значение по умолчанию — 8 мегабайт (<literal>8MB</literal>).

source: <primary><varname>effective_cache_size</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>effective_cache_size</varname></primary>

source: Sets the planner's assumption about the effective size of the disk cache that is available to a single query. This is factored into estimates of the cost of using an index; a higher value makes it more likely index scans will be used, a lower value makes it more likely sequential scans will be used. When setting this parameter you should consider both <productname>PostgreSQL</productname>'s shared buffers and the portion of the kernel's disk cache that will be used for <productname>PostgreSQL</productname> data files. Also, take into account the expected number of concurrent queries on different tables, since they will have to share the available space. This parameter has no effect on the size of shared memory allocated by <productname>PostgreSQL</productname>, nor does it reserve kernel disk cache; it is used only for estimation purposes. The system also does not assume data remains in the disk cache between queries. The default is 4 gigabytes (<literal>4GB</literal>).
ru: Определяет представление планировщика об эффективном размере дискового кеша, доступном для одного запроса. Это представление влияет на оценку стоимости использования индекса; чем выше это значение, тем больше вероятность, что будет применяться сканирование по индексу, чем ниже, тем более вероятно, что будет выбрано последовательное сканирование. При установке этого параметра следует учитывать и объём разделяемых буферов <productname>PostgreSQL</productname>, и процент дискового кеша ядра, который будут занимать файлы данных <productname>PostgreSQL</productname>. Кроме того, следует принять во внимание ожидаемое число параллельных запросов к разным таблицам, так как общий размер будет разделяться между ними. Этот параметр не влияет на размер разделяемой памяти, выделяемой <productname>PostgreSQL</productname>, или размер резервируемого кеша ядра; он используется только для целей оценки стоимости. При этом система не учитывает, что данные могут оставаться в дисковом кеше от запроса к запросу. Значение этого параметра по умолчанию — 4 гигабайта (<literal>4GB</literal>).

source: Genetic Query Optimizer
ru: Генетический оптимизатор запросов
