Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: <primary><varname>wal_sender_timeout</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_sender_timeout</varname></primary>

source: Terminate replication connections that are inactive longer than the specified number of milliseconds. This is useful for the sending server to detect a standby crash or network outage. A value of zero disables the timeout mechanism. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line. The default value is 60 seconds.
ru: Задаёт период времени (в миллисекундах), по истечении которого прерываются неактивные соединения репликации. Это помогает передающему серверу обнаружить сбой резервного или разрывы в сети. При значении, равном нулю, тайм-аут отключается. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера. Значение по умолчанию — 60 секунд.

source: <primary><varname>track_commit_timestamp</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>track_commit_timestamp</varname></primary>

source: Record commit time of transactions. This parameter can only be set in <filename>postgresql.conf</filename> file or on the server command line. The default value is <literal>off</literal>.
ru: Включает запись времени фиксации транзакций. Этот параметр можно задать только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера. По умолчанию этот параметр имеет значение <literal>off</literal>.

source: Master Server
ru: Главный сервер

source: These parameters can be set on the master/primary server that is to send replication data to one or more standby servers. Note that in addition to these parameters, <xref linkend="guc-wal-level"/> must be set appropriately on the master server, and optionally WAL archiving can be enabled as well (see <xref linkend="runtime-config-wal-archiving"/>). The values of these parameters on standby servers are irrelevant, although you may wish to set them there in preparation for the possibility of a standby becoming the master.
ru: Эти параметры можно задать на главном/ведущем сервере, который должен передавать данные репликации одному или нескольким резервным. Заметьте, что помимо этих параметров на главном сервере должен быть правильно установлен <xref linkend="guc-wal-level"/>, а также может быть включена архивация WAL (см. <xref remap="4" linkend="runtime-config-wal-archiving"/>). Значения этих параметров на резервных серверах не важны, хотя их можно подготовить заранее, на случай, если резервный сервер придётся сделать главным.

source: <primary><varname>synchronous_standby_names</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>synchronous_standby_names</varname></primary>

source: Specifies a list of standby servers that can support <firstterm>synchronous replication</firstterm>, as described in <xref linkend="synchronous-replication"/>. There will be one or more active synchronous standbys; transactions waiting for commit will be allowed to proceed after these standby servers confirm receipt of their data. The synchronous standbys will be those whose names appear earlier in this list, and that are both currently connected and streaming data in real-time (as shown by a state of <literal>streaming</literal> in the <link linkend="monitoring-stats-views-table"><literal>pg_stat_replication</literal></link> view). Other standby servers appearing later in this list represent potential synchronous standbys. If any of the current synchronous standbys disconnects for whatever reason, it will be replaced immediately with the next-highest-priority standby. Specifying more than one standby name can allow very high availability.
ru: Определяет список резервных серверов, которые могут поддерживать <firstterm>синхронную репликацию</firstterm>, как описано в <xref remap="6" linkend="synchronous-replication"/>. Активных синхронных резервных серверов может быть один или несколько; транзакции, ожидающие фиксирования, будут завершаться только после того, как эти резервные серверы подтвердят получение их данных. Синхронными резервными серверами будут те, имена которых указаны в начале этого списка, и которые подключены к главному и принимают поток данных в реальном времени (что показывает признак <literal>streaming</literal> в представлении <link linkend="monitoring-stats-views-table"><literal>pg_stat_replication</literal></link>). Следующие резервные серверы в этом списке являются потенциальными синхронными серверами. Если любой из текущих синхронных резервных серверов отключается по какой-либо причине, он немедленно заменяется другим, следующим по приоритету. Таким образом, указание нескольких имён резервных серверов позволяет обеспечить очень высокую степень доступности.

source: This parameter specifies a list of standby servers using either of the following syntaxes: <synopsis> <replaceable class="parameter">num_sync</replaceable> ( <replaceable class="parameter">standby_name</replaceable> [, ...] ) <replaceable class="parameter">standby_name</replaceable> [, ...] </synopsis> where <replaceable class="parameter">num_sync</replaceable> is the number of synchronous standbys that transactions need to wait for replies from, and <replaceable class="parameter">standby_name</replaceable> is the name of a standby server. For example, a setting of <literal>3 (s1, s2, s3, s4)</literal> makes transaction commits wait until their WAL records are received by three higher-priority standbys chosen from standby servers <literal>s1</literal>, <literal>s2</literal>, <literal>s3</literal> and <literal>s4</literal>.
ru: Этот параметр принимает список резервных серверов в одной из следующих форм: <synopsis> <replaceable class="parameter">число_синхронных</replaceable> ( <replaceable class="parameter">имя_резерва</replaceable> [, ...] ) <replaceable class="parameter">имя_резерва</replaceable> [, ...] </synopsis> здесь <replaceable class="parameter">число_синхронных</replaceable> — число синхронных резервных серверов, от которых необходимо дожидаться ответов для завершения транзакций, а <replaceable class="parameter">имя_резерва</replaceable> — имя резервного сервера. Например, со значением <literal>3 (s1, s2, s3, s4)</literal> фиксирование транзакций будет завершаться только после получения записей WAL тремя выбранными по приоритету резервными серверами из списка <literal>s1</literal>, <literal>s2</literal>, <literal>s3</literal> и <literal>s4</literal>.

source: The second syntax was used before <productname>PostgreSQL</productname> version 9.6 and is still supported. It's the same as the first syntax with <replaceable class="parameter">num_sync</replaceable> equal to 1. For example, <literal>1 (s1, s2)</literal> and <literal>s1, s2</literal> have the same meaning: either <literal>s1</literal> or <literal>s2</literal> is chosen as a synchronous standby.
ru: Вторая форма использовалась в <productname>PostgreSQL</productname> до версии 9.6 и по-прежнему поддерживается. По сути она равнозначна первой с <replaceable class="parameter">числом_синхронных</replaceable>, равным 1. Например, <literal>1 (s1, s2)</literal> и <literal>s1, s2</literal> действуют одинаково: в качестве синхронного резерва выбирается либо <literal>s1</literal>, либо <literal>s2</literal>.

source: The name of a standby server for this purpose is the <varname>application_name</varname> setting of the standby, as set in the <varname>primary_conninfo</varname> of the standby's WAL receiver. There is no mechanism to enforce uniqueness. In case of duplicates one of the matching standbys will be considered as higher priority, though exactly which one is indeterminate. The special entry <literal>*</literal> matches any <varname>application_name</varname>, including the default application name of <literal>walreceiver</literal>.
ru: В качестве имени резервного сервера в данном случае указывается значение параметра <varname>application_name</varname>, задаваемое в строке подключения <varname>primary_conninfo</varname> на резервном сервере, принимающем WAL. Уникальность этих имён не контролируется. В случае дублирования имён более приоритетным синхронным резервным сервером будет считаться один, хотя какой именно, не определено. Специальному указанию <literal>*</literal> соответствует любое имя приложения (<varname>application_name</varname>), включая имя приложения по умолчанию (<literal>walreceiver</literal>).

source: Each <replaceable class="parameter">standby_name</replaceable> should have the form of a valid SQL identifier, unless it is <literal>*</literal>. You can use double-quoting if necessary. But note that <replaceable class="parameter">standby_name</replaceable>s are compared to standby application names case-insensitively, whether double-quoted or not.
ru: Каждое <replaceable class="parameter">имя_резерва</replaceable> должно задаваться в виде допустимого идентификатора SQL, кроме <literal>*</literal>. При необходимости его можно заключать в кавычки. Но заметьте, что идентификаторы <replaceable class="parameter">имя_резерва</replaceable> сравниваются с именами приложений без учёта регистра, независимо от того, заключены ли они в кавычки или нет.

source: If no synchronous standby names are specified here, then synchronous replication is not enabled and transaction commits will not wait for replication. This is the default configuration. Even when synchronous replication is enabled, individual transactions can be configured not to wait for replication by setting the <xref linkend="guc-synchronous-commit"/> parameter to <literal>local</literal> or <literal>off</literal>.
ru: Если имена синхронных резервных серверов не определены, синхронная репликация не включается и фиксируемые транзакции не будут ждать репликации. Это поведение по умолчанию. Даже когда синхронная репликация включена, для отдельных транзакций можно отключить ожидание репликации, задав для параметра <xref linkend="guc-synchronous-commit"/> значение <literal>local</literal> или <literal>off</literal>.

source: This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>vacuum_defer_cleanup_age</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>vacuum_defer_cleanup_age</varname></primary>

source: Specifies the number of transactions by which <command>VACUUM</command> and <acronym>HOT</acronym> updates will defer cleanup of dead row versions. The default is zero transactions, meaning that dead row versions can be removed as soon as possible, that is, as soon as they are no longer visible to any open transaction. You may wish to set this to a non-zero value on a primary server that is supporting hot standby servers, as described in <xref linkend="hot-standby"/>. This allows more time for queries on the standby to complete without incurring conflicts due to early cleanup of rows. However, since the value is measured in terms of number of write transactions occurring on the primary server, it is difficult to predict just how much additional grace time will be made available to standby queries. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Задаёт число транзакций, на которое будет отложена очистка старых версий строк при <command>VACUUM</command> и изменениях <acronym>HOT</acronym>. По умолчанию это число равно нулю, то есть старые версии строк могут удаляться сразу, как только перестанут быть видимыми в открытых транзакциях. Это значение можно сделать ненулевым на главном сервере, работающим с серверами горячего резерва, как описано в <xref remap="6" linkend="hot-standby"/>. В результате увеличится время, в течение которого будут успешно выполняться запросы на резервном сервере без конфликтов из-за ранней очистки строк. Однако ввиду того, что эта отсрочка определяется числом записывающих транзакций, выполняющихся на главном сервере, сложно предсказать, каким будет дополнительное время отсрочки на резервном сервере. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: You should also consider setting <varname>hot_standby_feedback</varname> on standby server(s) as an alternative to using this parameter.
ru: В качестве альтернативы этому параметру можно также рассмотреть <varname>hot_standby_feedback</varname> на резервном сервере.

source: This does not prevent cleanup of dead rows which have reached the age specified by <varname>old_snapshot_threshold</varname>.
ru: Этот параметр не предотвращает очистку старых строк, которые достигли возраста, заданного параметром <varname>old_snapshot_threshold</varname>.

source: Standby Servers
ru: Резервные серверы

source: These settings control the behavior of a standby server that is to receive replication data. Their values on the master server are irrelevant.
ru: Эти параметры управляют поведением резервного сервера, который будет получать данные репликации. На главном сервере они не играют никакой роли.

source: <primary><varname>hot_standby</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>hot_standby</varname></primary>

source: Specifies whether or not you can connect and run queries during recovery, as described in <xref linkend="hot-standby"/>. The default value is <literal>off</literal>. This parameter can only be set at server start. It only has effect during archive recovery or in standby mode.
ru: Определяет, можно ли будет подключаться к серверу и выполнять запросы в процессе восстановления, как описано в <xref remap="6" linkend="hot-standby"/>. Значение по умолчанию — <literal>off</literal> (подключения не разрешаются). Задать этот параметр можно только при запуске сервера. Данный параметр играет роль только в режиме резервного сервера или при восстановлении архива.

source: <primary><varname>max_standby_archive_delay</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_standby_archive_delay</varname></primary>

source: When Hot Standby is active, this parameter determines how long the standby server should wait before canceling standby queries that conflict with about-to-be-applied WAL entries, as described in <xref linkend="hot-standby-conflict"/>. <varname>max_standby_archive_delay</varname> applies when WAL data is being read from WAL archive (and is therefore not current). The default is 30 seconds. Units are milliseconds if not specified. A value of -1 allows the standby to wait forever for conflicting queries to complete. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: В режиме горячего резерва этот параметр определяет, как долго должен ждать резервный сервер, прежде чем отменять запросы, конфликтующие с очередными изменениями в WAL, как описано в <xref remap="6" linkend="hot-standby-conflict"/>. Задержка <varname>max_standby_archive_delay</varname> применяется при обработке данных WAL, считываемых из архива (не текущих данных). Значение этого параметра задаётся в миллисекундах (если явно не указаны другие единицы) и по умолчанию равно 30 секундам. При значении, равном -1, резервный сервер может ждать завершения конфликтующих запросов неограниченное время. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: Note that <varname>max_standby_archive_delay</varname> is not the same as the maximum length of time a query can run before cancellation; rather it is the maximum total time allowed to apply any one WAL segment's data. Thus, if one query has resulted in significant delay earlier in the WAL segment, subsequent conflicting queries will have much less grace time.
ru: Заметьте, что параметр <varname>max_standby_archive_delay</varname> определяет не максимальное время, которое отводится для выполнения каждого запроса, а максимальное общее время, за которое должны быть применены изменения из одного сегмента WAL. Таким образом, если один запрос привёл к значительной задержке при обработке сегмента WAL, остальным конфликтующим запросам будет отведено гораздо меньше времени.

source: <primary><varname>max_standby_streaming_delay</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_standby_streaming_delay</varname></primary>

source: When Hot Standby is active, this parameter determines how long the standby server should wait before canceling standby queries that conflict with about-to-be-applied WAL entries, as described in <xref linkend="hot-standby-conflict"/>. <varname>max_standby_streaming_delay</varname> applies when WAL data is being received via streaming replication. The default is 30 seconds. Units are milliseconds if not specified. A value of -1 allows the standby to wait forever for conflicting queries to complete. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: В режиме горячего резерва этот параметр определяет, как долго должен ждать резервный сервер, прежде чем отменять запросы, конфликтующие с очередными изменениями в WAL, как описано в <xref remap="6" linkend="hot-standby-conflict"/>. Задержка <varname>max_standby_streaming_delay</varname> применяется при обработке данных WAL, поступающих при потоковой репликации. Значение этого параметра задаётся в миллисекундах (если явно не указаны другие единицы) и по умолчанию равно 30 секундам. При значении, равном -1, резервный сервер может ждать завершения конфликтующих запросов неограниченное время. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: Note that <varname>max_standby_streaming_delay</varname> is not the same as the maximum length of time a query can run before cancellation; rather it is the maximum total time allowed to apply WAL data once it has been received from the primary server. Thus, if one query has resulted in significant delay, subsequent conflicting queries will have much less grace time until the standby server has caught up again.
ru: Заметьте, что параметр <varname>max_standby_streaming_delay</varname> определяет не максимальное время, которое отводится для выполнения каждого запроса, а максимальное общее время, за которое должны быть применены изменения из WAL после получения от главного сервера. Таким образом, если один запрос привёл к значительной задержке, остальным конфликтующим запросам будет отводиться гораздо меньше времени, пока резервный сервер не догонит главный.

source: <primary><varname>wal_receiver_status_interval</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_receiver_status_interval</varname></primary>

source: Specifies the minimum frequency for the WAL receiver process on the standby to send information about replication progress to the primary or upstream standby, where it can be seen using the <link linkend="monitoring-stats-views-table"><literal>pg_stat_replication</literal></link> view. The standby will report the last transaction log position it has written, the last position it has flushed to disk, and the last position it has applied. This parameter's value is the maximum interval, in seconds, between reports. Updates are sent each time the write or flush positions change, or at least as often as specified by this parameter. Thus, the apply position may lag slightly behind the true position. Setting this parameter to zero disables status updates completely. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line. The default value is 10 seconds.
ru: Определяет минимальную частоту, с которой процесс, принимающий WAL на резервном сервере, будет сообщать о состоянии репликации ведущему или вышестоящему резервному, где это состояние можно наблюдать в представлении <link linkend="monitoring-stats-views-table"><literal>pg_stat_replication</literal></link>. В этом сообщении передаются следующие позиции в журнале транзакций: позиция изменений записанных, изменений, сохранённых на диске, и изменений применённых. Значение параметра задаётся в секундах и определяет максимальный интервал между сообщениями. Сообщения о состоянии передаются при каждом продвижении позиций записанных или сохранённых на диске изменений, но с промежутком не больше, чем заданный этим параметром. Таким образом, последняя переданная позиция применённых изменений может немного отставать от фактической в текущий момент. При нулевом значении этого параметра передача состояния полностью отключается. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера. По умолчанию его значение равно 10 секундам.

source: <primary><varname>hot_standby_feedback</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>hot_standby_feedback</varname></primary>

source: Specifies whether or not a hot standby will send feedback to the primary or upstream standby about queries currently executing on the standby. This parameter can be used to eliminate query cancels caused by cleanup records, but can cause database bloat on the primary for some workloads. Feedback messages will not be sent more frequently than once per <varname>wal_receiver_status_interval</varname>. The default value is <literal>off</literal>. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Определяет, будет ли сервер горячего резерва сообщать ведущему или вышестоящему резервному о запросах, которые он выполняет в данный момент. Это позволяет исключить необходимость отмены запросов, вызванную очисткой записей, но при некоторых типах нагрузки это может приводить к раздуванию базы данных на ведущем сервере. Эти сообщения о запросах будут отправляться не чаще, чем раз в интервал, задаваемый параметром <varname>wal_receiver_status_interval</varname>. Значение данного параметра по умолчанию — <literal>off</literal>. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: If cascaded replication is in use the feedback is passed upstream until it eventually reaches the primary. Standbys make no other use of feedback they receive other than to pass upstream.
ru: Если используется каскадная репликация, сообщения о запросах передаются выше, пока в итоге не достигнут ведущего сервера. На промежуточных серверах эта информация больше никак не задействуется.

source: This setting does not override the behavior of <varname>old_snapshot_threshold</varname> on the primary; a snapshot on the standby which exceeds the primary's age threshold can become invalid, resulting in cancellation of transactions on the standby. This is because <varname>old_snapshot_threshold</varname> is intended to provide an absolute limit on the time which dead rows can contribute to bloat, which would otherwise be violated because of the configuration of a standby.
ru: Этот параметр не переопределяет поведение <varname>old_snapshot_threshold</varname>, установленное на ведущем сервере; снимок на резервном сервере, имеющий возраст больше заданного указанным параметром на ведущем, может стать недействительным, что приведёт к отмене транзакций на резервном. Это объясняется тем, что предназначение <varname>old_snapshot_threshold</varname> заключается в указании абсолютного ограничения времени, в течение которого могут накапливаться мёртвые строки, которое иначе могло бы нарушаться из-за конфигурации резервного сервера.
