Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: Likewise, the current session's temporary-table schema, <literal>pg_temp_<replaceable>nnn</replaceable></literal>, is always searched if it exists. It can be explicitly listed in the path by using the alias <literal>pg_temp</literal><placeholder-1/>. If it is not listed in the path then it is searched first (even before <literal>pg_catalog</literal>). However, the temporary schema is only searched for relation (table, view, sequence, etc) and data type names. It is never searched for function or operator names.
ru: Аналогично всегда просматривается схема временных таблиц текущего сеанса, <literal>pg_temp_<replaceable>nnn</replaceable></literal>, если она существует. Её можно включить в путь поиска, указав её псевдоним <literal>pg_temp</literal><placeholder-1/>. Если она отсутствует в пути, она будет просматриваться первой (даже перед <literal>pg_catalog</literal>). Временная схема просматривается только при поиске отношений (таблиц, представлений, последовательностей и т. д.) и типов данных, но никогда при поиске функций и операторов.

source: When objects are created without specifying a particular target schema, they will be placed in the first valid schema named in <varname>search_path</varname>. An error is reported if the search path is empty.
ru: Когда объекты создаются без указания определённой целевой схемы, они помещаются в первую пригодную схему, указанную в <varname>search_path</varname>. Если путь поиска схем пуст, выдаётся ошибка.

source: The default value for this parameter is <literal>"$user", public</literal>. This setting supports shared use of a database (where no users have private schemas, and all share use of <literal>public</literal>), private per-user schemas, and combinations of these. Other effects can be obtained by altering the default search path setting, either globally or per-user.
ru: По умолчанию этот параметр имеет значение <literal>"$user", public</literal>. При таком значении поддерживается совместное использование базы данных (когда пользователи не имеют личных схем, все используют схему <literal>public</literal>), использование личных схем, а также комбинация обоих вариантов. Другие подходы можно реализовать, изменяя значение пути по умолчанию, либо глобально, либо индивидуально для каждого пользователя.

source: The current effective value of the search path can be examined via the <acronym>SQL</acronym> function <function>current_schemas</function> (see <xref linkend="functions-info"/>). This is not quite the same as examining the value of <varname>search_path</varname>, since <function>current_schemas</function> shows how the items appearing in <varname>search_path</varname> were resolved.
ru: Текущее действующее значение пути поиска можно получить, воспользовавшись <acronym>SQL</acronym>-функцией <function>current_schemas</function> (см. <xref remap="4" linkend="functions-info"/>). Это значение может отличаться от значения <varname>search_path</varname>, так как <function>current_schemas</function> показывает, как были преобразованы элементы, фигурирующие в <varname>search_path</varname>.

source: For more information on schema handling, see <xref linkend="ddl-schemas"/>.
ru: Чтобы больше узнать о работе со схемами, обратитесь к <xref remap="3" linkend="ddl-schemas"/>.

source: <primary><varname>row_security</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>row_security</varname></primary>

source: This variable controls whether to raise an error in lieu of applying a row security policy. When set to <literal>on</literal>, policies apply normally. When set to <literal>off</literal>, queries fail which would otherwise apply at least one policy. The default is <literal>on</literal>. Change to <literal>off</literal> where limited row visibility could cause incorrect results; for example, <application>pg_dump</application> makes that change by default. This variable has no effect on roles which bypass every row security policy, to wit, superusers and roles with the <literal>BYPASSRLS</literal> attribute.
ru: Эта переменная определяет, должна ли выдаваться ошибка при применении политик защиты строк. Со значением <literal>on</literal> политики применяются в обычном режиме. Со значением <literal>off</literal> запросы, ограничиваемые минимум одной политикой, будут выдавать ошибку. Значение по умолчанию — <literal>on</literal>. Значение <literal>off</literal> рекомендуется, когда ограничение видимости строк чревато некорректными результатами; например, <application>pg_dump</application> устанавливает это значение. Эта переменная не влияет на роли, которые обходят все политики защиты строк, а именно, на суперпользователей и роли с атрибутом <literal>BYPASSRLS</literal>.

source: For more information on row security policies, see <xref linkend="sql-createpolicy"/>.
ru: Подробнее о политиках защиты строк можно узнать в описании <xref linkend="sql-createpolicy"/>.

source: <primary><varname>default_tablespace</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>default_tablespace</varname></primary>

source: <primary>tablespace</primary><secondary>default</secondary>
ru: <primary>табличное пространство</primary> <secondary>по умолчанию</secondary>

source: This variable specifies the default tablespace in which to create objects (tables and indexes) when a <command>CREATE</command> command does not explicitly specify a tablespace.
ru: Эта переменная устанавливает табличное пространство по умолчанию, в котором будут создаваться объекты (таблицы и индексы), когда в команде <command>CREATE</command> табличное пространство не указывается явно.

source: The value is either the name of a tablespace, or an empty string to specify using the default tablespace of the current database. If the value does not match the name of any existing tablespace, <productname>PostgreSQL</productname> will automatically use the default tablespace of the current database. If a nondefault tablespace is specified, the user must have <literal>CREATE</literal> privilege for it, or creation attempts will fail.
ru: Её значением может быть либо имя табличного пространства, либо пустая строка, подразумевающая использование табличного пространства по умолчанию в текущей базе данных. Если табличное пространство с заданным именем не существует, <productname>PostgreSQL</productname> будет автоматически использовать табличное пространство по умолчанию. Если используется не пространство по умолчанию, пользователь должен иметь право <literal>CREATE</literal> для него, иначе он не сможет создавать объекты.

source: This variable is not used for temporary tables; for them, <xref linkend="guc-temp-tablespaces"/> is consulted instead.
ru: Эта переменная не используется для временных таблиц; для них задействуется <xref linkend="guc-temp-tablespaces"/>.

source: This variable is also not used when creating databases. By default, a new database inherits its tablespace setting from the template database it is copied from.
ru: Эта переменная также не используется при создании баз данных. По умолчанию, новая база данных наследует выбор табличного пространства от базы-шаблона, из которой она копируется.

source: For more information on tablespaces, see <xref linkend="manage-ag-tablespaces"/>.
ru: За дополнительными сведениями о табличных пространствах обратитесь к <xref remap="3" linkend="manage-ag-tablespaces"/>.

source: <primary><varname>temp_tablespaces</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>temp_tablespaces</varname></primary>

source: <primary>tablespace</primary><secondary>temporary</secondary>
ru: <primary>табличное пространство</primary> <secondary>временное</secondary>

source: This variable specifies tablespaces in which to create temporary objects (temp tables and indexes on temp tables) when a <command>CREATE</command> command does not explicitly specify a tablespace. Temporary files for purposes such as sorting large data sets are also created in these tablespaces.
ru: Эта переменная задаёт табличные пространства, в которых будут создаваться временные объекты (временные таблицы и индексы временных таблиц), когда в команде <command>CREATE</command> табличное пространство не указывается явно. В этих табличных пространствах также создаются временные файлы для внутреннего использования, например, для сортировки больших наборов данных.

source: The value is a list of names of tablespaces. When there is more than one name in the list, <productname>PostgreSQL</productname> chooses a random member of the list each time a temporary object is to be created; except that within a transaction, successively created temporary objects are placed in successive tablespaces from the list. If the selected element of the list is an empty string, <productname>PostgreSQL</productname> will automatically use the default tablespace of the current database instead.
ru: Её значение содержит список имён табличных пространств. Когда этот список содержит больше одного имени, <productname>PostgreSQL</productname> выбирает из этого списка случайный элемент при создании каждого временного объекта; однако при создании последующих объектов внутри транзакции табличные пространства перебираются последовательно. Если в этом списке оказывается пустая строка, <productname>PostgreSQL</productname> будет автоматически использовать вместо этого элемента табличное пространство по умолчанию для текущей базы данных.

source: When <varname>temp_tablespaces</varname> is set interactively, specifying a nonexistent tablespace is an error, as is specifying a tablespace for which the user does not have <literal>CREATE</literal> privilege. However, when using a previously set value, nonexistent tablespaces are ignored, as are tablespaces for which the user lacks <literal>CREATE</literal> privilege. In particular, this rule applies when using a value set in <filename>postgresql.conf</filename>.
ru: Когда <varname>temp_tablespaces</varname> задаётся интерактивно, указание несуществующего табличного пространства считается ошибкой, как и указание табличного пространства, для которого пользователь не имеет права <literal>CREATE</literal>. Однако при использовании значения, заданного ранее, несуществующие табличные пространства и пространства, для которых у пользователя нет права <literal>CREATE</literal>, просто игнорируются. В частности, это касается значения, заданного в <filename>postgresql.conf</filename>.

source: The default value is an empty string, which results in all temporary objects being created in the default tablespace of the current database.
ru: По умолчанию значение этой переменной — пустая строка. С таким значением все временные объекты создаются в табличном пространстве по умолчанию, установленном для текущей базы данных.

source: See also <xref linkend="guc-default-tablespace"/>.
ru: См. также <xref remap="4" linkend="guc-default-tablespace"/>.

source: <primary><varname>check_function_bodies</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>check_function_bodies</varname></primary>

source: This parameter is normally on. When set to <literal>off</literal>, it disables validation of the function body string during <xref linkend="sql-createfunction"/>. Disabling validation avoids side effects of the validation process and avoids false positives due to problems such as forward references. Set this parameter to <literal>off</literal> before loading functions on behalf of other users; <application>pg_dump</application> does so automatically.
ru: Этот параметр обычно включён. Выключение этого параметра (присвоение ему значения <literal>off</literal>) отключает проверку строки с телом функции, передаваемой команде <xref linkend="sql-createfunction"/>. Отключение проверки позволяет избежать побочных эффектов процесса проверки и исключить ложные срабатывания из-за таких проблем, как ссылки вперёд. Этому параметру нужно присваивать значение <literal>off</literal> перед загрузкой функций от лица других пользователей; <application>pg_dump</application> делает это автоматически.

source: <primary>transaction isolation level</primary> <secondary>setting default</secondary>
ru: <primary>уровень изоляции транзакции</primary> <secondary>выбор по умолчанию</secondary>

source: <primary><varname>default_transaction_isolation</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>default_transaction_isolation</varname></primary>

source: Each SQL transaction has an isolation level, which can be either <quote>read uncommitted</quote>, <quote>read committed</quote>, <quote>repeatable read</quote>, or <quote>serializable</quote>. This parameter controls the default isolation level of each new transaction. The default is <quote>read committed</quote>.
ru: Для каждой транзакции в SQL устанавливается уровень изоляции: <quote>read uncommitted</quote>, <quote>read committed</quote>, <quote>repeatable read</quote> или <quote>serializable</quote>. Этот параметр задаёт уровень изоляции, который будет устанавливаться по умолчанию для новых транзакций. Значение этого параметра по умолчанию — <quote>read committed</quote>.

source: Consult <xref linkend="mvcc"/> and <xref linkend="sql-set-transaction"/> for more information.
ru: Дополнительную информацию вы можете найти в <xref remap="6" linkend="mvcc"/> и <xref remap="6" linkend="sql-set-transaction"/>.

source: <primary>read-only transaction</primary> <secondary>setting default</secondary>
ru: <primary>транзакция в режиме &laquo;только чтение&raquo;</primary> <secondary>выбор по умолчанию</secondary>

source: <primary><varname>default_transaction_read_only</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>default_transaction_read_only</varname></primary>

source: A read-only SQL transaction cannot alter non-temporary tables. This parameter controls the default read-only status of each new transaction. The default is <literal>off</literal> (read/write).
ru: SQL-транзакции в режиме &laquo;только чтение&raquo; не могут модифицировать не временные таблицы. Этот параметр определяет, будут ли новые транзакции по умолчанию иметь характеристику &laquo;только чтение&raquo;. Значение этого параметра по умолчанию — <literal>off</literal> (допускается чтение и запись).

source: Consult <xref linkend="sql-set-transaction"/> for more information.
ru: За дополнительной информацией обратитесь к <xref remap="3" linkend="sql-set-transaction"/>.

source: <primary>deferrable transaction</primary> <secondary>setting default</secondary>
ru: <primary>откладываемая транзакция</primary> <secondary>выбор по умолчанию</secondary>

source: <primary><varname>default_transaction_deferrable</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>default_transaction_deferrable</varname></primary>

source: When running at the <literal>serializable</literal> isolation level, a deferrable read-only SQL transaction may be delayed before it is allowed to proceed. However, once it begins executing it does not incur any of the overhead required to ensure serializability; so serialization code will have no reason to force it to abort because of concurrent updates, making this option suitable for long-running read-only transactions.
ru: Транзакция, работающая на уровне изоляции <literal>serializable</literal>, в режиме &laquo;только чтение&raquo; может быть задержана, прежде чем будет разрешено её выполнение. Однако, когда она начинает выполняться, для обеспечения сериализуемости не требуется никаких дополнительных усилий, так что коду сериализации ни при каких условиях не придётся прерывать её из-за параллельных изменений, поэтому это вполне подходит для длительных транзакций в режиме &laquo;только чтение&raquo;.

source: This parameter controls the default deferrable status of each new transaction. It currently has no effect on read-write transactions or those operating at isolation levels lower than <literal>serializable</literal>. The default is <literal>off</literal>.
ru: Этот параметр определяет, будет ли каждая новая транзакция по умолчанию откладываемой. В настоящее время его действие не распространяется на транзакции, для которых устанавливается режим &laquo;чтение/запись&raquo; или уровень изоляции ниже <literal>serializable</literal>. Значение по умолчанию — <literal>off</literal> (выкл.).

source: <primary><varname>session_replication_role</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>session_replication_role</varname></primary>

source: Controls firing of replication-related triggers and rules for the current session. Setting this variable requires superuser privilege and results in discarding any previously cached query plans. Possible values are <literal>origin</literal> (the default), <literal>replica</literal> and <literal>local</literal>. See <xref linkend="sql-altertable"/> for more information.
ru: Управляет срабатыванием правил и триггеров, связанных с репликацией, в текущем сеансе. Изменение этой переменной требует наличия прав суперпользователя и приводит к сбросу всех ранее кешированных планов запросов. Она может принимать следующие значения <literal>origin</literal> (значение по умолчанию), <literal>replica</literal> и <literal>local</literal>. За дополнительными сведениями обратитесь к <xref remap="3" linkend="sql-altertable"/>.

source: <primary><varname>statement_timeout</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>statement_timeout</varname></primary>

source: Abort any statement that takes more than the specified number of milliseconds, starting from the time the command arrives at the server from the client. If <varname>log_min_error_statement</varname> is set to <literal>ERROR</literal> or lower, the statement that timed out will also be logged. A value of zero (the default) turns this off.
ru: Задаёт максимальное время выполнения оператора (в миллисекундах), начиная с момента получения сервером команды от клиента, по истечении которого оператор прерывается. Если <varname>log_min_error_statement</varname> имеет значение <literal>ERROR</literal> или ниже, оператор, прерванный по тайм-ауту, будет также записан в журнал. При значении, равном нулю (по умолчанию), этот контроль длительности отключается.

source: Setting <varname>statement_timeout</varname> in <filename>postgresql.conf</filename> is not recommended because it would affect all sessions.
ru: Устанавливать значение <varname>statement_timeout</varname> в <filename>postgresql.conf</filename> не рекомендуется, так как это повлияет на все сеансы.

source: <primary><varname>lock_timeout</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>lock_timeout</varname></primary>

source: Abort any statement that waits longer than the specified number of milliseconds while attempting to acquire a lock on a table, index, row, or other database object. The time limit applies separately to each lock acquisition attempt. The limit applies both to explicit locking requests (such as <command>LOCK TABLE</command>, or <command>SELECT FOR UPDATE</command> without <literal>NOWAIT</literal>) and to implicitly-acquired locks. If <varname>log_min_error_statement</varname> is set to <literal>ERROR</literal> or lower, the statement that timed out will be logged. A value of zero (the default) turns this off.
ru: Задаёт максимальную длительность ожидания (в миллисекундах) любым оператором получения блокировки таблицы, индекса, строки или другого объекта базы данных. Если ожидание не закончилось за указанное время, оператор прерывается. Это ограничение действует на каждую попытку получения блокировки по отдельности и применяется как к явным запросам блокировки (например, <command>LOCK TABLE</command> или <command>SELECT FOR UPDATE</command> без <literal>NOWAIT</literal>), так и к неявным. Если <varname>log_min_error_statement</varname> имеет значение <literal>ERROR</literal> или ниже, оператор, прерванный по тайм-ауту, будет также записан в журнал. При значении, равном нулю (по умолчанию), этот контроль длительности отключается.

source: Unlike <varname>statement_timeout</varname>, this timeout can only occur while waiting for locks. Note that if <varname>statement_timeout</varname> is nonzero, it is rather pointless to set <varname>lock_timeout</varname> to the same or larger value, since the statement timeout would always trigger first.
ru: В отличие от <varname>statement_timeout</varname>, этот тайм-аут может произойти только при ожидании блокировки. Заметьте, что при ненулевом <varname>statement_timeout</varname> бессмысленно задавать в <varname>lock_timeout</varname> такое же или большее значение, так как тайм-аут оператора всегда будет происходить раньше.

source: Setting <varname>lock_timeout</varname> in <filename>postgresql.conf</filename> is not recommended because it would affect all sessions.
ru: Устанавливать значение <varname>lock_timeout</varname> в <filename>postgresql.conf</filename> не рекомендуется, так как это повлияет на все сеансы.

source: <primary><varname>idle_in_transaction_session_timeout</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>idle_in_transaction_session_timeout</varname></primary>

source: Terminate any session with an open transaction that has been idle for longer than the specified duration in milliseconds. This allows any locks held by that session to be released and the connection slot to be reused; it also allows tuples visible only to this transaction to be vacuumed. See <xref linkend="routine-vacuuming"/> for more details about this.
ru: Завершать любые сеансы, в которых открытая транзакция простаивает дольше заданного (в миллисекундах) времени. Это позволяет освободить все блокировки сеанса и вновь задействовать слот подключения; также это позволяет очистить кортежи, видимые только для этой транзакции. Подробнее это описано в <xref remap="6" linkend="routine-vacuuming"/>.

source: The default value of 0 disables this feature.
ru: Значение по умолчанию (0) отключает это поведение.

source: <primary><varname>vacuum_freeze_table_age</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>vacuum_freeze_table_age</varname></primary>
