Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: <primary><varname>track_functions</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>track_functions</varname></primary>

source: Enables tracking of function call counts and time used. Specify <literal>pl</literal> to track only procedural-language functions, <literal>all</literal> to also track SQL and C language functions. The default is <literal>none</literal>, which disables function statistics tracking. Only superusers can change this setting.
ru: Включает подсчёт вызовов функций и времени их выполнения. Значение <literal>pl</literal> включает отслеживание только функций на процедурном языке, а <literal>all</literal> — также функций на языках SQL и C. Значение по умолчанию — <literal>none</literal>, то есть сбор статистики по функциям отключён. Изменить этот параметр могут только суперпользователи.

source: SQL-language functions that are simple enough to be <quote>inlined</quote> into the calling query will not be tracked, regardless of this setting.
ru: Функции на языке SQL, достаточно простые для <quote>внедрения</quote> в вызывающий запрос, отслеживаться не будут вне зависимости от этого параметра.

source: <primary><varname>stats_temp_directory</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>stats_temp_directory</varname></primary>

source: Sets the directory to store temporary statistics data in. This can be a path relative to the data directory or an absolute path. The default is <filename>pg_stat_tmp</filename>. Pointing this at a RAM-based file system will decrease physical I/O requirements and can lead to improved performance. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Задаёт каталог, в котором будут храниться временные данные статистики. Этот путь может быть абсолютным или задаваться относительно каталога данных. Значение по умолчанию — <filename>pg_stat_tmp</filename>. Если разместить целевой каталог в файловой системе в ОЗУ, это снизит нагрузку на физическое дисковое хранилище и может увеличить быстродействие. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: Statistics Monitoring
ru: Мониторинг статистики

source: <primary><varname>log_statement_stats</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_statement_stats</varname></primary>

source: <primary><varname>log_parser_stats</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_parser_stats</varname></primary>

source: <primary><varname>log_planner_stats</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_planner_stats</varname></primary>

source: <primary><varname>log_executor_stats</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_executor_stats</varname></primary>

source: For each query, output performance statistics of the respective module to the server log. This is a crude profiling instrument, similar to the Unix <function>getrusage()</function> operating system facility. <varname>log_statement_stats</varname> reports total statement statistics, while the others report per-module statistics. <varname>log_statement_stats</varname> cannot be enabled together with any of the per-module options. All of these options are disabled by default. Only superusers can change these settings.
ru: Эти параметры включают вывод статистики по производительности соответствующего модуля в протокол работы сервера. Это грубый инструмент профилирования, похожий на функцию <function>getrusage()</function> в операционной системе. Параметр <varname>log_statement_stats</varname> включает вывод общей статистики по операторам, тогда как другие управляют статистикой по модулям (разбор, планирование, выполнение). Включить <varname>log_statement_stats</varname> одновременно с параметрами, управляющими модулями, нельзя. По умолчанию все эти параметры отключены. Изменить эти параметры могут только суперпользователи.

source: Automatic Vacuuming
ru: Автоматическая очистка

source: <primary>autovacuum</primary> <secondary>configuration parameters</secondary>
ru: <primary>автоочистка</primary> <secondary>параметры конфигурации</secondary>

source: These settings control the behavior of the <firstterm>autovacuum</firstterm> feature. Refer to <xref linkend="autovacuum"/> for more information. Note that many of these settings can be overridden on a per-table basis; see <xref linkend="sql-createtable-storage-parameters" endterm="sql-createtable-storage-parameters-title"/>.
ru: Эти параметры управляют поведением механизма <firstterm>автоочистки</firstterm>. За дополнительными сведениями обратитесь к <xref remap="3" linkend="autovacuum"/>. Заметьте, что многие из этих параметров могут быть переопределены на уровне таблиц; см. <xref remap="4" linkend="sql-createtable-storage-parameters" endterm="sql-createtable-storage-parameters-title"/>.

source: <primary><varname>autovacuum</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>autovacuum</varname></primary>

source: Controls whether the server should run the autovacuum launcher daemon. This is on by default; however, <xref linkend="guc-track-counts"/> must also be enabled for autovacuum to work. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line; however, autovacuuming can be disabled for individual tables by changing table storage parameters.
ru: Управляет состоянием демона, запускающего автоочистку. По умолчанию он включён, но чтобы автоочистка работала, нужно также включить <xref linkend="guc-track-counts"/>. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера. Однако автоочистку можно отключить для отдельных таблиц, изменив их параметры хранения.

source: Note that even when this parameter is disabled, the system will launch autovacuum processes if necessary to prevent transaction ID wraparound. See <xref linkend="vacuum-for-wraparound"/> for more information.
ru: Заметьте, что даже если этот параметр отключён, система будет запускать процессы автоочистки, когда это необходимо для предотвращения наложений идентификаторов транзакций. За дополнительными сведениями обратитесь к <xref remap="3" linkend="vacuum-for-wraparound"/>.

source: <primary><varname>log_autovacuum_min_duration</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_autovacuum_min_duration</varname></primary>

source: Causes each action executed by autovacuum to be logged if it ran for at least the specified number of milliseconds. Setting this to zero logs all autovacuum actions. Minus-one (the default) disables logging autovacuum actions. For example, if you set this to <literal>250ms</literal> then all automatic vacuums and analyzes that run 250ms or longer will be logged. In addition, when this parameter is set to any value other than <literal>-1</literal>, a message will be logged if an autovacuum action is skipped due to the existence of a conflicting lock. Enabling this parameter can be helpful in tracking autovacuum activity. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line; but the setting can be overridden for individual tables by changing table storage parameters.
ru: Задаёт время (в миллисекундах) выполнения действия автоочистки, при превышении которого информация об этом действии записывается в протокол. При нулевом значении в протоколе фиксируются все действия автоочистки. Значение -1 (по умолчанию) отключает протоколирование действий автоочистки. Например, если задать значение <literal>250ms</literal>, в протоколе будут фиксироваться все операции автоматической очистки и анализа, выполняемые дольше 250 мс. Кроме того, когда этот параметр имеет любое значение, отличное от <literal>-1</literal>, в протокол будет записываться сообщение в случае пропуска действия автоочистки из-за конфликтующей блокировки. Таким образом, включение этого параметра позволяет отслеживать активность автоочистки. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера. Однако его можно переопределить для отдельных таблиц, изменив их параметры хранения.

source: <primary><varname>autovacuum_max_workers</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>autovacuum_max_workers</varname></primary>

source: Specifies the maximum number of autovacuum processes (other than the autovacuum launcher) that may be running at any one time. The default is three. This parameter can only be set at server start.
ru: Задаёт максимальное число процессов автоочистки (не считая процесс, запускающий автоочистку), которые могут выполняться одновременно. По умолчанию это число равно трём. Задать этот параметр можно только при запуске сервера.

source: <primary><varname>autovacuum_naptime</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>autovacuum_naptime</varname></primary>

source: Specifies the minimum delay between autovacuum runs on any given database. In each round the daemon examines the database and issues <command>VACUUM</command> and <command>ANALYZE</command> commands as needed for tables in that database. The delay is measured in seconds, and the default is one minute (<literal>1min</literal>). This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Задаёт минимальную задержку между двумя запусками автоочистки для отдельной базы данных. Демон автоочистки проверяет базу данных через заданный интервал времени и выдаёт команды <command>VACUUM</command> и <command>ANALYZE</command>, когда это требуется для таблиц этой базы. Задержка задаётся в секундах и по умолчанию равна одной минуте (<literal>1min</literal>). Этот параметр можно задать только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>autovacuum_vacuum_threshold</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>autovacuum_vacuum_threshold</varname></primary>

source: Specifies the minimum number of updated or deleted tuples needed to trigger a <command>VACUUM</command> in any one table. The default is 50 tuples. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line; but the setting can be overridden for individual tables by changing table storage parameters.
ru: Задаёт минимальное число изменённых или удалённых кортежей, при котором будет выполняться <command>VACUUM</command> для отдельно взятой таблицы. Значение по умолчанию — 50 кортежей. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера. Однако данное значение можно переопределить для избранных таблиц, изменив их параметры хранения.

source: <primary><varname>autovacuum_analyze_threshold</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>autovacuum_analyze_threshold</varname></primary>

source: Specifies the minimum number of inserted, updated or deleted tuples needed to trigger an <command>ANALYZE</command> in any one table. The default is 50 tuples. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line; but the setting can be overridden for individual tables by changing table storage parameters.
ru: Задаёт минимальное число добавленных, изменённых или удалённых кортежей, при котором будет выполняться <command>ANALYZE</command> для отдельно взятой таблицы. Значение по умолчанию — 50 кортежей. Этот параметр можно задать только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера. Однако данное значение можно переопределить для избранных таблиц, изменив их параметры хранения.

source: <primary><varname>autovacuum_vacuum_scale_factor</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>autovacuum_vacuum_scale_factor</varname></primary>

source: Specifies a fraction of the table size to add to <varname>autovacuum_vacuum_threshold</varname> when deciding whether to trigger a <command>VACUUM</command>. The default is 0.2 (20% of table size). This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line; but the setting can be overridden for individual tables by changing table storage parameters.
ru: Задаёт процент от размера таблицы, который будет добавляться к <varname>autovacuum_vacuum_threshold</varname> при выборе порога срабатывания команды <command>VACUUM</command>. Значение по умолчанию — 0.2 (20% от размера таблицы). Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера. Однако данное значение можно переопределить для избранных таблиц, изменив их параметры хранения.

source: <primary><varname>autovacuum_analyze_scale_factor</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>autovacuum_analyze_scale_factor</varname></primary>

source: Specifies a fraction of the table size to add to <varname>autovacuum_analyze_threshold</varname> when deciding whether to trigger an <command>ANALYZE</command>. The default is 0.1 (10% of table size). This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line; but the setting can be overridden for individual tables by changing table storage parameters.
ru: Задаёт процент от размера таблицы, который будет добавляться к <varname>autovacuum_analyze_threshold</varname> при выборе порога срабатывания команды <command>ANALYZE</command>. Значение по умолчанию — 0.1 (10% от размера таблицы). Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера. Однако данное значение можно переопределить для избранных таблиц, изменив их параметры хранения.

source: <primary><varname>autovacuum_freeze_max_age</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>autovacuum_freeze_max_age</varname></primary>

source: Specifies the maximum age (in transactions) that a table's <structname>pg_class</structname>.<structfield>relfrozenxid</structfield> field can attain before a <command>VACUUM</command> operation is forced to prevent transaction ID wraparound within the table. Note that the system will launch autovacuum processes to prevent wraparound even when autovacuum is otherwise disabled.
ru: Задаёт максимальный возраст (в транзакциях) для поля <structname>pg_class</structname>.<structfield>relfrozenxid</structfield> некоторой таблицы, при достижении которого будет запущена операция <command>VACUUM</command> для предотвращения наложений идентификаторов транзакций в этой таблице. Заметьте, что система запустит процессы автоочистки для предотвращения наложений, даже если для всех других целей автоочистка отключена.

source: Vacuum also allows removal of old files from the <filename>pg_clog</filename> subdirectory, which is why the default is a relatively low 200 million transactions. This parameter can only be set at server start, but the setting can be reduced for individual tables by changing table storage parameters. For more information see <xref linkend="vacuum-for-wraparound"/>.
ru: При очистке могут также удаляться старые файлы из подкаталога <filename>pg_clog</filename>, поэтому значение по умолчанию сравнительно мало — 200 миллионов транзакций. Задать этот параметр можно только при запуске сервера, но для отдельных таблиц его можно определить по-другому, изменив их параметры хранения. За дополнительными сведениями обратитесь к <xref remap="3" linkend="vacuum-for-wraparound"/>.

source: <primary><varname>autovacuum_multixact_freeze_max_age</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>autovacuum_multixact_freeze_max_age</varname></primary>

source: Specifies the maximum age (in multixacts) that a table's <structname>pg_class</structname>.<structfield>relminmxid</structfield> field can attain before a <command>VACUUM</command> operation is forced to prevent multixact ID wraparound within the table. Note that the system will launch autovacuum processes to prevent wraparound even when autovacuum is otherwise disabled.
ru: Задаёт максимальный возраст (в мультитранзакциях) для поля <structname>pg_class</structname>.<structfield>relminmxid</structfield> таблицы, при достижении которого будет запущена операция <command>VACUUM</command> для предотвращения наложений идентификаторов мультитранзакций в этой таблице. Заметьте, что система запустит процессы автоочистки для предотвращения наложений, даже если для всех других целей автоочистка отключена.

source: Vacuuming multixacts also allows removal of old files from the <filename>pg_multixact/members</filename> and <filename>pg_multixact/offsets</filename> subdirectories, which is why the default is a relatively low 400 million multixacts. This parameter can only be set at server start, but the setting can be reduced for individual tables by changing table storage parameters. For more information see <xref linkend="vacuum-for-multixact-wraparound"/>.
ru: При очистке мультитранзакций могут также удаляться старые файлы из подкаталогов <filename>pg_multixact/members</filename> и <filename>pg_multixact/offsets</filename>, поэтому значение по умолчанию сравнительно мало — 400 миллионов мультитранзакций. Этот параметр можно задать только при запуске сервера, но для отдельных таблиц его можно определить по-другому, изменив их параметры хранения. За дополнительными сведениями обратитесь к <xref remap="3" linkend="vacuum-for-multixact-wraparound"/>.

source: <primary><varname>autovacuum_vacuum_cost_delay</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>autovacuum_vacuum_cost_delay</varname></primary>

source: Specifies the cost delay value that will be used in automatic <command>VACUUM</command> operations. If -1 is specified, the regular <xref linkend="guc-vacuum-cost-delay"/> value will be used. The default value is 20 milliseconds. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line; but the setting can be overridden for individual tables by changing table storage parameters.
ru: Задаёт задержку при превышении предела стоимости, которая будет применяться при автоматических операциях <command>VACUUM</command>. При значении -1 применяется обычная задержка <xref linkend="guc-vacuum-cost-delay"/>. Значение по умолчанию — 20 миллисекунд. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера. Однако его можно переопределить для отдельных таблиц, изменив их параметры хранения.

source: <primary><varname>autovacuum_vacuum_cost_limit</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>autovacuum_vacuum_cost_limit</varname></primary>

source: Specifies the cost limit value that will be used in automatic <command>VACUUM</command> operations. If -1 is specified (which is the default), the regular <xref linkend="guc-vacuum-cost-limit"/> value will be used. Note that the value is distributed proportionally among the running autovacuum workers, if there is more than one, so that the sum of the limits for each worker does not exceed the value of this variable. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line; but the setting can be overridden for individual tables by changing table storage parameters.
ru: Задаёт предел стоимости, который будет учитываться при автоматических операциях <command>VACUUM</command>. При значении -1 (по умолчанию) применяется обычное значение <xref linkend="guc-vacuum-cost-limit"/>. Заметьте, что это значение распределяется пропорционально среди всех работающих процессов автоочистки, если их больше одного, так что сумма ограничений всех процессов никогда не превосходит данный предел. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера. Однако его можно переопределить для отдельных таблиц, изменив их параметры хранения.

source: Client Connection Defaults
ru: Параметры клиентских сеансов по умолчанию

source: Statement Behavior
ru: Поведение команд

source: <primary><varname>search_path</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>search_path</varname></primary>

source: <primary>path</primary><secondary>for schemas</secondary>
ru: <primary>путь</primary> <secondary>для схем</secondary>

source: This variable specifies the order in which schemas are searched when an object (table, data type, function, etc.) is referenced by a simple name with no schema specified. When there are objects of identical names in different schemas, the one found first in the search path is used. An object that is not in any of the schemas in the search path can only be referenced by specifying its containing schema with a qualified (dotted) name.
ru: Эта переменная определяет порядок, в котором будут просматриваться схемы при поиске объекта (таблицы, типа данных, функции и т. д.), к которому обращаются просто по имени, без указания схемы. Если объекты с одинаковым именем находятся в нескольких схемах, использоваться будет тот, что встретится первым при просмотре пути поиска. К объекту, который не относится к схемам, перечисленным в пути поиска, можно обратиться только по полному имени (с точкой), с указанием содержащей его схемы.

source: The value for <varname>search_path</varname> must be a comma-separated list of schema names. Any name that is not an existing schema, or is a schema for which the user does not have <literal>USAGE</literal> permission, is silently ignored.
ru: Значением <varname>search_path</varname> должен быть список имён схем через запятую. Если для имени, указанного в этом списке, не находится существующая схема, либо пользователь не имеет права <literal>USAGE</literal> для схемы с этим именем, такое имя просто игнорируется.

source: If one of the list items is the special name <literal>$user</literal>, then the schema having the name returned by <function>SESSION_USER</function> is substituted, if there is such a schema and the user has <literal>USAGE</literal> permission for it. (If not, <literal>$user</literal> is ignored.)
ru: Если список содержит специальный элемент <literal>$user</literal>, вместо него подставляется схема с именем, возвращаемым функцией <function>SESSION_USER</function>, если такая схема существует и пользователь имеет право <literal>USAGE</literal> для неё. (В противном случае элемент <literal>$user</literal> игнорируется.)

source: The system catalog schema, <literal>pg_catalog</literal>, is always searched, whether it is mentioned in the path or not. If it is mentioned in the path then it will be searched in the specified order. If <literal>pg_catalog</literal> is not in the path then it will be searched <emphasis>before</emphasis> searching any of the path items.
ru: Схема системных каталогов, <literal>pg_catalog</literal>, просматривается всегда, независимо от того, указана она в пути или нет. Если она указана в пути, она просматривается в заданном порядке. Если же <literal>pg_catalog</literal> отсутствует в пути, эта схема будет просматриваться <emphasis>перед</emphasis> остальными элементами пути.
