Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: The genetic query optimizer (GEQO) is an algorithm that does query planning using heuristic searching. This reduces planning time for complex queries (those joining many relations), at the cost of producing plans that are sometimes inferior to those found by the normal exhaustive-search algorithm. For more information see <xref linkend="geqo"/>.
ru: Генетический оптимизатор запросов (GEnetic Query Optimizer, GEQO) осуществляет планирование запросов, применяя эвристический поиск. Это позволяет сократить время планирования для сложных запросов (в которых соединяются множество отношений), ценой того, что иногда полученные планы уступают по качеству планам, выбираемым при полном переборе. За дополнительными сведениями обратитесь к <xref remap="3" linkend="geqo"/>.

source: <primary>genetic query optimization</primary>
ru: <primary>генетическая оптимизация запросов</primary>

source: <primary>GEQO</primary> <see>genetic query optimization</see>
ru: <primary>GEQO</primary> <see>генетическая оптимизация запросов</see>

source: <primary><varname>geqo</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>geqo</varname></primary>

source: Enables or disables genetic query optimization. This is on by default. It is usually best not to turn it off in production; the <varname>geqo_threshold</varname> variable provides more granular control of GEQO.
ru: Включает или отключает генетическую оптимизацию запросов. По умолчанию она включена. В производственной среде её лучше не отключать; более гибко управлять GEQO можно с помощью переменной <varname>geqo_threshold</varname>.

source: <primary><varname>geqo_threshold</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>geqo_threshold</varname></primary>

source: Use genetic query optimization to plan queries with at least this many <literal>FROM</literal> items involved. (Note that a <literal>FULL OUTER JOIN</literal> construct counts as only one <literal>FROM</literal> item.) The default is 12. For simpler queries it is usually best to use the regular, exhaustive-search planner, but for queries with many tables the exhaustive search takes too long, often longer than the penalty of executing a suboptimal plan. Thus, a threshold on the size of the query is a convenient way to manage use of GEQO.
ru: Задаёт минимальное число элементов во <literal>FROM</literal>, при котором для планирования запроса будет привлечён генетический оптимизатор. (Заметьте, что конструкция <literal>FULL OUTER JOIN</literal> считается одним элементом списка <literal>FROM</literal>.) Значение по умолчанию — 12. Для более простых запросов часто лучше использовать обычный планировщик, производящий полный перебор, но для запросов со множеством таблиц полный перебор займёт слишком много времени, чаще гораздо больше, чем будет потеряно из-за выбора не самого эффективного плана. Таким образом, ограничение по размеру запроса даёт удобную возможность управлять GEQO.

source: <primary><varname>geqo_effort</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>geqo_effort</varname></primary>

source: Controls the trade-off between planning time and query plan quality in GEQO. This variable must be an integer in the range from 1 to 10. The default value is five. Larger values increase the time spent doing query planning, but also increase the likelihood that an efficient query plan will be chosen.
ru: Управляет выбором между сокращением временем планирования и повышением качества плана запроса в GEQO. Это значение должна задаваться целым числом от 1 до 10. Значение по умолчанию равно пяти. Чем больше значение этого параметра, тем больше времени будет потрачено на планирование запроса, но и тем больше вероятность, что будет выбран эффективный план.

source: <varname>geqo_effort</varname> doesn't actually do anything directly; it is only used to compute the default values for the other variables that influence GEQO behavior (described below). If you prefer, you can set the other parameters by hand instead.
ru: Параметр <varname>geqo_effort</varname> сам по себе ничего не делает, он используется только для вычисления значений по умолчанию для других переменных, влияющих на поведение GEQO (они описаны ниже). При желании эти переменные можно просто установить вручную.

source: <primary><varname>geqo_pool_size</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>geqo_pool_size</varname></primary>

source: Controls the pool size used by GEQO, that is the number of individuals in the genetic population. It must be at least two, and useful values are typically 100 to 1000. If it is set to zero (the default setting) then a suitable value is chosen based on <varname>geqo_effort</varname> and the number of tables in the query.
ru: Задаёт размер пула для алгоритма GEQO, то есть число особей в генетической популяции. Это число должно быть не меньше двух, но полезные значения обычно лежат в интервале от 100 до 1000. Если оно равно нулю (это значение по умолчанию), то подходящее число выбирается, исходя из значения <varname>geqo_effort</varname> и числа таблиц в запросе.

source: <primary><varname>geqo_generations</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>geqo_generations</varname></primary>

source: Controls the number of generations used by GEQO, that is the number of iterations of the algorithm. It must be at least one, and useful values are in the same range as the pool size. If it is set to zero (the default setting) then a suitable value is chosen based on <varname>geqo_pool_size</varname>.
ru: Задаёт число поколений для GEQO, то есть число итераций этого алгоритма. Оно должно быть не меньше единицы, но полезные значения находятся в том же диапазоне, что и размер пула. Если оно равно нулю (это значение по умолчанию), то подходящее число выбирается, исходя из <varname>geqo_pool_size</varname>.

source: <primary><varname>geqo_selection_bias</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>geqo_selection_bias</varname></primary>

source: Controls the selection bias used by GEQO. The selection bias is the selective pressure within the population. Values can be from 1.50 to 2.00; the latter is the default.
ru: Задаёт интенсивность селекции для GEQO, то есть селективное давление в популяции. Допустимые значения лежат в диапазоне от 1.50 до 2.00 (это значение по умолчанию).

source: <primary><varname>geqo_seed</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>geqo_seed</varname></primary>

source: Controls the initial value of the random number generator used by GEQO to select random paths through the join order search space. The value can range from zero (the default) to one. Varying the value changes the set of join paths explored, and may result in a better or worse best path being found.
ru: Задаёт начальное значение для генератора случайных чисел, который применяется в GEQO для выбора случайных путей в пространстве поиска порядка соединений. Может иметь значение от нуля (по умолчанию) до одного. При изменении этого значения меняется набор анализируемых путей, в результате чего может быть найден как более, так и менее оптимальный путь.

source: Other Planner Options
ru: Другие параметры планировщика

source: <primary><varname>default_statistics_target</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>default_statistics_target</varname></primary>

source: Sets the default statistics target for table columns without a column-specific target set via <command>ALTER TABLE SET STATISTICS</command>. Larger values increase the time needed to do <command>ANALYZE</command>, but might improve the quality of the planner's estimates. The default is 100. For more information on the use of statistics by the <productname>PostgreSQL</productname> query planner, refer to <xref linkend="planner-stats"/>.
ru: Устанавливает целевое ограничение статистики по умолчанию, распространяющееся на столбцы, для которых командой <command>ALTER TABLE SET STATISTICS</command> не заданы отдельные ограничения. Чем больше установленное значение, тем больше времени требуется для выполнения <command>ANALYZE</command>, но тем выше может быть качество оценок планировщика. Значение этого параметра по умолчанию &mdash; 100. За дополнительными сведениями об использовании статистики планировщиком запросов <productname>PostgreSQL</productname> обратитесь к <xref remap="3" linkend="planner-stats"/>.

source: <primary>constraint exclusion</primary>
ru: <primary>исключение по ограничению</primary>

source: <primary><varname>constraint_exclusion</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>constraint_exclusion</varname></primary>

source: Controls the query planner's use of table constraints to optimize queries. The allowed values of <varname>constraint_exclusion</varname> are <literal>on</literal> (examine constraints for all tables), <literal>off</literal> (never examine constraints), and <literal>partition</literal> (examine constraints only for inheritance child tables and <literal>UNION ALL</literal> subqueries). <literal>partition</literal> is the default setting. It is often used with inheritance and partitioned tables to improve performance.
ru: Управляет использованием ограничений таблиц для оптимизации запросов. Допустимые значения <varname>constraint_exclusion</varname>: <literal>on</literal> (задействовать ограничения всех таблиц), <literal>off</literal> (никогда не задействовать ограничения) и <literal>partition</literal> (задействовать ограничения только для дочерних таблиц и подзапросов <literal>UNION ALL</literal>). Значение по умолчанию — <literal>partition</literal>. Оно часто помогает увеличить производительность, когда применяются секционированные таблицы и наследование.

source: When this parameter allows it for a particular table, the planner compares query conditions with the table's <literal>CHECK</literal> constraints, and omits scanning tables for which the conditions contradict the constraints. For example: <placeholder-1/> With constraint exclusion enabled, this <command>SELECT</command> will not scan <structname>child1000</structname> at all, improving performance.
ru: Когда данный параметр разрешает это для таблицы, планировщик сравнивает условия запроса с ограничениями <literal>CHECK</literal> данной таблицы и не сканирует её, если они оказываются несовместимыми. Например: <placeholder-1/> Если включено исключение по ограничению, команда <command>SELECT</command> не будет сканировать таблицу <structname>child1000</structname>, в результате чего запрос выполнится быстрее.

source: Currently, constraint exclusion is enabled by default only for cases that are often used to implement table partitioning. Turning it on for all tables imposes extra planning overhead that is quite noticeable on simple queries, and most often will yield no benefit for simple queries. If you have no partitioned tables you might prefer to turn it off entirely.
ru: В настоящее время исключение по ограничению разрешено по умолчанию только в условиях, возникающих при реализации секционированных таблиц. Включение этой возможности для всех таблиц влечёт дополнительные издержки на планирование, довольно заметные для простых запросов, но никакого выигрыша это не приносит. Если вы не применяете секционированные таблицы, лучше всего полностью отключить эту возможность.

source: Refer to <xref linkend="ddl-partitioning-constraint-exclusion"/> for more information on using constraint exclusion and partitioning.
ru: За дополнительными сведениями об исключении по ограничению и секционировании таблиц обратитесь к <xref remap="3" linkend="ddl-partitioning-constraint-exclusion"/>.

source: <primary><varname>cursor_tuple_fraction</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>cursor_tuple_fraction</varname></primary>

source: Sets the planner's estimate of the fraction of a cursor's rows that will be retrieved. The default is 0.1. Smaller values of this setting bias the planner towards using <quote>fast start</quote> plans for cursors, which will retrieve the first few rows quickly while perhaps taking a long time to fetch all rows. Larger values put more emphasis on the total estimated time. At the maximum setting of 1.0, cursors are planned exactly like regular queries, considering only the total estimated time and not how soon the first rows might be delivered.
ru: Задаёт для планировщика оценку процента строк, которые будут получены через курсор. Значение по умолчанию — 0.1 (10%). При меньших значениях планировщик будет склонен использовать для курсоров планы с <quote>быстрым стартом</quote>, позволяющие получать первые несколько строк очень быстро, хотя для выборки всех строк может уйти больше времени. При больших значениях планировщик стремится оптимизировать общее время запроса. При максимальном значении, равном 1.0, работа с курсорами планируется так же, как и обычные запросы — минимизируется только общее время, а не время получения первых строк.

source: <primary><varname>from_collapse_limit</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>from_collapse_limit</varname></primary>

source: The planner will merge sub-queries into upper queries if the resulting <literal>FROM</literal> list would have no more than this many items. Smaller values reduce planning time but might yield inferior query plans. The default is eight. For more information see <xref linkend="explicit-joins"/>.
ru: Задаёт максимальное число элементов в списке <literal>FROM</literal>, до которого планировщик будет объединять вложенные запросы с внешним запросом. При меньших значениях сокращается время планирования, но план запроса может стать менее эффективным. По умолчанию это значение равно восьми. За дополнительными сведениями обратитесь к <xref remap="3" linkend="explicit-joins"/>.

source: Setting this value to <xref linkend="guc-geqo-threshold"/> or more may trigger use of the GEQO planner, resulting in non-optimal plans. See <xref linkend="runtime-config-query-geqo"/>.
ru: Если это значение сделать равным <xref linkend="guc-geqo-threshold"/> или больше, при таком объединении запросов может включиться планировщик GEQO и в результате будет получен неоптимальный план. См. <xref remap="4" linkend="runtime-config-query-geqo"/>.

source: <primary><varname>join_collapse_limit</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>join_collapse_limit</varname></primary>

source: The planner will rewrite explicit <literal>JOIN</literal> constructs (except <literal>FULL JOIN</literal>s) into lists of <literal>FROM</literal> items whenever a list of no more than this many items would result. Smaller values reduce planning time but might yield inferior query plans.
ru: Задаёт максимальное количество элементов в списке <literal>FROM</literal>, до достижения которого планировщик будет сносить в него явные конструкции <literal>JOIN</literal> (за исключением <literal>FULL JOIN</literal>). При меньших значениях сокращается время планирования, но план запроса может стать менее эффективным.

source: By default, this variable is set the same as <varname>from_collapse_limit</varname>, which is appropriate for most uses. Setting it to 1 prevents any reordering of explicit <literal>JOIN</literal>s. Thus, the explicit join order specified in the query will be the actual order in which the relations are joined. Because the query planner does not always choose the optimal join order, advanced users can elect to temporarily set this variable to 1, and then specify the join order they desire explicitly. For more information see <xref linkend="explicit-joins"/>.
ru: По умолчанию эта переменная имеет то же значение, что и <varname>from_collapse_limit</varname>, и это приемлемо в большинстве случаев. При значении, равном 1, предложения <literal>JOIN</literal> переставляться не будут, так что явно заданный в запросе порядок соединений определит фактический порядок, в котором будут соединяться отношения. Так как планировщик не всегда выбирает оптимальный порядок соединений, опытные пользователи могут временно задать для этой переменной значение 1, а затем явно определить желаемый порядок. За дополнительными сведениями обратитесь к <xref remap="3" linkend="explicit-joins"/>.

source: <primary><varname>force_parallel_mode</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>force_parallel_mode</varname></primary>

source: Allows the use of parallel queries for testing purposes even in cases where no performance benefit is expected. The allowed values of <varname>force_parallel_mode</varname> are <literal>off</literal> (use parallel mode only when it is expected to improve performance), <literal>on</literal> (force parallel query for all queries for which it is thought to be safe), and <literal>regress</literal> (like <literal>on</literal>, but with additional behavior changes as explained below).
ru: Позволяет распараллеливать запрос в целях тестирования, даже когда от этого не ожидается никакого выигрыша в скорости. Допустимые значения параметра <varname>force_parallel_mode</varname> — <literal>off</literal> (использовать параллельный режим только когда ожидается увеличение производительности), <literal>on</literal> (принудительно распараллеливать все запросы, для которых это безопасно) и <literal>regress</literal> (как <literal>on</literal>, но с дополнительными изменениями поведения, описанными ниже).

source: More specifically, setting this value to <literal>on</literal> will add a <literal>Gather</literal> node to the top of any query plan for which this appears to be safe, so that the query runs inside of a parallel worker. Even when a parallel worker is not available or cannot be used, operations such as starting a subtransaction that would be prohibited in a parallel query context will be prohibited unless the planner believes that this will cause the query to fail. If failures or unexpected results occur when this option is set, some functions used by the query may need to be marked <literal>PARALLEL UNSAFE</literal> (or, possibly, <literal>PARALLEL RESTRICTED</literal>).
ru: Говоря точнее, со значением <literal>on</literal> узел <literal>Gather</literal> добавляется в вершину любого плана запроса, для которого допускается распараллеливание, так что запрос выполняется внутри параллельного исполнителя. Даже когда параллельный исполнитель недоступен или не может быть использован, такие операции, как запуск подтранзакции, которые не должны выполняться в контексте параллельного запроса, не будут выполняться в этом режиме, если только планировщик не решит, что это приведёт к ошибке запроса. Если при включении этого параметра возникают ошибки или выдаются неожиданные результаты, вероятно, некоторые функции, задействованные в этом запросе, нужно пометить как <literal>PARALLEL UNSAFE</literal> (или, возможно, <literal>PARALLEL RESTRICTED</literal>).

source: Setting this value to <literal>regress</literal> has all of the same effects as setting it to <literal>on</literal> plus some additional effects that are intended to facilitate automated regression testing. Normally, messages from a parallel worker include a context line indicating that, but a setting of <literal>regress</literal> suppresses this line so that the output is the same as in non-parallel execution. Also, the <literal>Gather</literal> nodes added to plans by this setting are hidden in <literal>EXPLAIN</literal> output so that the output matches what would be obtained if this setting were turned <literal>off</literal>.
ru: Значение <literal>regress</literal> действует так же, как и значение <literal>on</literal>, с некоторыми дополнительными особенностями, предназначенными для облегчения автоматического регрессионного тестирования. Обычно сообщения от параллельных исполнителей включают строку контекста, отмечающую это, но значение <literal>regress</literal> подавляет эту строку, так что вывод не отличается от выполнения в не параллельном режиме. Кроме того, узлы <literal>Gather</literal>, добавляемые в планы с этим значением параметра, скрываются в выводе <literal>EXPLAIN</literal>, чтобы вывод соответствовал тому, что будет получен при отключении этого параметра (со значением <literal>off</literal>).

source: Error Reporting and Logging
ru: Регистрация ошибок и протоколирование работы сервера

source: <primary>server log</primary>
ru: <primary>журнал сервера</primary>

source: Where To Log
ru: Куда протоколировать

source: <primary>where to log</primary>
ru: <primary>куда протоколировать</primary>

source: <primary><varname>log_destination</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_destination</varname></primary>

source: <productname>PostgreSQL</productname> supports several methods for logging server messages, including <systemitem>stderr</systemitem>, <systemitem>csvlog</systemitem> and <systemitem>syslog</systemitem>. On Windows, <systemitem>eventlog</systemitem> is also supported. Set this parameter to a list of desired log destinations separated by commas. The default is to log to <systemitem>stderr</systemitem> only. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: <productname>PostgreSQL</productname> поддерживает несколько методов протоколирования сообщений сервера: <systemitem>stderr</systemitem>, <systemitem>csvlog</systemitem> и <systemitem>syslog</systemitem>. На Windows также поддерживается <systemitem>eventlog</systemitem>. В качестве значения <varname>log_destination</varname> указывается один или несколько методов протоколирования, разделённых запятыми. По умолчанию используется <systemitem>stderr</systemitem>. Параметр можно задать только в конфигурационных файлах или в командной строке при запуске сервера.

source: If <systemitem>csvlog</systemitem> is included in <varname>log_destination</varname>, log entries are output in <quote>comma separated value</quote> (<acronym>CSV</acronym>) format, which is convenient for loading logs into programs. See <xref linkend="runtime-config-logging-csvlog"/> for details. <xref linkend="guc-logging-collector"/> must be enabled to generate CSV-format log output.
ru: Если в <varname>log_destination</varname> включено значение <systemitem>csvlog</systemitem>, то протоколирование ведётся в формате <acronym>CSV</acronym> (разделённые запятыми значения). Это удобно для программной обработки журнала. Подробнее об этом в <xref remap="6" linkend="runtime-config-logging-csvlog"/>. Для вывода в формате CSV должен быть включён <xref linkend="guc-logging-collector"/>.
