Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: <varname>db_user_namespace</varname> causes the client's and server's user name representation to differ. Authentication checks are always done with the server's user name so authentication methods must be configured for the server's user name, not the client's. Because <literal>md5</literal> uses the user name as salt on both the client and server, <literal>md5</literal> cannot be used with <varname>db_user_namespace</varname>.
ru: Параметр <varname>db_user_namespace</varname> порождает расхождение между именами пользователей на стороне сервера и клиента. Но проверки подлинности всегда выполняются с именем с точки зрения сервера, так что, настраивая аутентификацию, следует указывать серверное представление имени, а не клиентское. Так как метод аутентификации <literal>md5</literal> подмешивает имя пользователя в качестве соли и на стороне сервера, и на стороне клиента, при включённом параметре <varname>db_user_namespace</varname> использовать <literal>md5</literal> невозможно.

source: This feature is intended as a temporary measure until a complete solution is found. At that time, this option will be removed.
ru: Эта возможность предлагается в качестве временной меры, пока не будет найдено полноценное решение. Тогда этот параметр будет ликвидирован.

source: Resource Consumption
ru: Потребление ресурсов

source: Memory
ru: Память

source: <primary><varname>shared_buffers</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>shared_buffers</varname></primary>

source: Sets the amount of memory the database server uses for shared memory buffers. The default is typically 128 megabytes (<literal>128MB</literal>), but might be less if your kernel settings will not support it (as determined during <application>initdb</application>). This setting must be at least 128 kilobytes. (Non-default values of <symbol>BLCKSZ</symbol> change the minimum.) However, settings significantly higher than the minimum are usually needed for good performance. This parameter can only be set at server start.
ru: Задаёт объём памяти, который будет использовать сервер баз данных для буферов в разделяемой памяти. По умолчанию это обычно 128 мегабайт (<literal>128MB</literal>), но может быть и меньше, если конфигурация вашего ядра накладывает дополнительные ограничения (это определяется в процессе <application>initdb</application>). Это значение не должно быть меньше 128 килобайт. (Этот минимум зависит от величины <symbol>BLCKSZ</symbol>.) Однако для хорошей производительности обычно требуются гораздо большие значения. Задать этот параметр можно только при запуске сервера.

source: If you have a dedicated database server with 1GB or more of RAM, a reasonable starting value for <varname>shared_buffers</varname> is 25% of the memory in your system. There are some workloads where even large settings for <varname>shared_buffers</varname> are effective, but because <productname>PostgreSQL</productname> also relies on the operating system cache, it is unlikely that an allocation of more than 40% of RAM to <varname>shared_buffers</varname> will work better than a smaller amount. Larger settings for <varname>shared_buffers</varname> usually require a corresponding increase in <varname>max_wal_size</varname>, in order to spread out the process of writing large quantities of new or changed data over a longer period of time.
ru: Если вы используете выделенный сервер с объёмом ОЗУ 1 ГБ и более, разумным начальным значением <varname>shared_buffers</varname> будет 25% от объёма памяти. Существуют варианты нагрузки, при которых эффективны будут и ещё большие значения <varname>shared_buffers</varname>, но так как <productname>PostgreSQL</productname> использует и кеш операционной системы, выделять для <varname>shared_buffers</varname> более 40% ОЗУ вряд ли будет полезно. При увеличении <varname>shared_buffers</varname> обычно требуется соответственно увеличить <varname>max_wal_size</varname>, чтобы растянуть процесс записи большого объёма новых или изменённых данных на более продолжительное время.

source: On systems with less than 1GB of RAM, a smaller percentage of RAM is appropriate, so as to leave adequate space for the operating system. Also, on Windows, large values for <varname>shared_buffers</varname> aren't as effective. You may find better results keeping the setting relatively low and using the operating system cache more instead. The useful range for <varname>shared_buffers</varname> on Windows systems is generally from 64MB to 512MB.
ru: В серверах с объёмом ОЗУ меньше 1ГБ следует использовать меньший процент ОЗУ, чтобы оставить достаточно памяти для операционной системы. Кроме того, большие значения <varname>shared_buffers</varname> не так эффективны в Windows. Возможно, вы получите лучшие результаты, если оставите это значение относительно небольшим и будете больше полагаться на кеш операционной системы. Оптимальные значения <varname>shared_buffers</varname> для Windows обычно лежат в интервале от 64 до 512 мегабайт.

source: <primary><varname>huge_pages</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>huge_pages</varname></primary>

source: Enables/disables the use of huge memory pages. Valid values are <literal>try</literal> (the default), <literal>on</literal>, and <literal>off</literal>.
ru: Включает/отключает использование огромных страниц памяти. Допустимые значения: <literal>try</literal> (попытаться, по умолчанию), <literal>on</literal> (вкл.) и <literal>off</literal> (выкл.).

source: At present, this feature is supported only on Linux. The setting is ignored on other systems when set to <literal>try</literal>.
ru: В настоящее время это поддерживается только в Linux. В других системах значение <literal>try</literal> просто игнорируется.

source: The use of huge pages results in smaller page tables and less CPU time spent on memory management, increasing performance. For more details, see <xref linkend="linux-huge-pages"/>.
ru: В результате использования огромных страниц уменьшаются таблицы страниц и сокращается время, которое тратит процессор на управление памятью. За подробностями обратитесь к <xref remap="3" linkend="linux-huge-pages"/>.

source: With <varname>huge_pages</varname> set to <literal>try</literal>, the server will try to use huge pages, but fall back to using normal allocation if that fails. With <literal>on</literal>, failure to use huge pages will prevent the server from starting up. With <literal>off</literal>, huge pages will not be used.
ru: Когда <varname>huge_pages</varname> имеет значение <literal>try</literal>, сервер попытается использовать огромные страницы, но может переключиться на обычные, если это не удастся. Со значением <literal>on</literal>, если использовать огромные страницы не получится, сервер не будет запущен. Со значением <literal>off</literal> огромные страницы использоваться не будут.

source: <primary><varname>temp_buffers</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>temp_buffers</varname></primary>

source: Sets the maximum number of temporary buffers used by each database session. These are session-local buffers used only for access to temporary tables. The default is eight megabytes (<literal>8MB</literal>). The setting can be changed within individual sessions, but only before the first use of temporary tables within the session; subsequent attempts to change the value will have no effect on that session.
ru: Задаёт максимальное число временных буферов для каждого сеанса, По умолчанию объём временных буферов составляет восемь мегабайт (1024 буфера). Этот параметр можно изменить в отдельном сеансе, но только до первого обращения к временным таблицам; после этого изменить его значение для текущего сеанса не удастся.

source: A session will allocate temporary buffers as needed up to the limit given by <varname>temp_buffers</varname>. The cost of setting a large value in sessions that do not actually need many temporary buffers is only a buffer descriptor, or about 64 bytes, per increment in <varname>temp_buffers</varname>. However if a buffer is actually used an additional 8192 bytes will be consumed for it (or in general, <symbol>BLCKSZ</symbol> bytes).
ru: Сеанс выделяет временные буферы по мере необходимости до достижения предела, заданного параметром <varname>temp_buffers</varname>. Если сеанс не задействует временные буферы, то для него хранятся только дескрипторы буферов, которые занимает около 64 байтов (в количестве <varname>temp_buffers</varname>). Однако если буфер действительно используется, он будет дополнительно занимать 8192 байта (или в общем случае, <symbol>BLCKSZ</symbol> байтов).

source: <primary><varname>max_prepared_transactions</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_prepared_transactions</varname></primary>

source: Sets the maximum number of transactions that can be in the <quote>prepared</quote> state simultaneously (see <xref linkend="sql-prepare-transaction"/>). Setting this parameter to zero (which is the default) disables the prepared-transaction feature. This parameter can only be set at server start.
ru: Задаёт максимальное число транзакций, которые могут одновременно находиться в <quote>подготовленном</quote> состоянии (см. <xref remap="4" linkend="sql-prepare-transaction"/>). При нулевом значении (по умолчанию) механизм подготовленных транзакций отключается. Задать этот параметр можно только при запуске сервера.

source: If you are not planning to use prepared transactions, this parameter should be set to zero to prevent accidental creation of prepared transactions. If you are using prepared transactions, you will probably want <varname>max_prepared_transactions</varname> to be at least as large as <xref linkend="guc-max-connections"/>, so that every session can have a prepared transaction pending.
ru: Если использовать транзакции не планируется, этот параметр следует обнулить, чтобы не допустить непреднамеренного создания подготовленных транзакций. Если же подготовленные транзакции применяются, то <varname>max_prepared_transactions</varname>, вероятно, должен быть не меньше, чем <xref linkend="guc-max-connections"/>, чтобы подготовить транзакцию можно было в каждом сеансе.

source: <primary><varname>work_mem</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>work_mem</varname></primary>

source: Specifies the amount of memory to be used by internal sort operations and hash tables before writing to temporary disk files. The value defaults to four megabytes (<literal>4MB</literal>). Note that for a complex query, several sort or hash operations might be running in parallel; each operation will be allowed to use as much memory as this value specifies before it starts to write data into temporary files. Also, several running sessions could be doing such operations concurrently. Therefore, the total memory used could be many times the value of <varname>work_mem</varname>; it is necessary to keep this fact in mind when choosing the value. Sort operations are used for <literal>ORDER BY</literal>, <literal>DISTINCT</literal>, and merge joins. Hash tables are used in hash joins, hash-based aggregation, and hash-based processing of <literal>IN</literal> subqueries.
ru: Задаёт объём памяти, который будет использоваться для внутренних операций сортировки и хеш-таблиц, прежде чем будут задействованы временные файлы на диске. Значение по умолчанию — четыре мегабайта (<literal>4MB</literal>). Заметьте, что в сложных запросах одновременно могут выполняться несколько операций сортировки или хеширования, так что этот объём памяти будет доступен для каждой операции. Кроме того, такие операции могут выполняться одновременно в разных сеансах. Таким образом, общий объём памяти может многократно превосходить значение <varname>work_mem</varname>; это следует учитывать, выбирая подходящее значение. Операции сортировки используются для <literal>ORDER BY</literal>, <literal>DISTINCT</literal> и соединений слиянием. Хеш-таблицы используются при соединениях и агрегировании по хешу, а также обработке подзапросов <literal>IN</literal> с применением хеша.

source: <primary><varname>maintenance_work_mem</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>maintenance_work_mem</varname></primary>

source: Specifies the maximum amount of memory to be used by maintenance operations, such as <command>VACUUM</command>, <command>CREATE INDEX</command>, and <command>ALTER TABLE ADD FOREIGN KEY</command>. It defaults to 64 megabytes (<literal>64MB</literal>). Since only one of these operations can be executed at a time by a database session, and an installation normally doesn't have many of them running concurrently, it's safe to set this value significantly larger than <varname>work_mem</varname>. Larger settings might improve performance for vacuuming and for restoring database dumps.
ru: Задаёт максимальный объём памяти для операций обслуживания БД, в частности <command>VACUUM</command>, <command>CREATE INDEX</command> и <command>ALTER TABLE ADD FOREIGN KEY</command>. По умолчанию его значение — 64 мегабайта (<literal>64MB</literal>). Так как в один момент времени в сеансе может выполняться только одна такая операция, и обычно они не запускаются параллельно, это значение вполне может быть гораздо больше <varname>work_mem</varname>. Увеличение этого значения может привести к ускорению операций очистки и восстановления БД из копии.

source: Note that when autovacuum runs, up to <xref linkend="guc-autovacuum-max-workers"/> times this memory may be allocated, so be careful not to set the default value too high. It may be useful to control for this by separately setting <xref linkend="guc-autovacuum-work-mem"/>.
ru: Учтите, что когда выполняется автоочистка, этот объём может быть выделен <xref linkend="guc-autovacuum-max-workers"/> раз, поэтому не стоит устанавливать значение по умолчанию слишком большим. Возможно, будет лучше управлять объёмом памяти для автоочистки отдельно, изменяя <xref linkend="guc-autovacuum-work-mem"/>.

source: <primary><varname>replacement_sort_tuples</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>replacement_sort_tuples</varname></primary>

source: When the number of tuples to be sorted is smaller than this number, a sort will produce its first output run using replacement selection rather than quicksort. This may be useful in memory-constrained environments where tuples that are input into larger sort operations have a strong physical-to-logical correlation. Note that this does not include input tuples with an <emphasis>inverse</emphasis> correlation. It is possible for the replacement selection algorithm to generate one long run that requires no merging, where use of the default strategy would result in many runs that must be merged to produce a final sorted output. This may allow sort operations to complete sooner.
ru: Когда количество сортируемых кортежей меньше заданного числа, для получения первого потока сортируемых данных будет применяться не алгоритм quicksort, а выбор с замещением. Это может быть полезно в системах с ограниченным объёмом памяти, когда кортежи, поступающие на вход большой операции сортировки, характеризуются хорошей корреляцией физического и логического порядка. Заметьте, что это не относится к кортежам с <emphasis>обратной</emphasis> корреляцией. Вполне возможно, что алгоритм выбора с замещением сформирует один длинный поток и слияние не потребуется, тогда как со стратегией по умолчанию может быть получено много потоков, которые затем потребуется слить для получения окончательного отсортированного результата. Это позволяет ускорить операции сортировки.

source: The default is 150,000 tuples. Note that higher values are typically not much more effective, and may be counter-productive, since the priority queue is sensitive to the size of available CPU cache, whereas the default strategy sorts runs using a <firstterm>cache oblivious</firstterm> algorithm. This property allows the default sort strategy to automatically and transparently make effective use of available CPU cache.
ru: Значение по умолчанию — 150000 кортежей. Заметьте, что увеличивать это значение обычно не очень полезно, и может быть даже контрпродуктивно, так как эффективность приоритетной очереди зависит от доступного объёма кеша процессора, тогда как со стандартной стратегией потоки сортируются <firstterm>кеш-независимым</firstterm> алгоритмом. Благодаря этому, стандартная стратегия позволяет автоматически и прозрачно использовать доступный кеш процессора более эффективным образом.

source: Setting <varname>maintenance_work_mem</varname> to its default value usually prevents utility command external sorts (e.g., sorts used by <command>CREATE INDEX</command> to build B-Tree indexes) from ever using replacement selection sort, unless the input tuples are quite wide.
ru: Если в <varname>maintenance_work_mem</varname> задано значение по умолчанию, внешние сортировки в служебных командах (например, сортировки, выполняемые командами <command>CREATE INDEX</command> для построения-индекса B-дерева) обычно никогда не используют алгоритм выбора с замещением (так как все кортежи помещаются в память), кроме случаев, когда входные кортежи достаточно велики.

source: <primary><varname>autovacuum_work_mem</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>autovacuum_work_mem</varname></primary>

source: Specifies the maximum amount of memory to be used by each autovacuum worker process. It defaults to -1, indicating that the value of <xref linkend="guc-maintenance-work-mem"/> should be used instead. The setting has no effect on the behavior of <command>VACUUM</command> when run in other contexts.
ru: Задаёт максимальный объём памяти, который будет использовать каждый рабочий процесс автоочистки. По умолчанию равен -1, что означает, что этот объём определяется значением <xref linkend="guc-maintenance-work-mem"/>. Этот параметр не влияет на поведение команды <command>VACUUM</command>, выполняемой в других контекстах.

source: <primary><varname>max_stack_depth</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_stack_depth</varname></primary>

source: Specifies the maximum safe depth of the server's execution stack. The ideal setting for this parameter is the actual stack size limit enforced by the kernel (as set by <literal>ulimit -s</literal> or local equivalent), less a safety margin of a megabyte or so. The safety margin is needed because the stack depth is not checked in every routine in the server, but only in key potentially-recursive routines such as expression evaluation. The default setting is two megabytes (<literal>2MB</literal>), which is conservatively small and unlikely to risk crashes. However, it might be too small to allow execution of complex functions. Only superusers can change this setting.
ru: Задаёт максимальную безопасную глубину стека для исполнителя. В идеале это значение должно равняться предельному размеру стека, ограниченному ядром (как устанавливает команда <literal>ulimit -s</literal> или равнозначные ей), за вычетом запаса примерно в мегабайт. Этот запас необходим, потому что сервер проверяет глубину стека не в каждой процедуре, а только в потенциально рекурсивных процедурах, например, при вычислении выражений. Значение по умолчанию — два мегабайта (<literal>2MB</literal>), выбрано с большим запасом, так что риск переполнения стека минимален. Однако, с другой стороны, его может быть недостаточно для выполнения сложных функций. Изменить этот параметр могут только суперпользователи.

source: Setting <varname>max_stack_depth</varname> higher than the actual kernel limit will mean that a runaway recursive function can crash an individual backend process. On platforms where <productname>PostgreSQL</productname> can determine the kernel limit, the server will not allow this variable to be set to an unsafe value. However, not all platforms provide the information, so caution is recommended in selecting a value.
ru: Если <varname>max_stack_depth</varname> будет превышать фактический предел ядра, то функция с неограниченной рекурсией сможет вызвать крах отдельного процесса сервера. В системах, где <productname>PostgreSQL</productname> может определить предел, установленный ядром, он не позволит установить для этого параметра небезопасное значение. Однако эту информацию выдают не все системы, поэтому выбирать это значение следует с осторожностью.

source: <primary><varname>dynamic_shared_memory_type</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>dynamic_shared_memory_type</varname></primary>

source: Specifies the dynamic shared memory implementation that the server should use. Possible values are <literal>posix</literal> (for POSIX shared memory allocated using <literal>shm_open</literal>), <literal>sysv</literal> (for System V shared memory allocated via <literal>shmget</literal>), <literal>windows</literal> (for Windows shared memory), <literal>mmap</literal> (to simulate shared memory using memory-mapped files stored in the data directory), and <literal>none</literal> (to disable this feature). Not all values are supported on all platforms; the first supported option is the default for that platform. The use of the <literal>mmap</literal> option, which is not the default on any platform, is generally discouraged because the operating system may write modified pages back to disk repeatedly, increasing system I/O load; however, it may be useful for debugging, when the <literal>pg_dynshmem</literal> directory is stored on a RAM disk, or when other shared memory facilities are not available.
ru: Выбирает механизм динамической разделяемой памяти, который будет использовать сервер. Допустимые варианты: <literal>posix</literal> (для выделения разделяемой памяти POSIX функцией <literal>shm_open</literal>), <literal>sysv</literal> (для выделения разделяемой памяти System V функцией <literal>shmget</literal>), <literal>windows</literal> (для выделения разделяемой памяти в Windows), <literal>mmap</literal> (для эмуляции разделяемой памяти через отображение в память файлов, хранящихся в каталоге данных) и <literal>none</literal> (для отключения этой функциональности). Не все варианты поддерживаются на разных платформах; первый из поддерживаемых данной платформой вариантов становится для неё вариантом по умолчанию. Применять <literal>mmap</literal>, который нигде не выбирается по умолчанию, вообще не рекомендуется, так как операционная система может периодически записывать на диск изменённые страницы, что создаст дополнительную нагрузку; однако, это может быть полезно для отладки, когда каталог <literal>pg_dynshmem</literal> находится в RAM-диске или когда другие механизмы разделяемой памяти недоступны.

source: Disk
ru: Диск

source: <primary><varname>temp_file_limit</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>temp_file_limit</varname></primary>
