Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: This is a <function>printf</function>-style string that is output at the beginning of each log line. <literal>%</literal> characters begin <quote>escape sequences</quote> that are replaced with status information as outlined below. Unrecognized escapes are ignored. Other characters are copied straight to the log line. Some escapes are only recognized by session processes, and will be treated as empty by background processes such as the main server process. Status information may be aligned either left or right by specifying a numeric literal after the % and before the option. A negative value will cause the status information to be padded on the right with spaces to give it a minimum width, whereas a positive value will pad on the left. Padding can be useful to aid human readability in log files. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line. The default is an empty string. <placeholder-1/> The <literal>%c</literal> escape prints a quasi-unique session identifier, consisting of two 4-byte hexadecimal numbers (without leading zeros) separated by a dot. The numbers are the process start time and the process ID, so <literal>%c</literal> can also be used as a space saving way of printing those items. For example, to generate the session identifier from <literal>pg_stat_activity</literal>, use this query: <placeholder-2/>
ru: Строка, в стиле функции <function>printf</function>, которая выводится в начале каждой строки журнала сообщений. С символов <literal>%</literal> начинаются управляющие последовательности, которые заменяются статусной информацией, описанной ниже. Неизвестные управляющие последовательности игнорируются. Все остальные символы напрямую копируются в журнальную строку. Некоторые управляющие последовательности используются только для пользовательских процессов и будут игнорироваться фоновыми процессами, например основным процессом сервера. Подставляемая информация может быть выровнена по ширине влево или вправо указанием числа после % и перед кодом последовательности. Отрицательное число дополняет значение пробелами справа, а положительное число дополняет пробелами слева. Выравнивание можно использовать для улучшения читаемости. Параметр можно задать только в конфигурационных файлах или в командной строке при запуске сервера. По умолчанию используется пустая строка. <placeholder-1/> <literal>%c</literal> выводит псевдоуникальный номер сессии, состоящий из двух 4-х битных шестнадцатеричных чисел (без лидирующих нулей), разделённых точкой. Эти числа представляют собой время старта процесса и идентификатор процесса, поэтому <literal>%c</literal> можно использовать для экономии места при записи этих значений. Например, для получения идентификатора сессии из <literal>pg_stat_activity</literal>, используйте запрос: <placeholder-2/>

source: If you set a nonempty value for <varname>log_line_prefix</varname>, you should usually make its last character be a space, to provide visual separation from the rest of the log line. A punctuation character can be used too.
ru: Последним символом в <varname>log_line_prefix</varname> лучше оставлять пробел, чтобы отделить от остальной строки. Можно использовать и символы пунктуации.

source: <application>Syslog</application> produces its own time stamp and process ID information, so you probably do not want to include those escapes if you are logging to <application>syslog</application>.
ru: <application>Syslog</application> также формирует штамп времени и идентификатор процесса, поэтому вероятно нет смысла использовать соответствующие управляющие последовательности при использовании <application>syslog</application>.

source: <primary><varname>log_lock_waits</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_lock_waits</varname></primary>

source: Controls whether a log message is produced when a session waits longer than <xref linkend="guc-deadlock-timeout"/> to acquire a lock. This is useful in determining if lock waits are causing poor performance. The default is <literal>off</literal>. Only superusers can change this setting.
ru: Определяет, нужно ли фиксировать в журнале события, когда сеанс ожидает получения блокировки дольше, чем указано в <xref linkend="guc-deadlock-timeout"/>. Это позволяет выяснить, не связана ли низкая производительность с ожиданием блокировок. По умолчанию отключено. Только суперпользователи могут изменить этот параметр.

source: <primary><varname>log_statement</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_statement</varname></primary>

source: Controls which SQL statements are logged. Valid values are <literal>none</literal> (off), <literal>ddl</literal>, <literal>mod</literal>, and <literal>all</literal> (all statements). <literal>ddl</literal> logs all data definition statements, such as <command>CREATE</command>, <command>ALTER</command>, and <command>DROP</command> statements. <literal>mod</literal> logs all <literal>ddl</literal> statements, plus data-modifying statements such as <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>, <command>TRUNCATE</command>, and <command>COPY FROM</command>. <command>PREPARE</command>, <command>EXECUTE</command>, and <command>EXPLAIN ANALYZE</command> statements are also logged if their contained command is of an appropriate type. For clients using extended query protocol, logging occurs when an Execute message is received, and values of the Bind parameters are included (with any embedded single-quote marks doubled).
ru: Управляет тем, какие SQL-команды записывать в журнал. Допустимые значения: <literal>none</literal> (отключено), <literal>ddl</literal>, <literal>mod</literal> и <literal>all</literal> (все команды). <literal>ddl</literal> записывает все команды определения данных, такие как <command>CREATE</command>, <command>ALTER</command>, <command>DROP</command>. <literal>mod</literal> записывает все команды <literal>ddl</literal>, а также команды изменяющие данные, такие как <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>, <command>TRUNCATE</command> и <command>COPY FROM</command>. <command>PREPARE</command>, <command>EXECUTE</command> и <command>EXPLAIN ANALYZE</command> также записываются, если вызваны для команды соответствующего типа. Если клиент использует расширенный протокол запросов, то запись происходит на фазе выполнения и содержит значения всех связанных переменных (если есть символы одиночных кавычек, то они удваиваются).

source: The default is <literal>none</literal>. Only superusers can change this setting.
ru: По умолчанию <literal>none</literal>. Только суперпользователи могут изменить этот параметр.

source: Statements that contain simple syntax errors are not logged even by the <varname>log_statement</varname> = <literal>all</literal> setting, because the log message is emitted only after basic parsing has been done to determine the statement type. In the case of extended query protocol, this setting likewise does not log statements that fail before the Execute phase (i.e., during parse analysis or planning). Set <varname>log_min_error_statement</varname> to <literal>ERROR</literal> (or lower) to log such statements.
ru: Команды с синтаксическими ошибками не записываются, даже если <varname>log_statement</varname> = <literal>all</literal>, так как сообщение формируется только после выполнения предварительного разбора, определяющего тип команды. При расширенном протоколе запросов, похожим образом не будут записываться команды, неуспешно завершившиеся до фазы выполнения (например, при разборе или построении плана запроса). Для включения в журнал таких команд установите <varname>log_min_error_statement</varname> в <literal>ERROR</literal> (или ниже).

source: <primary><varname>log_replication_commands</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_replication_commands</varname></primary>

source: Causes each replication command to be logged in the server log. See <xref linkend="protocol-replication"/> for more information about replication command. The default value is <literal>off</literal>. Only superusers can change this setting.
ru: Включает запись в журнал сервера всех команд репликации. Подробнее о командах репликации можно узнать в <xref remap="6" linkend="protocol-replication"/>. Значение по умолчанию — <literal>off</literal>. Изменить этот параметр могут только суперпользователи.

source: <primary><varname>log_temp_files</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_temp_files</varname></primary>

source: Controls logging of temporary file names and sizes. Temporary files can be created for sorts, hashes, and temporary query results. A log entry is made for each temporary file when it is deleted. A value of zero logs all temporary file information, while positive values log only files whose size is greater than or equal to the specified number of kilobytes. The default setting is -1, which disables such logging. Only superusers can change this setting.
ru: Управляет включением в журнал информации об именах и размерах временных файлов. Временные файлы могут использоваться для сортировок, хеширования и временного хранения результатов запросов. На каждый временный файл, при его удалении, в журнал записывается отдельное сообщение. Значение 0 говорит о том, что нужно записывать информацию о всех временных файлах. Положительное значение задаёт размер временных файлов в килобайтах, при достижении или превышении которого, информация о временном файле будет записана. Значение по умолчанию -1, что отключает запись информации о временных файлах. Только суперпользователи могут изменить этот параметр.

source: <primary><varname>log_timezone</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_timezone</varname></primary>

source: Sets the time zone used for timestamps written in the server log. Unlike <xref linkend="guc-timezone"/>, this value is cluster-wide, so that all sessions will report timestamps consistently. The built-in default is <literal>GMT</literal>, but that is typically overridden in <filename>postgresql.conf</filename>; <application>initdb</application> will install a setting there corresponding to its system environment. See <xref linkend="datatype-timezones"/> for more information. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Устанавливает часовой пояс для штампов времени при записи в журнал сервера. В отличие от <xref linkend="guc-timezone"/>, это значение одинаково для всех баз данных кластера, поэтому для всех сессий используются согласованные значения штампов времени. Встроенное значение по умолчанию <literal>GMT</literal>, но оно переопределяется в <filename>postgresql.conf</filename>: <application>initdb</application> записывает в него значение, соответствующее системной среде. Подробнее об этом в <xref remap="6" linkend="datatype-timezones"/>. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: Using CSV-Format Log Output
ru: Использование вывода журнала в формате CSV

source: Including <literal>csvlog</literal> in the <varname>log_destination</varname> list provides a convenient way to import log files into a database table. This option emits log lines in comma-separated-values (<acronym>CSV</acronym>) format, with these columns: time stamp with milliseconds, user name, database name, process ID, client host:port number, session ID, per-session line number, command tag, session start time, virtual transaction ID, regular transaction ID, error severity, SQLSTATE code, error message, error message detail, hint, internal query that led to the error (if any), character count of the error position therein, error context, user query that led to the error (if any and enabled by <varname>log_min_error_statement</varname>), character count of the error position therein, location of the error in the PostgreSQL source code (if <varname>log_error_verbosity</varname> is set to <literal>verbose</literal>), and application name. Here is a sample table definition for storing CSV-format log output: <placeholder-1/>
ru: Добавление <literal>csvlog</literal> в <varname>log_destination</varname> делает удобным загрузку журнальных файлов в таблицу базы данных. Строки журнала представляют собой значения разделённые запятыми (CSV формат) со следующими полями: штамп времени с миллисекундами; имя пользователя; имя базы данных; идентификатор процесса; клиентский узел:номер порта; идентификатор сессии; номер строки каждой сессии; тег команды; время начала сессии; виртуальный идентификатор транзакции; идентификатор транзакции; уровень важности ошибки; код ошибки SQLSTATE; сообщение об ошибке; подробности к сообщению об ошибке; подсказка к сообщению об ошибке; внутренний запрос, приведший к ошибке (если есть); номер символа внутреннего запроса, где произошла ошибка; контекст ошибки; запрос пользователя, приведший к ошибке (если есть и включён <varname>log_min_error_statement</varname>); номер символа в запросе пользователя, где произошла ошибка; расположение ошибки в исходном коде PostgreSQL (если <varname>log_error_verbosity</varname> установлен в <literal>verbose</literal>) и имя приложения. Вот пример определения таблицы, для хранения журналов в формате CSV: <placeholder-1/>

source: To import a log file into this table, use the <command>COPY FROM</command> command: <placeholder-1/>
ru: Для загрузки журнального файла в такую таблицу можно использовать команду <command>COPY FROM</command>: <placeholder-1/>

source: Set <varname>log_filename</varname> and <varname>log_rotation_age</varname> to provide a consistent, predictable naming scheme for your log files. This lets you predict what the file name will be and know when an individual log file is complete and therefore ready to be imported.
ru: Установите для <varname>log_filename</varname> и <varname>log_rotation_age</varname> значения, гарантирующие согласованную и предсказуемую схему именования журнальных файлов. Зная, какие имена будут у журнальных файлов, можно определить, когда конкретный файл заполнен и готов к загрузке.

source: Set <varname>log_rotation_size</varname> to 0 to disable size-based log rotation, as it makes the log file name difficult to predict.
ru: Установите <varname>log_rotation_size</varname> в 0, чтобы запретить ротацию файлов по достижении определённого размера, так как это делает непредсказуемой схему именования журнальных файлов.

source: Set <varname>log_truncate_on_rotation</varname> to <literal>on</literal> so that old log data isn't mixed with the new in the same file.
ru: Установите <varname>log_truncate_on_rotation</varname> в <literal>on</literal>, чтобы новые сообщения не смешивались со старыми при переключении на существующий файл.

source: The table definition above includes a primary key specification. This is useful to protect against accidentally importing the same information twice. The <command>COPY</command> command commits all of the data it imports at one time, so any error will cause the entire import to fail. If you import a partial log file and later import the file again when it is complete, the primary key violation will cause the import to fail. Wait until the log is complete and closed before importing. This procedure will also protect against accidentally importing a partial line that hasn't been completely written, which would also cause <command>COPY</command> to fail.
ru: Определение таблицы содержит первичный ключ. Это полезно для предотвращения случайной повторной загрузки данных. Команда <command>COPY</command> фиксирует изменения один раз, поэтому любая ошибка приведёт к отмене всей загрузки. Если сначала загрузить неполный журнальный файл, то его повторная загрузка (по заполнении) приведёт к нарушению первичного ключа и, следовательно, к ошибке загрузки. Поэтому необходимо дожидаться окончания записи в журнальный файл перед началом загрузки. Похожим образом предотвращается случайная загрузка частично сформированной строки сообщения, что также приведёт к сбою в команде <command>COPY</command>.

source: There are a few things you need to do to simplify importing CSV log files: <placeholder-1/>
ru: Для упрощения загрузки журналов в CSV формате используйте следующее: <placeholder-1/>

source: Process Title
ru: Заголовок процесса

source: These settings control how process titles of server processes are modified. Process titles are typically viewed using programs like <application>ps</application> or, on Windows, <application>Process Explorer</application>. See <xref linkend="monitoring-ps"/> for details.
ru: Эти параметры влияют на то, как формируются заголовки серверных процессов. Заголовок процесса обычно можно наблюдать в программах типа <application>ps</application>, а в Windows — в <application>Process Explorer</application>. За подробностями обратитесь к <xref remap="3" linkend="monitoring-ps"/>.

source: <primary><varname>cluster_name</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>cluster_name</varname></primary>

source: Sets the cluster name that appears in the process title for all server processes in this cluster. The name can be any string of less than <symbol>NAMEDATALEN</symbol> characters (64 characters in a standard build). Only printable ASCII characters may be used in the <varname>cluster_name</varname> value. Other characters will be replaced with question marks (<literal>?</literal>). No name is shown if this parameter is set to the empty string <literal>''</literal> (which is the default). This parameter can only be set at server start.
ru: Задаёт имя кластера, которое отображается в заголовке процесса для всех серверных процессов данного кластера. Это имя может быть любой строкой не длиннее <symbol>NAMEDATALEN</symbol> символов (64 символа в стандартной сборке). В строке <varname>cluster_name</varname> могут использоваться только печатаемые ASCII-символы. Любой другой символ будет заменён символом вопроса (<literal>?</literal>). Если этот параметр содержит пустую строку <literal>''</literal> (это значение по умолчанию), никакое имя не выводится. Этот параметр можно задать только при запуске сервера.

source: <primary><varname>update_process_title</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>update_process_title</varname></primary>

source: Enables updating of the process title every time a new SQL command is received by the server. This setting defaults to <literal>on</literal> on most platforms, but it defaults to <literal>off</literal> on Windows due to that platform's larger overhead for updating the process title. Only superusers can change this setting.
ru: Включает изменение заголовка процесса при получении сервером каждой очередной команды SQL. На большинстве платформ он включён (имеет значение <literal>on</literal>), но в Windows по умолчанию выключен (<literal>off</literal>) ввиду больших издержек на изменение этого заголовка. Изменить этот параметр могут только суперпользователи.

source: Run-time Statistics
ru: Статистика времени выполнения

source: Query and Index Statistics Collector
ru: Сбор статистики по запросам и индексам

source: These parameters control server-wide statistics collection features. When statistics collection is enabled, the data that is produced can be accessed via the <structname>pg_stat</structname> and <structname>pg_statio</structname> family of system views. Refer to <xref linkend="monitoring"/> for more information.
ru: Эти параметры управляет функциями сбора статистики на уровне сервера. Когда ведётся сбор статистики, собираемые данные можно просмотреть в семействе системных представлений <structname>pg_stat</structname> и <structname>pg_statio</structname>. За дополнительными сведениями обратитесь к <xref remap="3" linkend="monitoring"/>.

source: <primary><varname>track_activities</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>track_activities</varname></primary>

source: Enables the collection of information on the currently executing command of each session, along with the time when that command began execution. This parameter is on by default. Note that even when enabled, this information is not visible to all users, only to superusers and the user owning the session being reported on, so it should not represent a security risk. Only superusers can change this setting.
ru: Включает сбор сведений о текущих командах, выполняющихся во всех сеансах (в частности, отслеживается время запуска команды). По умолчанию этот параметр включён. Заметьте, что даже когда сбор ведётся, собранная информация доступна не для всех пользователей, а только для суперпользователей и пользователя-владельца сеанса, в котором выполняется текущая команда. Поэтому это не должно повлечь риски, связанные с безопасностью. Изменить этот параметр могут только суперпользователи.

source: <primary><varname>track_activity_query_size</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>track_activity_query_size</varname></primary>

source: Specifies the number of bytes reserved to track the currently executing command for each active session, for the <structname>pg_stat_activity</structname>.<structfield>query</structfield> field. The default value is 1024. This parameter can only be set at server start.
ru: Задаёт число байт, которое будет зарезервировано для отслеживания выполняемой в данной момент команды в каждом активном сеансе, для поля <structname>pg_stat_activity</structname>.<structfield>query</structfield>. Значение по умолчанию — 1024. Задать этот параметр можно только при запуске сервера.

source: <primary><varname>track_counts</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>track_counts</varname></primary>

source: Enables collection of statistics on database activity. This parameter is on by default, because the autovacuum daemon needs the collected information. Only superusers can change this setting.
ru: Включает сбор статистики активности в базе данных. Этот параметр по умолчанию включён, так как собранная информация требуется демону автоочистки. Изменить этот параметр могут только суперпользователи.

source: <primary><varname>track_io_timing</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>track_io_timing</varname></primary>

source: Enables timing of database I/O calls. This parameter is off by default, because it will repeatedly query the operating system for the current time, which may cause significant overhead on some platforms. You can use the <xref linkend="pgtesttiming"/> tool to measure the overhead of timing on your system. I/O timing information is displayed in <xref linkend="pg-stat-database-view"/>, in the output of <xref linkend="sql-explain"/> when the <literal>BUFFERS</literal> option is used, and by <xref linkend="pgstatstatements"/>. Only superusers can change this setting.
ru: Включает замер времени операций ввода/вывода. Этот параметр по умолчанию отключён, так как для этого требуется постоянно запрашивать текущее время у операционной системы, что может значительно замедлить работу на некоторых платформах. Для оценивания издержек замера времени на вашей платформе можно воспользоваться утилитой <xref linkend="pgtesttiming"/>. Статистику ввода/вывода можно получить через представление <xref linkend="pg-stat-database-view"/>, в выводе <xref linkend="sql-explain"/> (когда используется параметр <literal>TIMING</literal>) и через представление <xref linkend="pgstatstatements"/>. Изменить этот параметр могут только суперпользователи.
