Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: Maximum time between automatic WAL checkpoints, in seconds. The valid range is between 30 seconds and one day. The default is five minutes (<literal>5min</literal>). Increasing this parameter can increase the amount of time needed for crash recovery. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Максимальное время между автоматическими контрольными точками в WAL (в секундах). Допускаются значения от 30 секунд до одного дня. Значение по умолчанию — пять минут (<literal>5min</literal>). Увеличение этого параметра может привести к увеличению времени, которое потребуется для восстановления после сбоя. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>checkpoint_completion_target</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>checkpoint_completion_target</varname></primary>

source: Specifies the target of checkpoint completion, as a fraction of total time between checkpoints. The default is 0.5. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Задаёт целевое время для завершения процедуры контрольной точки, как коэффициент для общего времени между контрольными точками. По умолчанию это значение равно 0.5. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>checkpoint_flush_after</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>checkpoint_flush_after</varname></primary>

source: Whenever more than <varname>checkpoint_flush_after</varname> bytes have been written while performing a checkpoint, attempt to force the OS to issue these writes to the underlying storage. Doing so will limit the amount of dirty data in the kernel's page cache, reducing the likelihood of stalls when an fsync is issued at the end of the checkpoint, or when the OS writes data back in larger batches in the background. Often that will result in greatly reduced transaction latency, but there also are some cases, especially with workloads that are bigger than <xref linkend="guc-shared-buffers"/>, but smaller than the OS's page cache, where performance might degrade. This setting may have no effect on some platforms. The valid range is between <literal>0</literal>, which disables forced writeback, and <literal>2MB</literal>. The default is <literal>256kB</literal> on Linux, <literal>0</literal> elsewhere. (If <symbol>BLCKSZ</symbol> is not 8kB, the default and maximum values scale proportionally to it.) This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Когда в процессе контрольной точки записывается больше чем <varname>checkpoint_flush_after</varname> байт, сервер даёт указание ОС произвести запись этих данных в нижележащее хранилище. Это ограничивает объём &laquo;грязных&raquo; данных в страничном кеше ядра и уменьшает вероятность затормаживания при выполнении fsync в конце этой контрольной точки или когда ОС сбрасывает данные на диск большими блоками в фоне. Часто это значительно уменьшает задержки транзакций, но бывают ситуации, особенно когда объём рабочей нагрузки больше <xref linkend="guc-shared-buffers"/>, но меньше страничного кеша ОС, когда производительность может упасть. Этот параметр действует не на всех платформах. Он может принимать значение от <literal>0</literal> (при этом управление отложенной записью отключается) до 2 Мбайт (<literal>2MB</literal>). Значение по умолчанию — <literal>256kB</literal> в Linux и <literal>0</literal> в других ОС. (Если <symbol>BLCKSZ</symbol> отличен от 8 Кбайт, значение по умолчанию и максимум корректируются пропорционально). Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>checkpoint_warning</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>checkpoint_warning</varname></primary>

source: Write a message to the server log if checkpoints caused by the filling of checkpoint segment files happen closer together than this many seconds (which suggests that <varname>max_wal_size</varname> ought to be raised). The default is 30 seconds (<literal>30s</literal>). Zero disables the warning. No warnings will be generated if <varname>checkpoint_timeout</varname> is less than <varname>checkpoint_warning</varname>. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Записывать в журнал сервера сообщение в случае, если контрольные точки, вызванные заполнением файлов сегментов, выполняются раньше, чем через заданное число секунд (что говорит о том, что значение <varname>max_wal_size</varname> нужно увеличить). Значение по умолчанию равно 30 секундам (<literal>30s</literal>). При нуле это предупреждение отключается. Если <varname>checkpoint_timeout</varname> меньше, чем <varname>checkpoint_warning</varname>, предупреждения так же не будут выводиться. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>max_wal_size</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_wal_size</varname></primary>

source: Maximum size to let the WAL grow to between automatic WAL checkpoints. This is a soft limit; WAL size can exceed <varname>max_wal_size</varname> under special circumstances, like under heavy load, a failing <varname>archive_command</varname>, or a high <varname>wal_keep_segments</varname> setting. The default is 1 GB. Increasing this parameter can increase the amount of time needed for crash recovery. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Максимальный размер, до которого может вырастать WAL между автоматическими контрольными точками в WAL. Это мягкий предел; размер WAL может превышать <varname>max_wal_size</varname> при особых обстоятельствах, например, при высокой нагрузке, сбое в <varname>archive_command</varname> или при большом значении <varname>wal_keep_segments</varname>. Значение по умолчанию — 1 ГБ. Увеличение этого параметра может привести к увеличению времени, которое потребуется для восстановления после сбоя. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>min_wal_size</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>min_wal_size</varname></primary>

source: As long as WAL disk usage stays below this setting, old WAL files are always recycled for future use at a checkpoint, rather than removed. This can be used to ensure that enough WAL space is reserved to handle spikes in WAL usage, for example when running large batch jobs. The default is 80 MB. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Пока WAL занимает на диске меньше этого объёма, старые файлы WAL в контрольных точках всегда перерабатываются, а не удаляются. Это позволяет зарезервировать достаточно места для WAL, чтобы справиться с резкими скачками использования WAL, например, при выполнении больших пакетных заданий. Значение по умолчанию — 80 МБ. Этот параметр можно установить только в <filename>postgresql.conf</filename> или в командной строке сервера.

source: Archiving
ru: Архивация

source: <primary><varname>archive_mode</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>archive_mode</varname></primary>

source: When <varname>archive_mode</varname> is enabled, completed WAL segments are sent to archive storage by setting <xref linkend="guc-archive-command"/>. In addition to <literal>off</literal>, to disable, there are two modes: <literal>on</literal>, and <literal>always</literal>. During normal operation, there is no difference between the two modes, but when set to <literal>always</literal> the WAL archiver is enabled also during archive recovery or standby mode. In <literal>always</literal> mode, all files restored from the archive or streamed with streaming replication will be archived (again). See <xref linkend="continuous-archiving-in-standby"/> for details.
ru: Когда параметр <varname>archive_mode</varname> включён, полные сегменты WAL передаются в хранилище архива командой <xref linkend="guc-archive-command"/>. Помимо значения <literal>off</literal> (выключающего архивацию) есть ещё два: <literal>on</literal> (вкл.) и <literal>always</literal> (всегда). В обычном состоянии эти два режима не различаются, но в режиме <literal>always</literal> архивация WAL активна и во время восстановления архива, и в резерве. В этом режиме все файлы, восстановленные из архива или полученные при потоковой репликации, будут архивироваться (снова). За подробностями обратитесь к <xref remap="3" linkend="continuous-archiving-in-standby"/>.

source: <varname>archive_mode</varname> and <varname>archive_command</varname> are separate variables so that <varname>archive_command</varname> can be changed without leaving archiving mode. This parameter can only be set at server start. <varname>archive_mode</varname> cannot be enabled when <varname>wal_level</varname> is set to <literal>minimal</literal>.
ru: Параметры <varname>archive_mode</varname> и <varname>archive_command</varname> разделены, чтобы команду архивации (<varname>archive_command</varname>) можно было изменять, не отключая режим архивации. Этот параметр можно задать только при запуске сервера. Режим архивации нельзя включить, когда установлен минимальный уровень WAL (<varname>wal_level</varname> имеет значение <literal>minimal</literal>).

source: <primary><varname>archive_command</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>archive_command</varname></primary>

source: The local shell command to execute to archive a completed WAL file segment. Any <literal>%p</literal> in the string is replaced by the path name of the file to archive, and any <literal>%f</literal> is replaced by only the file name. (The path name is relative to the working directory of the server, i.e., the cluster's data directory.) Use <literal>%%</literal> to embed an actual <literal>%</literal> character in the command. It is important for the command to return a zero exit status only if it succeeds. For more information see <xref linkend="backup-archiving-wal"/>.
ru: Команда локальной оболочки, которая будет выполняться для архивации завершённого сегмента WAL. Любое вхождение <literal>%p</literal> в этой строке заменяется путём архивируемого файла, а вхождение <literal>%f</literal> заменяется только его именем. (Путь задаётся относительно рабочего каталога сервера, то есть каталога данных кластера.) Чтобы вставить в команду символ <literal>%</literal>, его нужно записать как <literal>%%</literal>. Важно, чтобы команда возвращала нулевой код выхода, только если она завершается успешно. За дополнительной информацией обратитесь к <xref remap="3" linkend="backup-archiving-wal"/>.

source: This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line. It is ignored unless <varname>archive_mode</varname> was enabled at server start. If <varname>archive_command</varname> is an empty string (the default) while <varname>archive_mode</varname> is enabled, WAL archiving is temporarily disabled, but the server continues to accumulate WAL segment files in the expectation that a command will soon be provided. Setting <varname>archive_command</varname> to a command that does nothing but return true, e.g. <literal>/bin/true</literal> (<literal>REM</literal> on Windows), effectively disables archiving, but also breaks the chain of WAL files needed for archive recovery, so it should only be used in unusual circumstances.
ru: Этот параметр можно задать только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера. Если режим архивации (<varname>archive_mode</varname>) не был включён при запуске, этот параметр игнорируется. Если значение <varname>archive_command</varname> — пустая строка (по умолчанию), но <varname>archive_mode</varname> включён, архивация WAL временно отключается, но сервер продолжает накапливать файлы сегментов WAL в ожидании, что команда будет вскоре определена. Если в качестве <varname>archive_command</varname> задать команду, которая ничего не делает, но сообщает об успешном завершении, например <literal>/bin/true</literal> (или <literal>REM</literal> в Windows), архивация по сути отключается, но при этом нарушается цепочка файлов WAL, необходимых для восстановления архива, поэтому такой вариант следует использовать только в особых случаях.

source: <primary><varname>archive_timeout</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>archive_timeout</varname></primary>

source: The <xref linkend="guc-archive-command"/> is only invoked for completed WAL segments. Hence, if your server generates little WAL traffic (or has slack periods where it does so), there could be a long delay between the completion of a transaction and its safe recording in archive storage. To limit how old unarchived data can be, you can set <varname>archive_timeout</varname> to force the server to switch to a new WAL segment file periodically. When this parameter is greater than zero, the server will switch to a new segment file whenever this many seconds have elapsed since the last segment file switch, and there has been any database activity, including a single checkpoint. (Increasing <varname>checkpoint_timeout</varname> will reduce unnecessary checkpoints on an idle system.) Note that archived files that are closed early due to a forced switch are still the same length as completely full files. Therefore, it is unwise to use a very short <varname>archive_timeout</varname> &mdash; it will bloat your archive storage. <varname>archive_timeout</varname> settings of a minute or so are usually reasonable. You should consider using streaming replication, instead of archiving, if you want data to be copied off the master server more quickly than that. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Команда <xref linkend="guc-archive-command"/> вызывается только для завершённых сегментов WAL. Поэтому, если ваш сервер записывает мало данных WAL (или это наблюдается в некоторые периоды времени), от завершения транзакции до надёжного сохранения её в архивном хранилище может пройти довольно много времени. Для ограничения времени существования неархивированных данных можно установить значение <varname>archive_timeout</varname>, чтобы сервер периодически переключался на новый файл сегмента WAL. Когда этот параметр больше нуля, сервер будет переключаться на новый файл сегмента, если с момента последнего переключения на новый файл пройдёт заданное число секунд, и наблюдалась какая-то активность базы данных, даже если это была просто контрольная точка. (Для сокращения числа ненужных контрольных точек в простаивающей системе можно увеличить <varname>checkpoint_timeout</varname>.) Заметьте, что архивируемые файлы, закрываемые раньше из-за принудительного переключения, всё равно будут иметь тот же размер, что и полностью заполненные. Поэтому устанавливать для <varname>archive_timeout</varname> очень маленькое значение неразумно &mdash; это ведёт к замусориванию архивного хранилища. Обычно для <varname>archive_timeout</varname> имеет смысл задавать значение около минуты. Если вам нужно, чтобы данные копировались с главного сервера на резервный, вам следует подумать о переходе от архивации к потоковой репликации. Этот параметр можно задать только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: Replication
ru: Репликация

source: These settings control the behavior of the built-in <firstterm>streaming replication</firstterm> feature (see <xref linkend="streaming-replication"/>). Servers will be either a Master or a Standby server. Masters can send data, while Standby(s) are always receivers of replicated data. When cascading replication (see <xref linkend="cascading-replication"/>) is used, Standby server(s) can also be senders, as well as receivers. Parameters are mainly for Sending and Standby servers, though some parameters have meaning only on the Master server. Settings may vary across the cluster without problems if that is required.
ru: Эти параметры управляют поведением встроенного механизма <firstterm>потоковой репликации</firstterm> (см. <xref remap="4" linkend="streaming-replication"/>). Когда он применяется, один сервер является главным, а другие — резервными. Главный сервер всегда передаёт данные, а резервные всегда принимают данные репликации, но когда настроена каскадная репликация (см. <xref remap="4" linkend="cascading-replication"/>), резервные серверы также могут быть и передающими. Следующие параметры в основном относятся к передающим и резервным серверам, хотя некоторые параметры имеют смысл только для главного. Все эти параметры вполне могут быть разными в рамках одного кластера, если это требуется.

source: Sending Server(s)
ru: Передающие серверы

source: These parameters can be set on any server that is to send replication data to one or more standby servers. The master is always a sending server, so these parameters must always be set on the master. The role and meaning of these parameters does not change after a standby becomes the master.
ru: Эти параметры можно задать на любом сервере, который передаёт данные репликации одному или нескольким резервным. Главный сервер всегда является передающим, так что на нём они должны задаваться всегда. Роль и значение этих параметров не меняются после того, как резервный сервер становится главным.

source: <primary><varname>max_wal_senders</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_wal_senders</varname></primary>

source: Specifies the maximum number of concurrent connections from standby servers or streaming base backup clients (i.e., the maximum number of simultaneously running WAL sender processes). The default is zero, meaning replication is disabled. WAL sender processes count towards the total number of connections, so the parameter cannot be set higher than <xref linkend="guc-max-connections"/>. Abrupt streaming client disconnection might cause an orphaned connection slot until a timeout is reached, so this parameter should be set slightly higher than the maximum number of expected clients so disconnected clients can immediately reconnect. This parameter can only be set at server start. <varname>wal_level</varname> must be set to <literal>replica</literal> or higher to allow connections from standby servers.
ru: Задаёт максимально допустимое число одновременных подключений резервных серверов или клиентов потокового копирования (т. е. максимальное количество одновременно работающих процессов передачи WAL). По умолчанию это значение равно нулю, то есть репликация отключается. Передающие WAL процессы учитываются в общем числе соединений, так что этот параметр не может превышать <xref linkend="guc-max-connections"/>. В случае неожиданного отключения клиента потоковой передачи слот подключения может оставаться занятым до достижения тайм-аута, так что этот параметр должен быть немного больше максимального ожидаемого числа клиентов, чтобы отключившиеся клиенты могли переподключиться немедленно. Задать этот параметр можно только при запуске сервера. Чтобы к данному серверу могли подключаться резервные, уровень <varname>wal_level</varname> должен быть <literal>replica</literal> или выше.

source: <primary><varname>max_replication_slots</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_replication_slots</varname></primary>

source: Specifies the maximum number of replication slots (see <xref linkend="streaming-replication-slots"/>) that the server can support. The default is zero. This parameter can only be set at server start. <varname>wal_level</varname> must be set to <literal>replica</literal> or higher to allow replication slots to be used. Setting it to a lower value than the number of currently existing replication slots will prevent the server from starting.
ru: Задаёт максимальное число слотов репликации (см. <xref remap="4" linkend="streaming-replication-slots"/>), которое сможет поддерживать сервер. Значение по умолчанию — ноль. Этот параметр можно задать только при запуске сервера. Чтобы эти слоты репликации можно было использовать, уровень <varname>wal_level</varname> должен быть <literal>replica</literal> или выше. Если заданное значение данного параметра будет меньше, чем число уже существующих слотов репликации, сервер не запустится.

source: <primary><varname>wal_keep_segments</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_keep_segments</varname></primary>

source: Specifies the minimum number of past log file segments kept in the <filename>pg_xlog</filename> directory, in case a standby server needs to fetch them for streaming replication. Each segment is normally 16 megabytes. If a standby server connected to the sending server falls behind by more than <varname>wal_keep_segments</varname> segments, the sending server might remove a WAL segment still needed by the standby, in which case the replication connection will be terminated. Downstream connections will also eventually fail as a result. (However, the standby server can recover by fetching the segment from archive, if WAL archiving is in use.)
ru: Задаёт минимальное число файлов прошлых сегментов журнала, которые будут сохраняться в каталоге <filename>pg_xlog</filename>, чтобы резервный сервер мог выбрать их при потоковой репликации. Обычно сегмент имеет размер 16 мегабайт. Если резервный сервер, подключённый к передающему, отстаёт больше чем на <varname>wal_keep_segments</varname> сегментов, передающий удаляет сегменты WAL, всё ещё необходимые резервному, и в этом случае соединение репликации прерывается. В результате этого затем также будут прерваны зависимые соединения. (Однако резервный сервер сможет восстановиться, выбрав этот сегмент из архива, если осуществляется архивация WAL.)

source: This sets only the minimum number of segments retained in <filename>pg_xlog</filename>; the system might need to retain more segments for WAL archival or to recover from a checkpoint. If <varname>wal_keep_segments</varname> is zero (the default), the system doesn't keep any extra segments for standby purposes, so the number of old WAL segments available to standby servers is a function of the location of the previous checkpoint and status of WAL archiving. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Этот параметр задаёт только минимальное число сегментов, сохраняемое в каталоге <filename>pg_xlog</filename>; система может сохранить больше сегментов для архивации WAL или для восстановления с момента контрольной точки. Если <varname>wal_keep_segments</varname> равен нулю (это значение по умолчанию), система не сохраняет никакие дополнительные сегменты для резервных серверов, поэтому число старых сегментов WAL, доступных для резервных серверов, зависит от положения предыдущей контрольной точи и состояния архивации WAL. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.
