Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: <primary><varname>trace_sort</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>trace_sort</varname></primary>

source: If on, emit information about resource usage during sort operations. This parameter is only available if the <symbol>TRACE_SORT</symbol> macro was defined when <productname>PostgreSQL</productname> was compiled. (However, <symbol>TRACE_SORT</symbol> is currently defined by default.)
ru: Включает вывод информации об использовании ресурсов во время операций сортировки. Этот параметр доступен, только если при сборке <productname>PostgreSQL</productname> был определён макрос <symbol>TRACE_SORT</symbol>. (По умолчанию макрос <symbol>TRACE_SORT</symbol> определён.)

source: <primary><varname>trace_locks</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>trace_locks</varname></primary>

source: If on, emit information about lock usage. Information dumped includes the type of lock operation, the type of lock and the unique identifier of the object being locked or unlocked. Also included are bit masks for the lock types already granted on this object as well as for the lock types awaited on this object. For each lock type a count of the number of granted locks and waiting locks is also dumped as well as the totals. An example of the log file output is shown here: <screen> LOG: LockAcquire: new: lock(0xb7acd844) id(24688,24696,0,0,0,1) grantMask(0) req(0,0,0,0,0,0,0)=0 grant(0,0,0,0,0,0,0)=0 wait(0) type(AccessShareLock) LOG: GrantLock: lock(0xb7acd844) id(24688,24696,0,0,0,1) grantMask(2) req(1,0,0,0,0,0,0)=1 grant(1,0,0,0,0,0,0)=1 wait(0) type(AccessShareLock) LOG: UnGrantLock: updated: lock(0xb7acd844) id(24688,24696,0,0,0,1) grantMask(0) req(0,0,0,0,0,0,0)=0 grant(0,0,0,0,0,0,0)=0 wait(0) type(AccessShareLock) LOG: CleanUpLock: deleting: lock(0xb7acd844) id(24688,24696,0,0,0,1) grantMask(0) req(0,0,0,0,0,0,0)=0 grant(0,0,0,0,0,0,0)=0 wait(0) type(INVALID) </screen> Details of the structure being dumped may be found in <filename>src/include/storage/lock.h</filename>.
ru: Включает вывод подробной информации о блокировках. Она содержит вид операции блокировки, тип блокировки и уникальный идентификатор объекта, который блокируется или разблокируется. Кроме того, в её составе выводятся битовые маски для типов блокировок, уже полученных для данного объекта, и для типов блокировок, ожидающих его освобождения. В дополнение к этому выводится количество полученных и ожидающих блокировок для каждого типа блокировок, а также их общее количество. Ниже показан пример вывода в журнал: <screen> LOG: LockAcquire: new: lock(0xb7acd844) id(24688,24696,0,0,0,1) grantMask(0) req(0,0,0,0,0,0,0)=0 grant(0,0,0,0,0,0,0)=0 wait(0) type(AccessShareLock) LOG: GrantLock: lock(0xb7acd844) id(24688,24696,0,0,0,1) grantMask(2) req(1,0,0,0,0,0,0)=1 grant(1,0,0,0,0,0,0)=1 wait(0) type(AccessShareLock) LOG: UnGrantLock: updated: lock(0xb7acd844) id(24688,24696,0,0,0,1) grantMask(0) req(0,0,0,0,0,0,0)=0 grant(0,0,0,0,0,0,0)=0 wait(0) type(AccessShareLock) LOG: CleanUpLock: deleting: lock(0xb7acd844) id(24688,24696,0,0,0,1) grantMask(0) req(0,0,0,0,0,0,0)=0 grant(0,0,0,0,0,0,0)=0 wait(0) type(INVALID) </screen> Подробнее о структуре выводимой информации можно узнать в <filename>src/include/storage/lock.h</filename>.

source: This parameter is only available if the <symbol>LOCK_DEBUG</symbol> macro was defined when <productname>PostgreSQL</productname> was compiled.
ru: Этот параметр доступен, только если при компиляции <productname>PostgreSQL</productname> был определён макрос <symbol>LOCK_DEBUG</symbol>.

source: <primary><varname>trace_lwlocks</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>trace_lwlocks</varname></primary>

source: If on, emit information about lightweight lock usage. Lightweight locks are intended primarily to provide mutual exclusion of access to shared-memory data structures.
ru: Включает вывод информации об использовании легковесных блокировок. Такие блокировки предназначены в основном для взаимоисключающего доступа к общим структурам данных в памяти.

source: <primary><varname>trace_userlocks</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>trace_userlocks</varname></primary>

source: If on, emit information about user lock usage. Output is the same as for <symbol>trace_locks</symbol>, only for advisory locks.
ru: Включает вывод информации об использовании пользовательских блокировок. Она выводится в том же формате, что и с <symbol>trace_locks</symbol>, но по рекомендательным блокировкам.

source: <primary><varname>trace_lock_oidmin</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>trace_lock_oidmin</varname></primary>

source: If set, do not trace locks for tables below this OID. (use to avoid output on system tables)
ru: Если этот параметр установлен, при трассировке блокировок не будут отслеживаться таблицы с OID меньше заданного (это используется для исключения из трассировки системных таблиц).

source: <primary><varname>trace_lock_table</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>trace_lock_table</varname></primary>

source: Unconditionally trace locks on this table (OID).
ru: Безусловно трассировать блокировки для таблицы с заданным OID.

source: <primary><varname>debug_deadlocks</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>debug_deadlocks</varname></primary>

source: If set, dumps information about all current locks when a deadlock timeout occurs.
ru: Включает вывод информации обо всех текущих блокировках при тайм-ауте взаимоблокировки.

source: <primary><varname>log_btree_build_stats</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_btree_build_stats</varname></primary>

source: If set, logs system resource usage statistics (memory and CPU) on various B-tree operations.
ru: Включает вывод статистики использования системных ресурсов (памяти и процессора) при различных операциях с B-деревом.

source: This parameter is only available if the <symbol>BTREE_BUILD_STATS</symbol> macro was defined when <productname>PostgreSQL</productname> was compiled.
ru: Этот параметр доступен, только если при компиляции <productname>PostgreSQL</productname> был определён макрос <symbol>BTREE_BUILD_STATS</symbol>.

source: <primary><varname>wal_debug</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_debug</varname></primary>

source: If on, emit WAL-related debugging output. This parameter is only available if the <symbol>WAL_DEBUG</symbol> macro was defined when <productname>PostgreSQL</productname> was compiled.
ru: Включает вывод отладочной информации, связанной с WAL. Этот параметр доступен, только если при компиляции <productname>PostgreSQL</productname> был определён макрос <symbol>WAL_DEBUG</symbol>.

source: <primary><varname>ignore_checksum_failure</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>ignore_checksum_failure</varname></primary>

source: Only has effect if <xref linkend="app-initdb-data-checksums"/> are enabled.
ru: Этот параметр действует, только если включён <xref linkend="app-initdb-data-checksums"/>.

source: Detection of a checksum failure during a read normally causes <productname>PostgreSQL</productname> to report an error, aborting the current transaction. Setting <varname>ignore_checksum_failure</varname> to on causes the system to ignore the failure (but still report a warning), and continue processing. This behavior may <emphasis>cause crashes, propagate or hide corruption, or other serious problems</emphasis>. However, it may allow you to get past the error and retrieve undamaged tuples that might still be present in the table if the block header is still sane. If the header is corrupt an error will be reported even if this option is enabled. The default setting is <literal>off</literal>, and it can only be changed by a superuser.
ru: При обнаружении ошибок контрольных сумм при чтении <productname>PostgreSQL</productname> обычно сообщает об ошибке и прерывает текущую транзакцию. Если параметр <varname>ignore_checksum_failure</varname> включён, система игнорирует проблему (но всё же предупреждает о ней) и продолжает обработку. Это поведение может <emphasis>привести к краху, распространению или сокрытию повреждения данных и другим серьёзными проблемам</emphasis>. Однако, включив его, вы можете обойти ошибку и получить неповреждённые данные, которые могут находиться в таблице, если цел заголовок блока. Если же повреждён заголовок, будет выдана ошибка, даже когда этот параметр включён. По умолчанию этот параметр отключён (имеет значение <literal>off</literal>) и изменить его состояние может только суперпользователь.

source: <primary><varname>zero_damaged_pages</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>zero_damaged_pages</varname></primary>

source: Detection of a damaged page header normally causes <productname>PostgreSQL</productname> to report an error, aborting the current transaction. Setting <varname>zero_damaged_pages</varname> to on causes the system to instead report a warning, zero out the damaged page in memory, and continue processing. This behavior <emphasis>will destroy data</emphasis>, namely all the rows on the damaged page. However, it does allow you to get past the error and retrieve rows from any undamaged pages that might be present in the table. It is useful for recovering data if corruption has occurred due to a hardware or software error. You should generally not set this on until you have given up hope of recovering data from the damaged pages of a table. Zeroed-out pages are not forced to disk so it is recommended to recreate the table or the index before turning this parameter off again. The default setting is <literal>off</literal>, and it can only be changed by a superuser.
ru: При выявлении повреждённого заголовка страницы <productname>PostgreSQL</productname> обычно сообщает об ошибке и прерывает текущую транзакцию. Если параметр <varname>zero_damaged_pages</varname> включён, вместо этого система выдаёт предупреждение, обнуляет повреждённую страницу в памяти и продолжает обработку. Это поведение <emphasis>разрушает данные</emphasis>, а именно все строки в повреждённой странице. Однако, включив его, вы можете обойти ошибку и получить строки из неповреждённых страниц, которые могут находиться в таблице. Это бывает полезно для восстановления данных, испорченных в результате аппаратной или программной ошибки. Обычно включать его следует только тогда, когда не осталось никакой другой надежды на восстановление данных в повреждённых страницах таблицы. Обнулённые страницы не сохраняются на диск, поэтому прежде чем выключать этот параметр, рекомендуется пересоздать проблемные таблицы или индексы. По умолчанию этот параметр отключён (имеет значение <literal>off</literal>) и изменить его состояние может только суперпользователь.

source: Short Options
ru: Краткие аргументы

source: For convenience there are also single letter command-line option switches available for some parameters. They are described in <xref linkend="runtime-config-short-table"/>. Some of these options exist for historical reasons, and their presence as a single-letter option does not necessarily indicate an endorsement to use the option heavily.
ru: Для удобства с некоторыми параметрами сопоставлены однобуквенные аргументы командной строки. Все они описаны в <xref remap="6" linkend="runtime-config-short-table"/>. Некоторые из этих сопоставлений существуют по историческим причинам, так что наличие однобуквенного синонима не обязательно является признаком того, что этот аргумент часто используется.

source: Short Option Key
ru: Ключ краткого аргумента

source: Short Option
ru: Краткий аргумент

source: Equivalent
ru: Эквивалент
