Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: <placeholder-1/> The <filename>postgresql.conf</filename> file can also contain <literal>include_dir</literal> directives, which specify an entire directory of configuration files to include. These look like <placeholder-2/> Non-absolute directory names are taken as relative to the directory containing the referencing configuration file. Within the specified directory, only non-directory files whose names end with the suffix <literal>.conf</literal> will be included. File names that start with the <literal>.</literal> character are also ignored, to prevent mistakes since such files are hidden on some platforms. Multiple files within an include directory are processed in file name order (according to C locale rules, i.e. numbers before letters, and uppercase letters before lowercase ones).
ru: <placeholder-1/> Файл <filename>postgresql.conf</filename> может также содержать директивы <literal>include_dir</literal>, позволяющие подключать целые каталоги с файлами конфигурации. Они записываются так: <placeholder-2/> Имена, заданные не абсолютным путём, рассматриваются относительно каталога, содержащего текущий файл конфигурации. В заданном каталоге включению подлежат только файлы с именами, оканчивающимися на <literal>.conf</literal>. При этом файлы с именами, начинающимися с &laquo;<literal>.</literal>&raquo;, тоже игнорируются, для предотвращения ошибок, так как они считаются скрытыми в ряде систем. Набор файлов во включаемом каталоге обрабатывается по порядку имён (определяемому правилами, принятыми в C, т. е. цифры идут перед буквами, а буквы в верхнем регистре — перед буквами в нижнем).

source: Include files or directories can be used to logically separate portions of the database configuration, rather than having a single large <filename>postgresql.conf</filename> file. Consider a company that has two database servers, each with a different amount of memory. There are likely elements of the configuration both will share, for things such as logging. But memory-related parameters on the server will vary between the two. And there might be server specific customizations, too. One way to manage this situation is to break the custom configuration changes for your site into three files. You could add this to the end of your <filename>postgresql.conf</filename> file to include them: <placeholder-1/> All systems would have the same <filename>shared.conf</filename>. Each server with a particular amount of memory could share the same <filename>memory.conf</filename>; you might have one for all servers with 8GB of RAM, another for those having 16GB. And finally <filename>server.conf</filename> could have truly server-specific configuration information in it.
ru: Включение файлов или каталогов позволяет разделить конфигурацию базы данных на логические части, а не вести один большой файл <filename>postgresql.conf</filename>. Например, представьте, что в некоторой компании есть два сервера баз данных, с разным объёмом ОЗУ. Скорее всего при этом их конфигурации будут иметь общие элементы, например, параметры ведения журналов. Но параметры, связанные с памятью, у них будут различаться. Кроме того, другие параметры могут быть специфическими для каждого сервера. Один из вариантов эффективного управления такими конфигурациями — разделить изменения стандартной конфигурации на три файла. Чтобы подключить эти файлы, можно добавить в конец файла <filename>postgresql.conf</filename> следующие директивы: <placeholder-1/> Общие для всех серверов параметры будут помещаться в <filename>shared.conf</filename>. Файл <filename>memory.conf</filename> может иметь два варианта — первый для серверов с 8ГБ ОЗУ, а второй для серверов с 16 ГБ. Наконец, <filename>server.conf</filename> может содержать действительно специфические параметры для каждого отдельного сервера.

source: Another possibility is to create a configuration file directory and put this information into files there. For example, a <filename>conf.d</filename> directory could be referenced at the end of <filename>postgresql.conf</filename>: <placeholder-1/> Then you could name the files in the <filename>conf.d</filename> directory like this: <placeholder-2/> This naming convention establishes a clear order in which these files will be loaded. This is important because only the last setting encountered for a particular parameter while the server is reading configuration files will be used. In this example, something set in <filename>conf.d/02server.conf</filename> would override a value set in <filename>conf.d/01memory.conf</filename>.
ru: Также возможно создать каталог с файлами конфигурации и поместить туда все эти файлы. Например, так можно подключить каталог <filename>conf.d</filename> в конце <filename>postgresql.conf</filename>: <placeholder-1/> Затем можно дать файлам в каталоге <filename>conf.d</filename> следующие имена: <placeholder-2/> Такое именование устанавливает чёткий порядок подключения этих файлов, что важно, так как если параметр определяется несколько раз в разных файлах конфигурации, действовать будет последнее определение. В рамках данного примера, установленное в <filename>conf.d/02server.conf</filename> значение переопределит значение того же параметра, заданное в <filename>conf.d/01memory.conf</filename>.

source: You might instead use this approach to naming the files descriptively: <placeholder-1/> This sort of arrangement gives a unique name for each configuration file variation. This can help eliminate ambiguity when several servers have their configurations all stored in one place, such as in a version control repository. (Storing database configuration files under version control is another good practice to consider.)
ru: Вы можете применить этот подход и с описательными именами файлов: <placeholder-1/> При таком упорядочивании каждому варианту файла конфигурации даётся уникальное имя. Это помогает исключить конфликты, если конфигурации разных серверов нужно хранить в одном месте, например, в репозитории системы управления версиями. (Кстати, хранение файлов конфигурации в системе управления версиями — это ещё один эффективный приём, который стоит применять.)

source: File Locations
ru: Расположения файлов

source: In addition to the <filename>postgresql.conf</filename> file already mentioned, <productname>PostgreSQL</productname> uses two other manually-edited configuration files, which control client authentication (their use is discussed in <xref linkend="client-authentication"/>). By default, all three configuration files are stored in the database cluster's data directory. The parameters described in this section allow the configuration files to be placed elsewhere. (Doing so can ease administration. In particular it is often easier to ensure that the configuration files are properly backed-up when they are kept separate.)
ru: В дополнение к вышеупомянутому <filename>postgresql.conf</filename>, <productname>PostgreSQL</productname> обрабатывает два редактируемых вручную файла конфигурации, в которых настраивается аутентификация клиентов (их использование рассматривается в <xref remap="6" linkend="client-authentication"/>). По умолчанию все три файла конфигурации размещаются в каталоге данных кластера БД. Параметры, описанные в этом разделе, позволяют разместить их и в любом другом месте. (Это позволяет упростить администрирование, в частности, выполнять резервное копирование этих файлов обычно проще, когда они хранятся отдельно.)

source: <primary><varname>data_directory</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>data_directory</varname></primary>

source: Specifies the directory to use for data storage. This parameter can only be set at server start.
ru: Задаёт каталог, в котором хранятся данные. Этот параметр можно задать только при запуске сервера.

source: <primary><varname>config_file</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>config_file</varname></primary>

source: Specifies the main server configuration file (customarily called <filename>postgresql.conf</filename>). This parameter can only be set on the <command>postgres</command> command line.
ru: Задаёт основной файл конфигурации сервера (его стандартное имя — <filename>postgresql.conf</filename>). Этот параметр можно задать только в командной строке <command>postgres</command>.

source: <primary><varname>hba_file</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>hba_file</varname></primary>

source: Specifies the configuration file for host-based authentication (customarily called <filename>pg_hba.conf</filename>). This parameter can only be set at server start.
ru: Задаёт файл конфигурации для аутентификации по сетевым узлам (его стандартное имя — <filename>pg_hba.conf</filename>). Этот параметр можно задать только при старте сервера.

source: <primary><varname>ident_file</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>ident_file</varname></primary>

source: Specifies the configuration file for user name mapping (customarily called <filename>pg_ident.conf</filename>). This parameter can only be set at server start. See also <xref linkend="auth-username-maps"/>.
ru: Задаёт файл конфигурации для сопоставлений имён пользователей (его стандартное имя — <filename>pg_ident.conf</filename>). Этот параметр можно задать только при запуске сервера. См. также <xref remap="4" linkend="auth-username-maps"/>.

source: <primary><varname>external_pid_file</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>external_pid_file</varname></primary>

source: Specifies the name of an additional process-ID (PID) file that the server should create for use by server administration programs. This parameter can only be set at server start.
ru: Задаёт имя дополнительного файла с идентификатором процесса (PID), который будет создавать сервер для использования программами администрирования. Этот параметр можно задать только при запуске сервера.

source: In a default installation, none of the above parameters are set explicitly. Instead, the data directory is specified by the <option>-D</option> command-line option or the <envar>PGDATA</envar> environment variable, and the configuration files are all found within the data directory.
ru: При стандартной установке ни один из этих параметров не задаётся явно. Вместо них задаётся только каталог данных, аргументом командной строки <option>-D</option> или переменной окружения <envar>PGDATA</envar>, и все необходимые файлы конфигурации загружаются из этого каталога.

source: If you wish to keep the configuration files elsewhere than the data directory, the <command>postgres</command> <option>-D</option> command-line option or <envar>PGDATA</envar> environment variable must point to the directory containing the configuration files, and the <varname>data_directory</varname> parameter must be set in <filename>postgresql.conf</filename> (or on the command line) to show where the data directory is actually located. Notice that <varname>data_directory</varname> overrides <option>-D</option> and <envar>PGDATA</envar> for the location of the data directory, but not for the location of the configuration files.
ru: Если вы хотите разместить файлы конфигурации не в каталоге данных, то аргумент командной строки <command>postgres</command> <option>-D</option> или переменная окружения <envar>PGDATA</envar> должны указывать на каталог, содержащий файлы конфигурации, а в <filename>postgresql.conf</filename> (или в командной строке) должен задаваться параметр <varname>data_directory</varname>, указывающий, где фактически находятся данные. Учтите, что <varname>data_directory</varname> переопределяет путь, задаваемый в <option>-D</option> или <envar>PGDATA</envar> как путь каталога данных, но не расположение файлов конфигурации.

source: If you wish, you can specify the configuration file names and locations individually using the parameters <varname>config_file</varname>, <varname>hba_file</varname> and/or <varname>ident_file</varname>. <varname>config_file</varname> can only be specified on the <command>postgres</command> command line, but the others can be set within the main configuration file. If all three parameters plus <varname>data_directory</varname> are explicitly set, then it is not necessary to specify <option>-D</option> or <envar>PGDATA</envar>.
ru: При желании вы можете задать имена и расположение файлов конфигурации по отдельности, воспользовавшись параметрами <varname>config_file</varname>, <varname>hba_file</varname> и/или <varname>ident_file</varname>. Параметр <varname>config_file</varname> можно задать только в командной строке <command>postgres</command>, тогда как остальные можно задать и в основном файле конфигурации. Если явно заданы все три эти параметра плюс <varname>data_directory</varname>, то задавать <option>-D</option> или <envar>PGDATA</envar> не нужно.

source: When setting any of these parameters, a relative path will be interpreted with respect to the directory in which <command>postgres</command> is started.
ru: Во всех этих параметрах относительный путь должен задаваться от каталога, в котором запускается <command>postgres</command>.

source: Connections and Authentication
ru: Подключения и аутентификация

source: Connection Settings
ru: Параметры подключений

source: <primary><varname>listen_addresses</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>listen_addresses</varname></primary>

source: Specifies the TCP/IP address(es) on which the server is to listen for connections from client applications. The value takes the form of a comma-separated list of host names and/or numeric IP addresses. The special entry <literal>*</literal> corresponds to all available IP interfaces. The entry <literal>0.0.0.0</literal> allows listening for all IPv4 addresses and <literal>::</literal> allows listening for all IPv6 addresses. If the list is empty, the server does not listen on any IP interface at all, in which case only Unix-domain sockets can be used to connect to it. The default value is <systemitem class="systemname">localhost</systemitem>, which allows only local TCP/IP <quote>loopback</quote> connections to be made. While client authentication (<xref linkend="client-authentication"/>) allows fine-grained control over who can access the server, <varname>listen_addresses</varname> controls which interfaces accept connection attempts, which can help prevent repeated malicious connection requests on insecure network interfaces. This parameter can only be set at server start.
ru: Задаёт адреса TCP/IP, по которым сервер будет принимать подключения клиентских приложений. Это значение принимает форму списка, разделённого запятыми, из имён и/или числовых IP-адресов компьютеров. Особый элемент, <literal>*</literal>, обозначает все имеющиеся IP-интерфейсы. Запись <literal>0.0.0.0</literal> позволяет задействовать все адреса IPv4, а <literal>::</literal> — все адреса IPv6. Если список пуст, сервер не будет привязываться ни к какому IP-интерфейсу, а значит, подключиться к нему можно будет только через доменные сокеты Unix. По умолчанию этот параметр содержит <systemitem class="systemname">localhost</systemitem>, что допускает подключение к серверу по TCP/IP только через локальный интерфейс <quote>замыкания</quote>. Хотя механизм аутентификации клиентов (см. <xref remap="4" linkend="client-authentication"/>) позволяет гибко управлять доступом пользователей к серверу, параметр <varname>listen_addresses</varname> может ограничить интерфейсы, через которые будут приниматься соединения, что бывает полезно для предотвращения злонамеренных попыток подключения через незащищённые сетевые интерфейсы. Этот параметр можно задать только при запуске сервера.

source: <primary><varname>port</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>port</varname></primary>

source: The TCP port the server listens on; 5432 by default. Note that the same port number is used for all IP addresses the server listens on. This parameter can only be set at server start.
ru: TCP-порт, открываемый сервером; по умолчанию, 5432. Заметьте, что этот порт используется для всех IP-адресов, через которые сервер принимает подключения. Этот параметр можно задать только при запуске сервера.

source: <primary><varname>max_connections</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_connections</varname></primary>

source: Determines the maximum number of concurrent connections to the database server. The default is typically 100 connections, but might be less if your kernel settings will not support it (as determined during <application>initdb</application>). This parameter can only be set at server start.
ru: Определяет максимальное число одновременных подключений к серверу БД. По умолчанию обычно это 100 подключений, но это число может быть меньше, если ядро накладывает свои ограничения (это определяется в процессе <application>initdb</application>). Этот параметр можно задать только при запуске сервера.

source: When running a standby server, you must set this parameter to the same or higher value than on the master server. Otherwise, queries will not be allowed in the standby server.
ru: Для сервера, работающего в режиме резерва, значение этого параметра должно быть больше или равно значению на главном. В противном случае на резервном сервере не будут разрешены запросы.

source: <primary><varname>superuser_reserved_connections</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>superuser_reserved_connections</varname></primary>

source: Determines the number of connection <quote>slots</quote> that are reserved for connections by <productname>PostgreSQL</productname> superusers. At most <xref linkend="guc-max-connections"/> connections can ever be active simultaneously. Whenever the number of active concurrent connections is at least <varname>max_connections</varname> minus <varname>superuser_reserved_connections</varname>, new connections will be accepted only for superusers, and no new replication connections will be accepted.
ru: Определяет количество <quote>слотов</quote> подключений, которые <productname>PostgreSQL</productname> будет резервировать для суперпользователей. При этом всего одновременно активными могут быть максимум <xref linkend="guc-max-connections"/> подключений. Когда число активных одновременных подключений больше или равно <varname>max_connections</varname> минус <varname>superuser_reserved_connections</varname>, принимаются только подключения суперпользователей, а все другие подключения, в том числе подключения для репликации, запрещаются.

source: The default value is three connections. The value must be less than the value of <varname>max_connections</varname>. This parameter can only be set at server start.
ru: По умолчанию резервируются три соединения. Это значение должно быть меньше значения <varname>max_connections</varname>. Задать этот параметр можно только при запуске сервера.

source: <primary><varname>unix_socket_directories</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>unix_socket_directories</varname></primary>

source: Specifies the directory of the Unix-domain socket(s) on which the server is to listen for connections from client applications. Multiple sockets can be created by listing multiple directories separated by commas. Whitespace between entries is ignored; surround a directory name with double quotes if you need to include whitespace or commas in the name. An empty value specifies not listening on any Unix-domain sockets, in which case only TCP/IP sockets can be used to connect to the server. The default value is normally <filename>/tmp</filename>, but that can be changed at build time. This parameter can only be set at server start.
ru: Задаёт каталог доменного сокета Unix, через который сервер будет принимать подключения клиентских приложений. Создать несколько сокетов можно, перечислив в этом значении несколько каталогов через запятую. Пробелы между элементами этого списка игнорируются; если в пути каталога содержатся пробелы, его нужно заключать в двойные кавычки. При пустом значении сервер не будет работать с доменными сокетами Unix, в этом случае к нему можно будет подключиться только по TCP/IP. Значение по умолчанию обычно <filename>/tmp</filename>, но его можно изменить во время сборки. Задать этот параметр можно только при запуске сервера.

source: In addition to the socket file itself, which is named <literal>.s.PGSQL.<replaceable>nnnn</replaceable></literal> where <replaceable>nnnn</replaceable> is the server's port number, an ordinary file named <literal>.s.PGSQL.<replaceable>nnnn</replaceable>.lock</literal> will be created in each of the <varname>unix_socket_directories</varname> directories. Neither file should ever be removed manually.
ru: Помимо самого файла сокета, который называется <literal>.s.PGSQL.<replaceable>nnnn</replaceable></literal> (где <replaceable>nnnn</replaceable> — номер порта сервера), в каждом каталоге <varname>unix_socket_directories</varname> создаётся обычный файл <literal>.s.PGSQL.<replaceable>nnnn</replaceable>.lock</literal>. Ни в коем случае не удаляйте эти файлы вручную.

source: This parameter is irrelevant on Windows, which does not have Unix-domain sockets.
ru: Этот параметр не действует в системе Windows, так как в ней нет доменных сокетов Unix.

source: <primary><varname>unix_socket_group</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>unix_socket_group</varname></primary>

source: Sets the owning group of the Unix-domain socket(s). (The owning user of the sockets is always the user that starts the server.) In combination with the parameter <varname>unix_socket_permissions</varname> this can be used as an additional access control mechanism for Unix-domain connections. By default this is the empty string, which uses the default group of the server user. This parameter can only be set at server start.
ru: Задаёт группу-владельца доменных сокетов Unix. (Пользователем-владельцем сокетов всегда будет пользователь, запускающий сервер.) В сочетании с <varname>unix_socket_permissions</varname> данный параметр можно использовать как дополнительный механизм управления доступом к доменным сокетам. По умолчанию он содержит пустую строку, то есть группой-владельцем становится основная группа пользователя, запускающего сервер. Задать этот параметр можно только при запуске сервера.

source: <primary><varname>unix_socket_permissions</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>unix_socket_permissions</varname></primary>

source: Sets the access permissions of the Unix-domain socket(s). Unix-domain sockets use the usual Unix file system permission set. The parameter value is expected to be a numeric mode specified in the format accepted by the <function>chmod</function> and <function>umask</function> system calls. (To use the customary octal format the number must start with a <literal>0</literal> (zero).)
ru: Задаёт права доступа к доменным сокетам Unix. Для доменных сокетов применяется обычный набор разрешений Unix. Значение параметра ожидается в числовом виде, который принимают функции <function>chmod</function> и <function>umask</function>. (Для применения обычного восьмеричного формата число должно начинаться с <literal>0</literal> (нуля).)
