Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: The shared lock table tracks locks on <varname>max_locks_per_transaction</varname> * (<xref linkend="guc-max-connections"/> + <xref linkend="guc-max-prepared-transactions"/>) objects (e.g., tables); hence, no more than this many distinct objects can be locked at any one time. This parameter controls the average number of object locks allocated for each transaction; individual transactions can lock more objects as long as the locks of all transactions fit in the lock table. This is <emphasis>not</emphasis> the number of rows that can be locked; that value is unlimited. The default, 64, has historically proven sufficient, but you might need to raise this value if you have queries that touch many different tables in a single transaction, e.g. query of a parent table with many children. This parameter can only be set at server start.
ru: Общая таблица блокировок отслеживает блокировки для <varname>max_locks_per_transaction</varname> * (<xref linkend="guc-max-connections"/> + <xref linkend="guc-max-prepared-transactions"/>) объектов (например, таблиц); таким образом, в любой момент времени может быть заблокировано не больше этого числа различных объектов. Этот параметр управляет средним числом блокировок объектов, выделяемым для каждой транзакции; отдельные транзакции могут заблокировать и больше объектов, если все они умещаются в таблице блокировок. Заметьте, что это <emphasis>не</emphasis> число строк, которое может быть заблокировано; их количество не ограничено. Значение по умолчанию, 64, как показала практика, вполне приемлемо, но может возникнуть потребность его увеличить, если запросы обращаются ко множеству различных таблиц в одной транзакции, как например, запрос к родительской таблице со многими потомками. Этот параметр можно задать только при запуске сервера.

source: <primary><varname>max_pred_locks_per_transaction</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_pred_locks_per_transaction</varname></primary>

source: The shared predicate lock table tracks locks on <varname>max_pred_locks_per_transaction</varname> * (<xref linkend="guc-max-connections"/> + <xref linkend="guc-max-prepared-transactions"/>) objects (e.g., tables); hence, no more than this many distinct objects can be locked at any one time. This parameter controls the average number of object locks allocated for each transaction; individual transactions can lock more objects as long as the locks of all transactions fit in the lock table. This is <emphasis>not</emphasis> the number of rows that can be locked; that value is unlimited. The default, 64, has generally been sufficient in testing, but you might need to raise this value if you have clients that touch many different tables in a single serializable transaction. This parameter can only be set at server start.
ru: Общая таблица предикатных блокировок отслеживает блокировки для <varname>max_pred_locks_per_transaction</varname> * (<xref linkend="guc-max-connections"/> + <xref linkend="guc-max-prepared-transactions"/>) объектов (например, таблиц); таким образом, в одним момент времени может быть заблокировано не больше этого число различных объектов. Этот параметр управляет средним числом блокировок объектов, выделяемым для каждой транзакции; отдельные транзакции могут заблокировать и больше объектов, если все они умещаются в таблице блокировок. Заметьте, что это <emphasis>не</emphasis> число строк, которое может быть заблокировано; их количество не ограничено. Значение по умолчанию, 64, как показала практика, вполне приемлемо, но может возникнуть потребность его увеличить, если запросы обращаются ко множеству различных таблиц в одной сериализуемой транзакции, как например, запрос к родительской таблице со многими потомками. Этот параметр можно задать только при запуске сервера.

source: Version and Platform Compatibility
ru: Совместимость с разными версиями и платформами

source: Previous PostgreSQL Versions
ru: Предыдущие версии PostgreSQL

source: <primary><varname>array_nulls</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>array_nulls</varname></primary>

source: This controls whether the array input parser recognizes unquoted <literal>NULL</literal> as specifying a null array element. By default, this is <literal>on</literal>, allowing array values containing null values to be entered. However, <productname>PostgreSQL</productname> versions before 8.2 did not support null values in arrays, and therefore would treat <literal>NULL</literal> as specifying a normal array element with the string value <quote>NULL</quote>. For backward compatibility with applications that require the old behavior, this variable can be turned <literal>off</literal>.
ru: Этот параметр определяет, будет ли при разборе вводимого массива распознаваться строка <literal>NULL</literal> без кавычек как элемент массива, равный NULL. Значение по умолчанию, <literal>on</literal>, позволяет задавать NULL в качестве элементов вводимого массива. Однако до версии 8.2 <productname>PostgreSQL</productname> не поддерживал ввод элементов NULL в массивах, а воспринимал <literal>NULL</literal> как обычный элемент массива со строковым значением <quote>NULL</quote>. Для обратной совместимости с приложениями, зависящими от старого поведения, эту переменную можно отключить (присвоив ей <literal>off</literal>).

source: Note that it is possible to create array values containing null values even when this variable is <literal>off</literal>.
ru: Заметьте, что массивы, содержащие NULL, можно создать, даже когда эта переменная имеет значение <literal>off</literal>.

source: <primary>strings</primary><secondary>backslash quotes</secondary>
ru: <primary>строки</primary> <secondary>апостроф с обратной косой</secondary>

source: <primary><varname>backslash_quote</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>backslash_quote</varname></primary>

source: This controls whether a quote mark can be represented by <literal>\'</literal> in a string literal. The preferred, SQL-standard way to represent a quote mark is by doubling it (<literal>''</literal>) but <productname>PostgreSQL</productname> has historically also accepted <literal>\'</literal>. However, use of <literal>\'</literal> creates security risks because in some client character set encodings, there are multibyte characters in which the last byte is numerically equivalent to ASCII <literal>\</literal>. If client-side code does escaping incorrectly then a SQL-injection attack is possible. This risk can be prevented by making the server reject queries in which a quote mark appears to be escaped by a backslash. The allowed values of <varname>backslash_quote</varname> are <literal>on</literal> (allow <literal>\'</literal> always), <literal>off</literal> (reject always), and <literal>safe_encoding</literal> (allow only if client encoding does not allow ASCII <literal>\</literal> within a multibyte character). <literal>safe_encoding</literal> is the default setting.
ru: Этот параметр определяет, можно ли будет представить знак апострофа в строковой константе в виде <literal>\'</literal>. В стандарте SQL определён другой, предпочитаемый вариант передачи апострофа, удвоением (<literal>''</literal>), но <productname>PostgreSQL</productname> исторически также принимал вариант <literal>\'</literal>. Однако применение варианта <literal>\'</literal> сопряжено с угрозами безопасности, так как в некоторых клиентских кодировках существуют многобайтные символы, последний байт которых численно равен ASCII-коду <literal>\</literal>. Если код на стороне клиента выполнит экранирование некорректно, это может открыть возможности для SQL-инъекции. Предотвратить этот риск можно, запретив серверу принимать запросы, в которых апостроф экранируется обратной косой. Допустимые значения параметра <varname>backslash_quote</varname>: <literal>on</literal> (принимать <literal>\'</literal> всегда), <literal>off</literal> (не принимать никогда) и <literal>safe_encoding</literal> (принимать, только если клиентская кодировка не допускает присутствия ASCII-кода <literal>\</literal> в многобайтных символах). Значение по умолчанию — <literal>safe_encoding</literal>.

source: Note that in a standard-conforming string literal, <literal>\</literal> just means <literal>\</literal> anyway. This parameter only affects the handling of non-standard-conforming literals, including escape string syntax (<literal>E'...'</literal>).
ru: Заметьте, что в строковой константе, записанной согласно стандарту, знаки <literal>\</literal> обозначают просто <literal>\</literal>. Этот параметр влияет только на восприятие строк, не соответствующих стандарту, в том числе с синтаксисом спецпоследовательностей (<literal>E'...'</literal>).

source: <primary><varname>default_with_oids</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>default_with_oids</varname></primary>

source: This controls whether <command>CREATE TABLE</command> and <command>CREATE TABLE AS</command> include an OID column in newly-created tables, if neither <literal>WITH OIDS</literal> nor <literal>WITHOUT OIDS</literal> is specified. It also determines whether OIDs will be included in tables created by <command>SELECT INTO</command>. The parameter is <literal>off</literal> by default; in <productname>PostgreSQL</productname> 8.0 and earlier, it was <literal>on</literal> by default.
ru: Этот параметр определяет, будут ли команды <command>CREATE TABLE</command> и <command>CREATE TABLE AS</command> без явных указаний <literal>WITH OIDS</literal> и <literal>WITHOUT OIDS</literal> добавлять столбец OID в создаваемые таблицы. Он также устанавливает, будут ли столбцы OID добавляться в таблицы, создаваемые командой <command>SELECT INTO</command>. По умолчанию значение этого параметра — <literal>off</literal> (столбцы OID не добавляются); в <productname>PostgreSQL</productname> версии 8.0 и ранее он был включён (<literal>on</literal>).

source: The use of OIDs in user tables is considered deprecated, so most installations should leave this variable disabled. Applications that require OIDs for a particular table should specify <literal>WITH OIDS</literal> when creating the table. This variable can be enabled for compatibility with old applications that do not follow this behavior.
ru: Практика использования OID в пользовательских таблицах считается устаревшей, так что в большинстве инсталляций не следует включать этот параметр. Приложения, которым требуется столбец OID в определённой таблице, могут явно указать <literal>WITH OIDS</literal> при создании таблицы. Этот параметр следует включать только для совместимости со старыми приложениями, которые не делают этого.

source: <primary>strings</primary><secondary>escape warning</secondary>
ru: <primary>строки</primary> <secondary>предупреждение о спецсимволах</secondary>

source: <primary><varname>escape_string_warning</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>escape_string_warning</varname></primary>

source: When on, a warning is issued if a backslash (<literal>\</literal>) appears in an ordinary string literal (<literal>'...'</literal> syntax) and <varname>standard_conforming_strings</varname> is off. The default is <literal>on</literal>.
ru: Когда этот параметр включён, сервер выдаёт предупреждение, если обратная косая черта (<literal>\</literal>) встречается в обычной строковой константе (с синтаксисом <literal>'...'</literal>) и параметр <varname>standard_conforming_strings</varname> отключён. Значение по умолчанию — <literal>on</literal> (вкл.).

source: Applications that wish to use backslash as escape should be modified to use escape string syntax (<literal>E'...'</literal>), because the default behavior of ordinary strings is now to treat backslash as an ordinary character, per SQL standard. This variable can be enabled to help locate code that needs to be changed.
ru: Приложения, которые предпочитают использовать обратную косую в виде спецсимвола, должны перейти к применению синтаксиса спецстрок (<literal>E'...'</literal>), так как по умолчанию теперь в обычных строках обратная косая воспринимается как обычный символ, в соответствии со стандартом SQL. Включение данного параметра помогает найти код, нуждающийся в модификации.

source: <primary><varname>lo_compat_privileges</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>lo_compat_privileges</varname></primary>

source: In <productname>PostgreSQL</productname> releases prior to 9.0, large objects did not have access privileges and were, therefore, always readable and writable by all users. Setting this variable to <literal>on</literal> disables the new privilege checks, for compatibility with prior releases. The default is <literal>off</literal>. Only superusers can change this setting.
ru: В <productname>PostgreSQL</productname> до версии 9.0 для больших объектов не назначались права доступа, и поэтому они были всегда доступны на чтение и запись для всех пользователей. Если установить для этого параметра значение <literal>on</literal>, существующие теперь проверки прав отключаются для совместимости с предыдущими версиями. Значение по умолчанию — <literal>off</literal>. Изменить этот параметр могут только суперпользователи.

source: Setting this variable does not disable all security checks related to large objects &mdash; only those for which the default behavior has changed in <productname>PostgreSQL</productname> 9.0. For example, <literal>lo_import()</literal> and <literal>lo_export()</literal> need superuser privileges regardless of this setting.
ru: Установка данного параметра не приводит к отключению всех проверок безопасности, связанных с большими объектами &mdash; затрагиваются только те проверки, которые изменились в <productname>PostgreSQL</productname> 9.0. Например, функции <literal>lo_import()</literal> и <literal>lo_export()</literal> будут требовать прав суперпользователя вне зависимости от данного значения.

source: <primary><varname>operator_precedence_warning</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>operator_precedence_warning</varname></primary>

source: When on, the parser will emit a warning for any construct that might have changed meanings since <productname>PostgreSQL</productname> 9.4 as a result of changes in operator precedence. This is useful for auditing applications to see if precedence changes have broken anything; but it is not meant to be kept turned on in production, since it will warn about some perfectly valid, standard-compliant SQL code. The default is <literal>off</literal>.
ru: Когда этот параметр включён, анализатор запроса будет выдавать предупреждение для всех конструкций, которые поменяли поведение после <productname>PostgreSQL</productname> 9.4 в результате изменения приоритетов операторов. Это полезно для аудита, так как позволяет понять, не сломалось ли что-то вследствие этого изменения. Но в производственной среде включать его не следует, так как предупреждения могут выдаваться и тогда, когда код абсолютно правильный и соответствует стандарту SQL. Значение по умолчанию — <literal>off</literal>.

source: See <xref linkend="sql-precedence"/> for more information.
ru: За подробностями обратитесь к <xref remap="3" linkend="sql-precedence"/>.

source: <primary><varname>quote_all_identifiers</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>quote_all_identifiers</varname></primary>

source: When the database generates SQL, force all identifiers to be quoted, even if they are not (currently) keywords. This will affect the output of <command>EXPLAIN</command> as well as the results of functions like <function>pg_get_viewdef</function>. See also the <option>--quote-all-identifiers</option> option of <xref linkend="app-pgdump"/> and <xref linkend="app-pg-dumpall"/>.
ru: Принудительно заключать в кавычки все идентификаторы, даже если это не ключевые слова (сегодня), при получении SQL из базы данных. Это касается вывода <command>EXPLAIN</command>, а также результатов функций типа <function>pg_get_viewdef</function>. См. также описание аргумента <option>--quote-all-identifiers</option> команд <xref linkend="app-pgdump"/> и <xref linkend="app-pg-dumpall"/>.

source: <primary><varname>sql_inheritance</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>sql_inheritance</varname></primary>

source: <primary>inheritance</primary>
ru: <primary>наследование</primary>

source: This setting controls whether undecorated table references are considered to include inheritance child tables. The default is <literal>on</literal>, which means child tables are included (thus, a <literal>*</literal> suffix is assumed by default). If turned <literal>off</literal>, child tables are not included (thus, an <literal>ONLY</literal> prefix is assumed). The SQL standard requires child tables to be included, so the <literal>off</literal> setting is not spec-compliant, but it is provided for compatibility with <productname>PostgreSQL</productname> releases prior to 7.1. See <xref linkend="ddl-inherit"/> for more information.
ru: Этот параметр определяет, будет ли использование таблиц без уточнений подразумевать включение дочерних таблиц в иерархии наследования. Значение по умолчанию — <literal>on</literal>, что означает, что дочерние таблицы включаются (то есть по умолчанию подразумевается суффикс <literal>*</literal>). При значении <literal>off</literal> дочерние таблицы не включаются (то есть подразумевается префикс <literal>ONLY</literal>). Стандарт SQL требует, чтобы дочерние таблицы включались, так что вариант <literal>off</literal> не соответствует стандарту, но предлагается для совместимости с <productname>PostgreSQL</productname> до версии 7.1. За дополнительными сведениями обратитесь к <xref remap="3" linkend="ddl-inherit"/>.

source: Turning <varname>sql_inheritance</varname> off is deprecated, because that behavior has been found to be error-prone as well as contrary to SQL standard. Discussions of inheritance behavior elsewhere in this manual generally assume that it is <literal>on</literal>.
ru: Поведение с выключенным <varname>sql_inheritance</varname> считается устаревшим, так как оно не только противоречит стандарту SQL, но и провоцирует ошибки. При обсуждении наследования в этом руководстве обычно предполагается, что данный параметр имеет значение <literal>on</literal>.

source: <primary>strings</primary><secondary>standard conforming</secondary>
ru: <primary>строки</primary> <secondary>соответствие стандарту</secondary>

source: <primary><varname>standard_conforming_strings</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>standard_conforming_strings</varname></primary>

source: This controls whether ordinary string literals (<literal>'...'</literal>) treat backslashes literally, as specified in the SQL standard. Beginning in <productname>PostgreSQL</productname> 9.1, the default is <literal>on</literal> (prior releases defaulted to <literal>off</literal>). Applications can check this parameter to determine how string literals will be processed. The presence of this parameter can also be taken as an indication that the escape string syntax (<literal>E'...'</literal>) is supported. Escape string syntax (<xref linkend="sql-syntax-strings-escape"/>) should be used if an application desires backslashes to be treated as escape characters.
ru: Этот параметр определяет, будет ли обратная косая черта в обычных строковых константах (<literal>'...'</literal>) восприниматься буквально, как того требует стандарт SQL. Начиная с версии <productname>PostgreSQL</productname> 9.1, он имеет значение <literal>on</literal> (в предыдущих версиях значение по умолчанию было <literal>off</literal>). Приложения могут выяснить, как обрабатываются строковые константы, проверив этот параметр. Наличие этого параметра может также быть признаком того, что поддерживается синтаксис спецпоследовательностей (<literal>E'...'</literal>). Этот синтаксис (<xref linkend="sql-syntax-strings-escape"/>) следует использовать, если приложению нужно, чтобы обратная косая воспринималась как спецсимвол.

source: <primary><varname>synchronize_seqscans</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>synchronize_seqscans</varname></primary>

source: This allows sequential scans of large tables to synchronize with each other, so that concurrent scans read the same block at about the same time and hence share the I/O workload. When this is enabled, a scan might start in the middle of the table and then <quote>wrap around</quote> the end to cover all rows, so as to synchronize with the activity of scans already in progress. This can result in unpredictable changes in the row ordering returned by queries that have no <literal>ORDER BY</literal> clause. Setting this parameter to <literal>off</literal> ensures the pre-8.3 behavior in which a sequential scan always starts from the beginning of the table. The default is <literal>on</literal>.
ru: Этот параметр включает синхронизацию обращений при последовательном сканировании больших таблиц, чтобы эти операции читали один блок примерно в одно и то же время, и, таким образом, нагрузка разделялась между ними. Когда он включён, сканирование может начаться в середине таблицы, чтобы синхронизироваться со сканированием, которое уже выполняется. По достижении конца таблицы сканирование <quote>заворачивается</quote> к началу и завершает обработку пропущенных строк. Это может привести к непредсказуемому изменению порядка строк, возвращаемых запросами, в которых отсутствует предложение <literal>ORDER BY</literal>. Когда этот параметр выключен (имеет значение <literal>off</literal>), реализуется поведение, принятое до версии 8.3, когда последовательное сканирование всегда начиналось с начала таблицы. Значение по умолчанию — <literal>on</literal>.

source: Platform and Client Compatibility
ru: Совместимость с разными платформами и клиентами

source: <primary><varname>transform_null_equals</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>transform_null_equals</varname></primary>

source: When on, expressions of the form <literal><replaceable>expr</replaceable> = NULL</literal> (or <literal>NULL = <replaceable>expr</replaceable></literal>) are treated as <literal><replaceable>expr</replaceable> IS NULL</literal>, that is, they return true if <replaceable>expr</replaceable> evaluates to the null value, and false otherwise. The correct SQL-spec-compliant behavior of <literal><replaceable>expr</replaceable> = NULL</literal> is to always return null (unknown). Therefore this parameter defaults to <literal>off</literal>.
ru: Когда этот параметр включён, проверки вида <literal><replaceable>выражение</replaceable> = NULL</literal> (или <literal>NULL = <replaceable>выражение</replaceable></literal>) воспринимаются как <literal><replaceable>выражение</replaceable> IS NULL</literal>, то есть они истинны, если <replaceable>выражение</replaceable> даёт значение NULL, и ложны в противном случае. Согласно спецификации SQL, сравнение <literal><replaceable>выражение</replaceable> = NULL</literal> должно всегда возвращать NULL (неизвестное значение). Поэтому по умолчанию этот параметр выключен (равен <literal>off</literal>).
