Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: On most Unix systems, you will need to alter the configuration of your system's <application>syslog</application> daemon in order to make use of the <systemitem>syslog</systemitem> option for <varname>log_destination</varname>. <productname>PostgreSQL</productname> can log to <application>syslog</application> facilities <literal>LOCAL0</literal> through <literal>LOCAL7</literal> (see <xref linkend="guc-syslog-facility"/>), but the default <application>syslog</application> configuration on most platforms will discard all such messages. You will need to add something like: <placeholder-1/> to the <application>syslog</application> daemon's configuration file to make it work.
ru: В большинстве систем Unix потребуется изменить конфигурацию системного демона <application>syslog</application> для использования варианта <systemitem>syslog</systemitem> в <varname>log_destination</varname>. Для указания типа протоколируемой программы (facility), <productname>PostgreSQL</productname> может использовать значения с <literal>LOCAL0</literal> по <literal>LOCAL7</literal> (см. <xref remap="4" linkend="guc-syslog-facility"/>). Однако, на большинстве платформ, конфигурация <application>syslog</application> по умолчанию не учитывает сообщения подобного типа. Чтобы это работало, потребуется добавить в конфигурацию демона <application>syslog</application> что-то подобное: <placeholder-1/>

source: On Windows, when you use the <literal>eventlog</literal> option for <varname>log_destination</varname>, you should register an event source and its library with the operating system so that the Windows Event Viewer can display event log messages cleanly. See <xref linkend="event-log-registration"/> for details.
ru: Для использования <literal>eventlog</literal> в <varname>log_destination</varname> на Windows, необходимо зарегистрировать источник событий и его библиотеку в операционной системе. Тогда Windows Event Viewer сможет отображать сообщения журнала событий. Подробнее в <xref remap="6" linkend="event-log-registration"/>.

source: <primary><varname>logging_collector</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>logging_collector</varname></primary>

source: This parameter enables the <firstterm>logging collector</firstterm>, which is a background process that captures log messages sent to <systemitem>stderr</systemitem> and redirects them into log files. This approach is often more useful than logging to <application>syslog</application>, since some types of messages might not appear in <application>syslog</application> output. (One common example is dynamic-linker failure messages; another is error messages produced by scripts such as <varname>archive_command</varname>.) This parameter can only be set at server start.
ru: Параметр включает коллектор сообщений (<firstterm>logging collector</firstterm>). Это фоновый процесс, который собирает отправленные в <systemitem>stderr</systemitem> сообщения и перенаправляет их в журнальные файлы. Такой подход зачастую более полезен чем запись в <application>syslog</application>, поскольку некоторые сообщения в <application>syslog</application> могут не попасть. (Типичный пример с сообщениями об ошибках динамического связывания, другой пример — ошибки в скриптах типа <varname>archive_command</varname>.) Для установки параметра требуется перезапуск сервера.

source: It is possible to log to <systemitem>stderr</systemitem> without using the logging collector; the log messages will just go to wherever the server's <systemitem>stderr</systemitem> is directed. However, that method is only suitable for low log volumes, since it provides no convenient way to rotate log files. Also, on some platforms not using the logging collector can result in lost or garbled log output, because multiple processes writing concurrently to the same log file can overwrite each other's output.
ru: Можно обойтись без коллектора сообщений и просто писать в <systemitem>stderr</systemitem>. Сообщения будут записываться в место, куда направлен поток <systemitem>stderr</systemitem>. Такой способ подойдёт только для небольших объёмов протоколирования, потому что не предоставляет удобных средств для организации ротации журнальных файлов. Кроме того, на некоторых платформах отказ от использования коллектора сообщений может привести к потере или искажению сообщений, так как несколько процессов, одновременно пишущих в один журнальный файл, могут перезаписывать информацию друг друга.

source: The logging collector is designed to never lose messages. This means that in case of extremely high load, server processes could be blocked while trying to send additional log messages when the collector has fallen behind. In contrast, <application>syslog</application> prefers to drop messages if it cannot write them, which means it may fail to log some messages in such cases but it will not block the rest of the system.
ru: Коллектор спроектирован так, чтобы сообщения никогда не терялись. А это значит, что при очень высокой нагрузке, серверные процессы могут быть заблокированы при попытке отправить сообщения во время сбоя фонового процесса коллектора. В противоположность этому, <application>syslog</application> предпочитает удалять сообщения, при невозможности их записать. Поэтому часть сообщений может быть потеряна, но система не будет блокироваться.

source: <primary><varname>log_directory</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_directory</varname></primary>

source: When <varname>logging_collector</varname> is enabled, this parameter determines the directory in which log files will be created. It can be specified as an absolute path, or relative to the cluster data directory. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line. The default is <literal>pg_log</literal>.
ru: При включённом <varname>logging_collector</varname>, определяет каталог, в котором создаются журнальные файлы. Можно задавать как абсолютный путь, так и относительный от каталога данных кластера. Параметр можно задать только в конфигурационных файлах или в командной строке при запуске сервера. Значение по умолчанию <literal>pg_log</literal>.

source: <primary><varname>log_filename</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_filename</varname></primary>

source: When <varname>logging_collector</varname> is enabled, this parameter sets the file names of the created log files. The value is treated as a <function>strftime</function> pattern, so <literal>%</literal>-escapes can be used to specify time-varying file names. (Note that if there are any time-zone-dependent <literal>%</literal>-escapes, the computation is done in the zone specified by <xref linkend="guc-log-timezone"/>.) The supported <literal>%</literal>-escapes are similar to those listed in the Open Group's <ulink url="http://pubs.opengroup.org/onlinepubs/009695399/functions/strftime.html">strftime </ulink> specification. Note that the system's <function>strftime</function> is not used directly, so platform-specific (nonstandard) extensions do not work. The default is <literal>postgresql-%Y-%m-%d_%H%M%S.log</literal>.
ru: При включённом <varname>logging_collector</varname> задаёт имена журнальных файлов. Значение трактуется как строка формата в функции <function>strftime</function>, поэтому в ней можно использовать спецификаторы <literal>%</literal> для включения в имена файлов информации о дате и времени. (При наличии зависящих от часового пояса спецификаторов <literal>%</literal> будет использован пояс, заданный в <xref linkend="guc-log-timezone"/>.) Поддерживаемые спецификаторы <literal>%</literal> похожи на те, что перечислены в описании <ulink url="http://pubs.opengroup.org/onlinepubs/009695399/functions/strftime.html">strftime </ulink> спецификации Open Group. Обратите внимание, что системная функция <function>strftime</function> напрямую не используется. Поэтому нестандартные, специфичные для платформы особенности не будут работать. Значение по умолчанию <literal>postgresql-%Y-%m-%d_%H%M%S.log</literal>.

source: If you specify a file name without escapes, you should plan to use a log rotation utility to avoid eventually filling the entire disk. In releases prior to 8.4, if no <literal>%</literal> escapes were present, <productname>PostgreSQL</productname> would append the epoch of the new log file's creation time, but this is no longer the case.
ru: Если для задания имени файлов не используются спецификаторы <literal>%</literal>, то для избежания переполнения диска, следует использовать утилиты для ротации журнальных файлов. В версиях до 8.4, при отсутствии спецификаторов <literal>%</literal>, <productname>PostgreSQL</productname> автоматически добавлял время в формате Epoch к имени файла. Сейчас в этом больше нет необходимости.

source: If CSV-format output is enabled in <varname>log_destination</varname>, <literal>.csv</literal> will be appended to the timestamped log file name to create the file name for CSV-format output. (If <varname>log_filename</varname> ends in <literal>.log</literal>, the suffix is replaced instead.)
ru: Если в <varname>log_destination</varname> включён вывод в формате CSV, то к имени журнального файла будет добавлено расширение <literal>.csv</literal>. (Если <varname>log_filename</varname> заканчивается на <literal>.log</literal>, то это расширение заменится на <literal>.csv</literal>.)

source: <primary><varname>log_file_mode</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_file_mode</varname></primary>

source: On Unix systems this parameter sets the permissions for log files when <varname>logging_collector</varname> is enabled. (On Microsoft Windows this parameter is ignored.) The parameter value is expected to be a numeric mode specified in the format accepted by the <function>chmod</function> and <function>umask</function> system calls. (To use the customary octal format the number must start with a <literal>0</literal> (zero).)
ru: В системах Unix задаёт права доступа к журнальным файлам, при включённом <varname>logging_collector</varname>. (В Windows этот параметр игнорируется.) Значение параметра должно быть числовым, в формате команд <function>chmod</function> и <function>umask</function>. (Для восьмеричного формата, требуется задать лидирующий <literal>0</literal> (ноль).)

source: The default permissions are <literal>0600</literal>, meaning only the server owner can read or write the log files. The other commonly useful setting is <literal>0640</literal>, allowing members of the owner's group to read the files. Note however that to make use of such a setting, you'll need to alter <xref linkend="guc-log-directory"/> to store the files somewhere outside the cluster data directory. In any case, it's unwise to make the log files world-readable, since they might contain sensitive data.
ru: Права доступа по умолчанию <literal>0600</literal>, т. е. только владелец сервера может читать и писать в журнальные файлы. Также, может быть полезным значение <literal>0640</literal>, разрешающее чтение файлов членам группы. Однако, чтобы установить такое значение, нужно каталог для хранения журнальных файлов (<xref linkend="guc-log-directory"/>) вынести за пределы каталога данных кластера. В любом случае, нежелательно открывать для всех доступ на чтение журнальных файлов, так как они могут содержать конфиденциальные данные.

source: <primary><varname>log_rotation_age</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_rotation_age</varname></primary>

source: When <varname>logging_collector</varname> is enabled, this parameter determines the maximum lifetime of an individual log file. After this many minutes have elapsed, a new log file will be created. Set to zero to disable time-based creation of new log files. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Определяет максимальное время жизни отдельного журнального файла, при включённом <varname>logging_collector</varname>. После того как прошло заданное количество минут, создаётся новый журнальный файл. Для запрета создания нового файла по прошествии определённого времени, нужно установить значение 0. Параметр можно задать только в конфигурационных файлах или в командной строке при запуске сервера.

source: <primary><varname>log_rotation_size</varname> configuration parameter</primary>
ru: <primary>параметр <varname>log_rotation_size</varname></primary>

source: When <varname>logging_collector</varname> is enabled, this parameter determines the maximum size of an individual log file. After this many kilobytes have been emitted into a log file, a new log file will be created. Set to zero to disable size-based creation of new log files. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Определяет максимальный размер отдельного журнального файла, при включённом <varname>logging_collector</varname>. После того как заданное количество килобайт записано в текущий файл, создаётся новый журнальный файл. Для запрета создания нового файла при превышении определённого размера, нужно установить значение 0. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>log_truncate_on_rotation</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>log_truncate_on_rotation</varname></primary>

source: When <varname>logging_collector</varname> is enabled, this parameter will cause <productname>PostgreSQL</productname> to truncate (overwrite), rather than append to, any existing log file of the same name. However, truncation will occur only when a new file is being opened due to time-based rotation, not during server startup or size-based rotation. When off, pre-existing files will be appended to in all cases. For example, using this setting in combination with a <varname>log_filename</varname> like <literal>postgresql-%H.log</literal> would result in generating twenty-four hourly log files and then cyclically overwriting them. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Если параметр <varname>logging_collector</varname> включён, <productname>PostgreSQL</productname> будет перезаписывать существующие журнальные файлы, а не дописывать в них. Однако, перезапись при переключении на новый файл возможна только в результате ротации по времени, но не при старте сервера или ротации по размеру файла. При выключенном параметре всегда продолжается запись в существующий файл. Например, включение этого параметра в комбинации с <varname>log_filename</varname> равным <literal>postgresql-%H.log</literal>, приведёт к генерации 24-х часовых журнальных файлов, которые циклически перезаписываются. Параметр можно задать только в конфигурационных файлах или в командной строке при запуске сервера.

source: Example: To keep 7 days of logs, one log file per day named <literal>server_log.Mon</literal>, <literal>server_log.Tue</literal>, etc, and automatically overwrite last week's log with this week's log, set <varname>log_filename</varname> to <literal>server_log.%a</literal>, <varname>log_truncate_on_rotation</varname> to <literal>on</literal>, and <varname>log_rotation_age</varname> to <literal>1440</literal>.
ru: Пример: для хранения журнальных файлов в течение 7 дней, по одному файлу на каждый день с именами вида <literal>server_log.Mon</literal>, <literal>server_log.Tue</literal> и т. д., а также с автоматической перезаписью файлов прошлой недели, нужно установить <varname>log_filename</varname> в <literal>server_log.%a</literal>, <varname>log_truncate_on_rotation</varname> в <literal>on</literal> и <varname>log_rotation_age</varname> в <literal>1440</literal>.

source: Example: To keep 24 hours of logs, one log file per hour, but also rotate sooner if the log file size exceeds 1GB, set <varname>log_filename</varname> to <literal>server_log.%H%M</literal>, <varname>log_truncate_on_rotation</varname> to <literal>on</literal>, <varname>log_rotation_age</varname> to <literal>60</literal>, and <varname>log_rotation_size</varname> to <literal>1000000</literal>. Including <literal>%M</literal> in <varname>log_filename</varname> allows any size-driven rotations that might occur to select a file name different from the hour's initial file name.
ru: Пример: для хранения журнальных файлов в течение 24 часов, по одному файлу на час, с дополнительной возможностью переключения файла при превышения 1ГБ, установите <varname>log_filename</varname> в <literal>server_log.%H%M</literal>, <varname>log_truncate_on_rotation</varname> в <literal>on</literal>, <varname>log_rotation_age</varname> в <literal>60</literal> и <varname>log_rotation_size</varname> в <literal>1000000</literal>. Добавление <literal>%M</literal> в <varname>log_filename</varname> позволит при переключении по размеру указать другое имя файла в пределах одного часа.

source: <primary><varname>syslog_facility</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>syslog_facility</varname></primary>

source: When logging to <application>syslog</application> is enabled, this parameter determines the <application>syslog</application> <quote>facility</quote> to be used. You can choose from <literal>LOCAL0</literal>, <literal>LOCAL1</literal>, <literal>LOCAL2</literal>, <literal>LOCAL3</literal>, <literal>LOCAL4</literal>, <literal>LOCAL5</literal>, <literal>LOCAL6</literal>, <literal>LOCAL7</literal>; the default is <literal>LOCAL0</literal>. See also the documentation of your system's <application>syslog</application> daemon. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: При включённом протоколировании в <application>syslog</application>, этот параметр определяет значение <quote>facility</quote>. Допустимые значения <literal>LOCAL0</literal>, <literal>LOCAL1</literal>, <literal>LOCAL2</literal>, <literal>LOCAL3</literal>, <literal>LOCAL4</literal>, <literal>LOCAL5</literal>, <literal>LOCAL6</literal>, <literal>LOCAL7</literal>. По умолчанию используется <literal>LOCAL0</literal>. Подробнее в документации на системный демон <application>syslog</application>. Параметр можно задать только в конфигурационных файлах или в командной строке при запуске сервера.

source: <primary><varname>syslog_ident</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>syslog_ident</varname></primary>

source: When logging to <application>syslog</application> is enabled, this parameter determines the program name used to identify <productname>PostgreSQL</productname> messages in <application>syslog</application> logs. The default is <literal>postgres</literal>. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: При включённом протоколировании в <application>syslog</application>, этот параметр задаёт имя программы, которое будет использоваться в <application>syslog</application> для идентификации сообщений относящихся к <productname>PostgreSQL</productname>. По умолчанию используется <literal>postgres</literal>. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>syslog_sequence_numbers</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>syslog_sequence_numbers</varname></primary>

source: When logging to <application>syslog</application> and this is on (the default), then each message will be prefixed by an increasing sequence number (such as <literal>[2]</literal>). This circumvents the <quote>--- last message repeated N times ---</quote> suppression that many syslog implementations perform by default. In more modern syslog implementations, repeated message suppression can be configured (for example, <literal>$RepeatedMsgReduction</literal> in <productname>rsyslog</productname>), so this might not be necessary. Also, you could turn this off if you actually want to suppress repeated messages.
ru: Когда сообщения выводятся в <application>syslog</application> и этот параметр включён (по умолчанию), все сообщения будут предваряться последовательно увеличивающимися номерами (например, <literal>[2]</literal>). Это позволяет обойти подавление повторов <quote>--- последнее сообщение повторилось N раз ---</quote>, которое по умолчанию осуществляется во многих реализациях syslog. В более современных реализациях syslog подавление повторных сообщений можно настроить (например, в <productname>rsyslog</productname> есть директива <literal>$RepeatedMsgReduction</literal>), так что это может излишне. Если же вы действительно хотите, чтобы повторные сообщения подавлялись, вы можете отключить этот параметр.

source: <primary><varname>syslog_split_messages</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>syslog_split_messages</varname></primary>

source: When logging to <application>syslog</application> is enabled, this parameter determines how messages are delivered to syslog. When on (the default), messages are split by lines, and long lines are split so that they will fit into 1024 bytes, which is a typical size limit for traditional syslog implementations. When off, PostgreSQL server log messages are delivered to the syslog service as is, and it is up to the syslog service to cope with the potentially bulky messages.
ru: Когда активен вывод сообщений в <application>syslog</application>, этот параметр определяет, как будут доставляться сообщения. Если он включён (по умолчанию), сообщения разделяются по строкам, а длинные строки разбиваются на строки не длиннее 1024 байт, что составляет типичное ограничение размера для традиционных реализаций syslog. Когда он отключён, сообщения сервера PostgreSQL передаются службе syslog как есть, и она должна сама корректно воспринять потенциально длинные сообщения.

source: If syslog is ultimately logging to a text file, then the effect will be the same either way, and it is best to leave the setting on, since most syslog implementations either cannot handle large messages or would need to be specially configured to handle them. But if syslog is ultimately writing into some other medium, it might be necessary or more useful to keep messages logically together.
ru: Если syslog в итоге выводит сообщения в текстовый файл, результат будет тем же и лучше оставить этот параметр включённым, так как многие реализации syslog не способны обрабатывать большие сообщения или их нужно специально настраивать для этого. Но если syslog направляет сообщения в некоторую другую среду, может потребоваться или будет удобнее сохранять логическую целостность сообщений.

source: <primary><varname>event_source</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>event_source</varname></primary>
