Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: If <xref linkend="guc-synchronous-standby-names"/> is non-empty, this parameter also controls whether or not transaction commits will wait for their WAL records to be replicated to the standby server(s). When set to <literal>on</literal>, commits will wait until replies from the current synchronous standby(s) indicate they have received the commit record of the transaction and flushed it to disk. This ensures the transaction will not be lost unless both the primary and all synchronous standbys suffer corruption of their database storage. When set to <literal>remote_apply</literal>, commits will wait until replies from the current synchronous standby(s) indicate they have received the commit record of the transaction and applied it, so that it has become visible to queries on the standby(s). When set to <literal>remote_write</literal>, commits will wait until replies from the current synchronous standby(s) indicate they have received the commit record of the transaction and written it out to their operating system. This setting is sufficient to ensure data preservation even if a standby instance of <productname>PostgreSQL</productname> were to crash, but not if the standby suffers an operating-system-level crash, since the data has not necessarily reached stable storage on the standby. Finally, the setting <literal>local</literal> causes commits to wait for local flush to disk, but not for replication. This is not usually desirable when synchronous replication is in use, but is provided for completeness.
ru: Если задано значение <xref linkend="guc-synchronous-standby-names"/>, этот параметр также определяет, будет ли сервер при фиксировании транзакции ждать, пока выполнится репликация соответствующих записей WAL на резервный сервер(ы). Со значением <literal>on</literal> фиксирование завершается только после получения ответов от текущих синхронных резервных серверов, подтверждающих, что они получили запись о фиксировании транзакции и сохранили её на диске. Это гарантирует, что транзакция не будет потеряна, если только база данных не будет повреждена и на главном, и на всех синхронных резервных серверах. Со значением <literal>remote_apply</literal> фиксирование завершается после получения ответов от синхронных резервных серверов, говорящих, что они получили запись о фиксировании транзакции и применили её, так что она стала видна для запросов на этих серверах. Со значением <literal>remote_write</literal> фиксирование завершается после получения ответов от текущих синхронных резервных серверов, говорящих, что они получили запись о фиксировании транзакции и передали её ОС для сохранения на диске. Этот вариант позволяет гарантировать сохранность данных даже в случае отказа резервного сервера <productname>PostgreSQL</productname>, но не в случае сбоя на уровне ОС, так как данные могут ещё не достичь надёжного хранилища на этом сервере. Наконец, со значением <literal>local</literal> фиксирование завершается после локального сброса данных, не дожидаясь репликации. Обычно это нежелательный вариант при синхронной репликации, но он представлен для полноты.

source: If <varname>synchronous_standby_names</varname> is empty, the settings <literal>on</literal>, <literal>remote_apply</literal>, <literal>remote_write</literal> and <literal>local</literal> all provide the same synchronization level: transaction commits only wait for local flush to disk.
ru: Если параметр <varname>synchronous_standby_names</varname> пуст, варианты <literal moreinfo="none">on</literal>, <literal moreinfo="none">remote_write</literal> и <literal moreinfo="none">local</literal> реализуют одинаковый уровень синхронизации: при фиксировании транзакции сервер ждёт только сохранения данных на локальный диск.

source: This parameter can be changed at any time; the behavior for any one transaction is determined by the setting in effect when it commits. It is therefore possible, and useful, to have some transactions commit synchronously and others asynchronously. For example, to make a single multistatement transaction commit asynchronously when the default is the opposite, issue <command>SET LOCAL synchronous_commit TO OFF</command> within the transaction.
ru: Этот параметр можно изменить в любое время; поведение каждой конкретной транзакции определяется значением, действующим в момент её фиксирования. Таким образом, есть возможность и смысл фиксировать некоторые транзакции синхронно, а другие — асинхронно. Например, чтобы зафиксировать одну транзакцию из нескольких команд асинхронно, когда по умолчанию выбран противоположный вариант, выполните в этой транзакции <command>SET LOCAL synchronous_commit TO OFF</command>.

source: <primary><varname>wal_sync_method</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_sync_method</varname></primary>

source: Method used for forcing WAL updates out to disk. If <varname>fsync</varname> is off then this setting is irrelevant, since WAL file updates will not be forced out at all. Possible values are:
ru: Метод, применяемый для принудительного сохранения изменений WAL на диске. Если режим <varname>fsync</varname> отключён, данный параметр не действует, так как принудительное сохранение изменений WAL не производится вовсе. Возможные значения этого параметра:

source: <literal>open_datasync</literal> (write WAL files with <function>open()</function> option <symbol>O_DSYNC</symbol>)
ru: <literal>open_datasync</literal> (для сохранения файлов WAL открывать их функцией <function>open()</function> с параметром <symbol>O_DSYNC</symbol>)

source: <literal>fdatasync</literal> (call <function>fdatasync()</function> at each commit)
ru: <literal>fdatasync</literal> (вызывать <function>fdatasync()</function> при каждом фиксировании)

source: <literal>fsync</literal> (call <function>fsync()</function> at each commit)
ru: <literal>fsync</literal> (вызывать <function>fsync()</function> при каждом фиксировании)

source: <literal>fsync_writethrough</literal> (call <function>fsync()</function> at each commit, forcing write-through of any disk write cache)
ru: <literal>fsync_writethrough</literal> (вызывать <function>fsync()</function> при каждом фиксировании, форсируя сквозную запись кеша)

source: <literal>open_sync</literal> (write WAL files with <function>open()</function> option <symbol>O_SYNC</symbol>)
ru: <literal>open_sync</literal> (для сохранения файлов WAL открывать их функцией <function>open()</function> с параметром <symbol>O_SYNC</symbol>)

source: The <literal>open_</literal>* options also use <literal>O_DIRECT</literal> if available. Not all of these choices are available on all platforms. The default is the first method in the above list that is supported by the platform, except that <literal>fdatasync</literal> is the default on Linux. The default is not necessarily ideal; it might be necessary to change this setting or other aspects of your system configuration in order to create a crash-safe configuration or achieve optimal performance. These aspects are discussed in <xref linkend="wal-reliability"/>. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Варианты <literal>open_</literal>* также применяют флаг <literal>O_DIRECT</literal>, если он доступен. Не все эти методы поддерживается в разных системах. По умолчанию выбирается первый из этих методов, который поддерживается текущей системой, с одним исключением — в Linux по умолчанию выбирается <literal>fdatasync</literal>. Выбираемый по умолчанию вариант не обязательно будет идеальным; в зависимости от требований к отказоустойчивости или производительности может потребоваться скорректировать выбранное значение или внести другие изменения в конфигурацию вашей системы. Соответствующие аспекты конфигурации рассматриваются в <xref remap="6" linkend="wal-reliability"/>. Этот параметр можно задать только в файле <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>full_page_writes</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>full_page_writes</varname></primary>

source: When this parameter is on, the <productname>PostgreSQL</productname> server writes the entire content of each disk page to WAL during the first modification of that page after a checkpoint. This is needed because a page write that is in process during an operating system crash might be only partially completed, leading to an on-disk page that contains a mix of old and new data. The row-level change data normally stored in WAL will not be enough to completely restore such a page during post-crash recovery. Storing the full page image guarantees that the page can be correctly restored, but at the price of increasing the amount of data that must be written to WAL. (Because WAL replay always starts from a checkpoint, it is sufficient to do this during the first change of each page after a checkpoint. Therefore, one way to reduce the cost of full-page writes is to increase the checkpoint interval parameters.)
ru: Когда этот параметр включён, сервер <productname>PostgreSQL</productname> записывает в WAL всё содержимое каждой страницы при первом изменении этой страницы после контрольной точки. Это необходимо, потому что запись страницы, прерванная при сбое операционной системы, может выполниться частично, и на диске окажется страница, содержащая смесь старых данных с новыми. При этом информации об изменениях на уровне строк, которая обычно сохраняется в WAL, будет недостаточно для получения согласованного содержимого такой страницы при восстановлении после сбоя. Сохранение образа всей страницы гарантирует, что страницу можно восстановить корректно, ценой увеличения объёма данных, которые будут записываться в WAL. (Так как воспроизведение WAL всегда начинается от контрольной точки, достаточно сделать это при первом изменении каждой страницы после контрольной точки. Таким образом, уменьшить затраты на запись полных страниц можно, увеличив интервалы контрольных точек.)

source: Turning this parameter off speeds normal operation, but might lead to either unrecoverable data corruption, or silent data corruption, after a system failure. The risks are similar to turning off <varname>fsync</varname>, though smaller, and it should be turned off only based on the same circumstances recommended for that parameter.
ru: Отключение этого параметра ускоряет обычные операции, но может привести к неисправимому повреждению или незаметной порче данных после сбоя системы. Так как при этом возникают практически те же риски, что и при отключении <varname>fsync</varname>, хотя и в меньшей степени, отключать его следует только при тех же обстоятельствах, которые перечислялись в рекомендациях для вышеописанного параметра.

source: Turning off this parameter does not affect use of WAL archiving for point-in-time recovery (PITR) (see <xref linkend="continuous-archiving"/>).
ru: Отключение этого параметра не влияет на возможность применения архивов WAL для восстановления состояния на момент времени (см. <xref remap="4" linkend="continuous-archiving"/>).

source: This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line. The default is <literal>on</literal>.
ru: Этот параметр можно задать только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера. По умолчанию этот параметр имеет значение <literal>on</literal>.

source: <primary><varname>wal_log_hints</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_log_hints</varname></primary>

source: When this parameter is <literal>on</literal>, the <productname>PostgreSQL</productname> server writes the entire content of each disk page to WAL during the first modification of that page after a checkpoint, even for non-critical modifications of so-called hint bits.
ru: Когда этот параметр имеет значение <literal>on</literal>, сервер <productname>PostgreSQL</productname> записывает в WAL всё содержимое каждой страницы при первом изменении этой страницы после контрольной точки, даже при второстепенных изменениях так называемых вспомогательных битов.

source: If data checksums are enabled, hint bit updates are always WAL-logged and this setting is ignored. You can use this setting to test how much extra WAL-logging would occur if your database had data checksums enabled.
ru: Если включён расчёт контрольных сумм данных, изменения вспомогательных битов всегда проходят через WAL и этот параметр игнорируется. С помощью этого параметра можно проверить, насколько больше дополнительной информации записывалось бы в журнал, если бы для базы данных был включён подсчёт контрольных сумм.

source: This parameter can only be set at server start. The default value is <literal>off</literal>.
ru: Этот параметр можно задать только при запуске сервера. По умолчанию он имеет значение <literal>off</literal>.

source: <primary><varname>wal_compression</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_compression</varname></primary>

source: When this parameter is <literal>on</literal>, the <productname>PostgreSQL</productname> server compresses a full page image written to WAL when <xref linkend="guc-full-page-writes"/> is on or during a base backup. A compressed page image will be decompressed during WAL replay. The default value is <literal>off</literal>. Only superusers can change this setting.
ru: Когда этот параметр имеет значение <literal>on</literal>, сервер <productname>PostgreSQL</productname> сжимает образ полной страницы, записываемый в WAL, когда включён режим <xref linkend="guc-full-page-writes"/> или при создании базовой копии. Сжатый образ страницы будет развёрнут при воспроизведении WAL. Значение по умолчанию — <literal>off</literal>. Изменить этот параметр могут только суперпользователи.

source: Turning this parameter on can reduce the WAL volume without increasing the risk of unrecoverable data corruption, but at the cost of some extra CPU spent on the compression during WAL logging and on the decompression during WAL replay.
ru: Этот параметр позволяет без дополнительных рисков повреждения данных уменьшить объём WAL, ценой дополнительной нагрузки на процессор, связанной со сжатием данных при записи в WAL и разворачиванием их при воспроизведении WAL.

source: <primary><varname>wal_buffers</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_buffers</varname></primary>

source: The amount of shared memory used for WAL data that has not yet been written to disk. The default setting of -1 selects a size equal to 1/32nd (about 3%) of <xref linkend="guc-shared-buffers"/>, but not less than <literal>64kB</literal> nor more than the size of one WAL segment, typically <literal>16MB</literal>. This value can be set manually if the automatic choice is too large or too small, but any positive value less than <literal>32kB</literal> will be treated as <literal>32kB</literal>. This parameter can only be set at server start.
ru: Объём разделяемой памяти, который будет использоваться для буферизации данных WAL, ещё не записанных на диск. Значение по умолчанию, равное -1, задаёт размер, равный 1/32 (около 3%) от <xref linkend="guc-shared-buffers"/>, но не меньше, чем <literal>64 КБ</literal> и не больше, чем размер одного сегмента WAL (обычно <literal>16 МБ</literal>). Это значение можно задать вручную, если выбираемое автоматически слишком мало или велико, но при этом любое положительное число меньше <literal>32 КБ</literal> будет восприниматься как <literal>32 КБ</literal>. Этот параметр можно задать только при запуске сервера.

source: The contents of the WAL buffers are written out to disk at every transaction commit, so extremely large values are unlikely to provide a significant benefit. However, setting this value to at least a few megabytes can improve write performance on a busy server where many clients are committing at once. The auto-tuning selected by the default setting of -1 should give reasonable results in most cases.
ru: Содержимое буферов WAL записывается на диск при фиксировании каждой транзакции, так что очень большие значения вряд ли принесут значительную пользу. Однако значение как минимум в несколько мегабайт может увеличить быстродействие при записи на нагруженном сервере, когда сразу множество клиентов фиксируют транзакции. Автонастройка, действующая при значении по умолчанию (-1), в большинстве случаев выбирает разумные значения.

source: <primary><varname>wal_writer_delay</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_writer_delay</varname></primary>

source: Specifies how often the WAL writer flushes WAL. After flushing WAL it sleeps for <varname>wal_writer_delay</varname> milliseconds, unless woken up by an asynchronously committing transaction. If the last flush happened less than <varname>wal_writer_delay</varname> milliseconds ago and less than <varname>wal_writer_flush_after</varname> bytes of WAL have been produced since, then WAL is only written to the operating system, not flushed to disk. The default value is 200 milliseconds (<literal>200ms</literal>). Note that on many systems, the effective resolution of sleep delays is 10 milliseconds; setting <varname>wal_writer_delay</varname> to a value that is not a multiple of 10 might have the same results as setting it to the next higher multiple of 10. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Определяет, как часто процесс записи WAL будет сбрасывать WAL на диск. После очередного сброса WAL он делает паузу на <varname>wal_writer_delay</varname> миллисекунд, но может быть пробуждён асинхронно фиксируемой транзакцией. Если предыдущая операция сброса имела место в последние <varname>wal_writer_delay</varname> миллисекунд и за это время было получено меньше <varname>wal_writer_flush_after</varname> байт WAL, данные WAL только передаются ОС, но не сбрасываются на диск. Значение по умолчанию — 200 миллисекунд (<literal>200ms</literal>). Заметьте, что во многих системах разрешение таймера паузы составляет 10 мс; если задать в <varname>wal_writer_delay</varname> значение, не кратное 10, может быть получен тот же результат, что и со следующим за ним кратным 10. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>wal_writer_flush_after</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_writer_flush_after</varname></primary>

source: Specifies how often the WAL writer flushes WAL. If the last flush happened less than <varname>wal_writer_delay</varname> milliseconds ago and less than <varname>wal_writer_flush_after</varname> bytes of WAL have been produced since, then WAL is only written to the operating system, not flushed to disk. If <varname>wal_writer_flush_after</varname> is set to <literal>0</literal> then WAL data is flushed immediately. The default is <literal>1MB</literal>. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Определяет, как часто процесс записи WAL будет сбрасывать WAL на диск. Если предыдущая операция сброса имела место в последние <varname>wal_writer_delay</varname> миллисекунд и за это время было получено меньше <varname>wal_writer_flush_after</varname> байт WAL, данные WAL только передаются операционной системе, но не сбрасываются на диск. Если <varname>wal_writer_flush_after</varname> равен <literal>0</literal>, WAL сбрасывается на диск немедленно. Значение по умолчанию — 1 Мбайт (<literal>1MB</literal>). Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>commit_delay</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>commit_delay</varname></primary>

source: <varname>commit_delay</varname> adds a time delay, measured in microseconds, before a WAL flush is initiated. This can improve group commit throughput by allowing a larger number of transactions to commit via a single WAL flush, if system load is high enough that additional transactions become ready to commit within the given interval. However, it also increases latency by up to <varname>commit_delay</varname> microseconds for each WAL flush. Because the delay is just wasted if no other transactions become ready to commit, a delay is only performed if at least <varname>commit_siblings</varname> other transactions are active when a flush is about to be initiated. Also, no delays are performed if <varname>fsync</varname> is disabled. The default <varname>commit_delay</varname> is zero (no delay). Only superusers can change this setting.
ru: Параметр <varname>commit_delay</varname> добавляет паузу (в микросекундах) перед собственно выполнением сохранения WAL. Эта задержка может увеличить быстродействие при фиксировании множества транзакций, позволяя зафиксировать большее число транзакций за одну операции сохранения WAL, если система нагружена достаточно сильно и за заданное время успевают зафиксироваться другие транзакции. Однако этот параметр также увеличивает задержку максимум до <varname>commit_delay</varname> микросекунд при каждом сохранении WAL. Эта задержка окажется бесполезной, если никакие другие транзакции не будут зафиксированы за это время, поэтому она добавляется, только в если момент запроса сохранения WAL активны как минимум <varname>commit_siblings</varname> других транзакций. Кроме того, эти задержки не добавляются при выключенном <varname>fsync</varname>. По умолчанию значение <varname>commit_delay</varname> равно нулю (задержка отсутствует). Изменить этот параметр могут только суперпользователи.

source: In <productname>PostgreSQL</productname> releases prior to 9.3, <varname>commit_delay</varname> behaved differently and was much less effective: it affected only commits, rather than all WAL flushes, and waited for the entire configured delay even if the WAL flush was completed sooner. Beginning in <productname>PostgreSQL</productname> 9.3, the first process that becomes ready to flush waits for the configured interval, while subsequent processes wait only until the leader completes the flush operation.
ru: В <productname>PostgreSQL</productname> до версии 9.3, параметр <varname>commit_delay</varname> работал по-другому и не так эффективно: он задерживал только фиксирование транзакций, а не все операции сохранения WAL, и заданная пауза выдерживалась полностью, даже если WAL удавалось сохранить быстрее. Начиная с версии 9.3, заданное время ожидает только первый процесс, готовый произвести сохранение, тогда как все последующие процессы ждут только, когда он закончит эту операцию.

source: <primary><varname>commit_siblings</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>commit_siblings</varname></primary>

source: Minimum number of concurrent open transactions to require before performing the <varname>commit_delay</varname> delay. A larger value makes it more probable that at least one other transaction will become ready to commit during the delay interval. The default is five transactions.
ru: Минимальное число одновременно открытых транзакций, при котором будет добавляться задержка <varname>commit_delay</varname>. Чем больше это значение, тем больше вероятность, что минимум одна транзакция окажется готовой к фиксированию за время задержки. По умолчанию это число равно пяти.

source: Checkpoints
ru: Контрольные точки

source: <primary><varname>checkpoint_timeout</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>checkpoint_timeout</varname></primary>
