Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: However, filtered forms in <productname>Microsoft Access</productname> generate queries that appear to use <literal><replaceable>expr</replaceable> = NULL</literal> to test for null values, so if you use that interface to access the database you might want to turn this option on. Since expressions of the form <literal><replaceable>expr</replaceable> = NULL</literal> always return the null value (using the SQL standard interpretation), they are not very useful and do not appear often in normal applications so this option does little harm in practice. But new users are frequently confused about the semantics of expressions involving null values, so this option is off by default.
ru: Однако формы фильтров в <productname>Microsoft Access</productname> генерируют запросы, в которых проверка на значение NULL записывается как <literal><replaceable>выражение</replaceable> = NULL</literal>, так что если вы используете этот интерфейс для обращения к базе данных, имеет смысл включить данный параметр. Так как проверки вида <literal><replaceable>выражение</replaceable> = NULL</literal> всегда возвращают значение NULL (следуя правилам стандарта SQL), они не очень полезны и не должны встречаться в обычных приложениях, так что на практике от включения этого параметра не будет большого вреда. Однако начинающие пользователи часто путаются в семантике выражений со значениями NULL, поэтому по умолчанию этот параметр выключен.

source: Note that this option only affects the exact form <literal>= NULL</literal>, not other comparison operators or other expressions that are computationally equivalent to some expression involving the equals operator (such as <literal>IN</literal>). Thus, this option is not a general fix for bad programming.
ru: Заметьте, что этот параметр влияет только на точную форму сравнения <literal>= NULL</literal>, но не на другие операторы сравнения или выражения, результат которых может быть равнозначен сравнению с применением оператора равенства (например, конструкцию <literal>IN</literal>). Поэтому данный параметр не может быть универсальной защитой от плохих приёмов программирования.

source: Refer to <xref linkend="functions-comparison"/> for related information.
ru: За сопутствующей информацией обратитесь к <xref remap="3" linkend="functions-comparison"/>.

source: Error Handling
ru: Обработка ошибок

source: <primary><varname>exit_on_error</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>exit_on_error</varname></primary>

source: If true, any error will terminate the current session. By default, this is set to false, so that only FATAL errors will terminate the session.
ru: Если этот параметр включён, любая ошибка приведёт к прерыванию текущего сеанса. По умолчанию он отключён, так что сеанс будет прерываться только при критических ошибках.

source: <primary><varname>restart_after_crash</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>restart_after_crash</varname></primary>

source: When set to true, which is the default, <productname>PostgreSQL</productname> will automatically reinitialize after a backend crash. Leaving this value set to true is normally the best way to maximize the availability of the database. However, in some circumstances, such as when <productname>PostgreSQL</productname> is being invoked by clusterware, it may be useful to disable the restart so that the clusterware can gain control and take any actions it deems appropriate.
ru: Когда этот параметр включён (это состояние по умолчанию), <productname>PostgreSQL</productname> будет автоматически перезагружаться после сбоя серверного процесса. Такой вариант позволяет обеспечить максимальную степень доступности базы данных. Однако в некоторых обстоятельствах, например, когда <productname>PostgreSQL</productname> управляется кластерным ПО, такую перезагрузку лучше отключить, чтобы кластерное ПО могло вмешаться и выполнить, возможно, более подходящие действия.

source: Preset Options
ru: Предопределённые параметры

source: The following <quote>parameters</quote> are read-only, and are determined when <productname>PostgreSQL</productname> is compiled or when it is installed. As such, they have been excluded from the sample <filename>postgresql.conf</filename> file. These options report various aspects of <productname>PostgreSQL</productname> behavior that might be of interest to certain applications, particularly administrative front-ends.
ru: Следующие <quote>параметры</quote> доступны только для чтения, их значения задаются при компиляции или при установке <productname>PostgreSQL</productname>. По этой причине они исключены из примера файла <filename>postgresql.conf</filename>. Эти параметры сообщают различные аспекты поведения <productname>PostgreSQL</productname>, которые могут быть интересны для определённых приложений, например, средств администрирования.

source: <primary><varname>block_size</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>block_size</varname></primary>

source: Reports the size of a disk block. It is determined by the value of <literal>BLCKSZ</literal> when building the server. The default value is 8192 bytes. The meaning of some configuration variables (such as <xref linkend="guc-shared-buffers"/>) is influenced by <varname>block_size</varname>. See <xref linkend="runtime-config-resource"/> for information.
ru: Сообщает размер блока на диске. Он определяется значением <literal>BLCKSZ</literal> при сборке сервера. Значение по умолчанию — 8192 байта. Значение <varname>block_size</varname> влияет на некоторые другие переменные конфигурации (например, <xref linkend="guc-shared-buffers"/>). Об этом говорится в <xref remap="6" linkend="runtime-config-resource"/>.

source: <primary><varname>data_checksums</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>data_checksums</varname></primary>

source: Reports whether data checksums are enabled for this cluster. See <xref linkend="app-initdb-data-checksums"/> for more information.
ru: Сообщает, включён ли в этом кластере контроль целостности данных. За дополнительными сведениями обратитесь к <xref remap="3" linkend="app-initdb-data-checksums"/>.

source: <primary><varname>debug_assertions</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>debug_assertions</varname></primary>

source: Reports whether <productname>PostgreSQL</productname> has been built with assertions enabled. That is the case if the macro <symbol>USE_ASSERT_CHECKING</symbol> is defined when <productname>PostgreSQL</productname> is built (accomplished e.g. by the <command>configure</command> option <option>--enable-cassert</option>). By default <productname>PostgreSQL</productname> is built without assertions.
ru: Сообщает, был ли <productname>PostgreSQL</productname> собран с проверочными утверждениями. Это имеет место, когда при сборке <productname>PostgreSQL</productname> определён макрос <symbol>USE_ASSERT_CHECKING</symbol> (для этого нужно передать <command>configure</command> флаг <option>--enable-cassert</option>). По умолчанию <productname>PostgreSQL</productname> собирается без проверочных утверждений.

source: <primary><varname>integer_datetimes</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>integer_datetimes</varname></primary>

source: Reports whether <productname>PostgreSQL</productname> was built with support for 64-bit-integer dates and times. This can be disabled by configuring with <literal>--disable-integer-datetimes</literal> when building <productname>PostgreSQL</productname>. The default value is <literal>on</literal>.
ru: Сообщает, был ли <productname>PostgreSQL</productname> собран с поддержкой даты и времени в 64-битных целых. Эта поддержка отключается аргументом <literal>--disable-integer-datetimes</literal> при конфигурировании в процессе сборки <productname>PostgreSQL</productname>. Значение по умолчанию — <literal>on</literal>.

source: <primary><varname>lc_collate</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>lc_collate</varname></primary>

source: Reports the locale in which sorting of textual data is done. See <xref linkend="locale"/> for more information. This value is determined when a database is created.
ru: Сообщает локаль, по правилам которой выполняется сортировка текстовых данных. За дополнительными сведениями обратитесь к <xref remap="3" linkend="locale"/>. Это значение определяется при создании базы данных.

source: <primary><varname>lc_ctype</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>lc_ctype</varname></primary>

source: Reports the locale that determines character classifications. See <xref linkend="locale"/> for more information. This value is determined when a database is created. Ordinarily this will be the same as <varname>lc_collate</varname>, but for special applications it might be set differently.
ru: Сообщает локаль, определяющую классификацию символов. За дополнительными сведениями обратитесь к <xref remap="3" linkend="locale"/>. Это значение определяется при создании базы данных. Обычно оно не отличается от <varname>lc_collate</varname>, но для некоторых приложений оно может быть определено по-другому.

source: <primary><varname>max_function_args</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_function_args</varname></primary>

source: Reports the maximum number of function arguments. It is determined by the value of <literal>FUNC_MAX_ARGS</literal> when building the server. The default value is 100 arguments.
ru: Сообщает верхний предел для числа аргументов функции. Он определяется константой <literal>FUNC_MAX_ARGS</literal> при сборке сервера. По умолчанию установлен предел в 100 аргументов.

source: <primary><varname>max_identifier_length</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_identifier_length</varname></primary>

source: Reports the maximum identifier length. It is determined as one less than the value of <literal>NAMEDATALEN</literal> when building the server. The default value of <literal>NAMEDATALEN</literal> is 64; therefore the default <varname>max_identifier_length</varname> is 63 bytes, which can be less than 63 characters when using multibyte encodings.
ru: Сообщает максимальную длину идентификатора. Она определяется числом на 1 меньше, чем <literal>NAMEDATALEN</literal>, при сборке сервера. По умолчанию константа <literal>NAMEDATALEN</literal> равна 64; следовательно <varname>max_identifier_length</varname> по умолчанию равна 63 байтам, но число символов в многобайтной кодировке будет меньше.

source: <primary><varname>max_index_keys</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_index_keys</varname></primary>

source: Reports the maximum number of index keys. It is determined by the value of <literal>INDEX_MAX_KEYS</literal> when building the server. The default value is 32 keys.
ru: Сообщает верхний предел для числа ключей индекса. Он определяется константой <literal>INDEX_MAX_KEYS</literal> при сборке сервера. По умолчанию установлен предел в 32 ключа.

source: <primary><varname>segment_size</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>segment_size</varname></primary>

source: Reports the number of blocks (pages) that can be stored within a file segment. It is determined by the value of <literal>RELSEG_SIZE</literal> when building the server. The maximum size of a segment file in bytes is equal to <varname>segment_size</varname> multiplied by <varname>block_size</varname>; by default this is 1GB.
ru: Сообщает, сколько блоков (страниц) можно сохранить в одном файловом сегменте. Это число определяется константой <literal>RELSEG_SIZE</literal> при сборке сервера. Максимальный размер сегмента в файлах равен произведению <varname>segment_size</varname> и <varname>block_size</varname>; по умолчанию это 1 гигабайт.

source: <primary><varname>server_encoding</varname> configuration parameter</primary>
ru: <primary>параметр кодировки <varname>server_encoding</varname></primary>

source: Reports the database encoding (character set). It is determined when the database is created. Ordinarily, clients need only be concerned with the value of <xref linkend="guc-client-encoding"/>.
ru: Сообщает кодировку базы данных (набор символов). Она определяется при создании базы данных. Обычно клиентов должно интересовать только значение <xref linkend="guc-client-encoding"/>.

source: <primary><varname>server_version</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>server_version</varname></primary>

source: Reports the version number of the server. It is determined by the value of <literal>PG_VERSION</literal> when building the server.
ru: Сообщает номер версии сервера. Она определяется константой <literal>PG_VERSION</literal> при сборке сервера.

source: <primary><varname>server_version_num</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>server_version_num</varname></primary>

source: Reports the version number of the server as an integer. It is determined by the value of <literal>PG_VERSION_NUM</literal> when building the server.
ru: Сообщает номер версии сервера в виде целого числа. Она определяется константой <literal>PG_VERSION_NUM</literal> при сборке сервера.

source: <primary><varname>wal_block_size</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_block_size</varname></primary>

source: Reports the size of a WAL disk block. It is determined by the value of <literal>XLOG_BLCKSZ</literal> when building the server. The default value is 8192 bytes.
ru: Сообщает размер блока WAL на диске. Он определяется константой <literal>XLOG_BLCKSZ</literal> при сборке сервера. Значение по умолчанию — 8192 байта.

source: <primary><varname>wal_segment_size</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>wal_segment_size</varname></primary>

source: Reports the number of blocks (pages) in a WAL segment file. The total size of a WAL segment file in bytes is equal to <varname>wal_segment_size</varname> multiplied by <varname>wal_block_size</varname>; by default this is 16MB. See <xref linkend="wal-configuration"/> for more information.
ru: Сообщает число блоков (страниц) в файле сегмента WAL. Общий размер файла сегмента WAL равняется произведению <varname>wal_segment_size</varname> и <varname>wal_block_size</varname>; по умолчанию это 16 мегабайт. За дополнительными сведениями обратитесь к <xref remap="3" linkend="wal-configuration"/>.

source: Customized Options
ru: Внесистемные параметры

source: This feature was designed to allow parameters not normally known to <productname>PostgreSQL</productname> to be added by add-on modules (such as procedural languages). This allows extension modules to be configured in the standard ways.
ru: Поддержка внесистемных параметров была реализована, чтобы дополнительные модули (например, процедурные языки) могли добавлять собственные параметры, неизвестные серверу <productname>PostgreSQL</productname>. Это позволяет единообразно настраивать модули расширения.

source: Custom options have two-part names: an extension name, then a dot, then the parameter name proper, much like qualified names in SQL. An example is <literal>plpgsql.variable_conflict</literal>.
ru: Имена параметров расширений записываются следующим образом: имя расширения, точка и затем собственно имя параметра, подобно полным именам объектов в SQL. Например: <literal>plpgsql.variable_conflict</literal>.

source: Because custom options may need to be set in processes that have not loaded the relevant extension module, <productname>PostgreSQL</productname> will accept a setting for any two-part parameter name. Such variables are treated as placeholders and have no function until the module that defines them is loaded. When an extension module is loaded, it will add its variable definitions, convert any placeholder values according to those definitions, and issue warnings for any unrecognized placeholders that begin with its extension name.
ru: Так как внесистемные параметры могут быть установлены в процессах, не загружающих соответствующий модуль расширения, <productname>PostgreSQL</productname> принимает значения для любых имён с двумя компонентами. Такие параметры воспринимаются как заготовки и не действуют до тех пор, пока не будет загружен определяющий их модуль. Когда модуль расширения загружается, он добавляет свои определения параметров и присваивает все заготовленные значения этим параметрам, либо выдаёт предупреждение, если начинающееся с имени данного расширения имя заготовленного параметра оказывается нераспознанным.

source: Developer Options
ru: Параметры для разработчиков

source: The following parameters are intended for work on the <productname>PostgreSQL</productname> source code, and in some cases to assist with recovery of severely damaged databases. There should be no reason to use them on a production database. As such, they have been excluded from the sample <filename>postgresql.conf</filename> file. Note that many of these parameters require special source compilation flags to work at all.
ru: Следующие параметры предназначены для работы над исходным кодом <productname>PostgreSQL</productname>, а в некоторых случаях они могут помочь восстановить сильно повреждённые базы данных. Для использования их в производственной среде не должно быть причин, поэтому они исключены из примера файла <filename>postgresql.conf</filename>. Заметьте, что для работы с многими из этих параметров требуются специальные флаги компиляции.

source: <primary><varname>allow_system_table_mods</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>allow_system_table_mods</varname></primary>

source: Allows modification of the structure of system tables. This is used by <command>initdb</command>. This parameter can only be set at server start.
ru: Разрешает модификацию структуры системных таблиц. Этот параметр используется командой <command>initdb</command>. Задать этот параметр можно только при запуске сервера.

source: <primary><varname>ignore_system_indexes</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>ignore_system_indexes</varname></primary>

source: Ignore system indexes when reading system tables (but still update the indexes when modifying the tables). This is useful when recovering from damaged system indexes. This parameter cannot be changed after session start.
ru: Отключает использование индексов при чтении системных таблиц (при этом индексы всё же будут изменяться при записи в эти таблицы). Это полезно для восстановления работоспособности при повреждённых системных индексах. Этот параметр нельзя изменить после запуска сеанса.

source: <primary><varname>post_auth_delay</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>post_auth_delay</varname></primary>

source: If nonzero, a delay of this many seconds occurs when a new server process is started, after it conducts the authentication procedure. This is intended to give developers an opportunity to attach to the server process with a debugger. This parameter cannot be changed after session start.
ru: При ненулевом значении этот параметр задаёт задержку (в секундах) при запуске нового серверного процесса после выполнения процедуры аутентификации. Он предназначен для того, чтобы разработчики имели возможность подключить отладчик к серверному процессу. Этот параметр нельзя изменить после начала сеанса.

source: <primary><varname>pre_auth_delay</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>pre_auth_delay</varname></primary>

source: If nonzero, a delay of this many seconds occurs just after a new server process is forked, before it conducts the authentication procedure. This is intended to give developers an opportunity to attach to the server process with a debugger to trace down misbehavior in authentication. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: При ненулевом значении этот параметр задаёт задержку (в секундах), добавляемую сразу после порождения нового серверного процесса, до выполнения процедуры аутентификации. Он предназначен для того, чтобы разработчики имели возможность подключить отладчик к серверному процессу при решении проблем с аутентификацией. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>trace_notify</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>trace_notify</varname></primary>

source: Generates a great amount of debugging output for the <command>LISTEN</command> and <command>NOTIFY</command> commands. <xref linkend="guc-client-min-messages"/> or <xref linkend="guc-log-min-messages"/> must be <literal>DEBUG1</literal> or lower to send this output to the client or server logs, respectively.
ru: Включает вывод очень подробной отладочной информации при выполнении команд <command>LISTEN</command> и <command>NOTIFY</command>. Чтобы эти сообщения передавались клиенту или в журнал сервера, параметр <xref linkend="guc-client-min-messages"/> или <xref linkend="guc-log-min-messages"/>, соответственно, должен иметь значение <literal>DEBUG1</literal> или ниже.

source: <primary><varname>trace_recovery_messages</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>trace_recovery_messages</varname></primary>

source: Enables logging of recovery-related debugging output that otherwise would not be logged. This parameter allows the user to override the normal setting of <xref linkend="guc-log-min-messages"/>, but only for specific messages. This is intended for use in debugging Hot Standby. Valid values are <literal>DEBUG5</literal>, <literal>DEBUG4</literal>, <literal>DEBUG3</literal>, <literal>DEBUG2</literal>, <literal>DEBUG1</literal>, and <literal>LOG</literal>. The default, <literal>LOG</literal>, does not affect logging decisions at all. The other values cause recovery-related debug messages of that priority or higher to be logged as though they had <literal>LOG</literal> priority; for common settings of <varname>log_min_messages</varname> this results in unconditionally sending them to the server log. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Включает вывод в журнал отладочных сообщений, связанных с восстановлением, которые иначе не выводятся. Этот параметр позволяет пользователю переопределить обычное значение <xref linkend="guc-log-min-messages"/>, но только для специфических сообщений. Он предназначен для отладки режима горячего резерва. Допустимые значения: <literal>DEBUG5</literal>, <literal>DEBUG4</literal>, <literal>DEBUG3</literal>, <literal>DEBUG2</literal>, <literal>DEBUG1</literal> и <literal>LOG</literal>. Значение по умолчанию, <literal>LOG</literal>, никак не влияет на запись этих сообщений в журнал. С другими значениями отладочные сообщения, связанные с восстановлением, имеющие заданный приоритет или выше, выводятся, как если бы они имели приоритет <literal>LOG</literal>; при стандартных значениях <varname>log_min_messages</varname> это означает, что они будут фиксироваться в журнале сервера. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.
