Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: <command>VACUUM</command> performs an aggressive scan if the table's <structname>pg_class</structname>.<structfield>relfrozenxid</structfield> field has reached the age specified by this setting. An aggressive scan differs from a regular <command>VACUUM</command> in that it visits every page that might contain unfrozen XIDs or MXIDs, not just those that might contain dead tuples. The default is 150 million transactions. Although users can set this value anywhere from zero to two billions, <command>VACUUM</command> will silently limit the effective value to 95% of <xref linkend="guc-autovacuum-freeze-max-age"/>, so that a periodical manual <command>VACUUM</command> has a chance to run before an anti-wraparound autovacuum is launched for the table. For more information see <xref linkend="vacuum-for-wraparound"/>.
ru: Задаёт максимальный возраст для поля <structname>pg_class</structname>.<structfield>relfrozenxid</structfield> таблицы, при достижении которого <command>VACUUM</command> будет производить агрессивное сканирование. Агрессивное сканирование отличается от обычного сканирования <command>VACUUM</command> тем, что затрагивает все страницы, которые могут содержать незамороженные XID или MXID, а не только те, что могут содержать мёртвые кортежи. Значение по умолчанию — 150 миллионов транзакций. Хотя пользователи могут задать любое значение от нуля до двух миллиардов, в <command>VACUUM</command> введён внутренний предел для действующего значения, равный 95% от <xref linkend="guc-autovacuum-freeze-max-age"/>, чтобы периодически запускаемая вручную команда <command>VACUUM</command> имела шансы выполниться, прежде чем для таблицы будет запущена автоочистка для предотвращения зацикливания. За дополнительными сведениями обратитесь к <xref remap="3" linkend="vacuum-for-wraparound"/>.

source: <primary><varname>vacuum_freeze_min_age</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>vacuum_freeze_min_age</varname></primary>

source: Specifies the cutoff age (in transactions) that <command>VACUUM</command> should use to decide whether to freeze row versions while scanning a table. The default is 50 million transactions. Although users can set this value anywhere from zero to one billion, <command>VACUUM</command> will silently limit the effective value to half the value of <xref linkend="guc-autovacuum-freeze-max-age"/>, so that there is not an unreasonably short time between forced autovacuums. For more information see <xref linkend="vacuum-for-wraparound"/>.
ru: Задаёт возраст для отсечки (в транзакциях), при достижении которого команда <command>VACUUM</command> должна замораживать версии строк при сканировании таблицы. Значение по умолчанию — 50 миллионов транзакций. Хотя пользователи могут задать любое значение от нуля до одного миллиарда, в <command>VACUUM</command> введён внутренний предел для действующего значения, равный половине <xref linkend="guc-autovacuum-freeze-max-age"/>, чтобы принудительная автоочистка выполнялась не слишком часто. За дополнительными сведениями обратитесь к <xref remap="3" linkend="vacuum-for-wraparound"/>.

source: <primary><varname>vacuum_multixact_freeze_table_age</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>vacuum_multixact_freeze_table_age</varname></primary>

source: <command>VACUUM</command> performs an aggressive scan if the table's <structname>pg_class</structname>.<structfield>relminmxid</structfield> field has reached the age specified by this setting. An aggressive scan differs from a regular <command>VACUUM</command> in that it visits every page that might contain unfrozen XIDs or MXIDs, not just those that might contain dead tuples. The default is 150 million multixacts. Although users can set this value anywhere from zero to two billions, <command>VACUUM</command> will silently limit the effective value to 95% of <xref linkend="guc-autovacuum-multixact-freeze-max-age"/>, so that a periodical manual <command>VACUUM</command> has a chance to run before an anti-wraparound is launched for the table. For more information see <xref linkend="vacuum-for-multixact-wraparound"/>.
ru: Задаёт максимальный возраст для поля <structname>pg_class</structname>.<structfield>relminmxid</structfield> таблицы, при достижении которого команда <command>VACUUM</command> будет выполнять агрессивное сканирование. Агрессивное сканирование отличается от обычного сканирования <command>VACUUM</command> тем, что затрагивает все страницы, которые могут содержать незамороженные XID или MXID, а не только те, что могут содержать мёртвые кортежи. Значение по умолчанию — 150 миллионов мультитранзакций. Хотя пользователи могут задать любое значение от нуля до двух миллиардов, в <command>VACUUM</command> введён внутренний предел для действующего значения, равный 95% от <xref linkend="guc-autovacuum-multixact-freeze-max-age"/>, чтобы периодически запускаемая вручную команда <command>VACUUM</command> имела шансы выполниться, прежде чем для таблицы будет запущена автоочистка для предотвращения зацикливания. За дополнительными сведениями обратитесь к <xref remap="3" linkend="vacuum-for-multixact-wraparound"/>.

source: <primary><varname>vacuum_multixact_freeze_min_age</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>vacuum_multixact_freeze_min_age</varname></primary>

source: Specifies the cutoff age (in multixacts) that <command>VACUUM</command> should use to decide whether to replace multixact IDs with a newer transaction ID or multixact ID while scanning a table. The default is 5 million multixacts. Although users can set this value anywhere from zero to one billion, <command>VACUUM</command> will silently limit the effective value to half the value of <xref linkend="guc-autovacuum-multixact-freeze-max-age"/>, so that there is not an unreasonably short time between forced autovacuums. For more information see <xref linkend="vacuum-for-multixact-wraparound"/>.
ru: Задаёт возраст для отсечки (в мультитранзакциях), при достижении которого команда <command>VACUUM</command> должна заменять идентификаторы мультитранзакций новыми идентификаторами транзакций или мультитранзакций при сканировании таблицы. Значение по умолчанию — 5 миллионов мультитранзакций. Хотя пользователи могут задать любое значение от нуля до одного миллиарда, в <command>VACUUM</command> введён внутренний предел для действующего значения, равный половине <xref linkend="guc-autovacuum-multixact-freeze-max-age"/>, чтобы принудительная автоочистка не выполнялась слишком часто. За дополнительными сведениями обратитесь к <xref remap="3" linkend="vacuum-for-multixact-wraparound"/>.

source: <primary><varname>bytea_output</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>bytea_output</varname></primary>

source: Sets the output format for values of type <type>bytea</type>. Valid values are <literal>hex</literal> (the default) and <literal>escape</literal> (the traditional PostgreSQL format). See <xref linkend="datatype-binary"/> for more information. The <type>bytea</type> type always accepts both formats on input, regardless of this setting.
ru: Задаёт выходной формат для значения типа <type>bytea</type>. Это может быть формат <literal>hex</literal> (по умолчанию) или <literal>escape</literal> (традиционный формат PostgreSQL). За дополнительными сведениями обратитесь к <xref remap="3" linkend="datatype-binary"/>. Входные значения <type>bytea</type> воспринимаются в обоих форматах, независимо от данного параметра.

source: <primary><varname>xmlbinary</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>xmlbinary</varname></primary>

source: Sets how binary values are to be encoded in XML. This applies for example when <type>bytea</type> values are converted to XML by the functions <function>xmlelement</function> or <function>xmlforest</function>. Possible values are <literal>base64</literal> and <literal>hex</literal>, which are both defined in the XML Schema standard. The default is <literal>base64</literal>. For further information about XML-related functions, see <xref linkend="functions-xml"/>.
ru: Задаёт способ кодирования двоичных данных в XML. Это кодирование применяется, например, когда значения <type>bytea</type> преобразуются в XML функциями <function>xmlelement</function> или <function>xmlforest</function>. Допустимые варианты, определённые в стандарте XML-схем: <literal>base64</literal> и <literal>hex</literal>. Значение по умолчанию — <literal>base64</literal>. Чтобы узнать больше о функциях для работы с XML, обратитесь к <xref remap="3" linkend="functions-xml"/>.

source: The actual choice here is mostly a matter of taste, constrained only by possible restrictions in client applications. Both methods support all possible values, although the hex encoding will be somewhat larger than the base64 encoding.
ru: Конечный выбор в основном дело вкуса, ограничения могут накладываться только клиентскими приложениями. Оба метода поддерживают все возможные значения, хотя результат кодирования в base64 немного компактнее шестнадцатеричного вида (hex).

source: <primary><varname>xmloption</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>xmloption</varname></primary>

source: Sets whether <literal>DOCUMENT</literal> or <literal>CONTENT</literal> is implicit when converting between XML and character string values. See <xref linkend="datatype-xml"/> for a description of this. Valid values are <literal>DOCUMENT</literal> and <literal>CONTENT</literal>. The default is <literal>CONTENT</literal>.
ru: Задаёт подразумеваемый по умолчанию тип преобразования между XML и символьными строками (<literal>DOCUMENT</literal> или <literal>CONTENT</literal>). За описанием этого преобразования обратитесь к <xref remap="3" linkend="datatype-xml"/>. Значение по умолчанию — <literal>CONTENT</literal> (кроме него допускается значение <literal>DOCUMENT</literal>).

source: According to the SQL standard, the command to set this option is <synopsis> SET XML OPTION { DOCUMENT | CONTENT }; </synopsis> This syntax is also available in PostgreSQL.
ru: Согласно стандарту SQL этот параметр должен задаваться командой <synopsis> SET XML OPTION { DOCUMENT | CONTENT }; </synopsis> Этот синтаксис тоже поддерживается в PostgreSQL.

source: <primary><varname>gin_pending_list_limit</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>gin_pending_list_limit</varname></primary>

source: Sets the maximum size of the GIN pending list which is used when <literal>fastupdate</literal> is enabled. If the list grows larger than this maximum size, it is cleaned up by moving the entries in it to the main GIN data structure in bulk. The default is four megabytes (<literal>4MB</literal>). This setting can be overridden for individual GIN indexes by changing index storage parameters. See <xref linkend="gin-fast-update"/> and <xref linkend="gin-tips"/> for more information.
ru: Задаёт максимальный размер очереди записей GIN, которая используется, когда включён режим <literal>fastupdate</literal>. Если размер очереди превышает заданный предел, записи из неё массово переносятся в основную структуру данных GIN и очередь очищается. Размер по умолчанию — четыре мегабайта (<literal>4MB</literal>). Этот предел можно переопределить для отдельных индексов GIN, изменив их параметры хранения. За дополнительными сведениями обратитесь к <xref remap="3" linkend="gin-fast-update"/> и <xref remap="3" linkend="gin-tips"/>.

source: Locale and Formatting
ru: Языковая среда и форматы

source: <primary><varname>DateStyle</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>DateStyle</varname></primary>

source: Sets the display format for date and time values, as well as the rules for interpreting ambiguous date input values. For historical reasons, this variable contains two independent components: the output format specification (<literal>ISO</literal>, <literal>Postgres</literal>, <literal>SQL</literal>, or <literal>German</literal>) and the input/output specification for year/month/day ordering (<literal>DMY</literal>, <literal>MDY</literal>, or <literal>YMD</literal>). These can be set separately or together. The keywords <literal>Euro</literal> and <literal>European</literal> are synonyms for <literal>DMY</literal>; the keywords <literal>US</literal>, <literal>NonEuro</literal>, and <literal>NonEuropean</literal> are synonyms for <literal>MDY</literal>. See <xref linkend="datatype-datetime"/> for more information. The built-in default is <literal>ISO, MDY</literal>, but <application>initdb</application> will initialize the configuration file with a setting that corresponds to the behavior of the chosen <varname>lc_time</varname> locale.
ru: Задаёт формат вывода значений даты и времени, а также правила интерпретации неоднозначных значений даты. По историческим причинам эта переменная содержит два независимых компонента: указание выходного формата (<literal>ISO</literal>, <literal>Postgres</literal>, <literal>SQL</literal> и <literal>German</literal>) и указание порядка год(Y)/месяц(M)/день(D) для вводимых и выводимых значений (<literal>DMY</literal>, <literal>MDY</literal> или <literal>YMD</literal>). Эти два компонента могут задаваться по отдельности или вместе. Ключевые слова <literal>Euro</literal> и <literal>European</literal> являются синонимами <literal>DMY</literal>, а ключевые слова <literal>US</literal>, <literal>NonEuro</literal> и <literal>NonEuropean</literal> — синонимы <literal>MDY</literal>. За дополнительными сведениями обратитесь к <xref remap="3" linkend="datatype-datetime"/>. Встроенное значение по умолчанию — <literal>ISO, MDY</literal>, но <application>initdb</application> при инициализации записывает в файл конфигурации значение, соответствующее выбранной локали <varname>lc_time</varname>.

source: <primary><varname>IntervalStyle</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>IntervalStyle</varname></primary>

source: Sets the display format for interval values. The value <literal>sql_standard</literal> will produce output matching <acronym>SQL</acronym> standard interval literals. The value <literal>postgres</literal> (which is the default) will produce output matching <productname>PostgreSQL</productname> releases prior to 8.4 when the <xref linkend="guc-datestyle"/> parameter was set to <literal>ISO</literal>. The value <literal>postgres_verbose</literal> will produce output matching <productname>PostgreSQL</productname> releases prior to 8.4 when the <varname>DateStyle</varname> parameter was set to non-<literal>ISO</literal> output. The value <literal>iso_8601</literal> will produce output matching the time interval <quote>format with designators</quote> defined in section 4.4.3.2 of ISO 8601.
ru: Задаёт формат вывода для значений-интервалов. В формате <literal>sql_standard</literal> интервал выводится в виде, установленном стандартом <acronym>SQL</acronym>. В формате <literal>postgres</literal> (выбранном по умолчанию) интервал выводится в виде, применявшемся в <productname>PostgreSQL</productname> до версии 8.4, когда параметр <xref linkend="guc-datestyle"/> имел значение <literal>ISO</literal>. В формате <literal>postgres_verbose</literal> интервал выводится в виде, применявшемся в <productname>PostgreSQL</productname> до версии 8.4, когда параметр <varname>DateStyle</varname> имел значение не <literal>ISO</literal>. В формате <literal>iso_8601</literal> выводимая строка будет соответствовать <quote>формату с кодами</quote>, определённому в разделе 4.4.3.2 стандарта ISO 8601.

source: The <varname>IntervalStyle</varname> parameter also affects the interpretation of ambiguous interval input. See <xref linkend="datatype-interval-input"/> for more information.
ru: На интерпретацию неоднозначных вводимых данных также влияет параметр <varname>IntervalStyle</varname>. За дополнительными сведениями обратитесь к <xref remap="3" linkend="datatype-interval-input"/>.

source: <primary><varname>TimeZone</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>TimeZone</varname></primary>

source: <primary>time zone</primary>
ru: <primary>часовой пояс</primary>

source: Sets the time zone for displaying and interpreting time stamps. The built-in default is <literal>GMT</literal>, but that is typically overridden in <filename>postgresql.conf</filename>; <application>initdb</application> will install a setting there corresponding to its system environment. See <xref linkend="datatype-timezones"/> for more information.
ru: Задаёт часовой пояс для вывода и ввода значений времени. Встроенное значение по умолчанию — <literal>GMT</literal>, но обычно оно переопределяется в <filename>postgresql.conf</filename>; <application>initdb</application> устанавливает в нём значение, соответствующее системному окружению. За дополнительными сведениями обратитесь к <xref remap="3" linkend="datatype-timezones"/>.

source: <primary><varname>timezone_abbreviations</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>timezone_abbreviations</varname></primary>

source: <primary>time zone names</primary>
ru: <primary>имена часовых поясов</primary>

source: Sets the collection of time zone abbreviations that will be accepted by the server for datetime input. The default is <literal>'Default'</literal>, which is a collection that works in most of the world; there are also <literal>'Australia'</literal> and <literal>'India'</literal>, and other collections can be defined for a particular installation. See <xref linkend="datetime-config-files"/> for more information.
ru: Задаёт набор сокращений часовых поясов, которые будут приниматься сервером во вводимых значениях даты и времени. Значение по умолчанию — <literal>'Default'</literal>, которое представляет набор основных сокращений, принятых в мире; допускаются также значения <literal>'Australia'</literal> и <literal>'India'</literal>, кроме них для конкретной инсталляции можно определить и другие наборы. За дополнительными сведениями обратитесь к <xref remap="3" linkend="datetime-config-files"/>.

source: <primary>significant digits</primary>
ru: <primary>значимые цифры</primary>

source: <primary>floating-point</primary> <secondary>display</secondary>
ru: <primary>число с плавающей точкой</primary> <secondary>отображение</secondary>

source: <primary><varname>extra_float_digits</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>extra_float_digits</varname></primary>

source: This parameter adjusts the number of digits displayed for floating-point values, including <type>float4</type>, <type>float8</type>, and geometric data types. The parameter value is added to the standard number of digits (<literal>FLT_DIG</literal> or <literal>DBL_DIG</literal> as appropriate). The value can be set as high as 3, to include partially-significant digits; this is especially useful for dumping float data that needs to be restored exactly. Or it can be set negative to suppress unwanted digits. See also <xref linkend="datatype-float"/>.
ru: Этот параметр корректирует число цифр, выводимых при отображении чисел с плавающей точкой, включая типы <type>float4</type>, <type>float8</type> и геометрические типы. Значение параметра добавляется к стандартному числу цифр (<literal>FLT_DIG</literal> или <literal>DBL_DIG</literal>, в зависимости от типа). Значение может быть положительным, до 3, и тогда в выводе добавляются частично значимые цифры (это особенно полезно для выгрузки чисел с плавающей точкой, которые должны быть восстановлены точно), или отрицательным, тогда в выводе будут подавляться нежелательные цифры. См. также <xref remap="4" linkend="datatype-float"/>.

source: <primary><varname>client_encoding</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>client_encoding</varname></primary>

source: <primary>character set</primary>
ru: <primary>набор символов</primary>

source: Sets the client-side encoding (character set). The default is to use the database encoding. The character sets supported by the <productname>PostgreSQL</productname> server are described in <xref linkend="multibyte-charset-supported"/>.
ru: Задаёт кодировку (набор символов) на стороне клиента. По умолчанию выбирается кодировка базы данных. Наборы символов, которые поддерживает сервер <productname>PostgreSQL</productname>, перечислены в <xref remap="6" linkend="multibyte-charset-supported"/>.

source: <primary><varname>lc_messages</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>lc_messages</varname></primary>

source: Sets the language in which messages are displayed. Acceptable values are system-dependent; see <xref linkend="locale"/> for more information. If this variable is set to the empty string (which is the default) then the value is inherited from the execution environment of the server in a system-dependent way.
ru: Устанавливает язык выводимых сообщений. Набор допустимых значений зависит от системы; за дополнительными сведениями обратитесь к <xref remap="3" linkend="locale"/>. Если эта переменная определена как пустая строка (по умолчанию), то действующее значение получается из среды выполнения сервера, в зависимости от системы.

source: On some systems, this locale category does not exist. Setting this variable will still work, but there will be no effect. Also, there is a chance that no translated messages for the desired language exist. In that case you will continue to see the English messages.
ru: В некоторых системах такая категория локали отсутствует, так что даже если задать значение этой переменной, действовать оно не будет. Также может оказаться, что переведённые сообщения для запрошенного языка отсутствуют. В этих случаях вы по-прежнему будете получать сообщения на английском языке.

source: Only superusers can change this setting, because it affects the messages sent to the server log as well as to the client, and an improper value might obscure the readability of the server logs.
ru: Изменить этот параметр могут только суперпользователи. Он влияет и на сообщения, которые сервер передаёт клиентам, и на те, что записываются в журнал, поэтому неподходящее значение может сделать серверные журналы нечитаемыми.

source: <primary><varname>lc_monetary</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>lc_monetary</varname></primary>

source: Sets the locale to use for formatting monetary amounts, for example with the <function>to_char</function> family of functions. Acceptable values are system-dependent; see <xref linkend="locale"/> for more information. If this variable is set to the empty string (which is the default) then the value is inherited from the execution environment of the server in a system-dependent way.
ru: Устанавливает локаль для форматирования денежных сумм, например с использованием функций семейства <function>to_char</function>. Набор допустимых значений зависит от системы; за дополнительными сведениями обратитесь к <xref remap="3" linkend="locale"/>. Если эта переменная определена как пустая строка (по умолчанию), то действующее значение получается из среды выполнения сервера, в зависимости от системы.

source: <primary><varname>lc_numeric</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>lc_numeric</varname></primary>
