Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: Specifies the maximum amount of disk space that a process can use for temporary files, such as sort and hash temporary files, or the storage file for a held cursor. A transaction attempting to exceed this limit will be canceled. The value is specified in kilobytes, and <literal>-1</literal> (the default) means no limit. Only superusers can change this setting.
ru: Задаёт максимальный объём дискового пространства, который сможет использовать один процесс для временных файлов, например, при сортировке и хешировании, или для сохранения удерживаемого курсора. Транзакция, которая попытается превысить этот предел, будет отменена. Этот параметр задаётся в килобайтах, а значение <literal>-1</literal> (по умолчанию) означает, что предел отсутствует. Изменить этот параметр могут только суперпользователи.

source: This setting constrains the total space used at any instant by all temporary files used by a given <productname>PostgreSQL</productname> process. It should be noted that disk space used for explicit temporary tables, as opposed to temporary files used behind-the-scenes in query execution, does <emphasis>not</emphasis> count against this limit.
ru: Этот параметр ограничивает общий объём, который могут занимать в момент времени все временные файлы, задействованные в данном процессе <productname>PostgreSQL</productname>. Следует отметить, что при этом учитывается только место, занимаемое явно создаваемыми временными таблицами; на временные файлы, которые создаются неявно при выполнении запроса, это ограничение <emphasis>не</emphasis> распространяется.

source: Kernel Resource Usage
ru: Использование ресурсов ядра

source: <primary><varname>max_files_per_process</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_files_per_process</varname></primary>

source: Sets the maximum number of simultaneously open files allowed to each server subprocess. The default is one thousand files. If the kernel is enforcing a safe per-process limit, you don't need to worry about this setting. But on some platforms (notably, most BSD systems), the kernel will allow individual processes to open many more files than the system can actually support if many processes all try to open that many files. If you find yourself seeing <quote>Too many open files</quote> failures, try reducing this setting. This parameter can only be set at server start.
ru: Задаёт максимальное число файлов, которые могут быть одновременно открыты каждым серверным подпроцессом. Значение по умолчанию — 1000 файлов. Если ядро реализует безопасное ограничение по процессам, об этом параметре можно не беспокоиться. Но на некоторых платформах (а именно, в большинстве систем BSD) ядро позволяет отдельному процессу открыть больше файлов, чем могут открыть несколько процессов одновременно. Если вы столкнётесь с ошибками <quote>Too many open files</quote> (Слишком много открытых файлов), попробуйте уменьшить это число. Задать этот параметр можно только при запуске сервера.

source: Cost-based Vacuum Delay
ru: Задержка очистки по стоимости

source: During the execution of <xref linkend="sql-vacuum"/> and <xref linkend="sql-analyze"/> commands, the system maintains an internal counter that keeps track of the estimated cost of the various I/O operations that are performed. When the accumulated cost reaches a limit (specified by <varname>vacuum_cost_limit</varname>), the process performing the operation will sleep for a short period of time, as specified by <varname>vacuum_cost_delay</varname>. Then it will reset the counter and continue execution.
ru: Во время выполнения команд <xref linkend="sql-vacuum"/> и <xref linkend="sql-analyze"/> система ведёт внутренний счётчик, в котором суммирует оцениваемую стоимость различных выполняемых операций ввода/вывода. Когда накопленная стоимость превышает предел (<varname>vacuum_cost_limit</varname>), процесс, выполняющий эту операцию, засыпает на некоторое время (<varname>vacuum_cost_delay</varname>). Затем счётчик сбрасывается и процесс продолжается.

source: The intent of this feature is to allow administrators to reduce the I/O impact of these commands on concurrent database activity. There are many situations where it is not important that maintenance commands like <command>VACUUM</command> and <command>ANALYZE</command> finish quickly; however, it is usually very important that these commands do not significantly interfere with the ability of the system to perform other database operations. Cost-based vacuum delay provides a way for administrators to achieve this.
ru: Данный подход реализован для того, чтобы администраторы могли снизить влияние этих команд на параллельную работу с базой, за счёт уменьшения нагрузки на подсистему ввода-вывода. Очень часто не имеет значения, насколько быстро выполнятся команды обслуживания (например, <command>VACUUM</command> и <command>ANALYZE</command>), но очень важно, чтобы они как можно меньше влияли на выполнение других операций с базой данных. Администраторы имеют возможность управлять этим, настраивая задержку очистки по стоимости.

source: This feature is disabled by default for manually issued <command>VACUUM</command> commands. To enable it, set the <varname>vacuum_cost_delay</varname> variable to a nonzero value.
ru: По умолчанию этот режим отключён для выполняемых вручную команд <command>VACUUM</command>. Чтобы включить его, нужно установить в <varname>vacuum_cost_delay</varname> ненулевое значение.

source: <primary><varname>vacuum_cost_delay</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>vacuum_cost_delay</varname></primary>

source: The length of time, in milliseconds, that the process will sleep when the cost limit has been exceeded. The default value is zero, which disables the cost-based vacuum delay feature. Positive values enable cost-based vacuuming. Note that on many systems, the effective resolution of sleep delays is 10 milliseconds; setting <varname>vacuum_cost_delay</varname> to a value that is not a multiple of 10 might have the same results as setting it to the next higher multiple of 10.
ru: Продолжительность времени, в миллисекундах, в течение которого будет простаивать процесс, превысивший предел стоимости. По умолчанию его значение равно нулю, то есть задержка очистки отсутствует. При положительных значениях интенсивность очистки будет зависеть от стоимости. Заметьте, что во многих системах разрешение таймера составляет 10 мс, поэтому если задать в <varname>vacuum_cost_delay</varname> значение, не кратное 10, фактически будет получен тот же результат, что и со следующим за ним кратным 10.

source: When using cost-based vacuuming, appropriate values for <varname>vacuum_cost_delay</varname> are usually quite small, perhaps 10 or 20 milliseconds. Adjusting vacuum's resource consumption is best done by changing the other vacuum cost parameters.
ru: При настройке интенсивности очистки для <varname>vacuum_cost_delay</varname> обычно выбираются довольно небольшие значения, например 10 или 20 миллисекунд. Чтобы точнее ограничить потребление ресурсов при очистке, лучше всего изменять другие параметры стоимости очистки.

source: <primary><varname>vacuum_cost_page_hit</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>vacuum_cost_page_hit</varname></primary>

source: The estimated cost for vacuuming a buffer found in the shared buffer cache. It represents the cost to lock the buffer pool, lookup the shared hash table and scan the content of the page. The default value is one.
ru: Примерная стоимость очистки буфера, оказавшегося в общем кеше. Это подразумевает блокировку пула буферов, поиск в хеш-таблице и сканирование содержимого страницы. По умолчанию этот параметр равен одному.

source: <primary><varname>vacuum_cost_page_miss</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>vacuum_cost_page_miss</varname></primary>

source: The estimated cost for vacuuming a buffer that has to be read from disk. This represents the effort to lock the buffer pool, lookup the shared hash table, read the desired block in from the disk and scan its content. The default value is 10.
ru: Примерная стоимость очистки буфера, который нужно прочитать с диска. Это подразумевает блокировку пула буферов, поиск в хеш-таблице, чтение требуемого блока с диска и сканирование его содержимого. По умолчанию этот параметр равен 10.

source: <primary><varname>vacuum_cost_page_dirty</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>vacuum_cost_page_dirty</varname></primary>

source: The estimated cost charged when vacuum modifies a block that was previously clean. It represents the extra I/O required to flush the dirty block out to disk again. The default value is 20.
ru: Примерная стоимость очистки, при которой изменяется блок, не модифицированный ранее. В неё включается дополнительная стоимость ввода/вывода, связанная с записью изменённого блока на диск. По умолчанию этот параметр равен 20.

source: <primary><varname>vacuum_cost_limit</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>vacuum_cost_limit</varname></primary>

source: The accumulated cost that will cause the vacuuming process to sleep. The default value is 200.
ru: Общая стоимость, при накоплении которой процесс очистки будет засыпать. По умолчанию этот параметр равен 200.

source: There are certain operations that hold critical locks and should therefore complete as quickly as possible. Cost-based vacuum delays do not occur during such operations. Therefore it is possible that the cost accumulates far higher than the specified limit. To avoid uselessly long delays in such cases, the actual delay is calculated as <varname>vacuum_cost_delay</varname> * <varname>accumulated_balance</varname> / <varname>vacuum_cost_limit</varname> with a maximum of <varname>vacuum_cost_delay</varname> * 4.
ru: Некоторые операции устанавливают критические блокировки и поэтому должны завершаться как можно быстрее. Во время таких операций задержка очистки по стоимости не осуществляется, так что накопленная за это время стоимость может намного превышать установленный предел. Во избежание ненужных длительных задержек в таких случаях, фактическая задержка вычисляется по формуле <varname>vacuum_cost_delay</varname> * <varname>accumulated_balance</varname> / <varname>vacuum_cost_limit</varname> и ограничивается максимумом, равным <varname>vacuum_cost_delay</varname> * 4.

source: Background Writer
ru: Фоновая запись

source: There is a separate server process called the <firstterm>background writer</firstterm>, whose function is to issue writes of <quote>dirty</quote> (new or modified) shared buffers. It writes shared buffers so server processes handling user queries seldom or never need to wait for a write to occur. However, the background writer does cause a net overall increase in I/O load, because while a repeatedly-dirtied page might otherwise be written only once per checkpoint interval, the background writer might write it several times as it is dirtied in the same interval. The parameters discussed in this subsection can be used to tune the behavior for local needs.
ru: В числе специальных процессов сервера есть процесс <firstterm>фоновой записи</firstterm>, задача которого — осуществлять запись <quote>грязных</quote> (новых или изменённых) общих буферов на диск. Он старается записывать данные из буферов так, чтобы обычным серверным процессам, обрабатывающим запросы, не приходилось ждать записи или это ожидание было минимальным. Однако процесс фоновой записи увеличивает общую нагрузку на подсистему ввода/вывода, так как он может записывать неоднократно изменяемую страницу при каждом изменении, тогда как она может быть записана всего раз в контрольной точке. Параметры, рассматриваемые в данном подразделе, позволяют настроить поведение фоновой записи для конкретных нужд.

source: <primary><varname>bgwriter_delay</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>bgwriter_delay</varname></primary>

source: Specifies the delay between activity rounds for the background writer. In each round the writer issues writes for some number of dirty buffers (controllable by the following parameters). It then sleeps for <varname>bgwriter_delay</varname> milliseconds, and repeats. When there are no dirty buffers in the buffer pool, though, it goes into a longer sleep regardless of <varname>bgwriter_delay</varname>. The default value is 200 milliseconds (<literal>200ms</literal>). Note that on many systems, the effective resolution of sleep delays is 10 milliseconds; setting <varname>bgwriter_delay</varname> to a value that is not a multiple of 10 might have the same results as setting it to the next higher multiple of 10. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Задаёт задержку между раундами активности процесса фоновой записи. Во время раунда этот процесс осуществляет запись некоторого количество загрязнённых буферов (это настраивается следующими параметрами). Затем он засыпает на время <varname>bgwriter_delay</varname> (задаваемое в миллисекундах), и всё повторяется снова. Однако если в пуле не остаётся загрязнённых буферов, он может быть неактивен более длительное время. По умолчанию этот параметр равен 200 миллисекундам (<literal>200ms</literal>). Заметьте, что во многих системах разрешение таймера составляет 10 мс, поэтому если задать в <varname>bgwriter_delay</varname> значение, не кратное 10, фактически будет получен тот же результат, что и со следующим за ним кратным 10. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>bgwriter_lru_maxpages</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>bgwriter_lru_maxpages</varname></primary>

source: In each round, no more than this many buffers will be written by the background writer. Setting this to zero disables background writing. (Note that checkpoints, which are managed by a separate, dedicated auxiliary process, are unaffected.) The default value is 100 buffers. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Задаёт максимальное число буферов, которое сможет записать процесс фоновой записи за раунд активности. При нулевом значении фоновая запись отключается. (Учтите, что на контрольные точки, которые управляются отдельным вспомогательным процессом, это не влияет.) По умолчанию значение этого параметра — 100 буферов. Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>bgwriter_lru_multiplier</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>bgwriter_lru_multiplier</varname></primary>

source: The number of dirty buffers written in each round is based on the number of new buffers that have been needed by server processes during recent rounds. The average recent need is multiplied by <varname>bgwriter_lru_multiplier</varname> to arrive at an estimate of the number of buffers that will be needed during the next round. Dirty buffers are written until there are that many clean, reusable buffers available. (However, no more than <varname>bgwriter_lru_maxpages</varname> buffers will be written per round.) Thus, a setting of 1.0 represents a <quote>just in time</quote> policy of writing exactly the number of buffers predicted to be needed. Larger values provide some cushion against spikes in demand, while smaller values intentionally leave writes to be done by server processes. The default is 2.0. This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Число загрязнённых буферов, записываемых в очередном раунде, зависит от того, сколько новых буферов требовалось серверным процессам в предыдущих раундах. Средняя недавняя потребность умножается на <varname>bgwriter_lru_multiplier</varname> и предполагается, что именно столько буферов потребуется на следующем раунде. Процесс фоновой записи будет записывать на диск и освобождать буферы, пока число свободных буферов не достигнет целевого значения. (При этом число буферов, записываемых за раунд, ограничивается сверху параметром <varname>bgwriter_lru_maxpages</varname>.) Таким образом, со множителем, равным 1.0, записывается ровно столько буферов, сколько требуется по предположению (<quote>точно по плану</quote>). Увеличение этого множителя даёт некоторую страховку от резких скачков потребностей, тогда как уменьшение отражает намерение оставить некоторый объём записи для серверных процессов. По умолчанию он равен 2.0. Этот параметр можно установить только в файле <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: <primary><varname>bgwriter_flush_after</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>bgwriter_flush_after</varname></primary>

source: Whenever more than <varname>bgwriter_flush_after</varname> bytes have been written by the bgwriter, attempt to force the OS to issue these writes to the underlying storage. Doing so will limit the amount of dirty data in the kernel's page cache, reducing the likelihood of stalls when an fsync is issued at the end of a checkpoint, or when the OS writes data back in larger batches in the background. Often that will result in greatly reduced transaction latency, but there also are some cases, especially with workloads that are bigger than <xref linkend="guc-shared-buffers"/>, but smaller than the OS's page cache, where performance might degrade. This setting may have no effect on some platforms. The valid range is between <literal>0</literal>, which disables forced writeback, and <literal>2MB</literal>. The default is <literal>512kB</literal> on Linux, <literal>0</literal> elsewhere. (If <symbol>BLCKSZ</symbol> is not 8kB, the default and maximum values scale proportionally to it.) This parameter can only be set in the <filename>postgresql.conf</filename> file or on the server command line.
ru: Когда процессом фоновой записи записывается больше чем <varname>bgwriter_flush_after</varname> байт, сервер даёт указание ОС произвести запись этих данных в нижележащее хранилище. Это ограничивает объём &laquo;грязных&raquo; данных в страничном кеше ядра и уменьшает вероятность затормаживания при выполнении fsync в конце контрольной точки или когда ОС сбрасывает данные на диск большими блоками в фоне. Часто это значительно уменьшает задержки транзакций, но бывают ситуации, особенно когда объём рабочей нагрузки больше <xref linkend="guc-shared-buffers"/>, но меньше страничного кеша ОС, когда производительность может упасть. Этот параметр действует не на всех платформах. Он может принимать значение от <literal>0</literal> (при этом управление отложенной записью отключается) до 2 Мбайт (<literal>2MB</literal>). Значение по умолчанию — <literal>512kB</literal> в Linux и <literal>0</literal> в других ОС. (Если <symbol>BLCKSZ</symbol> отличен от 8 Кбайт, значение по умолчанию и максимум корректируются пропорционально.) Задать этот параметр можно только в <filename>postgresql.conf</filename> или в командной строке при запуске сервера.

source: Smaller values of <varname>bgwriter_lru_maxpages</varname> and <varname>bgwriter_lru_multiplier</varname> reduce the extra I/O load caused by the background writer, but make it more likely that server processes will have to issue writes for themselves, delaying interactive queries.
ru: С маленькими значениями <varname>bgwriter_lru_maxpages</varname> и <varname>bgwriter_lru_multiplier</varname> уменьшается активность ввода/вывода со стороны процесса фоновой записи, но увеличивается вероятность того, что запись придётся производить непосредственно серверным процессам, что замедлит выполнение запросов.

source: Asynchronous Behavior
ru: Асинхронное поведение

source: <primary><varname>effective_io_concurrency</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>effective_io_concurrency</varname></primary>

source: Sets the number of concurrent disk I/O operations that <productname>PostgreSQL</productname> expects can be executed simultaneously. Raising this value will increase the number of I/O operations that any individual <productname>PostgreSQL</productname> session attempts to initiate in parallel. The allowed range is 1 to 1000, or zero to disable issuance of asynchronous I/O requests. Currently, this setting only affects bitmap heap scans.
ru: Задаёт допустимое число параллельных операций ввода/вывода, которое говорит <productname>PostgreSQL</productname> о том, сколько операций ввода/вывода могут быть выполнены одновременно. Чем больше это число, тем больше операций ввода/вывода будет пытаться выполнить параллельно <productname>PostgreSQL</productname> в отдельном сеансе. Допустимые значения лежат в интервале от 1 до 1000, а нулевое значение отключает асинхронные запросы ввода/вывода. В настоящее время этот параметр влияет только на сканирование по битовой карте.

source: For magnetic drives, a good starting point for this setting is the number of separate drives comprising a RAID 0 stripe or RAID 1 mirror being used for the database. (For RAID 5 the parity drive should not be counted.) However, if the database is often busy with multiple queries issued in concurrent sessions, lower values may be sufficient to keep the disk array busy. A value higher than needed to keep the disks busy will only result in extra CPU overhead. SSDs and other memory-based storage can often process many concurrent requests, so the best value might be in the hundreds.
ru: Для магнитных носителей хорошим начальным значением этого параметра будет число отдельных дисков, составляющих массив RAID 0 или RAID 1, в котором размещена база данных. (Для RAID 5 следует исключить один диск (как диск с чётностью).) Однако, если база данных часто обрабатывает множество запросов в различных сеансах, и при небольших значениях дисковый массив может быть полностью загружен. Если продолжать увеличивать это значение при полной загрузке дисков, это приведёт только к увеличению нагрузки на процессор. Диски SSD и другие виды хранилища в памяти часто могут обрабатывать множество параллельных запросов, так что оптимальным числом может быть несколько сотен.

source: Asynchronous I/O depends on an effective <function>posix_fadvise</function> function, which some operating systems lack. If the function is not present then setting this parameter to anything but zero will result in an error. On some operating systems (e.g., Solaris), the function is present but does not actually do anything.
ru: Асинхронный ввод/вывод зависит от эффективности функции <function>posix_fadvise</function>, которая отсутствует в некоторых операционных системах. В случае её отсутствия попытка задать для этого параметра любое ненулевое значение приведёт к ошибке. В некоторых системах (например, в Solaris), эта функция присутствует, но на самом деле ничего не делает.

source: The default is 1 on supported systems, otherwise 0. This value can be overridden for tables in a particular tablespace by setting the tablespace parameter of the same name (see <xref linkend="sql-altertablespace"/>).
ru: Значение по умолчанию равно 1 в системах, где это поддерживается, и 0 в остальных. Это значение можно переопределить для таблиц в определённом табличном пространстве, установив одноимённый параметр табличного пространства (см. <xref remap="4" linkend="sql-altertablespace"/>).
