Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/config.po
Languages: ru

source: Sets the locale to use for formatting numbers, for example with the <function>to_char</function> family of functions. Acceptable values are system-dependent; see <xref linkend="locale"/> for more information. If this variable is set to the empty string (which is the default) then the value is inherited from the execution environment of the server in a system-dependent way.
ru: Устанавливает локаль для форматирования чисел, например с использованием функций семейства <function>to_char</function>. Набор допустимых значений зависит от системы; за дополнительными сведениями обратитесь к <xref remap="3" linkend="locale"/>. Если эта переменная определена как пустая строка (по умолчанию), то действующее значение получается из среды выполнения сервера, в зависимости от системы.

source: <primary><varname>lc_time</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>lc_time</varname></primary>

source: Sets the locale to use for formatting dates and times, for example with the <function>to_char</function> family of functions. Acceptable values are system-dependent; see <xref linkend="locale"/> for more information. If this variable is set to the empty string (which is the default) then the value is inherited from the execution environment of the server in a system-dependent way.
ru: Устанавливает локаль для форматирования даты и времени, например с использованием функций семейства <function>to_char</function>. Набор допустимых значений зависит от системы; за дополнительными сведениями обратитесь к <xref remap="3" linkend="locale"/>. Если эта переменная определена как пустая строка (по умолчанию), то действующее значение получается из среды выполнения сервера, в зависимости от системы.

source: <primary><varname>default_text_search_config</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>default_text_search_config</varname></primary>

source: Selects the text search configuration that is used by those variants of the text search functions that do not have an explicit argument specifying the configuration. See <xref linkend="textsearch"/> for further information. The built-in default is <literal>pg_catalog.simple</literal>, but <application>initdb</application> will initialize the configuration file with a setting that corresponds to the chosen <varname>lc_ctype</varname> locale, if a configuration matching that locale can be identified.
ru: Выбирает конфигурацию текстового поиска для тех функций текстового поиска, которым не передаётся аргумент, явно указывающий конфигурацию. За дополнительной информацией обратитесь к <xref remap="3" linkend="textsearch"/>. Встроенное значение по умолчанию — <literal>pg_catalog.simple</literal>, но <application>initdb</application> при инициализации записывает в файл конфигурации сервера значение, соответствующее выбранной локали <varname>lc_ctype</varname>, если удастся найти такую конфигурацию текстового поиска.

source: Shared Library Preloading
ru: Предзагрузка разделяемых библиотек

source: Several settings are available for preloading shared libraries into the server, in order to load additional functionality or achieve performance benefits. For example, a setting of <literal>'$libdir/mylib'</literal> would cause <literal>mylib.so</literal> (or on some platforms, <literal>mylib.sl</literal>) to be preloaded from the installation's standard library directory. The differences between the settings are when they take effect and what privileges are required to change them.
ru: Для настройки предварительной загрузки разделяемых библиотек в память сервера, в целях подключения дополнительной функциональности или увеличения быстродействия, предназначены несколько параметров. Значения этих параметров задаются однотипно, например, со значением <literal>'$libdir/mylib'</literal> в память будет загружена <literal>mylib.so</literal> (или в некоторых ОС, <literal>mylib.sl</literal>) из стандартного каталога библиотек данной инсталляции сервера. Различаются эти параметры тем, когда они вступают в силу и какие права требуются для их изменения.

source: <productname>PostgreSQL</productname> procedural language libraries can be preloaded in this way, typically by using the syntax <literal>'$libdir/plXXX'</literal> where <literal>XXX</literal> is <literal>pgsql</literal>, <literal>perl</literal>, <literal>tcl</literal>, or <literal>python</literal>.
ru: Таким же образом можно загрузить библиотеки на процедурных языках <productname>PostgreSQL</productname>, обычно в виде <literal>'$libdir/plXXX'</literal>, где <literal>XXX</literal> — имя языка: <literal>pgsql</literal>, <literal>perl</literal>, <literal>tcl</literal> или <literal>python</literal>.

source: For each parameter, if more than one library is to be loaded, separate their names with commas. All library names are converted to lower case unless double-quoted.
ru: Если в любом из этих параметров требуется загрузить несколько библиотек, их имена нужно перечислять через запятую. Все имена библиотек переводятся в нижний регистр, если только они не заключены в двойные кавычки.

source: Only shared libraries specifically intended to be used with PostgreSQL can be loaded this way. Every PostgreSQL-supported library has a <quote>magic block</quote> that is checked to guarantee compatibility. For this reason, non-PostgreSQL libraries cannot be loaded in this way. You might be able to use operating-system facilities such as <envar>LD_PRELOAD</envar> for that.
ru: Этим способом можно загрузить только разделяемые библиотеки, предназначенные специально для использования с PostgreSQL. PostgreSQL при загрузке библиотеки проверяет наличие <quote>отличительного блока</quote> для гарантии совместимости. Поэтому загрузить библиотеки не для PostgreSQL таким образом нельзя. Для этого вы можете воспользоваться средствами операционной системы, например, переменной окружения <envar>LD_PRELOAD</envar>.

source: In general, refer to the documentation of a specific module for the recommended way to load that module.
ru: В общем случае, чтобы узнать, какой способ рекомендуется для загрузки модуля, следует обратиться к документации этого модуля.

source: <primary><varname>local_preload_libraries</varname> configuration parameter</primary>
ru: <primary><varname>local_preload_libraries</varname> параметр конфигурации</primary>

source: This variable specifies one or more shared libraries that are to be preloaded at connection start. The parameter value only takes effect at the start of the connection. Subsequent changes have no effect. If a specified library is not found, the connection attempt will fail.
ru: В этом параметре задаются одна или несколько разделяемых библиотек, которые будут загружаться при установлении соединения. Заданное значение параметра действует только в начале соединения, так что последующие изменения ни на что не влияют. Если указанная в нём библиотека не найдена, установить подключение не удастся.

source: This option can be set by any user. Because of that, the libraries that can be loaded are restricted to those appearing in the <filename>plugins</filename> subdirectory of the installation's standard library directory. (It is the database administrator's responsibility to ensure that only <quote>safe</quote> libraries are installed there.) Entries in <varname>local_preload_libraries</varname> can specify this directory explicitly, for example <literal>$libdir/plugins/mylib</literal>, or just specify the library name &mdash; <literal>mylib</literal> would have the same effect as <literal>$libdir/plugins/mylib</literal>.
ru: Этот параметр разрешено устанавливать всем пользователям. Поэтому библиотеки, которые так можно загрузить, ограничиваются теми, что находятся в подкаталоге <filename>plugins</filename> стандартного каталога библиотек установленного сервера. (Ответственность за то, чтобы в этом подкаталоге находились только <quote>безопасные</quote> библиотеки, лежит на администраторе.) В <varname>local_preload_libraries</varname> этот каталог можно задать явно (например, так: <literal>$libdir/plugins/mylib</literal>), либо просто указать имя библиотеки &mdash; <literal>mylib</literal> (оно будет воспринято как <literal>$libdir/plugins/mylib</literal>).

source: The intent of this feature is to allow unprivileged users to load debugging or performance-measurement libraries into specific sessions without requiring an explicit <command>LOAD</command> command. To that end, it would be typical to set this parameter using the <envar>PGOPTIONS</envar> environment variable on the client or by using <command>ALTER ROLE SET</command>.
ru: Данный механизм предназначен для того, чтобы непривилегированные пользователи могли загружать отладочные или профилирующие библиотеки в избранных сеансах, обходясь без явной команды <command>LOAD</command>. Для такого применения этот параметр обычно устанавливается в переменной окружения <envar>PGOPTIONS</envar> на клиенте или с помощью команды <command>ALTER ROLE SET</command>.

source: However, unless a module is specifically designed to be used in this way by non-superusers, this is usually not the right setting to use. Look at <xref linkend="guc-session-preload-libraries"/> instead.
ru: Обычно этот параметр не следует использовать, если только модуль не предназначен специально для такой загрузки обычными пользователями. Предпочтительная альтернатива ему — <xref linkend="guc-session-preload-libraries"/>.

source: <primary><varname>session_preload_libraries</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>session_preload_libraries</varname></primary>

source: This variable specifies one or more shared libraries that are to be preloaded at connection start. Only superusers can change this setting. The parameter value only takes effect at the start of the connection. Subsequent changes have no effect. If a specified library is not found, the connection attempt will fail.
ru: В этом параметре задаются одна или несколько разделяемых библиотек, которые будут загружаться при установлении соединения. Изменить его могут только суперпользователи. Заданное значение параметра действует только в начале соединения, так что последующие изменения ни на что не влияют. Если указанная в нём библиотека не найдена, установить подключение не удастся.

source: The intent of this feature is to allow debugging or performance-measurement libraries to be loaded into specific sessions without an explicit <command>LOAD</command> command being given. For example, <xref linkend="auto-explain"/> could be enabled for all sessions under a given user name by setting this parameter with <command>ALTER ROLE SET</command>. Also, this parameter can be changed without restarting the server (but changes only take effect when a new session is started), so it is easier to add new modules this way, even if they should apply to all sessions.
ru: Данный параметр предназначен для загрузки отладочных или профилирующих библиотек в избранных сеансах, без явного выполнения команды <command>LOAD</command>. Например, можно загрузить модуль <xref linkend="auto-explain"/> во всех сеансах пользователя с заданным именем, установив этот параметр командой <command>ALTER ROLE SET</command>. Кроме того, этот параметр можно изменить без перезапуска сервера (хотя изменения вступают в силу только при запуске нового сеанса), так что таким образом проще подгружать новые модули, даже если это нужно сделать для всех сеансов.

source: Unlike <xref linkend="guc-shared-preload-libraries"/>, there is no large performance advantage to loading a library at session start rather than when it is first used. There is some advantage, however, when connection pooling is used.
ru: В отличие от <xref linkend="guc-shared-preload-libraries"/>, этот вариант загрузки библиотеки не даёт большого выигрыша в скорости по сравнению с вариантом загрузки при первом использовании. Однако он оказывается выигрышным, когда используется пул соединений.

source: <primary><varname>shared_preload_libraries</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>shared_preload_libraries</varname></primary>

source: This variable specifies one or more shared libraries to be preloaded at server start. This parameter can only be set at server start. If a specified library is not found, the server will fail to start.
ru: В этом параметре задаются одна или несколько разделяемых библиотек, которые будут загружаться во время запуска сервера. Этот параметр можно задать только при запуске сервера. Если указанная в нём библиотека не найдёна, сервер не запустится.

source: Some libraries need to perform certain operations that can only take place at postmaster start, such as allocating shared memory, reserving light-weight locks, or starting background workers. Those libraries must be loaded at server start through this parameter. See the documentation of each library for details.
ru: Некоторые библиотеки при загрузке должны выполнять операции, которые могут иметь место только при запуске главного процесса, например, выделять разделяемую память, резервировать легковесные блокировки или запускать фоновые рабочие процессы. Такие библиотеки должны загружаться при запуске сервера посредством этого параметра. За подробностями обратитесь к документации библиотек.

source: Other libraries can also be preloaded. By preloading a shared library, the library startup time is avoided when the library is first used. However, the time to start each new server process might increase slightly, even if that process never uses the library. So this parameter is recommended only for libraries that will be used in most sessions. Also, changing this parameter requires a server restart, so this is not the right setting to use for short-term debugging tasks, say. Use <xref linkend="guc-session-preload-libraries"/> for that instead.
ru: Также можно предварительно загрузить и другие библиотеки. Предварительная загрузка позволяет избавиться от задержки, возникающей при первом использовании библиотеки. Однако при этом может несколько увеличиться время запуска каждого нового процесса, даже если он не будет использовать эту библиотеку. Поэтому применять этот параметр рекомендуется только для библиотек, которые будут использоваться большинством сеансов. Кроме того, при изменении этого параметра необходимо перезапускать сервер, так что этот вариант не подходит, например, для краткосрочных задач отладки. В таких случаях используйте вместо него <xref linkend="guc-session-preload-libraries"/>.

source: On Windows hosts, preloading a library at server start will not reduce the time required to start each new server process; each server process will re-load all preload libraries. However, <varname>shared_preload_libraries </varname> is still useful on Windows hosts for libraries that need to perform operations at postmaster start time.
ru: В системе Windows загрузка библиотек при запуске сервера не сокращает время запуска каждого нового серверного процесса; каждый процесс будет заново загружать все библиотеки. Однако параметр <varname>shared_preload_libraries </varname> всё же может быть полезен в Windows для загрузки библиотек, которые должны выполнять некоторые операции при запуске главного процесса.

source: Other Defaults
ru: Другие параметры по умолчанию

source: <primary><varname>dynamic_library_path</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>dynamic_library_path</varname></primary>

source: <primary>dynamic loading</primary>
ru: <primary>динамическая загрузка</primary>

source: If a dynamically loadable module needs to be opened and the file name specified in the <command>CREATE FUNCTION</command> or <command>LOAD</command> command does not have a directory component (i.e., the name does not contain a slash), the system will search this path for the required file.
ru: Когда требуется открыть динамически загружаемый модуль и его имя, заданное в команде <command>CREATE FUNCTION</command> или <command>LOAD</command> не содержит имён каталогов (т. е. в этом имени нет косой черты), система будет искать запрошенный файл в данном пути.

source: The value for <varname>dynamic_library_path</varname> must be a list of absolute directory paths separated by colons (or semi-colons on Windows). If a list element starts with the special string <literal>$libdir</literal>, the compiled-in <productname>PostgreSQL</productname> package library directory is substituted for <literal>$libdir</literal>; this is where the modules provided by the standard <productname>PostgreSQL</productname> distribution are installed. (Use <literal>pg_config --pkglibdir</literal> to find out the name of this directory.) For example: <placeholder-1/> or, in a Windows environment: <placeholder-2/>
ru: Значением параметра <varname>dynamic_library_path</varname> должен быть список абсолютных путей, разделённых двоеточием (или точкой с запятой в Windows). Если элемент в этом списке начинается со специальной строки <literal>$libdir</literal>, вместо неё подставляется заданный при компиляции путь каталога библиотек <productname>PostgreSQL</productname>; в этот каталог устанавливаются модули, поставляемые в составе стандартного дистрибутива <productname>PostgreSQL</productname>. (Чтобы узнать имя этого каталога, можно выполнить <literal>pg_config --pkglibdir</literal>.) Например: <placeholder-1/> Или в среде Windows: <placeholder-2/>

source: The default value for this parameter is <literal>'$libdir'</literal>. If the value is set to an empty string, the automatic path search is turned off.
ru: Значение по умолчанию этого параметра — <literal>'$libdir'</literal>. Если его значение — пустая строка, автоматический поиск по заданному пути отключается.

source: This parameter can be changed at run time by superusers, but a setting done that way will only persist until the end of the client connection, so this method should be reserved for development purposes. The recommended way to set this parameter is in the <filename>postgresql.conf</filename> configuration file.
ru: Суперпользователи могут изменить этот параметр в процессе работы сервера, но такое изменение будет действовать только до завершения клиентского соединения, так что этот вариант следует оставить для целей разработки. Для других целей этот параметр рекомендуется устанавливать в файле конфигурации <filename>postgresql.conf</filename>.

source: <primary><varname>gin_fuzzy_search_limit</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>gin_fuzzy_search_limit</varname></primary>

source: Soft upper limit of the size of the set returned by GIN index scans. For more information see <xref linkend="gin-tips"/>.
ru: Задаёт мягкий верхний лимит для размера набора, возвращаемого при сканировании индексов GIN. За дополнительными сведениями обратитесь к <xref remap="3" linkend="gin-tips"/>.

source: Lock Management
ru: Управление блокировками

source: <primary>deadlock</primary> <secondary>timeout during</secondary>
ru: <primary>взаимоблокировка</primary> <secondary>тайм-аут</secondary>

source: <primary>timeout</primary> <secondary>deadlock</secondary>
ru: <primary>тайм-аут</primary> <secondary>взаимоблокировка</secondary>

source: <primary><varname>deadlock_timeout</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>deadlock_timeout</varname></primary>

source: This is the amount of time, in milliseconds, to wait on a lock before checking to see if there is a deadlock condition. The check for deadlock is relatively expensive, so the server doesn't run it every time it waits for a lock. We optimistically assume that deadlocks are not common in production applications and just wait on the lock for a while before checking for a deadlock. Increasing this value reduces the amount of time wasted in needless deadlock checks, but slows down reporting of real deadlock errors. The default is one second (<literal>1s</literal>), which is probably about the smallest value you would want in practice. On a heavily loaded server you might want to raise it. Ideally the setting should exceed your typical transaction time, so as to improve the odds that a lock will be released before the waiter decides to check for deadlock. Only superusers can change this setting.
ru: Время ожидания блокировки (в миллисекундах), по истечении которого будет выполняться проверка состояния взаимоблокировки. Эта проверка довольно дорогостоящая, поэтому сервер не выполняет её при всяком ожидании блокировки. Мы оптимистично полагаем, что взаимоблокировки редки в производственных приложениях и поэтому просто ждём некоторое время, прежде чем пытаться выявить взаимоблокировку. При увеличении значения этого параметра сокращается время, уходящее на ненужные проверки взаимоблокировки, но замедляется реакция на реальные взаимоблокировки. Значение по умолчанию — одна секунда (<literal>1s</literal>), что близко к минимальному значению, которое стоит применять на практике. На сервере с большой нагрузкой имеет смысл увеличить его. В идеале это значение должно превышать типичное время транзакции, чтобы повысить шансы на то, что блокировка всё-таки будет освобождена, прежде чем ожидающая транзакция решит проверить состояние взаимоблокировки. Изменить этот параметр могут только суперпользователи.

source: When <xref linkend="guc-log-lock-waits"/> is set, this parameter also determines the length of time to wait before a log message is issued about the lock wait. If you are trying to investigate locking delays you might want to set a shorter than normal <varname>deadlock_timeout</varname>.
ru: Когда включён параметр <xref linkend="guc-log-lock-waits"/>, данный параметр также определяет, спустя какое время в журнал сервера будут записываться сообщения об ожидании блокировки. Если вы пытаетесь исследовать задержки, вызванные блокировками, имеет смысл уменьшить его по сравнению с обычным значением <varname>deadlock_timeout</varname>.

source: <primary><varname>max_locks_per_transaction</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>max_locks_per_transaction</varname></primary>
