Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/docguide.po
Languages: ru

source: Documentation
ru: Документация

source: Plain text, for pre-installation information
ru: Простой текст, для информации перед установкой

source: <acronym>HTML</acronym>, for on-line browsing and reference
ru: <acronym>HTML</acronym>, для справки, поиска и просмотра в Интернете

source: PDF or PostScript, for printing
ru: PDF или PostScript, для печати

source: man pages, for quick reference.
ru: Страницы руководства man, для быстрой справки.

source: <productname>PostgreSQL</productname> has four primary documentation formats: <placeholder-1/> Additionally, a number of plain-text <filename>README</filename> files can be found throughout the <productname>PostgreSQL</productname> source tree, documenting various implementation issues.
ru: Документация <productname>PostgreSQL</productname> публикуется в четырёх основных форматах: <placeholder-1/> Кроме того, в дереве исходного кода <productname>PostgreSQL</productname> можно найти несколько простых текстовых файлов <filename>README</filename>, освещающих различные вопросы реализации.

source: <acronym>HTML</acronym> documentation and man pages are part of a standard distribution and are installed by default. PDF and PostScript format documentation is available separately for download.
ru: Документация в <acronym>HTML</acronym> и страницы man входят в состав стандартного дистрибутива и устанавливаются по умолчанию. Документацию в форматах PDF и PostScript можно загрузить отдельно.

source: The documentation sources are written in <firstterm>DocBook</firstterm>, which is a markup language superficially similar to <acronym>HTML</acronym>. Both of these languages are applications of the <firstterm>Standard Generalized Markup Language</firstterm>, <acronym>SGML</acronym>, which is essentially a language for describing other languages. In what follows, the terms DocBook and <acronym>SGML</acronym> are both used, but technically they are not interchangeable.
ru: Исходный материал документации пишется на языке разметки <firstterm>DocBook</firstterm>, который отдалённо напоминает <acronym>HTML</acronym>. Оба эти языка являются приложениями <acronym>SGML</acronym> (<firstterm>Standard Generalized Markup Language</firstterm>, Стандартного обобщённого языка разметки), который по сути является языком описания других языков. В следующем описании используется как термин DocBook, так и <acronym>SGML</acronym>, но технически они не взаимозаменяемы.

source: <productname>DocBook</productname> allows an author to specify the structure and content of a technical document without worrying about presentation details. A document style defines how that content is rendered into one of several final forms. DocBook is maintained by the <ulink url="http://www.oasis-open.org"> OASIS group</ulink>. The <ulink url="http://www.oasis-open.org/docbook/"> official DocBook site</ulink> has good introductory and reference documentation and a complete O'Reilly book for your online reading pleasure. The <ulink url="http://newbiedoc.sourceforge.net/metadoc/docbook-guide.html"> NewbieDoc Docbook Guide</ulink> is very helpful for beginners. The <ulink url="http://www.freebsd.org/docproj/docproj.html"> FreeBSD Documentation Project</ulink> also uses DocBook and has some good information, including a number of style guidelines that might be worth considering.
ru: Формат <productname>DocBook</productname> позволяет авторам определять структуру и содержимое технического документа, не заботясь о деталях представления. Как это содержимое будет представлено в различных конечных формах, определяет стиль документа. DocBook поддерживается <ulink url="http://www.oasis-open.org"> группой OASIS</ulink>. На <ulink url="http://www.oasis-open.org/docbook/">официальном сайте DocBook</ulink> имеется хорошая вводная и справочная документация, а также полная книга издательства О'Рейли для чтения в электронном виде. Новичкам будет очень полезно руководство <ulink url="http://newbiedoc.sourceforge.net/metadoc/docbook-guide.html">NewbieDoc Docbook Guide</ulink>. Кроме того, в <ulink url="http://www.freebsd.org/docproj/docproj.html">Проекте документации FreeBSD</ulink> (FreeBSD Documentation Project) так же применяется формат DocBook и даются полезные сведения, включая ряд замечаний по стилю, которые стоит принять во внимание.

source: Tool Sets
ru: Инструментарий

source: <ulink url="http://www.oasis-open.org/docbook/">DocBook DTD</ulink>
ru: <ulink url="http://www.oasis-open.org/docbook/">DTD для DocBook</ulink>

source: This is the definition of DocBook itself. We currently use version 4.2; you cannot use later or earlier versions. You need the <acronym>SGML</acronym> variant of the DocBook DTD, but to build man pages you also need the <acronym>XML</acronym> variant of the same version.
ru: Это полное определение самого формата DocBook. В настоящее время мы применяем версию 4.2; более ранняя или более поздняя версия не подойдёт. Использовать нужно вариант <acronym>SGML</acronym> формата DocBook, но для сборки страниц man вам также потребуется вариант <acronym>XML</acronym> той же версии.

source: <ulink url="http://www.oasis-open.org/cover/ISOEnts.zip">ISO 8879 character entities</ulink>
ru: <ulink url="http://www.oasis-open.org/cover/ISOEnts.zip">Сущности символов ISO 8879</ulink>

source: These are required by DocBook but are distributed separately because they are maintained by ISO.
ru: Они требуются форматом DocBook, но распространяются отдельно, так как поддерживаются комитетом ISO.

source: <ulink url="http://wiki.docbook.org/DocBookDssslStylesheetDocs">DocBook DSSSL Stylesheets</ulink>
ru: <ulink url="http://wiki.docbook.org/DocBookDssslStylesheetDocs">Таблицы стилей DocBook DSSSL</ulink>

source: These contain the processing instructions for converting the DocBook sources to other formats, such as <acronym>HTML</acronym>.
ru: Они содержат инструкции обработки для преобразования исходных материалов DocBook в другие форматы, например, в <acronym>HTML</acronym>.

source: <ulink url="http://wiki.docbook.org/DocBookXslStylesheets">DocBook XSL Stylesheets</ulink>
ru: <ulink url="http://wiki.docbook.org/DocBookXslStylesheets">Таблицы стилей DocBook XSL</ulink>

source: This is another stylesheet for converting DocBook to other formats. We currently use this to produce man pages and optionally HTMLHelp. You can also use this toolchain to produce HTML or PDF output, but official PostgreSQL releases use the DSSSL stylesheets for that.
ru: Это ещё одни стили для преобразования DocBook в другие форматы. В настоящее время мы используем их для получения страниц man и дополнительного формата, HTMLHelp. Эти стили можно применять и для получения вывода в HTML или PDF, но в официальных выпусках PostgreSQL для этого используются стили DSSSL.

source: The minimum required version is currently 1.74.0.
ru: На данный момент требуется версия как минимум 1.74.0.

source: This is the base package of <acronym>SGML</acronym> processing. It contains an <acronym>SGML</acronym> parser, a <acronym>DSSSL</acronym> processor (that is, a program to convert <acronym>SGML</acronym> to other formats using <acronym>DSSSL</acronym> stylesheets), as well as a number of related tools. <productname>Jade</productname> is now being maintained by the OpenJade group, no longer by James Clark.
ru: Это базовый пакет для обработки <acronym>SGML</acronym>. В него входит средство разбора <acronym>SGML</acronym>, процессор <acronym>DSSSL</acronym> (то есть программа, преобразующая <acronym>SGML</acronym> в другие форматы, применяя стили <acronym>DSSSL</acronym>), а также ряд связанных инструментов. Поддержкой <productname>Jade</productname> теперь занимается не Джеймс Кларк, а группа OpenJade.

source: <ulink url="http://xmlsoft.org/">Libxml2</ulink> for <command>xmllint</command>
ru: <ulink url="http://xmlsoft.org/">Libxml2</ulink> для <command>xmllint</command>

source: This library and the <command>xmllint</command> tool it contains are used for processing XML. Many developers will already have <application>Libxml2</application> installed, because it is also used when building the PostgreSQL code. Note, however, that <command>xmllint</command> might need to be installed from a separate subpackage.
ru: Эта библиотека и включённая в неё утилита <command>xmllint</command> применяются для обработки XML. У многих разработчиков библиотека <application>Libxml2</application> уже установлена, потому что она также используются при сборке кода PostgreSQL. Заметьте, однако, что <command>xmllint</command> может потребоваться установить из отдельного пакета.

source: <ulink url="http://xmlsoft.org/XSLT/">Libxslt</ulink> for <command>xsltproc</command>
ru: <ulink url="http://xmlsoft.org/XSLT/">Libxslt</ulink> для <command>xsltproc</command>

source: This is the processing tool to use with the XSLT stylesheets (like <command>jade</command> is the processing tool for DSSSL stylesheets).
ru: Это средство преобразования с применением стилей XSLT (как <command>jade</command> — средство преобразования с применением стилей DSSSL).

source: If you want to, you can also install <productname>JadeTeX</productname> to use <productname>TeX</productname> as a formatting backend for <productname>Jade</productname>. <application>JadeTeX</application> can create PostScript or <acronym>PDF</acronym> files (the latter with bookmarks).
ru: Если хотите, вы также можете установить <productname>JadeTeX</productname>, чтобы использовать <productname>TeX</productname> как модуль форматирования для <productname>Jade</productname>. <application>JadeTeX</application> может создавать файлы PostScript и <acronym>PDF</acronym> (последние с закладками).

source: However, the output from <application>JadeTeX</application> is inferior to what you get from the <acronym>RTF</acronym> backend. Particular problem areas are tables and various artifacts of vertical and horizontal spacing. Also, there is no opportunity to manually polish the results.
ru: Однако вывод <application>JadeTeX</application> уступает тому, что можно получить через <acronym>RTF</acronym>. В частности, проблемы возникают с таблицами, а также с горизонтальными и вертикальными отступами. Кроме того, при таком выводе нет возможности вручную отполировать результаты.

source: The following tools are used to process the documentation. Some might be optional, as noted. <placeholder-1/>
ru: Для обработки документации применяются следующие средства. Некоторые из них могут быть необязательными, как отмечено ниже. <placeholder-1/>

source: We have documented experience with several installation methods for the various tools that are needed to process the documentation. These will be described below. There might be some other packaged distributions for these tools. Please report package status to the documentation mailing list, and we will include that information here.
ru: Ниже мы опишем различные варианты установки программного обеспечения, необходимого для обработки документации. Эти программы могут распространяться и в других пакетах. Пожалуйста, сообщите о состоянии конкретного пакета в список рассылки, посвящённый документации, и мы добавим эту информацию сюда.

source: Installation on Fedora, RHEL, and Derivatives
ru: Установка в Fedora, RHEL и производных системах

source: To install the required packages, use: <placeholder-1/>
ru: Чтобы установить требуемые пакеты, выполните: <placeholder-1/>

source: Installation on FreeBSD
ru: Установка во FreeBSD

source: The FreeBSD Documentation Project is itself a heavy user of DocBook, so it comes as no surprise that there is a full set of <quote>ports</quote> of the documentation tools available on FreeBSD. The following ports need to be installed to build the documentation on FreeBSD. <placeholder-1/>
ru: Проект документации FreeBSD сам активно использует DocBook, поэтому неудивительно, что для FreeBSD есть полный набор <quote>портов</quote> инструментария для сборки документации. Чтобы собирать документацию во FreeBSD, необходимо установить нижеперечисленные порты. <placeholder-1/>

source: A number of things from <filename>/usr/ports/print</filename> (<filename>tex</filename>, <filename>jadetex</filename>) might also be of interest.
ru: Также могут представлять интерес некоторые вещи из <filename>/usr/ports/print</filename> (<filename>tex</filename>, <filename>jadetex</filename>).

source: More information about the FreeBSD documentation tools can be found in the <ulink url="http://www.freebsd.org/doc/en_US.ISO8859-1/books/fdp-primer/tools.html"> FreeBSD Documentation Project's instructions</ulink>.
ru: Дополнительные сведения об инструментарии документации FreeBSD можно найти в <ulink url="http://www.freebsd.org/doc/en_US.ISO8859-1/books/fdp-primer/tools.html">инструкциях проекта документации FreeBSD</ulink>.

source: Debian Packages
ru: Пакеты Debian

source: There is a full set of packages of the documentation tools available for <productname>Debian GNU/Linux</productname>. To install, simply use: <placeholder-1/>
ru: Для <productname>Debian GNU/Linux</productname> имеется полный набор пакетов инструментария сборки документации. Чтобы установить их, просто выполните: <placeholder-1/>

source: If you use MacPorts, the following will get you set up: <placeholder-1/>
ru: Если вы используете систему MacPorts, вы можете получить необходимое программное обеспечение так: <placeholder-1/>

source: Manual Installation from Source
ru: Установка из исходного кода вручную

source: The manual installation process of the DocBook tools is somewhat complex, so if you have pre-built packages available, use them. We describe here only a standard setup, with reasonably standard installation paths, and no <quote>fancy</quote> features. For details, you should study the documentation of the respective package, and read <acronym>SGML</acronym> introductory material.
ru: Процесс установки инструментария DocBook довольно сложен, поэтому, если для вашей системы есть готовые пакеты, используйте их. Мы опишем здесь только стандартную процедуру с обычными путями инсталляции и без <quote>экстраординарных</quote> функций. За подробностями вы можете обратиться к документации соответствующего пакета или вводному материалу по <acronym>SGML</acronym>.

source: Installing OpenJade
ru: Установка OpenJade

source: The installation of OpenJade offers a GNU-style <literal>./configure; make; make install</literal> build process. Details can be found in the OpenJade source distribution. In a nutshell: <synopsis> ./configure --enable-default-catalog=/usr/local/share/sgml/catalog make make install </synopsis> Be sure to remember where you put the <quote>default catalog</quote>; you will need it below. You can also leave it off, but then you will have to set the environment variable <envar>SGML_CATALOG_FILES</envar> to point to the file whenever you use <application>jade</application> later on. (This method is also an option if OpenJade is already installed and you want to install the rest of the toolchain locally.)
ru: Установка OpenJade заключается в процессе сборки в стиле GNU <literal>./configure; make; make install</literal>. Подробности можно найти в пакете исходного кода OpenJade. Вкратце: <synopsis> ./configure --enable-default-catalog=/usr/local/share/sgml/catalog make make install </synopsis> Обязательно запомните, какой путь вы задали для <quote>каталога по умолчанию</quote>; он понадобится вам позже. Вы можете и не задавать его, но тогда вам надо будет устанавливать путь к каталогу в переменной окружения <envar>SGML_CATALOG_FILES</envar> всякий раз, когда вы будете использовать <application>jade</application>. (Это может пригодиться, если OpenJade уже установлен и вы хотите установить остальные компоненты локально.)

source: Some users have reported encountering a segmentation fault using OpenJade 1.4devel to build the PDFs, with a message like: <screen> openjade:./stylesheet.dsl:664:2:E: flow object not accepted by port; only display flow objects accepted make: *** [postgres-A4.tex-pdf] Segmentation fault </screen> Downgrading to OpenJade 1.3 should get rid of this error.
ru: Некоторые пользователи сообщали о возникновении ошибки сегментации в OpenJade 1.4devel при попытке сгенерировать PDF, с таким сообщением: <screen> openjade:./stylesheet.dsl:664:2:E: flow object not accepted by port; only display flow objects accepted make: *** [postgres-A4.tex-pdf] Segmentation fault </screen> Понижение версии OpenJade до 1.3 должно решить эту проблему.

source: Additionally, you should install the files <filename>dsssl.dtd</filename>, <filename>fot.dtd</filename>, <filename>style-sheet.dtd</filename>, and <filename>catalog</filename> from the <filename>dsssl</filename> directory somewhere, perhaps into <filename>/usr/local/share/sgml/dsssl</filename>. It's probably easiest to copy the entire directory: <synopsis> cp -R dsssl /usr/local/share/sgml </synopsis>
ru: Кроме того, вы должны установить файлы <filename>dsssl.dtd</filename>, <filename>fot.dtd</filename>, <filename>style-sheet.dtd</filename> и <filename>catalog</filename> из каталога <filename>dsssl</filename> в определённое место, возможно, в <filename>/usr/local/share/sgml/dsssl</filename>. Вероятно, проще всего для этого будет скопировать весь каталог: <synopsis> cp -R dsssl /usr/local/share/sgml </synopsis>

source: Finally, create the file <filename>/usr/local/share/sgml/catalog</filename> and add this line to it: <placeholder-1/> (This is a relative path reference to the file installed in <xref linkend="doc-openjade-install"/>. Be sure to adjust it if you chose your installation layout differently.)
ru: Наконец, создайте файл <filename>/usr/local/share/sgml/catalog</filename> и добавьте в него эту строку: <placeholder-1/> (Это ссылка по относительному пути на файл, установленный на <xref remap="6" linkend="doc-openjade-install"/>. Обязательно скорректируйте этот путь, если ваша инсталляция имеет другую структуру.)

source: Installing the <productname>DocBook</productname> <acronym>DTD</acronym> Kit
ru: Установка <productname>DocBook</productname> <acronym>DTD</acronym>

source: Obtain the <ulink url="http://www.docbook.org/sgml/4.2/docbook-4.2.zip"> DocBook V4.2 distribution</ulink>.
ru: Получите <ulink url="http://www.docbook.org/sgml/4.2/docbook-4.2.zip">пакет DocBook V4.2</ulink>.

source: Create the directory <filename>/usr/local/share/sgml/docbook-4.2</filename> and change to it. (The exact location is irrelevant, but this one is reasonable within the layout we are following here.) <screen> <prompt>$ </prompt><userinput>mkdir /usr/local/share/sgml/docbook-4.2</userinput> <prompt>$ </prompt><userinput>cd /usr/local/share/sgml/docbook-4.2</userinput> </screen>
ru: Создайте каталог <filename>/usr/local/share/sgml/docbook-4.2</filename> и перейдите в него. (Расположение может быть и другим, но данный путь соответствует структуре каталогов, которой мы следуем здесь.) <screen> <prompt>$ </prompt><userinput>mkdir /usr/local/share/sgml/docbook-4.2</userinput> <prompt>$ </prompt><userinput>cd /usr/local/share/sgml/docbook-4.2</userinput> </screen>

source: Unpack the archive: <screen> <prompt>$ </prompt><userinput>unzip -a ...../docbook-4.2.zip</userinput> </screen> (The archive will unpack its files into the current directory.)
ru: Распакуйте архив: <screen> <prompt>$ </prompt><userinput>unzip -a ...../docbook-4.2.zip</userinput> </screen> (Файлы архива будут распакованы в текущий каталог.)

source: Edit the file <filename>/usr/local/share/sgml/catalog</filename> (or whatever you told jade during installation) and put a line like this into it: <placeholder-1/>
ru: Отредактируйте файл <filename>/usr/local/share/sgml/catalog</filename> (или тот, что был указан при инсталляции jade) и добавьте в него такую строку: <placeholder-1/>

source: Download the <ulink url="http://www.oasis-open.org/cover/ISOEnts.zip"> ISO 8879 character entities archive</ulink>, unpack it, and put the files in the same directory you put the DocBook files in: <screen> <prompt>$ </prompt><userinput>cd /usr/local/share/sgml/docbook-4.2</userinput> <prompt>$ </prompt><userinput>unzip ...../ISOEnts.zip</userinput> </screen>
ru: Загрузите <ulink url="http://www.oasis-open.org/cover/ISOEnts.zip">архив сущностей символов ISO 8879</ulink>, распакуйте его и поместите файлы в тот же каталог, в который вы поместили файлы DocBook: <screen> <prompt>$ </prompt><userinput>cd /usr/local/share/sgml/docbook-4.2</userinput> <prompt>$ </prompt><userinput>unzip ...../ISOEnts.zip</userinput> </screen>

source: Run the following command in the directory with the DocBook and ISO files: <placeholder-1/> (This fixes a mixup between the names used in the DocBook catalog file and the actual names of the ISO character entity files.)
ru: Запустите в каталоге с файлами DocBook и ISO следующую команду: <placeholder-1/> (Она исправляет несоответствие имён в файле каталога DocBook и фактических имён файлов сущностей ISO.)

source: Installing the DocBook <acronym>DSSSL</acronym> Style Sheets
ru: Установка таблиц стилей DocBook <acronym>DSSSL</acronym>

source: To install the style sheets, unzip and untar the distribution and move it to a suitable place, for example <filename>/usr/local/share/sgml</filename>. (The archive will automatically create a subdirectory.) <screen> <prompt>$</prompt> <userinput>gunzip docbook-dsssl-1.<replaceable>xx</replaceable>.tar.gz</userinput> <prompt>$</prompt> <userinput>tar -C /usr/local/share/sgml -xf docbook-dsssl-1.<replaceable>xx</replaceable>.tar</userinput> </screen>
ru: Чтобы установить таблицы стилей, разархивируйте дистрибутивный пакет и поместите его содержимое в подходящее место, например, в <filename>/usr/local/share/sgml</filename>. (Из архива будет автоматически извлечён подкаталог.) <screen> <prompt>$</prompt> <userinput>gunzip docbook-dsssl-1.<replaceable>xx</replaceable>.tar.gz</userinput> <prompt>$</prompt> <userinput>tar -C /usr/local/share/sgml -xf docbook-dsssl-1.<replaceable>xx</replaceable>.tar</userinput> </screen>

source: The usual catalog entry in <filename>/usr/local/share/sgml/catalog</filename> can also be made: <placeholder-1/> Because stylesheets change rather often, and it's sometimes beneficial to try out alternative versions, <productname>PostgreSQL</productname> doesn't use this catalog entry. See <xref linkend="docguide-toolsets-configure"/> for information about how to select the stylesheets instead.
ru: Также можно добавить обычную запись в каталог <filename>/usr/local/share/sgml/catalog</filename>: <placeholder-1/> Так как таблицы стилей меняются довольно часто и иногда имеет смысл использовать альтернативные версии, документация <productname>PostgreSQL</productname> не использует эту запись каталога. Как выбрать таблицы стилей для неё, описано в <xref remap="6" linkend="docguide-toolsets-configure"/>.

source: Installing <productname>JadeTeX</productname>
ru: Установка <productname>JadeTeX</productname>
