Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/docguide.po
Languages: ru

source: To install and use <productname>JadeTeX</productname>, you will need a working installation of <productname>TeX</productname> and <productname>LaTeX2e</productname>, including the supported <productname>tools</productname> and <productname>graphics</productname> packages, <productname>Babel</productname>, <productname><acronym>AMS</acronym> fonts</productname> and <productname>AMS-LaTeX</productname>, the <productname><acronym>PSNFSS</acronym></productname> extension and companion kit of <quote>the 35 fonts</quote>, the <productname>dvips</productname> program for generating <productname>PostScript</productname>, the macro packages <productname>fancyhdr</productname>, <productname>hyperref</productname>, <productname>minitoc</productname>, <productname>url</productname> and <productname>ot2enc</productname>. All of these can be found on your friendly neighborhood <ulink url="http://www.ctan.org"><acronym>CTAN</acronym> site</ulink>. The installation of the <application>TeX</application> base system is far beyond the scope of this introduction. Binary packages should be available for any system that can run <application>TeX</application>.
ru: Чтобы установить и использовать <productname>JadeTeX</productname>, вам потребуется рабочая инсталляция <productname>TeX</productname> и <productname>LaTeX2e</productname>, включающая: поддерживаемые пакеты <productname>tools</productname> и <productname>graphics</productname>, шрифты <productname>Babel</productname>, <productname><acronym>AMS</acronym></productname> и <productname>AMS-LaTeX</productname>, расширение <productname><acronym>PSNFSS</acronym></productname>, дополнительный набор из <quote>35 шрифтов</quote>, программу <productname>dvips</productname> для вывода в <productname>PostScript</productname>, а также пакеты макросов <productname>fancyhdr</productname>, <productname>hyperref</productname>, <productname>minitoc</productname>, <productname>url</productname> и <productname>ot2enc</productname>. Все эти компоненты можно найти на родственном сайте <ulink url="http://www.ctan.org"><acronym>CTAN</acronym></ulink>. Рассмотрение установки базовой системы <application>TeX</application> выходит далеко за рамки этого введения. Для любой системы, в которой может работать <application>TeX</application>, должны существовать и готовые двоичные пакеты.

source: Before you can use <application>JadeTeX</application> with the <productname>PostgreSQL</productname> documentation sources, you will need to increase the size of <application>TeX</application>'s internal data structures. Details on this can be found in the <application>JadeTeX</application> installation instructions.
ru: Прежде чем использовать <application>JadeTeX</application> с исходным материалом документации <productname>PostgreSQL</productname>, вам необходимо увеличить размер внутренних структур данных <application>TeX</application>. Подробнее об этом рассказывается в инструкциях по установке <application>JadeTeX</application>.

source: Once that is finished you can install <application>JadeTeX</application>: <screen> <prompt>$</prompt> <userinput>gunzip jadetex-<replaceable>xxx</replaceable>.tar.gz</userinput> <prompt>$</prompt> <userinput>tar xf jadetex-<replaceable>xxx</replaceable>.tar</userinput> <prompt>$</prompt> <userinput>cd jadetex</userinput> <prompt>$</prompt> <userinput>make install</userinput> <prompt>$</prompt> <userinput>mktexlsr</userinput> </screen> The last two need to be done as <systemitem>root</systemitem>.
ru: Выполнив необходимые условия, вы можете установить <application>JadeTeX</application> так: <screen> <prompt>$</prompt> <userinput>gunzip jadetex-<replaceable>xxx</replaceable>.tar.gz</userinput> <prompt>$</prompt> <userinput>tar xf jadetex-<replaceable>xxx</replaceable>.tar</userinput> <prompt>$</prompt> <userinput>cd jadetex</userinput> <prompt>$</prompt> <userinput>make install</userinput> <prompt>$</prompt> <userinput>mktexlsr</userinput> </screen> Последние две команды нужно выполнять от имени <systemitem>root</systemitem>.

source: Detection by <command>configure</command>
ru: Проверка условий <command>configure</command>

source: Before you can build the documentation you need to run the <filename>configure</filename> script as you would when building the <productname>PostgreSQL</productname> programs themselves. Check the output near the end of the run, it should look something like this: <screen> <computeroutput> checking for onsgmls... onsgmls checking for openjade... openjade checking for DocBook V4.2... yes checking for DocBook stylesheets... /usr/share/sgml/docbook/stylesheet/dsssl/modular checking for collateindex.pl... /usr/bin/collateindex.pl checking for xsltproc... xsltproc checking for osx... osx </computeroutput> </screen> If neither <filename>onsgmls</filename> nor <filename>nsgmls</filename> were found then some of the following tests will be skipped. <filename>nsgmls</filename> is part of the Jade package. You can pass the environment variables <envar>JADE</envar> and <envar>NSGMLS</envar> to configure to point to the programs if they are not found automatically. If <quote>DocBook V4.2</quote> was not found then you did not install the DocBook DTD kit in a place where Jade can find it, or you have not set up the catalog files correctly. See the installation hints above. The DocBook stylesheets are looked for in a number of relatively standard places, but if you have them some other place then you should set the environment variable <envar>DOCBOOKSTYLE</envar> to the location and rerun <filename>configure</filename> afterwards.
ru: Прежде чем вы сможете собрать документацию, вы должны запустить скрипт <filename>configure</filename> так же, как это нужно сделать для сборки программной части <productname>PostgreSQL</productname>. Обратите внимание на сообщения, выводимые ближе к концу. Вы должны увидеть примерно следующее: <screen> <computeroutput> checking for onsgmls... onsgmls checking for openjade... openjade checking for DocBook V4.2... yes checking for DocBook stylesheets... /usr/share/sgml/docbook/stylesheet/dsssl/modular checking for collateindex.pl... /usr/bin/collateindex.pl checking for xsltproc... xsltproc checking for osx... osx </computeroutput> </screen> Если ни <filename>onsgmls</filename>, ни <filename>nsgmls</filename> не будут найдены, некоторые из следующих тестов будут пропущены. Программа <filename>nsgmls</filename> входит в состав пакета Jade. Вы можете передать configure в переменных окружения <envar>JADE</envar> и <envar>NSGMLS</envar> пути к соответствующим программам, если они не находятся автоматически. Если <quote>DocBook V4.2</quote> не находится, значит вы не установили файлы DocBook DTD туда, где их может найти Jade, или не настроили корректно файлы каталогов. В этом случае воспользуйтесь указаниями, данными выше. При поиске таблиц стилей DocBook просматриваются несколько стандартных расположений, но если вы поместили их в другое место, вам, возможно, придётся задать это расположение в переменной окружения <envar>DOCBOOKSTYLE</envar> и затем перезапустить <filename>configure</filename>.

source: Building The Documentation
ru: Сборка документации

source: Once you have everything set up, change to the directory <filename>doc/src/sgml</filename> and run one of the commands described in the following subsections to build the documentation. (Remember to use GNU make.)
ru: Завершив все подготовительные действия, перейдите в каталог <filename>doc/src/sgml</filename> и запустите одну из команд сборки, описанных в следующих подразделах. (Помните, что для сборки нужно использовать GNU make.)

source: To build the <acronym>HTML</acronym> version of the documentation: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make html</userinput> </screen> This is also the default target. The output appears in the subdirectory <filename>html</filename>.
ru: Чтобы собрать <acronym>HTML</acronym>-версию документации: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make html</userinput> </screen> Эта цель сборки также выбирается по умолчанию. Результат помещается в подкаталог <filename>html</filename>.

source: To produce HTML documentation with the stylesheet used on <ulink url="https://www.postgresql.org/docs/current">postgresql.org</ulink> instead of the default simple style use: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make STYLE=website html</userinput> </screen>
ru: Чтобы получить HTML-документацию со стилем оформления, используемым на сайте <ulink url="https://www.postgresql.org/docs/current">postgresql.org</ulink>, вместо простого стандартного стиля, выполните: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make STYLE=website html</userinput> </screen>

source: To create a proper index, the build might process several identical stages. If you do not care about the index, and just want to proof-read the output, use <literal>draft</literal>: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make draft</userinput> </screen>
ru: Чтобы был сформирован алфавитный указатель, во время сборки требуется выполнить несколько проходов. Если этот указатель вам не нужен, вы просто хотите проверить результат, используйте режим <literal>draft</literal>: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make draft</userinput> </screen>

source: To build the documentation as a single HTML page, use: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make postgres.html</userinput> </screen>
ru: Чтобы получить документацию в виде одной HTML-страницы, выполните: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make postgres.html</userinput> </screen>

source: Manpages
ru: Страницы man

source: We use the DocBook XSL stylesheets to convert <productname>DocBook</productname> <sgmltag>refentry</sgmltag> pages to *roff output suitable for man pages. The man pages are also distributed as a tar archive, similar to the <acronym>HTML</acronym> version. To create the man pages, use the commands: <placeholder-1/>
ru: Для преобразования страниц <productname>DocBook</productname> <sgmltag>refentry</sgmltag> в формат *roff, подходящий для страниц man, мы используем стили DocBook XSL. Страницы man распространяются в архиве tar, подобно <acronym>HTML</acronym>-версии. Чтобы создать страницы man, выполните: <placeholder-1/>

source: Print Output via <application>JadeTeX</application>
ru: Получение печатной версии с использованием <application>JadeTeX</application>

source: To generate PostScript via <acronym>DVI</acronym> in A4 format: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make postgres-A4.ps</userinput> </screen> In U.S. letter format: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make postgres-US.ps</userinput> </screen>
ru: Чтобы получить PostScript через <acronym>DVI</acronym> для формата A4, выполните: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make postgres-A4.ps</userinput> </screen> Для формата &laquo;U.S. Letter&raquo; выполните: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make postgres-US.ps</userinput> </screen>

source: To make a <acronym>PDF</acronym>: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make postgres-A4.pdf</userinput> </screen> or: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make postgres-US.pdf</userinput> </screen> (Of course you can also make a <acronym>PDF</acronym> version from the PostScript, but if you generate <acronym>PDF</acronym> directly, it will have hyperlinks and other enhanced features.)
ru: Чтобы получить <acronym>PDF</acronym>: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make postgres-A4.pdf</userinput> </screen> или: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make postgres-US.pdf</userinput> </screen> (Разумеется, вы можете получить <acronym>PDF</acronym> и из PostScript, но если сгенерировать <acronym>PDF</acronym> напрямую, полученный файл будет содержать гиперссылки и другие расширенные особенности.)

source: If you want to use <application>JadeTex</application> to produce a printable rendition of the documentation, you can use one of the following commands: <placeholder-1/>
ru: Если вы хотите получить печатную версию документации, используя <application>JadeTex</application>, вы можете воспользоваться одной из следующих команд: <placeholder-1/>

source: When using JadeTeX to build the PostgreSQL documentation, you will probably need to increase some of TeX's internal parameters. These can be set in the file <filename>texmf.cnf</filename>. The following settings worked at the time of this writing: <placeholder-1/>
ru: Если вы намерены использовать JadeTeX для сборки документации PostgreSQL, вам, вероятно, потребуется увеличить некоторые внутренние параметры TeX. Их можно задать в файле <filename>texmf.cnf</filename>. На момент написания этого описания работали следующие параметры: <placeholder-1/>

source: Overflow Text
ru: Переполнение текста

source: Occasionally text is too wide for the printed margins, and in extreme cases, too wide for the printed page, e.g. non-wrapped text, wide tables. Overly wide text generates <quote>Overfull hbox</quote> messages in the TeX log output file, e.g. <filename>postgres-US.log</filename> or <filename>postgres-A4.log</filename>. There are 72 points in an inch so anything reported as over 72 points too wide will probably not fit on the printed page (assuming one inch margins). To find the <acronym>SGML</acronym> text causing the overflow, find the first page number mentioned above the overflow message, e.g. <literal>[50 ###]</literal> (page 50), and look at the page after that (e.g. page 51) in the <acronym>PDF</acronym> file to see the overflow text and adjust the <acronym>SGML</acronym> accordingly.
ru: В некоторых местах текст документации оказывается слишком широким для предопределённых границ, и, в особых случаях, не умещается на странице. В частности, это наблюдается с широкими таблицами или текстом, не допускающим переносы. Сталкиваясь с такой ситуацией, TeX выводит сообщения <quote>Overfull hbox</quote> (Переполнение горизонтальной рамки) в файл журнала, например, <filename>postgres-US.log</filename> или <filename>postgres-A4.log</filename>. С учётом того, что дюйм составляют 72 точки, всё, что выходит за границу больше чем на 72 точки, скорее всего не поместится на печатаемой странице (при размере поля один дюйм). Чтобы найти в <acronym>SGML</acronym> текст, выходящий за границы, определите номер страницы, указанный над сообщением о переполнении, например: <literal>[50 ###]</literal> (стр. 50), и посмотрите на следующую страницу (в данном случае, стр. 51) в <acronym>PDF</acronym>. Увидев, какой текст на ней выходит за границы, внесите требуемые коррективы в <acronym>SGML</acronym>.

source: Print Output via <acronym>RTF</acronym>
ru: Получение печатной версии из <acronym>RTF</acronym>

source: You can also create a printable version of the <productname>PostgreSQL</productname> documentation by converting it to <acronym>RTF</acronym> and applying minor formatting corrections using an office suite. Depending on the capabilities of the particular office suite, you can then convert the documentation to PostScript of <acronym>PDF</acronym>. The procedure below illustrates this process using <productname>Applixware</productname>.
ru: Вы также можете получить печатную версию документации <productname>PostgreSQL</productname>, преобразовав её в формат <acronym>RTF</acronym>, который позволяет откорректировать форматирование в офисном пакете. В зависимости от возможностей конкретного текстового редактора, затем документацию можно будет преобразовать в PostScript или <acronym>PDF</acronym>. Ниже описывается, как это можно проделать с применением <productname>Applixware</productname>.

source: It appears that current versions of the <productname>PostgreSQL</productname> documentation trigger some bug in or exceed the size limit of OpenJade. If the build process of the <acronym>RTF</acronym> version hangs for a long time and the output file still has size 0, then you might have hit that problem. (But keep in mind that a normal build takes 5 to 10 minutes, so don't abort too soon.)
ru: Судя по всему, текущие версии документации <productname>PostgreSQL</productname> провоцируют ошибку или превышают ограничения размера, существующие в OpenJade. Если у вас процесс сборки <acronym>RTF</acronym> &laquo;зависает&raquo; на долгое время, а размер выводимого файла остаётся нулевым, возможно, вы столкнулись именно с этой проблемой. (Но учтите, что обычная сборка занимает от 5 до 10 минут, так что не прерывайте процесс слишком быстро.)

source: <productname>Applixware</productname> <acronym>RTF</acronym> Cleanup
ru: Очистка <acronym>RTF</acronym> в <productname>Applixware</productname>

source: <application>OpenJade</application> omits specifying a default style for body text. In the past, this undiagnosed problem led to a long process of table of contents generation. However, with great help from the <productname>Applixware</productname> folks the symptom was diagnosed and a workaround is available.
ru: <application>OpenJade</application> опускает указание стиля по умолчанию для основного текста. В прошлом, пока это не было обнаружено, генерация оглавления документации выполнялась очень долго. Однако, благодаря помощи разработчиков <productname>Applixware</productname>, мы смогли диагностировать эту проблему и найти обходное решение.

source: Generate the <acronym>RTF</acronym> version by typing: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make postgres.rtf</userinput> </screen>
ru: Получите <acronym>RTF</acronym>-версию документации, введя: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make postgres.rtf</userinput> </screen>

source: Repair the RTF file to correctly specify all styles, in particular the default style. If the document contains <sgmltag>refentry</sgmltag> sections, one must also replace formatting hints which tie a preceding paragraph to the current paragraph, and instead tie the current paragraph to the following one. A utility, <command>fixrtf</command>, is available in <filename>doc/src/sgml</filename> to accomplish these repairs: <screen> <prompt>doc/src/sgml$ </prompt><userinput>./fixrtf --refentry postgres.rtf</userinput> </screen>
ru: Исправьте файл RTF, чтобы в нём корректно указывались все стили, в частности, стиль по умолчанию. Если документ содержит разделы <sgmltag>refentry</sgmltag>, нужно также заменить указания форматирования, связывающие предыдущий абзац с текущим, на указания, связывающие текущий абзац со следующим. Для внесения этих корректив предоставляется утилита <command>fixrtf</command> (она находится в <filename>doc/src/sgml</filename>): <screen> <prompt>doc/src/sgml$ </prompt><userinput>./fixrtf --refentry postgres.rtf</userinput> </screen>

source: The script adds <literal>{\s0 Normal;}</literal> as the zeroth style in the document. According to <productname>Applixware</productname>, the RTF standard would prohibit adding an implicit zeroth style, though Microsoft Word happens to handle this case. For repairing <sgmltag>refentry</sgmltag> sections, the script replaces <literal>\keepn</literal> tags with <literal>\keep</literal>.
ru: Этот скрипт добавляет в документ <literal>{\s0 Normal;}</literal> в качестве нулевого стиля. По утверждению разработчиков <productname>Applixware</productname>, стандарт RTF не должен допускать добавления неявного нулевого стиля, хотя Microsoft Word обрабатывает это указание. Для исправления разделов <sgmltag>refentry</sgmltag> этот скрипт заменяет теги <literal>\keepn</literal> на <literal>\keep</literal>.

source: Open a new document in <productname>Applixware Words</productname> and then import the <acronym>RTF</acronym> file.
ru: Создайте новый документ в <productname>Applixware Words</productname>, а затем импортируйте в него файл <acronym>RTF</acronym>.

source: Generate a new table of contents (ToC) using <productname>Applixware</productname>.
ru: Создайте оглавление с помощью <productname>Applixware</productname>.

source: Select the existing ToC lines, from the beginning of the first character on the first line to the last character of the last line.
ru: Выделите строки существующего оглавления, от первого символа первой строки до последнего символа последней строки.

source: Build a new ToC using <menuchoice><guimenu>Tools</guimenu><guisubmenu>Book Building</guisubmenu><guimenuitem>Create Table of Contents</guimenuitem></menuchoice>. Select the first three levels of headers for inclusion in the ToC. This will replace the existing lines imported in the RTF with a native <productname>Applixware</productname> ToC.
ru: Постройте новое оглавление, выбрав в меню <menuchoice><guimenu>Tools</guimenu><guisubmenu>Book Building</guisubmenu><guimenuitem>Create Table of Contents</guimenuitem></menuchoice> (<menuchoice><guimenu>Сервис</guimenu><guisubmenu>Сборка книги</guisubmenu><guimenuitem>Создать оглавление</guimenuitem></menuchoice>). Выберите первые три уровня заголовков для включения в оглавление. В результате строки оглавления, импортированные из RTF, будут заменены оглавлением, созданным в <productname>Applixware</productname>.

source: Style
ru: Стиль

source: First Indent (inches)
ru: Первый отступ (в дюймах)

source: Left Indent (inches)
ru: Отступ слева (в дюймах)

source: Adjust the ToC formatting by using <menuchoice><guimenu>Format</guimenu><guimenuitem>Style</guimenuitem></menuchoice>, selecting each of the three ToC styles, and adjusting the indents for <literal>First</literal> and <literal>Left</literal>. Use the following values: <placeholder-1/>
ru: Поправьте форматирование оглавления, выбрав пункт меню <menuchoice><guimenu>Format</guimenu><guimenuitem>Style</guimenuitem></menuchoice> (<menuchoice><guimenu>Формат</guimenu><guimenuitem>Стиль</guimenuitem></menuchoice>), и определив следующие значения отступов (<literal>First</literal> (Первый) и <literal>Left</literal> (Слева)) для каждого из трёх стилей оглавления: <placeholder-1/>

source: Adjust page breaks.
ru: Расставьте разрывы страниц.

source: Adjust table column widths.
ru: Поправьте ширину столбцов таблиц.

source: Work through the document to: <placeholder-1/>
ru: Проработайте форматирование документа: <placeholder-1/>

source: Replace the right-justified page numbers in the Examples and Figures portions of the ToC with correct values. This only takes a few minutes.
ru: Замените выравненные по правому краю номера страниц в части оглавления Примеры и Рисунки правильными значениями. Это должно занять всего несколько минут.

source: Delete the index section from the document if it is empty.
ru: Удалите из документа раздел алфавитного указателя, если он пуст.

source: Regenerate and adjust the table of contents.
ru: Сгенерируйте заново и скорректируйте оглавление.

source: Select the ToC field.
ru: Выделите поле оглавления.

source: Select <menuchoice><guimenu>Tools</guimenu><guisubmenu>Book Building</guisubmenu><guimenuitem>Create Table of Contents</guimenuitem></menuchoice>.
ru: Выберите в меню <menuchoice><guimenu>Tools</guimenu><guisubmenu>Book Building</guisubmenu><guimenuitem>Create Table of Contents</guimenuitem></menuchoice> (<menuchoice><guimenu>Сервис</guimenu><guisubmenu>Сборка книги</guisubmenu><guimenuitem>Создать оглавление</guimenuitem></menuchoice>).

source: Unbind the ToC by selecting <menuchoice><guimenu>Tools</guimenu><guisubmenu>Field Editing</guisubmenu><guimenuitem>Unprotect</guimenuitem></menuchoice>.
ru: Отделите оглавление, выбрав в меню <menuchoice><guimenu>Tools</guimenu><guisubmenu>Field Editing</guisubmenu><guimenuitem>Unprotect</guimenuitem></menuchoice> (<menuchoice><guimenu>Сервис</guimenu><guisubmenu>Изменение полей</guisubmenu><guimenuitem>Снять защиту</guimenuitem></menuchoice>).

source: Delete the first line in the ToC, which is an entry for the ToC itself.
ru: Удалите первую строку в оглавлении, которая указывает на само оглавление.
