Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/docguide.po
Languages: ru

source: Save the document as native <productname>Applixware Words</productname> format to allow easier last minute editing later.
ru: Сохраните документ в специальном формате <productname>Applixware Words</productname>, чтобы в него можно было легко внести последние правки.

source: <quote>Print</quote> the document to a file in PostScript format.
ru: <quote>Напечатайте</quote> документ в файл формата PostScript.

source: Plain Text Files
ru: Простые текстовые файлы

source: The installation instructions are also distributed as plain text, in case they are needed in a situation where better reading tools are not available. The <filename>INSTALL</filename> file corresponds to <xref linkend="installation"/>, with some minor changes to account for the different context. To recreate the file, change to the directory <filename>doc/src/sgml</filename> and enter <userinput>make INSTALL</userinput>.
ru: Инструкции по установке также распространяются в виде обычного текста, на случай, если они понадобятся в ситуации, когда под рукой не окажется средств просмотра более удобного формата. Файл <filename>INSTALL</filename> соответствует <xref remap="3" linkend="installation"/>, с небольшими изменениями, внесёнными с учётом другого контекста. Чтобы пересоздать этот файл, перейдите в каталог <filename>doc/src/sgml</filename> и введите <userinput>make INSTALL</userinput>.

source: In the past, the release notes and regression testing instructions were also distributed as plain text, but this practice has been discontinued.
ru: В прошлом примечания к выпуску и инструкции по регрессионному тестированию также распространялись в виде простых текстовых файлов, но эта практика была прекращена.

source: Syntax Check
ru: Проверка синтаксиса

source: Building the documentation can take very long. But there is a method to just check the correct syntax of the documentation files, which only takes a few seconds: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make check</userinput> </screen>
ru: Сборка всей документации может занять много времени. Но если нужно проверить только синтаксис файлов документации, это можно сделать всего за несколько секунд: <screen> <prompt>doc/src/sgml$ </prompt><userinput>make check</userinput> </screen>

source: Documentation Authoring
ru: Написание документации

source: <acronym>SGML</acronym> and <productname>DocBook</productname> do not suffer from an oversupply of open-source authoring tools. The most common tool set is the <productname>Emacs</productname>/<productname>XEmacs</productname> editor with appropriate editing mode. On some systems these tools are provided in a typical full installation.
ru: Форматы <acronym>SGML</acronym> и <productname>DocBook</productname> не страдают от обилия средств их редактирования с открытым исходным кодом. Чаще всего для написания документации используется редактор <productname>Emacs</productname>/<productname>XEmacs</productname> в подходящем режиме. В некоторых системах эти редакторы устанавливаются при типичной полной установке.

source: <productname>PSGML</productname> is the most common and most powerful mode for editing <acronym>SGML</acronym> documents. When properly configured, it will allow you to use <application>Emacs</application> to insert tags and check markup consistency. You could use it for <acronym>HTML</acronym> as well. Check the <ulink url="http://www.lysator.liu.se/projects/about_psgml.html"> PSGML web site</ulink> for downloads, installation instructions, and detailed documentation.
ru: Режим <productname>PSGML</productname> — наиболее популярный и мощный режим редактирования документов <acronym>SGML</acronym>. При правильной настройке в <application>Emacs</application> он позволяет вставлять теги и проверять корректность разметки. Его также можно использовать для редактирования <acronym>HTML</acronym>. Загружаемые файлы, инструкции по установке и подробную документацию вы можете найти на <ulink url="http://www.lysator.liu.se/projects/about_psgml.html">сайте PSGML</ulink>.

source: There is one important thing to note with <productname>PSGML</productname>: its author assumed that your main <acronym>SGML</acronym> <acronym>DTD</acronym> directory would be <filename>/usr/local/lib/sgml</filename>. If, as in the examples in this chapter, you use <filename>/usr/local/share/sgml</filename>, you have to compensate for this, either by setting <envar>SGML_CATALOG_FILES</envar> environment variable, or you can customize your <productname>PSGML</productname> installation (its manual tells you how).
ru: Необходимо отметить важный момент относительно <productname>PSGML</productname>: его автор предполагал, что вашим основным каталогом с <acronym>DTD</acronym> <acronym>SGML</acronym> будет <filename>/usr/local/lib/sgml</filename>. Если же у вас, как и в приводимых ранее примерах, это каталог <filename>/usr/local/share/sgml</filename>, вам нужно дополнительно скорректировать предопределённый путь, либо воспользовавшись переменной окружения <envar>SGML_CATALOG_FILES</envar>, либо настроив соответственно вашу инсталляцию <productname>PSGML</productname> (как это сделать, можно узнать из его описания).

source: ; ********** for SGML mode (psgml) (setq sgml-omittag t) (setq sgml-shorttag t) (setq sgml-minimize-attributes nil) (setq sgml-always-quote-attributes t) (setq sgml-indent-step 1) (setq sgml-indent-data t) (setq sgml-parent-document nil) (setq sgml-exposed-tags nil) (setq sgml-catalog-files '("/usr/local/share/sgml/catalog")) (autoload 'sgml-mode "psgml" "Major mode to edit SGML files." t )
ru: ; ********** для режима SGML (psgml) (setq sgml-omittag t) (setq sgml-shorttag t) (setq sgml-minimize-attributes nil) (setq sgml-always-quote-attributes t) (setq sgml-indent-step 1) (setq sgml-indent-data t) (setq sgml-parent-document nil) (setq sgml-exposed-tags nil) (setq sgml-catalog-files '("/usr/local/share/sgml/catalog")) (autoload 'sgml-mode "psgml" "Major mode to edit SGML files." t )

source: Put the following in your <filename>~/.emacs</filename> environment file (adjusting the path names to be appropriate for your system): <placeholder-1/> and in the same file add an entry for <acronym>SGML</acronym> into the (existing) definition for <varname>auto-mode-alist</varname>: <placeholder-2/>
ru: Поместите следующие строки в файл <filename>~/.emacs</filename> (изменив пути на подходящие для вашей системы): <placeholder-1/> и добавьте в тот же файл запись для <acronym>SGML</acronym> в существующее определение <varname>auto-mode-alist</varname>: <placeholder-2/>

source: You might find that when using <productname>PSGML</productname>, a comfortable way of working with these separate files of book parts is to insert a proper <literal>DOCTYPE</literal> declaration while you're editing them. If you are working on this source, for instance, it is an appendix chapter, so you would specify the document as an <quote>appendix</quote> instance of a DocBook document by making the first line look like this: <placeholder-1/> This means that anything and everything that reads <acronym>SGML</acronym> will get it right, and I can verify the document with <command>nsgmls -s docguide.sgml</command>. (But you need to take out that line before building the entire documentation set.)
ru: Используя <productname>PSGML</productname>, вы можете найти удобным вставлять подходящие объявления <literal>DOCTYPE</literal> в отдельные файлы книги, когда вы редактируете их. Например, редактируя текущий текст, который относится к главе приложений (appendix), вы можете обозначить документ как экземпляр документа <quote>appendix</quote>, добавив в него следующую первую строку: <placeholder-1/> Это будет означать, что всё и вся, читающее этот <acronym>SGML</acronym>, сможет прочитать его правильно, и его корректность можно будет проверить командой <command>nsgmls -s docguide.sgml</command>. (Но вы должны будете убрать эту строку, прежде чем собирать весь комплект документации.)

source: Other Emacs Modes
ru: Другие режимы Emacs

source: <productname>GNU Emacs</productname> ships with a different <acronym>SGML</acronym> mode, which is not quite as powerful as <productname>PSGML</productname>, but it's less confusing and lighter weight. Also, it offers syntax highlighting (font lock), which can be very helpful. <filename>src/tools/editors/emacs.samples</filename> contains sample settings for this mode.
ru: <productname>GNU Emacs</productname> предлагает другой режим <acronym>SGML</acronym>, не такой мощный как <productname>PSGML</productname>, но при этом менее запутанный и тяжеловесный. Кроме того, в нём реализована подсветка синтаксиса (привязка шрифтов), которая бывает весьма полезна. Пример конфигурации для этого режима содержится в <filename>src/tools/editors/emacs.samples</filename>.

source: Norm Walsh offers a <ulink url="http://nwalsh.com/emacs/docbookide/index.html">major mode</ulink> specifically for DocBook which also has font-lock and a number of features to reduce typing.
ru: Норм Уолш предложил <ulink url="http://nwalsh.com/emacs/docbookide/index.html">главный режим</ulink> специально для DocBook, в котором также реализовал привязку шрифтов и ряд возможностей для оптимизации ввода текста.

source: Style Guide
ru: Руководство по стилю

source: Reference Pages
ru: Справочные страницы

source: Reference pages should follow a standard layout. This allows users to find the desired information more quickly, and it also encourages writers to document all relevant aspects of a command. Consistency is not only desired among <productname>PostgreSQL</productname> reference pages, but also with reference pages provided by the operating system and other packages. Hence the following guidelines have been developed. They are for the most part consistent with similar guidelines established by various operating systems.
ru: Справочные страницы должны следовать единой структуре. Это позволит пользователям быстрее находить нужную информацию и также подталкивает авторов к описанию всех аспектов команды. При этом важна согласованность не только справочных страниц <productname>PostgreSQL</productname> между собой, но также и со справочными страницами, предоставляемыми операционной системой и другим пакетами. В соответствии с этими требованиями и были разработаны следующие рекомендации. По большей части они соответствуют рекомендациям, сопровождающим документацию различных операционных систем.

source: Name
ru: Название

source: This section is generated automatically. It contains the command name and a half-sentence summary of its functionality.
ru: Этот раздел генерируется автоматически. Он содержит имя команды и краткое (в полпредложения) описание её функциональности.

source: Synopsis
ru: Синтаксис

source: This section contains the syntax diagram of the command. The synopsis should normally not list each command-line option; that is done below. Instead, list the major components of the command line, such as where input and output files go.
ru: В этом разделе представляется синтаксическая диаграмма команды. Обычно в нём не указываются все аргументы командной строки, они перечисляются ниже. Вместо этого, здесь обозначаются основные компоненты командной строки, например, входные и выходные файлы.

source: Description
ru: Описание

source: Several paragraphs explaining what the command does.
ru: Состоящее из нескольких абзацев описание действия команды.

source: Options
ru: Параметры

source: A list describing each command-line option. If there are a lot of options, subsections can be used.
ru: Список всех аргументов командной строки с описанием. Если аргументов очень много, их можно разделить на подразделы.

source: Exit Status
ru: Код завершения

source: If the program uses 0 for success and non-zero for failure, then you do not need to document it. If there is a meaning behind the different non-zero exit codes, list them here.
ru: Если программа возвращает 0 в случае успеха и ненулевое значение при ошибке, описывать это не нужно. Если же различные ненулевые коды возврата имеют определённые значения, опишите их в этом разделе.

source: Usage
ru: Использование

source: Describe any sublanguage or run-time interface of the program. If the program is not interactive, this section can usually be omitted. Otherwise, this section is a catch-all for describing run-time features. Use subsections if appropriate.
ru: В этом разделе описывается встроенный язык или внутренний интерфейс программы. Если программа неинтерактивная, этот раздел обычно можно опустить. В противном случае он может включать всеобъемлющее описание возможностей времени выполнения. Если это уместно, в нём можно использовать подразделы.

source: Environment
ru: Переменные окружения

source: List all environment variables that the program might use. Try to be complete; even seemingly trivial variables like <envar>SHELL</envar> might be of interest to the user.
ru: Список всех переменных окружения, которые может использовать эта программа. Постарайтесь сделать его полным — даже кажущиеся очевидными переменные вроде <envar>SHELL</envar> могут быть интересны пользователю.

source: Files
ru: Файлы

source: List any files that the program might access implicitly. That is, do not list input and output files that were specified on the command line, but list configuration files, etc.
ru: Список всех файлов, к которым программа может обращаться неявно. То есть, здесь нужно перечислять не входные и выходные файлы, передаваемые в командной строке, а файлы конфигурации и т. п.

source: Diagnostics
ru: Диагностика

source: Explain any unusual output that the program might create. Refrain from listing every possible error message. This is a lot of work and has little use in practice. But if, say, the error messages have a standard format that the user can parse, this would be the place to explain it.
ru: В этом разделе можно объяснить необычные сообщения, которые может выдавать программа. Воздержитесь от разъяснения вообще всех сообщений об ошибках. Это потребует больших усилий, но принесёт мало практической пользы. Но если, скажем, сообщения об ошибках имеют определённый формат, который может быть разобран, об этом можно рассказать здесь.

source: Notes
ru: Замечания

source: Anything that doesn't fit elsewhere, but in particular bugs, implementation flaws, security considerations, compatibility issues.
ru: Всё, что не подходит для других разделов, но особенно описание ошибок, недостатков реализации, соображения безопасности и вопросы совместимости.

# term
source: Examples
ru: Примеры

# para
source: Examples
ru: Примеры

source: History
ru: История

source: If there were some major milestones in the history of the program, they might be listed here. Usually, this section can be omitted.
ru: Если в истории программы были значительные вехи, о них можно рассказать здесь. Обычно этот раздел можно опустить.

source: Author
ru: Автор

source: Author (only used in the contrib section)
ru: Автор (используется только в разделе внешних разработок (contrib))

source: See Also
ru: См. также

source: Cross-references, listed in the following order: other <productname>PostgreSQL</productname> command reference pages, <productname>PostgreSQL</productname> SQL command reference pages, citation of <productname>PostgreSQL</productname> manuals, other reference pages (e.g., operating system, other packages), other documentation. Items in the same group are listed alphabetically.
ru: Перекрёстные ссылки, перечисленные в следующем порядке: справочные страницы других команд <productname>PostgreSQL</productname>, справочные страницы SQL-команд <productname>PostgreSQL</productname>, цитаты из руководств <productname>PostgreSQL</productname>, другие справочные страницы (например, относящиеся к операционной системе и другим пакетам), другая документация. Пункты внутри одной группы перечисляются в алфавитном порядке.

source: Reference pages that describe executable commands should contain the following sections, in this order. Sections that do not apply can be omitted. Additional top-level sections should only be used in special circumstances; often that information belongs in the <quote>Usage</quote> section. <placeholder-1/>
ru: Справочные страницы, описывающие исполняемые команды, должны содержать следующие разделы, в указанном порядке. Разделы, неуместные для данной команды, могут опускаться. Дополнительные разделы верхнего уровня могут использоваться только в особых случаях; часто эта информация помещается в раздел <quote>Использование</quote>. <placeholder-1/>

source: Reference pages describing SQL commands should contain the following sections: Name, Synopsis, Description, Parameters, Outputs, Notes, Examples, Compatibility, History, See Also. The Parameters section is like the Options section, but there is more freedom about which clauses of the command can be listed. The Outputs section is only needed if the command returns something other than a default command-completion tag. The Compatibility section should explain to what extent this command conforms to the SQL standard(s), or to which other database system it is compatible. The See Also section of SQL commands should list SQL commands before cross-references to programs.
ru: Справочные страницы, описывающие команды SQL, должны содержать следующие разделы: Название, Синтаксис, Описание, Параметры, Результаты, Замечания, Примеры, Совместимость, История, См. также. Раздел &laquo;Параметры&raquo; похож на раздел &laquo;Аргументы&raquo; в описании исполняемых команд, но в нём можно выбирать, какие именно предложения команды описывать. Раздел &laquo;Результаты&raquo; может потребоваться, только если команда возвращает результат, отличный от стандартного тега завершения команды. В разделе &laquo;Совместимость&raquo; следует отметить, в какой степени описываемая команда соответствует стандарту SQL, или с какими другими СУБД она совместима. В разделе &laquo;См. также&raquo; следует привести ссылки на связанные команды SQL (до ссылок на команды).
