Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/high-availability.po
Languages: ru

source: Many of the above solutions allow multiple servers to handle multiple queries, but none allow a single query to use multiple servers to complete faster. This solution allows multiple servers to work concurrently on a single query. It is usually accomplished by splitting the data among servers and having each server execute its part of the query and return results to a central server where they are combined and returned to the user. <productname>Pgpool-II</productname> has this capability. Also, this can be implemented using the <productname>PL/Proxy</productname> tool set.
ru: Многие из указанных выше решений позволяют обрабатывать несколько запросов на нескольких серверах, но ни один из них не может обрабатывать один запрос с применением нескольких серверов для уменьшения общего времени выполнения. Подобное решение позволяет нескольким серверам обрабатывать один запрос одновременно. Такое обычно достигается путём разделения данных между серверами, обработкой на сервере своей части запроса с возвратом результата на центральный сервер. Там данные проходят окончательную обработку и возвращаются пользователю. <productname>Pgpool-II</productname> предоставляет такую возможность. Так же это может быть реализовано с применением набора средств <productname>PL/Proxy</productname>.

source: Log-Shipping Standby Servers
ru: Трансляция журналов на резервные серверы

source: Continuous archiving can be used to create a <firstterm>high availability</firstterm> (HA) cluster configuration with one or more <firstterm>standby servers</firstterm> ready to take over operations if the primary server fails. This capability is widely referred to as <firstterm>warm standby</firstterm> or <firstterm>log shipping</firstterm>.
ru: Постоянная архивация может использоваться для создания кластерной конфигурации <firstterm>высокой степени доступности</firstterm> (HA) с одним или несколькими <firstterm>резервными серверами</firstterm>, способными заменить ведущий сервер в случае выхода его из строя. Такую реализацию отказоустойчивости часто называют <firstterm>тёплый резерв</firstterm> или <firstterm>трансляция журналов</firstterm>.

source: The primary and standby server work together to provide this capability, though the servers are only loosely coupled. The primary server operates in continuous archiving mode, while each standby server operates in continuous recovery mode, reading the WAL files from the primary. No changes to the database tables are required to enable this capability, so it offers low administration overhead compared to some other replication solutions. This configuration also has relatively low performance impact on the primary server.
ru: Ведущий и резервный серверы работают совместно для обеспечения этой возможности, при этом они связаны опосредованно. Ведущий сервер работает в режиме постоянной архивации изменений, в то время как каждый резервный сервер работает в режиме постоянного приема архивных изменений, зачитывая WAL-файлы с ведущего. Для обеспечения этой возможности не требуется вносить изменения в таблицы БД, что требует существенно меньших административных издержек в сравнении с некоторыми другими решениями репликации. Так же такая конфигурация относительно слабо влияет на производительность ведущего сервера.

source: Directly moving WAL records from one database server to another is typically described as log shipping. <productname>PostgreSQL</productname> implements file-based log shipping by transferring WAL records one file (WAL segment) at a time. WAL files (16MB) can be shipped easily and cheaply over any distance, whether it be to an adjacent system, another system at the same site, or another system on the far side of the globe. The bandwidth required for this technique varies according to the transaction rate of the primary server. Record-based log shipping is more granular and streams WAL changes incrementally over a network connection (see <xref linkend="streaming-replication"/>).
ru: Непосредственную передачу записей WAL с одного сервера БД на другой обычно называют трансляцией журналов (или доставкой журналов). <productname>PostgreSQL</productname> реализует трансляцию журналов на уровне файлов, передавая записи WAL по одному файлу (сегменту WAL) единовременно. Файлы WAL (размером 16 МБ) можно легко и эффективно передать на любое расстояние, будь то соседний сервер, другая система в местной сети или сервер на другом краю света. Требуемая пропускная способность при таком подходе определяется скоростью записи транзакций на ведущем сервере. Трансляция журналов на уровне записей более фрагментарная операция, при которой изменения WAL передаются последовательно через сетевое соединение (см. <xref remap="4" linkend="streaming-replication"/>).

source: It should be noted that log shipping is asynchronous, i.e., the WAL records are shipped after transaction commit. As a result, there is a window for data loss should the primary server suffer a catastrophic failure; transactions not yet shipped will be lost. The size of the data loss window in file-based log shipping can be limited by use of the <varname>archive_timeout</varname> parameter, which can be set as low as a few seconds. However such a low setting will substantially increase the bandwidth required for file shipping. Streaming replication (see <xref linkend="streaming-replication"/>) allows a much smaller window of data loss.
ru: Следует отметить, что трансляция журналов асинхронна, то есть записи WAL доставляются после завершения транзакции. В результате образуется окно, когда возможна потеря данных при отказе сервера: будут утеряны ещё не переданные транзакции. Размер этого окна при трансляции файлов журналов может быть ограничен параметром <varname>archive_timeout</varname>, который может принимать значение меньше нескольких секунд. Тем не менее подобные заниженные значения могут потребовать существенного увеличения пропускной способности, необходимой для трансляции файлов. При потоковой репликации (см. <xref remap="4" linkend="streaming-replication"/>) окно возможности потери данных гораздо меньше.

source: Recovery performance is sufficiently good that the standby will typically be only moments away from full availability once it has been activated. As a result, this is called a warm standby configuration which offers high availability. Restoring a server from an archived base backup and rollforward will take considerably longer, so that technique only offers a solution for disaster recovery, not high availability. A standby server can also be used for read-only queries, in which case it is called a Hot Standby server. See <xref linkend="hot-standby"/> for more information.
ru: Скорость восстановления достаточно высока, обычно резервный сервер становится полностью доступным через мгновение после активации. В результате такое решение называется тёплым резервом, что обеспечивает отличную отказоустойчивость. Восстановление сервера из архивной копии базы и применение изменений обычно происходит существенно дольше. Поэтому такие действия обычно требуются при восстановлении после аварии, не для отказоустойчивости. Так же резервный сервер может обрабатывать читающие запросы. В этом случае он называется сервером горячего резерва. См. <xref remap="4" linkend="hot-standby"/> для подробной информации.

source: <primary>warm standby</primary>
ru: <primary>тёплый резерв</primary>

source: <primary>PITR standby</primary>
ru: <primary>PITR резерв</primary>

source: <primary>standby server</primary>
ru: <primary>резервный сервер</primary>

source: <primary>log shipping</primary>
ru: <primary>трансляция журналов</primary>

source: <primary>witness server</primary>
ru: <primary>следящий сервер</primary>

source: Planning
ru: Планирование

source: It is usually wise to create the primary and standby servers so that they are as similar as possible, at least from the perspective of the database server. In particular, the path names associated with tablespaces will be passed across unmodified, so both primary and standby servers must have the same mount paths for tablespaces if that feature is used. Keep in mind that if <xref linkend="sql-createtablespace"/> is executed on the primary, any new mount point needed for it must be created on the primary and all standby servers before the command is executed. Hardware need not be exactly the same, but experience shows that maintaining two identical systems is easier than maintaining two dissimilar ones over the lifetime of the application and system. In any case the hardware architecture must be the same &mdash; shipping from, say, a 32-bit to a 64-bit system will not work.
ru: Обычно разумно подбирать ведущий и резервный серверы так, чтобы они были максимально похожи, как минимум с точки зрения базы данных. Тогда в частности, пути, связанные с табличными пространствами, могут передаваться без изменений. Таким образом, как на ведущем, так и на резервных серверах должны быть одинаковые пути монтирования для табличных пространств при использовании этой возможности БД. Учитывайте, что если <xref linkend="sql-createtablespace"/> выполнена на ведущем сервере, новая точка монтирования для этой команды уже должна существовать на резервных серверах до её выполнения. Аппаратная часть не должна быть в точности одинаковой, но опыт показывает, что сопровождать идентичные системы легче, чем две различные на протяжении жизненного цикла приложения и системы. В любом случае архитектура оборудования должна быть одинаковой &mdash; например, трансляция журналов с 32-битной на 64-битную систему не будет работать.

source: In general, log shipping between servers running different major <productname>PostgreSQL</productname> release levels is not possible. It is the policy of the PostgreSQL Global Development Group not to make changes to disk formats during minor release upgrades, so it is likely that running different minor release levels on primary and standby servers will work successfully. However, no formal support for that is offered and you are advised to keep primary and standby servers at the same release level as much as possible. When updating to a new minor release, the safest policy is to update the standby servers first &mdash; a new minor release is more likely to be able to read WAL files from a previous minor release than vice versa.
ru: В общем случае трансляция журналов между серверами с различными основными версиями <productname>PostgreSQL</productname> невозможна. Политика главной группы разработки PostgreSQL состоит в том, чтобы не вносить изменения в дисковые форматы при обновлениях корректирующей версии, таким образом, ведущий и резервный серверы, имеющие разные корректирующие версии, могут работать успешно. Тем не менее, формально такая возможность не поддерживается и рекомендуется поддерживать одинаковую версию ведущего и резервных серверов, насколько это возможно. При обновлении корректирующей версии безопаснее будет в первую очередь обновить резервные серверы &mdash; новая корректирующая версия с большей вероятностью прочитает файл WAL предыдущей корректирующей версии, чем наоборот.

source: Standby Server Operation
ru: Работа резервного сервера

source: In standby mode, the server continuously applies WAL received from the master server. The standby server can read WAL from a WAL archive (see <xref linkend="restore-command"/>) or directly from the master over a TCP connection (streaming replication). The standby server will also attempt to restore any WAL found in the standby cluster's <filename>pg_xlog</filename> directory. That typically happens after a server restart, when the standby replays again WAL that was streamed from the master before the restart, but you can also manually copy files to <filename>pg_xlog</filename> at any time to have them replayed.
ru: Сервер, работающий в режиме резервного, последовательно применяет файлы WAL, полученные от главного. Резервный сервер может читать файлы WAL из архива WAL (см. <xref remap="4" linkend="restore-command"/>) или напрямую с главного сервера по соединению TCP (потоковая репликация). Резервный сервер так же будет пытаться восстановить любой файл WAL, найденный в кластере резервного в каталоге <filename>pg_xlog</filename>. Это обычно происходит после перезапуска сервера, когда он применяет заново файлы WAL, полученные от главного сервера перед перезапуском. Но можно и вручную скопировать файлы в каталог <filename>pg_xlog</filename>, чтобы применить их в любой момент времени.

source: At startup, the standby begins by restoring all WAL available in the archive location, calling <varname>restore_command</varname>. Once it reaches the end of WAL available there and <varname>restore_command</varname> fails, it tries to restore any WAL available in the <filename>pg_xlog</filename> directory. If that fails, and streaming replication has been configured, the standby tries to connect to the primary server and start streaming WAL from the last valid record found in archive or <filename>pg_xlog</filename>. If that fails or streaming replication is not configured, or if the connection is later disconnected, the standby goes back to step 1 and tries to restore the file from the archive again. This loop of retries from the archive, <filename>pg_xlog</filename>, and via streaming replication goes on until the server is stopped or failover is triggered by a trigger file.
ru: В момент запуска резервный сервер начинает восстанавливать все доступные файлы WAL, размещённые в архивном каталоге, указанном в команде <varname>restore_command</varname>. По достижении конца доступных файлов WAL или при сбое команды <varname>restore_command</varname> сервер пытается восстановить все файлы WAL, доступные в каталоге <filename>pg_xlog</filename>. Если это не удаётся и потоковая репликация настроена, резервный сервер пытается присоединиться к ведущему и начать закачивать поток WAL с последней подтверждённой записи, найденной в архиве или <filename>pg_xlog</filename>. Если это действие закончилось неудачей, или потоковая репликация не настроена, или соединение позднее разорвалось, резервный сервер возвращается к шагу 1 и пытается восстановить файлы из архива вновь. Цикл обращения за файлами WAL к архиву, <filename>pg_xlog</filename>, и через потоковую репликацию продолжается до остановки сервера или переключения его роли, вызванного файлом-триггером.

source: Standby mode is exited and the server switches to normal operation when <command>pg_ctl promote</command> is run or a trigger file is found (<varname>trigger_file</varname>). Before failover, any WAL immediately available in the archive or in <filename>pg_xlog</filename> will be restored, but no attempt is made to connect to the master.
ru: Режим резерва завершается и сервер переключается в обычный рабочий режим при получении команды <command>pg_ctl promote</command> или при обнаружении файла-триггера (<varname>trigger_file</varname>). Перед переключением сервер восстановит все файлы WAL, непосредственно доступные из архива или <filename>pg_xlog</filename>, но пытаться подключиться к главному серверу он больше не будет.

source: Preparing the Master for Standby Servers
ru: Подготовка главного сервера для работы с резервными

source: Set up continuous archiving on the primary to an archive directory accessible from the standby, as described in <xref linkend="continuous-archiving"/>. The archive location should be accessible from the standby even when the master is down, i.e. it should reside on the standby server itself or another trusted server, not on the master server.
ru: Настройка постоянного архивирования на ведущем сервере в архивный каталог, доступный с резервного, описана в <xref remap="6" linkend="continuous-archiving"/>. Расположение архива должно быть доступно с резервного сервера даже при отключении главного, то есть его следует разместить на резервном или другом доверенном, но не на главном сервере.

source: If you want to use streaming replication, set up authentication on the primary server to allow replication connections from the standby server(s); that is, create a role and provide a suitable entry or entries in <filename>pg_hba.conf</filename> with the database field set to <literal>replication</literal>. Also ensure <varname>max_wal_senders</varname> is set to a sufficiently large value in the configuration file of the primary server. If replication slots will be used, ensure that <varname>max_replication_slots</varname> is set sufficiently high as well.
ru: При использовании потоковой репликации следует настроить режим аутентификации на ведущем сервере, чтобы разрешить соединения с резервных. Для этого создать роль и обеспечить подходящую запись в файле <filename>pg_hba.conf</filename> в разделе доступа к БД <literal>replication</literal>. Так же следует убедиться, что для параметра <varname>max_wal_senders</varname> задаётся достаточно большое значение в конфигурационном файле ведущего сервера. При использовании слотов для репликации также достаточно большое значение нужно задать для <varname>max_replication_slots</varname>.

source: Take a base backup as described in <xref linkend="backup-base-backup"/> to bootstrap the standby server.
ru: Создание базовой резервной копии, необходимой для запуска резервного сервера, описано в <xref remap="6" linkend="backup-base-backup"/>.

source: Setting Up a Standby Server
ru: Настройка резервного сервера

source: To set up the standby server, restore the base backup taken from primary server (see <xref linkend="backup-pitr-recovery"/>). Create a recovery command file <filename>recovery.conf</filename> in the standby's cluster data directory, and turn on <varname>standby_mode</varname>. Set <varname>restore_command</varname> to a simple command to copy files from the WAL archive. If you plan to have multiple standby servers for high availability purposes, set <varname>recovery_target_timeline</varname> to <literal>latest</literal>, to make the standby server follow the timeline change that occurs at failover to another standby.
ru: Для запуска резервного сервера нужно восстановить резервную копию, снятую с ведущего (см. <xref remap="4" linkend="backup-pitr-recovery"/>). Затем нужно создать файл команд восстановления <filename>recovery.conf</filename> в каталоге данных кластера резервного сервера и включить режим <varname>standby_mode</varname>. Задайте в <varname>restore_command</varname> обычную команду копирования файлов из архива WAL. Если планируется несколько резервных серверов в целях отказоустойчивости, установите для <varname>recovery_target_timeline</varname> значение <literal>latest</literal>, чтобы резервный сервер переходил на новую линию времени, образуемую при отработке отказа и переключении на другой сервер.

source: Do not use pg_standby or similar tools with the built-in standby mode described here. <varname>restore_command</varname> should return immediately if the file does not exist; the server will retry the command again if necessary. See <xref linkend="log-shipping-alternative"/> for using tools like pg_standby.
ru: Не используйте pg_standby или подобные средства со встроенным режимом резервного сервера, описанным здесь. <varname>restore_command</varname> должна немедленно прекратиться при отсутствии файла; сервер повторит команду вновь при необходимости. Использование средств, подобных pg_standby, описано в <xref remap="6" linkend="log-shipping-alternative"/>.

source: If you want to use streaming replication, fill in <varname>primary_conninfo</varname> with a libpq connection string, including the host name (or IP address) and any additional details needed to connect to the primary server. If the primary needs a password for authentication, the password needs to be specified in <varname>primary_conninfo</varname> as well.
ru: При необходимости потоковой репликации заполните <varname>primary_conninfo</varname> параметрами строки соединения для libpq, включая имя (или IP-адрес) сервера и все остальные необходимые данные для соединения с ведущим сервером. Если ведущий требует пароль для аутентификации, пароль может быть так же передан в <varname>primary_conninfo</varname>.

source: If you're setting up the standby server for high availability purposes, set up WAL archiving, connections and authentication like the primary server, because the standby server will work as a primary server after failover.
ru: Если резервный сервер настраивается в целях отказоустойчивости, на нём следует настроить архивацию WAL, соединения и аутентификацию, как на ведущем сервере, потому что резервный сервер станет ведущим после отработки отказа.

source: If you're using a WAL archive, its size can be minimized using the <xref linkend="archive-cleanup-command"/> parameter to remove files that are no longer required by the standby server. The <application>pg_archivecleanup</application> utility is designed specifically to be used with <varname>archive_cleanup_command</varname> in typical single-standby configurations, see <xref linkend="pgarchivecleanup"/>. Note however, that if you're using the archive for backup purposes, you need to retain files needed to recover from at least the latest base backup, even if they're no longer needed by the standby.
ru: При использовании архива WAL его размер может быть уменьшен с помощью команды в параметре <xref linkend="archive-cleanup-command"/>, которая удаляет файлы уже не нужные для дальнейшей работы резервного сервера. Утилита <application>pg_archivecleanup</application> разработана специально для использования в <varname>archive_cleanup_command</varname> при типичной конфигурации с одним резервным сервером (см. <xref remap="4" linkend="pgarchivecleanup"/>). Следует отметить, что если архив используется в целях резервирования, следует сохранять все файлы необходимые для восстановления как минимум с последней базовой резервной копии, даже если они не нужны для резервного сервера.

source: A simple example of a <filename>recovery.conf</filename> is: <placeholder-1/>
ru: Простой пример <filename>recovery.conf</filename>: <placeholder-1/>

source: You can have any number of standby servers, but if you use streaming replication, make sure you set <varname>max_wal_senders</varname> high enough in the primary to allow them to be connected simultaneously.
ru: Можно поддерживать любое количество резервных серверов, но при применении потоковой репликации необходимо убедиться, что значение <varname>max_wal_senders</varname> на ведущем достаточно большое, чтобы все они могли подключиться одновременно.

source: Streaming Replication
ru: Потоковая репликация

source: <primary>Streaming Replication</primary>
ru: <primary>Потоковая репликация</primary>

source: Streaming replication allows a standby server to stay more up-to-date than is possible with file-based log shipping. The standby connects to the primary, which streams WAL records to the standby as they're generated, without waiting for the WAL file to be filled.
ru: При потоковой репликации резервный сервер может работать с меньшей задержкой, чем при трансляции файлов. Резервный сервер подключается к ведущему, который передаёт поток записей WAL резервному в момент их добавления, не дожидаясь окончания заполнения файла WAL.
