Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/high-availability.po
Languages: ru

source: Streaming replication is asynchronous by default (see <xref linkend="synchronous-replication"/>), in which case there is a small delay between committing a transaction in the primary and the changes becoming visible in the standby. This delay is however much smaller than with file-based log shipping, typically under one second assuming the standby is powerful enough to keep up with the load. With streaming replication, <varname>archive_timeout</varname> is not required to reduce the data loss window.
ru: Потоковая репликация асинхронна по умолчанию (см. <xref remap="4" linkend="synchronous-replication"/>), то есть имеется небольшая задержка между подтверждением транзакции на ведущем сервере и появлением этих изменений на резервном. Тем не менее, эта задержка гораздо меньше, чем при трансляции файлов журналов, обычно в пределах одной секунды, если резервный сервер достаточно мощный и справляется с нагрузкой. При потоковой репликации настраивать <varname>archive_timeout</varname> для уменьшения окна потенциальной потери данных не требуется.

source: If you use streaming replication without file-based continuous archiving, the server might recycle old WAL segments before the standby has received them. If this occurs, the standby will need to be reinitialized from a new base backup. You can avoid this by setting <varname>wal_keep_segments</varname> to a value large enough to ensure that WAL segments are not recycled too early, or by configuring a replication slot for the standby. If you set up a WAL archive that's accessible from the standby, these solutions are not required, since the standby can always use the archive to catch up provided it retains enough segments.
ru: При потоковой репликации без постоянной архивации на уровне файлов, сервер может избавиться от старых сегментов WAL до того, как резервный получит их. В этом случае резервный сервер потребует повторной инициализации из новой базовой резервной копии. Этого можно избежать, установив для <varname>wal_keep_segments</varname> достаточно большое значение, при котором сегменты WAL будут защищены от ранней очистки, либо настроив слот репликации для резервного сервера. Если с резервного сервера доступен архив WAL, этого не требуется, так как резервный может всегда обратиться к архиву для восполнения пропущенных сегментов.

source: To use streaming replication, set up a file-based log-shipping standby server as described in <xref linkend="warm-standby"/>. The step that turns a file-based log-shipping standby into streaming replication standby is setting <varname>primary_conninfo</varname> setting in the <filename>recovery.conf</filename> file to point to the primary server. Set <xref linkend="guc-listen-addresses"/> and authentication options (see <filename>pg_hba.conf</filename>) on the primary so that the standby server can connect to the <literal>replication</literal> pseudo-database on the primary server (see <xref linkend="streaming-replication-authentication"/>).
ru: Чтобы включить потоковую репликацию, сначала настройте резервный сервер на приём трансляции журналов, как описано в <xref remap="6" linkend="warm-standby"/>. Затем сделайте следующий шаг — переключите резервный сервер в режим репликации, установив в <varname>primary_conninfo</varname> в файле <filename>recovery.conf</filename> строку подключения, указывающую на ведущий. Настройте <xref linkend="guc-listen-addresses"/> и параметры аутентификации (см. <filename>pg_hba.conf</filename>) на ведущем сервере таким образом, чтобы резервный смог подключиться к псевдобазе <literal>replication</literal> на ведущем (см. <xref remap="4" linkend="streaming-replication-authentication"/>).

source: On systems that support the keepalive socket option, setting <xref linkend="guc-tcp-keepalives-idle"/>, <xref linkend="guc-tcp-keepalives-interval"/> and <xref linkend="guc-tcp-keepalives-count"/> helps the primary promptly notice a broken connection.
ru: В системах, поддерживающих параметр сокета keepalive, подходящие значения <xref linkend="guc-tcp-keepalives-idle"/>, <xref linkend="guc-tcp-keepalives-interval"/> и <xref linkend="guc-tcp-keepalives-count"/> помогут ведущему вовремя заметить разрыв соединения.

source: Set the maximum number of concurrent connections from the standby servers (see <xref linkend="guc-max-wal-senders"/> for details).
ru: Установите максимальное количество одновременных соединений с резервных серверов (см. описание <xref linkend="guc-max-wal-senders"/>.

source: When the standby is started and <varname>primary_conninfo</varname> is set correctly, the standby will connect to the primary after replaying all WAL files available in the archive. If the connection is established successfully, you will see a walreceiver process in the standby, and a corresponding walsender process in the primary.
ru: При запуске резервного сервера с правильно установленным <varname>primary_conninfo</varname> резервный подключится к ведущему после воспроизведения всех файлов WAL, доступных из архива. При успешном установлении соединения можно увидеть процесс walreceiver на резервном сервере и соответствующий процесс walsender на ведущем.

source: Authentication
ru: Аутентификация

source: It is very important that the access privileges for replication be set up so that only trusted users can read the WAL stream, because it is easy to extract privileged information from it. Standby servers must authenticate to the primary as a superuser or an account that has the <literal>REPLICATION</literal> privilege. It is recommended to create a dedicated user account with <literal>REPLICATION</literal> and <literal>LOGIN</literal> privileges for replication. While <literal>REPLICATION</literal> privilege gives very high permissions, it does not allow the user to modify any data on the primary system, which the <literal>SUPERUSER</literal> privilege does.
ru: Право использования репликации очень важно ограничить так, чтобы только доверенные пользователи могли читать поток WAL, так как из него можно извлечь конфиденциальную информацию. Резервный сервер должен аутентифицироваться на ведущем от имени суперпользователя или пользователя с правом <literal>REPLICATION</literal>. Настоятельно рекомендуется создавать выделенного пользователя с правами <literal>REPLICATION</literal> и <literal>LOGIN</literal> специально для репликации. Хотя право <literal>REPLICATION</literal> даёт очень широкие полномочия, оно не позволяет модифицировать данные в ведущей системе, тогда как с правом <literal>SUPERUSER</literal> это можно делать.

source: # Allow the user "foo" from host 192.168.1.100 to connect to the primary # as a replication standby if the user's password is correctly supplied. # # TYPE DATABASE USER ADDRESS METHOD host replication foo 192.168.1.100/32 md5
ru: # Разрешить пользователю "foo" с компьютера 192.168.1.100 подключаться к этому # серверу в качестве партнёра репликации, если был передан правильный пароль. # # TYPE DATABASE USER ADDRESS METHOD host replication foo 192.168.1.100/32 md5

source: Client authentication for replication is controlled by a <filename>pg_hba.conf</filename> record specifying <literal>replication</literal> in the <replaceable>database</replaceable> field. For example, if the standby is running on host IP <literal>192.168.1.100</literal> and the account name for replication is <literal>foo</literal>, the administrator can add the following line to the <filename>pg_hba.conf</filename> file on the primary: <placeholder-1/>
ru: Список аутентификации клиентов для репликации содержится в <filename>pg_hba.conf</filename> в записях с установленным значением <literal>replication</literal> в поле <replaceable>database</replaceable>. Например, если резервный сервер запущен на компьютере с IP-адресом <literal>192.168.1.100</literal> и учётная запись для репликации <literal>foo</literal>, администратор может добавить следующую строку в файл <filename>pg_hba.conf</filename> ведущего: <placeholder-1/>

source: # The standby connects to the primary that is running on host 192.168.1.50 # and port 5432 as the user "foo" whose password is "foopass". primary_conninfo = 'host=192.168.1.50 port=5432 user=foo password=foopass'
ru: # Резервный сервер подключается к ведущему, работающему на компьютере 192.168.1.50 # (порт 5432), от имени пользователя "foo" с паролем "foopass". primary_conninfo = 'host=192.168.1.50 port=5432 user=foo password=foopass'

source: The host name and port number of the primary, connection user name, and password are specified in the <filename>recovery.conf</filename> file. The password can also be set in the <filename>~/.pgpass</filename> file on the standby (specify <literal>replication</literal> in the <replaceable>database</replaceable> field). For example, if the primary is running on host IP <literal>192.168.1.50</literal>, port <literal>5432</literal>, the account name for replication is <literal>foo</literal>, and the password is <literal>foopass</literal>, the administrator can add the following line to the <filename>recovery.conf</filename> file on the standby: <placeholder-1/>
ru: Имя компьютера и номер порта для ведущего, имя пользователя для соединения и пароль указываются в файле <filename>recovery.conf</filename>. Пароль так же может быть задан через файл <filename>~/.pgpass</filename> на резервном сервере (указанном в определении с <literal>replication</literal> в поле <replaceable>database</replaceable>). Например, если ведущий принимает подключения по IP-адресу <literal>192.168.1.50</literal>, в порту <literal>5432</literal>, пользователя для репликации <literal>foo</literal> с паролем <literal>foopass</literal>, то администратор может добавить следующую строку в файл <filename>recovery.conf</filename> на резервном сервере: <placeholder-1/>

source: Monitoring
ru: Наблюдение

source: An important health indicator of streaming replication is the amount of WAL records generated in the primary, but not yet applied in the standby. You can calculate this lag by comparing the current WAL write location on the primary with the last WAL location received by the standby. They can be retrieved using <function>pg_current_xlog_location</function> on the primary and the <function>pg_last_xlog_receive_location</function> on the standby, respectively (see <xref linkend="functions-admin-backup-table"/> and <xref linkend="functions-recovery-info-table"/> for details). The last WAL receive location in the standby is also displayed in the process status of the WAL receiver process, displayed using the <command>ps</command> command (see <xref linkend="monitoring-ps"/> for details).
ru: Важным индикатором стабильности работы потоковой репликации является количество записей WAL, созданных на ведущем, но ещё не применённых на резервном сервере. Можно подсчитать задержку, сравнив текущий WAL, записанный на ведущем, с последним WAL, полученным на резервном. Эти показатели могут быть получены с помощью функций <function>pg_current_xlog_location</function> на ведущем и <function>pg_last_xlog_receive_location</function> на резервном соответственно (более подробно см. <xref remap="4" linkend="functions-admin-backup-table"/> и <xref remap="4" linkend="functions-recovery-info-table"/>). Местоположение последнего полученного WAL на резервном сервере так же показывается в статусе процесса получателя WAL, отображаемого по команде <command>ps</command> (более подробно см. <xref remap="4" linkend="monitoring-ps"/>).

source: You can retrieve a list of WAL sender processes via the <link linkend="monitoring-stats-views-table"><literal>pg_stat_replication</literal></link> view. Large differences between <function>pg_current_xlog_location</function> and <literal>sent_location</literal> field might indicate that the master server is under heavy load, while differences between <literal>sent_location</literal> and <function>pg_last_xlog_receive_location</function> on the standby might indicate network delay, or that the standby is under heavy load.
ru: Можно запросить список процессов отправителей WAL через представление <link linkend="monitoring-stats-views-table"><literal>pg_stat_replication</literal></link>. Большая разница между <function>pg_current_xlog_location</function> и полем <literal>sent_location</literal> указывает на то, что главный сервер работает с большой нагрузкой, в то время как разница между <literal>sent_location</literal> и <function>pg_last_xlog_receive_location</function> на резервном указывает на задержки в сети или на то, что с большой нагрузкой работает резервный.

source: Replication Slots
ru: Слоты репликации

source: <primary>replication slot</primary> <secondary>streaming replication</secondary>
ru: <primary>Слоты репликации</primary> <secondary>Потоковая репликация</secondary>

source: Replication slots provide an automated way to ensure that the master does not remove WAL segments until they have been received by all standbys, and that the master does not remove rows which could cause a <link linkend="hot-standby-conflict">recovery conflict</link> even when the standby is disconnected.
ru: Слоты репликации автоматически обеспечивают механизм сохранения сегментов WAL, пока они не будут получены всеми резервными и главный сервер не будет удалять строки, находящиеся в статусе <link linkend="hot-standby-conflict">recovery conflict</link> даже при отключении резервного.

source: In lieu of using replication slots, it is possible to prevent the removal of old WAL segments using <xref linkend="guc-wal-keep-segments"/>, or by storing the segments in an archive using <xref linkend="guc-archive-command"/>. However, these methods often result in retaining more WAL segments than required, whereas replication slots retain only the number of segments known to be needed. An advantage of these methods is that they bound the space requirement for <literal>pg_xlog</literal>; there is currently no way to do this using replication slots.
ru: Вместо использования слотов репликации для предотвращения удаления старых сегментов WAL можно применять <xref linkend="guc-wal-keep-segments"/>, или сохранять сегменты в архиве с помощью команды <xref linkend="guc-archive-command"/>. Тем не менее, эти методы часто приводят к тому, что хранится больше сегментов WAL, чем необходимо, в то время как слоты репликации оставляют только то количество сегментов, которое необходимо. Преимущество этих методов состоит в том, что они чётко задают объёмы места, необходимого для <literal>pg_xlog</literal>; в то время как текущая реализация репликационных слотов не представляет такой возможности.

source: Similarly, <xref linkend="guc-hot-standby-feedback"/> and <xref linkend="guc-vacuum-defer-cleanup-age"/> provide protection against relevant rows being removed by vacuum, but the former provides no protection during any time period when the standby is not connected, and the latter often needs to be set to a high value to provide adequate protection. Replication slots overcome these disadvantages.
ru: Подобным образом, параметры <xref linkend="guc-hot-standby-feedback"/> и <xref linkend="guc-vacuum-defer-cleanup-age"/> позволяют защитить востребованные строки от удаления при очистке, но первый параметр не защищает в тот промежуток времени, когда резервный сервер не подключён, а для последнего часто нужно задавать большое значение, чтобы обеспечить должную защиту. Слоты репликации решают эти проблемы.

source: Querying and manipulating replication slots
ru: Запросы и действия слотов репликации

source: Each replication slot has a name, which can contain lower-case letters, numbers, and the underscore character.
ru: Каждый слот репликации обладает именем, состоящим из строчных букв, цифр и символов подчёркивания.

source: Existing replication slots and their state can be seen in the <link linkend="view-pg-replication-slots"><structname>pg_replication_slots</structname></link> view.
ru: Имеющиеся слоты репликации и их статус можно просмотреть в представлении <link linkend="view-pg-replication-slots"><structname>pg_replication_slots</structname></link>.

source: Slots can be created and dropped either via the streaming replication protocol (see <xref linkend="protocol-replication"/>) or via SQL functions (see <xref linkend="functions-replication"/>).
ru: Слоты могут быть созданы и удалены как с помощью протокола потоковой репликации (см. <xref remap="4" linkend="protocol-replication"/>), так и посредством функций SQL (см. <xref remap="4" linkend="functions-replication"/>).

source: Configuration Example
ru: Пример конфигурации

source: You can create a replication slot like this: <placeholder-1/> To configure the standby to use this slot, <varname>primary_slot_name</varname> should be configured in the standby's <filename>recovery.conf</filename>. Here is a simple example: <placeholder-2/>
ru: Для создания слота репликации выполните: <placeholder-1/> Для настройки резервного сервера на использование этого слота <varname>primary_slot_name</varname> должно быть настроено в конфигурации <filename>recovery.conf</filename> резервного. Вот простейший пример: <placeholder-2/>

source: Cascading Replication
ru: Каскадная репликация

source: <primary>Cascading Replication</primary>
ru: <primary>Каскадная репликация</primary>

source: The cascading replication feature allows a standby server to accept replication connections and stream WAL records to other standbys, acting as a relay. This can be used to reduce the number of direct connections to the master and also to minimize inter-site bandwidth overheads.
ru: Свойство каскадной репликации позволяет резервному серверу принимать соединения репликации и потоки WAL от других резервных, выступающих посредниками. Это может быть полезно для уменьшения числа непосредственных подключений к главному серверу, а также для уменьшения накладных расходов при передаче данных в интрасети.

source: A standby acting as both a receiver and a sender is known as a cascading standby. Standbys that are more directly connected to the master are known as upstream servers, while those standby servers further away are downstream servers. Cascading replication does not place limits on the number or arrangement of downstream servers, though each standby connects to only one upstream server which eventually links to a single master/primary server.
ru: Резервный сервер, выступающий как получатель и отправитель, называется каскадным резервным сервером. Резервные серверы, стоящие ближе к главному, называются серверами верхнего уровня, а более отдалённые — серверами нижнего уровня. Каскадная репликация не накладывает ограничений на количество или организацию последующих уровней, а каждый резервный соединяется только с одним сервером вышестоящего уровня, который в конце концов соединяется с единственным главным/ведущим сервером.

source: A cascading standby sends not only WAL records received from the master but also those restored from the archive. So even if the replication connection in some upstream connection is terminated, streaming replication continues downstream for as long as new WAL records are available.
ru: Резервный сервер каскадной репликации не только получает записи WAL от главного, но так же восстанавливает их из архива. Таким образом, даже если соединение с сервером более высокого уровня разорвётся, потоковая репликация для последующих уровней будет продолжаться до исчерпания доступных записей WAL.

source: Cascading replication is currently asynchronous. Synchronous replication (see <xref linkend="synchronous-replication"/>) settings have no effect on cascading replication at present.
ru: Каскадная репликация в текущей реализации асинхронна. Параметры синхронной репликации (см. <xref remap="4" linkend="synchronous-replication"/>) в настоящее время не оказывают влияние на каскадную репликацию.

source: Hot Standby feedback propagates upstream, whatever the cascaded arrangement.
ru: Распространение обратной связи горячего резерва работает от нижестоящего уровня к вышестоящему уровню вне зависимости от способа организации связи.

source: If an upstream standby server is promoted to become new master, downstream servers will continue to stream from the new master if <varname>recovery_target_timeline</varname> is set to <literal>'latest'</literal>.
ru: Если резервный сервер вышестоящего уровня будет преобразован в новый главный, серверы нижестоящего уровня продолжат получать поток с нового главного при условии, что <varname>recovery_target_timeline</varname> установлен в значение <literal>'latest'</literal>.

source: To use cascading replication, set up the cascading standby so that it can accept replication connections (that is, set <xref linkend="guc-max-wal-senders"/> and <xref linkend="guc-hot-standby"/>, and configure <link linkend="auth-pg-hba-conf">host-based authentication</link>). You will also need to set <varname>primary_conninfo</varname> in the downstream standby to point to the cascading standby.
ru: Для использования каскадной репликации необходимо настроить резервный каскадный сервер на прием соединений репликации (то есть установить <xref linkend="guc-max-wal-senders"/> и <xref linkend="guc-hot-standby"/>, настроить <link linkend="auth-pg-hba-conf">host-based authentication</link>). Так же может быть необходимо настроить на нижестоящем резервном значение <varname>primary_conninfo</varname> на каскадный резервный сервер.

source: Synchronous Replication
ru: Синхронная репликация

source: <primary>Synchronous Replication</primary>
ru: <primary>Синхронная репликация</primary>

source: <productname>PostgreSQL</productname> streaming replication is asynchronous by default. If the primary server crashes then some transactions that were committed may not have been replicated to the standby server, causing data loss. The amount of data loss is proportional to the replication delay at the time of failover.
ru: По умолчанию в <productname>PostgreSQL</productname> потоковая репликация асинхронна. Если ведущий сервер выходит из строя, некоторые транзакции, которые были подтверждены, но не переданы на резервный, могут быть потеряны. Объём потерянных данных пропорционален задержке репликации на момент отработки отказа.

source: Synchronous replication offers the ability to confirm that all changes made by a transaction have been transferred to one or more synchronous standby servers. This extends that standard level of durability offered by a transaction commit. This level of protection is referred to as 2-safe replication in computer science theory, and group-1-safe (group-safe and 1-safe) when <varname>synchronous_commit</varname> is set to <literal>remote_write</literal>.
ru: Синхронная репликация предоставляет возможность гарантировать, что все изменения, внесённые в транзакции, были переданы одному или нескольким синхронным резервным серверам. Это увеличивает стандартный уровень надёжности, гарантируемый при фиксации транзакции. Этот уровень защиты соответствует второму уровню безопасности репликации из теории вычислительной техники, или групповой безопасности первого уровня (безопасности групповой и уровня 1), когда выбран режим <varname>synchronous_commit</varname> <literal>remote_write</literal>.
