Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/high-availability.po
Languages: ru

source: High Availability, Load Balancing, and Replication
ru: Отказоустойчивость, балансировка нагрузки и репликация

source: <primary>high availability</primary>
ru: <primary>отказоустойчивость</primary>

source: <primary>failover</primary>
ru: <primary>отработка отказа</primary>

source: <primary>replication</primary>
ru: <primary>репликация</primary>

source: <primary>load balancing</primary>
ru: <primary>балансировка нагрузки</primary>

source: <primary>clustering</primary>
ru: <primary>кластеризация</primary>

source: <primary>data partitioning</primary>
ru: <primary>секционирование данных</primary>

source: Database servers can work together to allow a second server to take over quickly if the primary server fails (high availability), or to allow several computers to serve the same data (load balancing). Ideally, database servers could work together seamlessly. Web servers serving static web pages can be combined quite easily by merely load-balancing web requests to multiple machines. In fact, read-only database servers can be combined relatively easily too. Unfortunately, most database servers have a read/write mix of requests, and read/write servers are much harder to combine. This is because though read-only data needs to be placed on each server only once, a write to any server has to be propagated to all servers so that future read requests to those servers return consistent results.
ru: Серверы базы данных могут работать совместно для обеспечения возможности быстрого переключения на другой сервер в случае отказа первого (отказоустойчивость) или для обеспечения возможности нескольким серверам БД обрабатывать один набор данных (балансировка нагрузки). В идеале, серверы БД могут работать вместе прозрачно для клиента. Веб-серверы, обрабатывающие статические страницы, можно совместить достаточно легко посредством простого распределения запросов на несколько машин. Фактически серверы баз данных только для чтения тоже могут быть совмещены достаточно легко. К сожалению, большинство серверов баз данных получают смешанные запросы на чтение/запись, а серверы с доступом на чтение/запись совместить гораздо сложнее. Это объясняется тем, что данные только для чтения достаточно единожды разместить на каждом сервере, а запись на любой из серверов должна распространиться на все остальные серверы, чтобы будущие запросы на чтение возвращали согласованные результаты.

source: This synchronization problem is the fundamental difficulty for servers working together. Because there is no single solution that eliminates the impact of the sync problem for all use cases, there are multiple solutions. Each solution addresses this problem in a different way, and minimizes its impact for a specific workload.
ru: Проблема синхронизации является главным препятствием для совместной работы серверов. Так как единственного решения, устраняющего проблему синхронизации во всех случаях, не существует, предлагается несколько решений. Разные решения подходят к проблеме по-разному и минимизируют её влияние в разных рабочих условиях.

source: Some solutions deal with synchronization by allowing only one server to modify the data. Servers that can modify data are called read/write, <firstterm>master</firstterm> or <firstterm>primary</firstterm> servers. Servers that track changes in the master are called <firstterm>standby</firstterm> or <firstterm>slave</firstterm> servers. A standby server that cannot be connected to until it is promoted to a master server is called a <firstterm>warm standby</firstterm> server, and one that can accept connections and serves read-only queries is called a <firstterm>hot standby</firstterm> server.
ru: Некоторые решения применяют синхронизацию, позволяя только одному серверу изменять данные. Сервер, который может изменять данные, называется сервером чтения/записи, <firstterm>главным</firstterm> или <firstterm>ведущим</firstterm> сервером. Сервер, который отслеживает изменения на главном, называется <firstterm>резервным</firstterm> или <firstterm>ведомым</firstterm> сервером. Резервный сервер, к которому нельзя подключаться до тех пор, пока он не будет повышен до главного, называется сервером <firstterm>тёплого резерва</firstterm>, а тот, который может принимать соединения и обрабатывать запросы только на чтение, называется сервером <firstterm>горячего резерва</firstterm>.

source: Some solutions are synchronous, meaning that a data-modifying transaction is not considered committed until all servers have committed the transaction. This guarantees that a failover will not lose any data and that all load-balanced servers will return consistent results no matter which server is queried. In contrast, asynchronous solutions allow some delay between the time of a commit and its propagation to the other servers, opening the possibility that some transactions might be lost in the switch to a backup server, and that load balanced servers might return slightly stale results. Asynchronous communication is used when synchronous would be too slow.
ru: Некоторые решения являются синхронными, при которых транзакция, модифицирующая данные, не считается подтверждённой, пока все серверы не подтвердят транзакцию. Это гарантирует, что при отработке отказа не произойдёт потеря данных и что все балансирующие серверы возвращают целостные данные вне зависимости от того, к какому серверу был запрос. Асинхронное решение, напротив, допускает некоторую задержку между временем подтверждения транзакции и её передачей на другие серверы, допуская возможность, что некоторые транзакции могут быть потеряны в момент переключения на резервный сервер и что балансирующие серверы могут вернуть слегка устаревшие данные. Асинхронная передача используется, когда синхронная будет слишком медленной.

source: Solutions can also be categorized by their granularity. Some solutions can deal only with an entire database server, while others allow control at the per-table or per-database level.
ru: Решения могут так же разделяться по степени детализации. Некоторые решения работают только на уровне всего сервера БД целиком, в то время как другие позволяют работать на уровне таблиц или уровне БД.

source: Performance must be considered in any choice. There is usually a trade-off between functionality and performance. For example, a fully synchronous solution over a slow network might cut performance by more than half, while an asynchronous one might have a minimal performance impact.
ru: В любом случае необходимо принимать во внимание быстродействие. Обычно выбирается компромисс между функциональностью и производительностью. Например, полностью синхронное решение в медленной сети может снизить производительность больше чем наполовину, в то время как асинхронное решение будет оказывать минимальное воздействие.

source: The remainder of this section outlines various failover, replication, and load balancing solutions.
ru: В продолжении этого раздела рассматриваются различные решения по организации отказоустойчивости, репликации и балансировки нагрузки.

source: Comparison of Different Solutions
ru: Сравнение различных решений

# term
source: Shared Disk Failover
ru: Отказоустойчивость на разделяемых дисках

source: Shared disk failover avoids synchronization overhead by having only one copy of the database. It uses a single disk array that is shared by multiple servers. If the main database server fails, the standby server is able to mount and start the database as though it were recovering from a database crash. This allows rapid failover with no data loss.
ru: Отказоустойчивость на разделяемых дисках позволяет избежать избыточности синхронизации путём задействования только одной копии базы данных. Она использует единственный дисковый массив, который разделяется между несколькими серверами. Если основной сервер БД откажет, резервный сервер может подключиться и запустить базу данных, что позволит восстановить БД после аварии. Это обеспечивает быстрое переключение без потери данных.

source: Shared hardware functionality is common in network storage devices. Using a network file system is also possible, though care must be taken that the file system has full <acronym>POSIX</acronym> behavior (see <xref linkend="creating-cluster-nfs"/>). One significant limitation of this method is that if the shared disk array fails or becomes corrupt, the primary and standby servers are both nonfunctional. Another issue is that the standby server should never access the shared storage while the primary server is running.
ru: Функциональность разделяемого оборудования обычно реализована в сетевых устройствах хранения. Так же возможно применение сетевой файловой системы, особое внимание следует уделить тому, чтобы поведение системы полностью соответствовало <acronym>POSIX</acronym> (см. <xref remap="4" linkend="creating-cluster-nfs"/>). Существенное ограничение этого метода состоит в том, что в случае отказа или порчи разделяемого дискового массива оба сервера: ведущий и резервный — станут нерабочими. Другая особенность — резервный сервер никогда не получает доступ к разделяемым дискам во время работы ведущего.

source: File System (Block-Device) Replication
ru: Репликация на уровне файловой системы (блочного устройства)

source: A modified version of shared hardware functionality is file system replication, where all changes to a file system are mirrored to a file system residing on another computer. The only restriction is that the mirroring must be done in a way that ensures the standby server has a consistent copy of the file system &mdash; specifically, writes to the standby must be done in the same order as those on the master. <productname>DRBD</productname> is a popular file system replication solution for Linux.
ru: Видоизменённая версия функциональности разделяемого оборудования представлена в виде репликации на уровне файловой системы, когда все изменения в файловой системе отражаются в файловой системе другого компьютера. Единственное ограничение: синхронизация должна выполняться методом, гарантирующим целостность копии файловой системы на резервном сервере &mdash; в частности, запись на резервном сервере должна происходить в том же порядке, что и на главном. <productname>DRBD</productname> является популярным решением на основе репликации файловой системы для Linux.

# term
source: Transaction Log Shipping
ru: Трансляция журнала транзакций

source: Warm and hot standby servers can be kept current by reading a stream of write-ahead log (<acronym>WAL</acronym>) records. If the main server fails, the standby contains almost all of the data of the main server, and can be quickly made the new master database server. This can be synchronous or asynchronous and can only be done for the entire database server.
ru: Серверы тёплого и горячего резерва могут так же поддерживаться актуальными путём чтения потока записей из журнала изменений (<acronym>WAL</acronym>). Если основной сервер отказывает, резервный содержит почти все данные с него и может быть быстро преобразован в новый главный сервер БД. Это можно сделать синхронно или асинхронно, но может быть выполнено только на уровне сервера БД целиком.

source: A standby server can be implemented using file-based log shipping (<xref linkend="warm-standby"/>) or streaming replication (see <xref linkend="streaming-replication"/>), or a combination of both. For information on hot standby, see <xref linkend="hot-standby"/>.
ru: Резервный сервер может быть реализован с применением трансляции файлов журналов (см. <xref remap="4" linkend="warm-standby"/>), или потоковой репликации (см. <xref remap="4" linkend="streaming-replication"/>), или их комбинацией. За информацией о горячем резерве обратитесь к <xref remap="3" linkend="hot-standby"/>.

# term
source: Trigger-Based Master-Standby Replication
ru: Репликация главный-резервный на основе триггеров

source: A master-standby replication setup sends all data modification queries to the master server. The master server asynchronously sends data changes to the standby server. The standby can answer read-only queries while the master server is running. The standby server is ideal for data warehouse queries.
ru: При репликации главный-резервный все запросы, изменяющие данные, пересылаются главному серверу. Главный сервер, в свою очередь, асинхронно пересылает изменённые данные резервному. Резервный сервер может обрабатывать запросы только на чтение при работающем главном. Такой резервный сервер идеален для обработки запросов к хранилищам данных.

source: <productname>Slony-I</productname> is an example of this type of replication, with per-table granularity, and support for multiple standby servers. Because it updates the standby server asynchronously (in batches), there is possible data loss during fail over.
ru: <productname>Slony-I</productname> является примером подобного типа репликации, действующей на уровне таблиц, и поддерживает множество резервных серверов. Так как обновления на резервных серверах происходят асинхронно (в пакетах), возможна потеря данных во время отказа.

# term
source: Statement-Based Replication Middleware
ru: Репликация запросов в среднем слое

source: With statement-based replication middleware, a program intercepts every SQL query and sends it to one or all servers. Each server operates independently. Read-write queries must be sent to all servers, so that every server receives any changes. But read-only queries can be sent to just one server, allowing the read workload to be distributed among them.
ru: В схеме с репликацией запросов в среднем слое, средний слой перехватывает каждый SQL-запрос и пересылает его на один или все серверы. Каждый сервер работает независимо. Модифицирующие запросы должны быть направлены всем серверам, чтобы каждый из них получал все изменения. Но читающие запросы могут быть посланы только на один сервер, что позволяет перераспределить читающую нагрузку между всеми серверами.

source: If queries are simply broadcast unmodified, functions like <function>random()</function>, <function>CURRENT_TIMESTAMP</function>, and sequences can have different values on different servers. This is because each server operates independently, and because SQL queries are broadcast (and not actual modified rows). If this is unacceptable, either the middleware or the application must query such values from a single server and then use those values in write queries. Another option is to use this replication option with a traditional master-standby setup, i.e. data modification queries are sent only to the master and are propagated to the standby servers via master-standby replication, not by the replication middleware. Care must also be taken that all transactions either commit or abort on all servers, perhaps using two-phase commit (<xref linkend="sql-prepare-transaction"/> and <xref linkend="sql-commit-prepared"/>). <productname>Pgpool-II</productname> and <productname>Continuent Tungsten</productname> are examples of this type of replication.
ru: Если запросы просто перенаправлять без изменений, функции подобные <function>random()</function>, <function>CURRENT_TIMESTAMP</function> и последовательности могут получить различные значения на разных серверах. Это происходит потому что каждый сервер работает независимо, а эти запросы неизбирательные (и действительно не изменяют строки). Если такая ситуация недопустима, или средний слой, или приложение должно запросить подобные значения с одного сервера, затем использовать его в других пишущих запросах. Другим способом является применения этого вида репликации совместно с другим традиционным набором репликации главный-резервный, то есть изменяющие данные запросы посылаются только на главный сервер, а затем применяются на резервном в процессе этой репликации, но не с помощью реплицирующего среднего слоя. Следует иметь в виду, что все транзакции фиксируются или прерываются на всех серверах, возможно с применением двухфазной фиксации (см. <xref remap="4" linkend="sql-prepare-transaction"/> и <xref remap="4" linkend="sql-commit-prepared"/>). Репликацию такого типа реализуют, например <productname>Pgpool-II</productname> и <productname>Continuent Tungsten</productname>.

# term
source: Asynchronous Multimaster Replication
ru: Асинхронная репликация с несколькими главными серверами

source: For servers that are not regularly connected, like laptops or remote servers, keeping data consistent among servers is a challenge. Using asynchronous multimaster replication, each server works independently, and periodically communicates with the other servers to identify conflicting transactions. The conflicts can be resolved by users or conflict resolution rules. Bucardo is an example of this type of replication.
ru: Если серверы не находятся постоянно в единой сети, как например, ноутбуки или удалённые серверы, обеспечение согласованности данных между ними представляет проблему. Когда используется асинхронная репликация с несколькими главными серверами, каждый из них работает независимо и периодически связывается с другими серверами для определения конфликтующих транзакций. Конфликты могут урегулироваться пользователем или по правилам их разрешения. Примером такого типа репликации является Bucardo.

# term
source: Synchronous Multimaster Replication
ru: Синхронная репликация с несколькими главными серверами

source: In synchronous multimaster replication, each server can accept write requests, and modified data is transmitted from the original server to every other server before each transaction commits. Heavy write activity can cause excessive locking, leading to poor performance. In fact, write performance is often worse than that of a single server. Read requests can be sent to any server. Some implementations use shared disk to reduce the communication overhead. Synchronous multimaster replication is best for mostly read workloads, though its big advantage is that any server can accept write requests &mdash; there is no need to partition workloads between master and standby servers, and because the data changes are sent from one server to another, there is no problem with non-deterministic functions like <function>random()</function>.
ru: При синхронной репликации с несколькими главными серверами каждый сервер может принимать запросы на запись, а изменённые данные передаются с начального сервера всем остальным, прежде чем транзакция будет подтверждена. Если запись производится интенсивно, это может провоцировать избыточные блокировки, что приводит к снижению производительности. На самом деле производительность при записи часто бывает хуже, чем с одним сервером. Запросы на чтение также могут быть обработаны любым сервером. В некоторых конфигурациях для более эффективного взаимодействия серверов применяются разделяемые диски. Синхронная репликация с несколькими главными серверами лучше всего работает, когда преобладают операции чтения, хотя её большой плюс в том, что любой сервер может принимать запросы на запись &mdash; нет необходимости искусственно разделять нагрузку между главным и резервными серверами, а так как изменения передаются от одного сервера другим, не возникает проблем с недетерминированными функциями вроде <function>random()</function>.

source: <productname>PostgreSQL</productname> does not offer this type of replication, though <productname>PostgreSQL</productname> two-phase commit (<xref linkend="sql-prepare-transaction"/> and <xref linkend="sql-commit-prepared"/>) can be used to implement this in application code or middleware.
ru: <productname>PostgreSQL</productname> не предоставляет данный тип репликации, но так как <productname>PostgreSQL</productname> поддерживает двухфазное подтверждение транзакции (<xref linkend="sql-prepare-transaction"/> и <xref linkend="sql-commit-prepared"/>) такое поведение может быть реализовано в коде приложения или среднего слоя.

source: Commercial Solutions
ru: Коммерческие решения

source: Because <productname>PostgreSQL</productname> is open source and easily extended, a number of companies have taken <productname>PostgreSQL</productname> and created commercial closed-source solutions with unique failover, replication, and load balancing capabilities.
ru: Так как <productname>PostgreSQL</productname> обладает открытым кодом и легко расширяется, некоторые компании взяли за основу <productname>PostgreSQL</productname> и создали коммерческие решения с закрытым кодом со своими реализациями свойств отказоустойчивости, репликации и балансировки нагрузки.

source: <xref linkend="high-availability-matrix"/> summarizes the capabilities of the various solutions listed above.
ru: <xref linkend="high-availability-matrix"/> итоговая таблица возможностей различных решений приведена ниже.

source: High Availability, Load Balancing, and Replication Feature Matrix
ru: Таблица свойств отказоустойчивости, балансировки нагрузки и репликации

source: Feature
ru: Тип

# entry
source: Shared Disk Failover
ru: Отказоустойчивость через разделяемые диски

source: File System Replication
ru: Репликация файловой системы

# entry
source: Transaction Log Shipping
ru: Трансляция журнала транзакций

# entry
source: Trigger-Based Master-Standby Replication
ru: Репликация главный-резервный на основе триггеров

# entry
source: Statement-Based Replication Middleware
ru: Репликация запросов в среднем слое

# entry
source: Asynchronous Multimaster Replication
ru: Асинхронная репликация с несколькими главными серверами

# entry
source: Synchronous Multimaster Replication
ru: Синхронная репликация с несколькими главными серверами

source: Most Common Implementation
ru: Наиболее типичная реализация

source: Streaming Repl.
ru: Потоковая репликация

source: Communication Method
ru: Метод взаимодействия

source: shared disk
ru: разделяемые диски

source: disk blocks
ru: дисковые блоки

source: table rows
ru: Строки таблицы

source: table rows and row locks
ru: Строки таблицы и блокировки строк

source: No special hardware required
ru: Не требуется специального оборудования

source: Allows multiple master servers
ru: Допускается несколько главных серверов

source: No master server overhead
ru: Нет избыточности главного сервера

source: No waiting for multiple servers
ru: Нет задержки при нескольких серверах

source: with sync off
ru: без синхр.

source: Master failure will never lose data
ru: Отказ главного сервера не может привести к потере данных

source: with sync on
ru: с синхр.

source: Standby accept read-only queries
ru: Резервный сервер принимает читающие запросы

source: with hot
ru: с горячим резервом

source: Per-table granularity
ru: Репликация на уровне таблиц

source: No conflict resolution necessary
ru: Не требуется разрешение конфликтов

source: There are a few solutions that do not fit into the above categories:
ru: Несколько решений, которые не подпадают под указанные выше категории:

source: Data Partitioning
ru: Секционирование данных

source: Data partitioning splits tables into data sets. Each set can be modified by only one server. For example, data can be partitioned by offices, e.g., London and Paris, with a server in each office. If queries combining London and Paris data are necessary, an application can query both servers, or master/standby replication can be used to keep a read-only copy of the other office's data on each server.
ru: При секционировании таблицы расщепляются на наборы данных. Каждый из наборов может быть изменён только на одном сервере. Например, данные могут быть секционированы по офисам, например, Лондон и Париж, с сервером в каждом офисе. В случае необходимости обращения одновременно к данным Лондона и Парижа, приложение может запросить оба сервера, или может быть применена репликация главный-резервный для предоставления копии только для чтения в другом офисе для каждого из серверов.

source: Multiple-Server Parallel Query Execution
ru: Выполнение параллельных запросов на нескольких серверах
