Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/high-availability.po
Languages: ru

source: Hot Standby is the term used to describe the ability to connect to the server and run read-only queries while the server is in archive recovery or standby mode. This is useful both for replication purposes and for restoring a backup to a desired state with great precision. The term Hot Standby also refers to the ability of the server to move from recovery through to normal operation while users continue running queries and/or keep their connections open.
ru: Термин &laquo;горячий резерв&raquo; используется для описания возможности подключаться к серверу и выполнять запросы на чтение, в то время как сервер находится в режиме резерва или восстановления архива. Это полезно и для целей репликации, и для восстановления желаемого состояния из резервной копии с высокой точностью. Так же термин «горячий резерв» описывает способность сервера переходить из режима восстановления к обычной работе, в то время как пользователи продолжают выполнять запросы и/или их соединения остаются открытыми.

source: Running queries in hot standby mode is similar to normal query operation, though there are several usage and administrative differences explained below.
ru: В режиме горячего резерва запросы выполняются примерно так же, как и в обычном режиме, с некоторыми отличиями в использовании и администрировании, описанными ниже.

source: User's Overview
ru: Обзор на уровне пользователя

source: When the <xref linkend="guc-hot-standby"/> parameter is set to true on a standby server, it will begin accepting connections once the recovery has brought the system to a consistent state. All such connections are strictly read-only; not even temporary tables may be written.
ru: Когда параметр <xref linkend="guc-hot-standby"/> на резервном сервере установлен в true, то он начинает принимать соединения сразу как только система придёт в согласованное состояние в процессе восстановления. Для таких соединений будет разрешено только чтение, запись невозможна даже во временные таблицы.

source: The data on the standby takes some time to arrive from the primary server so there will be a measurable delay between primary and standby. Running the same query nearly simultaneously on both primary and standby might therefore return differing results. We say that data on the standby is <firstterm>eventually consistent</firstterm> with the primary. Once the commit record for a transaction is replayed on the standby, the changes made by that transaction will be visible to any new snapshots taken on the standby. Snapshots may be taken at the start of each query or at the start of each transaction, depending on the current transaction isolation level. For more details, see <xref linkend="transaction-iso"/>.
ru: Для того, чтобы данные с ведущего сервера были получены на резервном, требуется некоторое время. Таким образом, имеется измеряемая задержка между ведущим и резервным серверами. Поэтому запуск одинаковых запросов примерно в одно время на ведущем и резервном серверах может вернуть разный результат. Можно сказать, что данные на резервном сервере <firstterm>в конечном счёте согласуются</firstterm> с ведущим. После того, как запись о зафиксированной транзакции воспроизводится на резервном сервере, изменения, совершённые в этой транзакции, становится видны в любых последующих снимках данных на резервном сервере. Снимок может быть сделан в начале каждого запроса или в начале каждой транзакции в зависимости от уровня изоляции транзакции. Более подробно см. <xref remap="4" linkend="transaction-iso"/>.

source: Query access - <command>SELECT</command>, <command>COPY TO</command>
ru: Доступ к данным — <command>SELECT</command>, <command>COPY TO</command>

source: Cursor commands - <command>DECLARE</command>, <command>FETCH</command>, <command>CLOSE</command>
ru: Команды для работы с курсором — <command>DECLARE</command>, <command>FETCH</command>, <command>CLOSE</command>

source: Parameters - <command>SHOW</command>, <command>SET</command>, <command>RESET</command>
ru: Параметры — <command>SHOW</command>, <command>SET</command>, <command>RESET</command>

source: <command>EXCEPTION</command> blocks and other internal subtransactions
ru: Блок <command>EXCEPTION</command> и другие внутренние подчиненные транзакции

source: Transaction management commands <placeholder-1/>
ru: Команды явного управления транзакциями <placeholder-1/>

source: <command>LOCK TABLE</command>, though only when explicitly in one of these modes: <literal>ACCESS SHARE</literal>, <literal>ROW SHARE</literal> or <literal>ROW EXCLUSIVE</literal>.
ru: <command>LOCK TABLE</command>, только когда исполняется в явном виде в следующем режиме: <literal>ACCESS SHARE</literal>, <literal>ROW SHARE</literal> или <literal>ROW EXCLUSIVE</literal>.

source: Plans and resources - <command>PREPARE</command>, <command>EXECUTE</command>, <command>DEALLOCATE</command>, <command>DISCARD</command>
ru: Планы и ресурсы — <command>PREPARE</command>, <command>EXECUTE</command>, <command>DEALLOCATE</command>, <command>DISCARD</command>

source: Plugins and extensions - <command>LOAD</command>
ru: Дополнения и расширения — <command>LOAD</command>

source: Transactions started during hot standby may issue the following commands: <placeholder-1/>
ru: Транзакции, запущенные в режиме горячего резерва, могут выполнять следующие команды: <placeholder-1/>

source: Data Manipulation Language (DML) - <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>, <command>COPY FROM</command>, <command>TRUNCATE</command>. Note that there are no allowed actions that result in a trigger being executed during recovery. This restriction applies even to temporary tables, because table rows cannot be read or written without assigning a transaction ID, which is currently not possible in a Hot Standby environment.
ru: Команды манипуляции данными (DML) — <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>, <command>COPY FROM</command>, <command>TRUNCATE</command>. Следует отметить, что нет разрешённых действий, которые приводили бы к срабатыванию триггера во время исполнения на резервном сервере. Это ограничение так же касается и временных таблиц, так как строки таблицы не могут быть прочитаны или записаны без обращения к ID транзакции, что в настоящее время не возможно в среде горячего резерва.

source: Data Definition Language (DDL) - <command>CREATE</command>, <command>DROP</command>, <command>ALTER</command>, <command>COMMENT</command>. This restriction applies even to temporary tables, because carrying out these operations would require updating the system catalog tables.
ru: Команды определения данных (DDL) — <command>CREATE</command>, <command>DROP</command>, <command>ALTER</command>, <command>COMMENT</command>. Эти ограничения так же относятся и к временным таблицам, так как операции могут потребовать обновления таблиц системных каталогов.

source: <command>SELECT ... FOR SHARE | UPDATE</command>, because row locks cannot be taken without updating the underlying data files.
ru: <command>SELECT ... FOR SHARE | UPDATE</command>, так как блокировка строки не может быть проведена без обновления соответствующих файлов данных.

source: Rules on <command>SELECT</command> statements that generate DML commands.
ru: Правила для выражений <command>SELECT</command>, которые приводят к выполнению команд DML.

source: <command>LOCK</command> that explicitly requests a mode higher than <literal>ROW EXCLUSIVE MODE</literal>.
ru: <command>LOCK</command> которая явно требует режим более строгий чем <literal>ROW EXCLUSIVE MODE</literal>.

source: <command>LOCK</command> in short default form, since it requests <literal>ACCESS EXCLUSIVE MODE</literal>.
ru: <command>LOCK</command> в короткой форме с умолчаниями, так как требует <literal>ACCESS EXCLUSIVE MODE</literal>.

source: Transaction management commands that explicitly set non-read-only state: <placeholder-1/>
ru: Команды управления транзакциями, которые в явном виде требуют режим не только для чтения <placeholder-1/>

source: Two-phase commit commands - <command>PREPARE TRANSACTION</command>, <command>COMMIT PREPARED</command>, <command>ROLLBACK PREPARED</command> because even read-only transactions need to write WAL in the prepare phase (the first phase of two phase commit).
ru: Команды двухфазной фиксации — <command>PREPARE TRANSACTION</command>, <command>COMMIT PREPARED</command>, <command>ROLLBACK PREPARED</command>, так как даже транзакции только для чтения нуждаются в записи в WAL на подготовительной фазе (первая фаза двухфазной фиксации).

source: Sequence updates - <function>nextval()</function>, <function>setval()</function>
ru: Обновление последовательностей — <function>nextval()</function>, <function>setval()</function>

source: Transactions started during hot standby will never be assigned a transaction ID and cannot write to the system write-ahead log. Therefore, the following actions will produce error messages: <placeholder-1/>
ru: Транзакции, запущенные в режиме горячего резерва, никогда не получают ID транзакции и не могут быть записаны в журнал транзакций. Поэтому при попытке выполнить следующие действия возникнут ошибки: <placeholder-1/>

source: In normal operation, <quote>read-only</quote> transactions are allowed to update sequences and to use <command>LISTEN</command>, <command>UNLISTEN</command>, and <command>NOTIFY</command>, so Hot Standby sessions operate under slightly tighter restrictions than ordinary read-only sessions. It is possible that some of these restrictions might be loosened in a future release.
ru: При обычной работе транзакции <quote>только для чтения</quote> могут обновлять последовательности и использовать команды <command>LISTEN</command>, <command>UNLISTEN</command> и <command>NOTIFY</command>, таким образом сессии горячего резерва работают с несколько большими ограничениями, чем обычные только читающие сессии. Возможно, что некоторые из этих ограничений будут ослаблены в следующих выпусках.

source: During hot standby, the parameter <varname>transaction_read_only</varname> is always true and may not be changed. But as long as no attempt is made to modify the database, connections during hot standby will act much like any other database connection. If failover or switchover occurs, the database will switch to normal processing mode. Sessions will remain connected while the server changes mode. Once hot standby finishes, it will be possible to initiate read-write transactions (even from a session begun during hot standby).
ru: В режиме горячего резерва параметр <varname>transaction_read_only</varname> всегда имеет значение true и изменить его нельзя. Но если не пытаться модифицировать содержимое БД, подключение к серверу в этом режиме не отличается от подключений к обычным базам данных. При отработке отказа или переключении ролей база данных переходит в обычный режим работы. Когда сервер меняет режим работы, установленные сеансы остаются подключёнными. После выхода из режима горячего резерва становится возможным запускать пишущие транзакции (даже в сеансах, начатых ещё в режиме горячего резерва).

source: Users will be able to tell whether their session is read-only by issuing <command>SHOW transaction_read_only</command>. In addition, a set of functions (<xref linkend="functions-recovery-info-table"/>) allow users to access information about the standby server. These allow you to write programs that are aware of the current state of the database. These can be used to monitor the progress of recovery, or to allow you to write complex programs that restore the database to particular states.
ru: Пользователи могут узнать о нахождении сессии в режиме только для чтения с помощью команды <command>SHOW transaction_read_only</command>. Кроме того, набор функций (<xref linkend="functions-recovery-info-table"/>) позволяет пользователям получить доступ к информации о резервном сервере. Это позволяет создавать программы, учитывающие текущий статус базы данных. Такой режим может быть полезен для мониторинга процесса восстановления или для написания комплексного восстановления для особенных случаев.

source: Handling Query Conflicts
ru: Обработка конфликтов запросов

source: The primary and standby servers are in many ways loosely connected. Actions on the primary will have an effect on the standby. As a result, there is potential for negative interactions or conflicts between them. The easiest conflict to understand is performance: if a huge data load is taking place on the primary then this will generate a similar stream of WAL records on the standby, so standby queries may contend for system resources, such as I/O.
ru: Ведущий и резервный серверы связаны между собой многими слабыми связями. События на ведущем сервере оказывают влияние на резервный. В результате имеется потенциальная возможность отрицательного влияния или конфликта между ними. Наиболее простой для понимания конфликт — быстродействие: если на ведущем происходит загрузка очень большого объёма данных, то происходит создание соответствующего потока записей WAL на резервный сервер. Таким образом, запросы на резервном конкурируют за системные ресурсы, например, ввод-вывод.

source: Access Exclusive locks taken on the primary server, including both explicit <command>LOCK</command> commands and various <acronym>DDL</acronym> actions, conflict with table accesses in standby queries.
ru: Установка эксклюзивной блокировки на ведущем сервере, как с помощью явной команды <command>LOCK</command>, так и при различных <acronym>DDL</acronym>, что приводит к конфликту доступа к таблицам на резервном.

source: Dropping a tablespace on the primary conflicts with standby queries using that tablespace for temporary work files.
ru: Удаление табличного пространства на ведущем сервере приводит к конфликту на резервном когда запросы используют это пространство для хранения временных рабочих файлов.

source: Dropping a database on the primary conflicts with sessions connected to that database on the standby.
ru: Удаление базы данных на ведущем сервере конфликтует с сессиями, подключёнными к этой БД на резервном.

source: Application of a vacuum cleanup record from WAL conflicts with standby transactions whose snapshots can still <quote>see</quote> any of the rows to be removed.
ru: Приложение очистки устаревших транзакций из WAL конфликтует с транзакциями на резервном сервере, которые используют снимок данных, который всё ещё видит какие-то из очищенных на ведущем строк.

source: Application of a vacuum cleanup record from WAL conflicts with queries accessing the target page on the standby, whether or not the data to be removed is visible.
ru: Приложение очистки устаревших транзакций из WAL конфликтует с запросами к целевой странице на резервном сервере вне зависимости от того, являются ли данные удалёнными или видимыми.

source: There are also additional types of conflict that can occur with Hot Standby. These conflicts are <emphasis>hard conflicts</emphasis> in the sense that queries might need to be canceled and, in some cases, sessions disconnected to resolve them. The user is provided with several ways to handle these conflicts. Conflict cases include: <placeholder-1/>
ru: Так же может возникнуть дополнительный тип конфликта на сервере горячего резерва. Этот конфликт называется <emphasis>жёстким конфликтом</emphasis>, оказывает влияние на запросы, приводя к их отмене, а в некоторых случаях и к обрыву сессии для разрешения конфликтов. Пользователям предоставлен набор средств для обработки подобных конфликтов. Случаи конфликтов включают: <placeholder-1/>

source: On the primary server, these cases simply result in waiting; and the user might choose to cancel either of the conflicting actions. However, on the standby there is no choice: the WAL-logged action already occurred on the primary so the standby must not fail to apply it. Furthermore, allowing WAL application to wait indefinitely may be very undesirable, because the standby's state will become increasingly far behind the primary's. Therefore, a mechanism is provided to forcibly cancel standby queries that conflict with to-be-applied WAL records.
ru: В этих случаях на ведущем сервере просто происходит ожидание; пользователю следует выбрать какую их конфликтующих сторон отменить. Тем не менее, на резервном нет выбора: действия из WAL уже произошли на ведущем, поэтому резервный обязан применить их. Более того, позволять обработчику WAL ожидать неограниченно долго может быть крайне нежелательно, так как отставание резервного сервера от ведущего может всё возрастать. Таким образом, механизм обеспечивает принудительную отмену запросов на резервном сервере, которые конфликтуют с применяемыми записями WAL.

source: An example of the problem situation is an administrator on the primary server running <command>DROP TABLE</command> on a table that is currently being queried on the standby server. Clearly the standby query cannot continue if the <command>DROP TABLE</command> is applied on the standby. If this situation occurred on the primary, the <command>DROP TABLE</command> would wait until the other query had finished. But when <command>DROP TABLE</command> is run on the primary, the primary doesn't have information about what queries are running on the standby, so it will not wait for any such standby queries. The WAL change records come through to the standby while the standby query is still running, causing a conflict. The standby server must either delay application of the WAL records (and everything after them, too) or else cancel the conflicting query so that the <command>DROP TABLE</command> can be applied.
ru: Примером такой проблемы может быть ситуация: администратор на ведущем сервере выполнил команду <command>DROP TABLE</command> для таблицы, которая сейчас участвует в запросе на резервном. Понятно, что этот запрос нельзя будет выполнять дальше, если команда <command>DROP TABLE</command> применится на резервном. Если бы этот запрос выполнялся на ведущем, команда <command>DROP TABLE</command> ждала бы его окончания. Но когда на ведущем выполняется только команда <command>DROP TABLE</command>, ведущий сервер не знает, какие запросы выполняются на резервном, поэтому он не может ждать завершения подобных запросов. Поэтому если записи WAL с изменением прибудут на резервный сервер, когда запрос будет продолжать выполняться, возникнет конфликт. В этом случае резервный сервер должен либо задержать применение этих записей WAL (и всех остальных, следующих за ними), либо отменить конфликтующий запрос, чтобы можно было применить <command>DROP TABLE</command>.

source: When a conflicting query is short, it's typically desirable to allow it to complete by delaying WAL application for a little bit; but a long delay in WAL application is usually not desirable. So the cancel mechanism has parameters, <xref linkend="guc-max-standby-archive-delay"/> and <xref linkend="guc-max-standby-streaming-delay"/>, that define the maximum allowed delay in WAL application. Conflicting queries will be canceled once it has taken longer than the relevant delay setting to apply any newly-received WAL data. There are two parameters so that different delay values can be specified for the case of reading WAL data from an archive (i.e., initial recovery from a base backup or <quote>catching up</quote> a standby server that has fallen far behind) versus reading WAL data via streaming replication.
ru: Если конфликтный запрос короткий, обычно желательно разрешить ему завершиться, ненадолго задержав применение записей WAL, но слишком большая задержка в применении WAL обычно нежелательна. Поэтому механизм отмены имеет параметры <xref linkend="guc-max-standby-archive-delay"/> и <xref linkend="guc-max-standby-streaming-delay"/>, которые определяют максимально допустимое время задержки применения WAL. Конфликтующие запросы будут отменены, если они длятся дольше допустимого времени задержки применения очередных записей WAL. Два параметра существуют для того, чтобы можно было задать разные значения для чтения записей WAL из архива (то есть при начальном восстановлении из базовой копии либо при <quote>навёрстывании</quote> ведущего сервера в случае большого отставания) и для получения записей WAL при потоковой репликации.

source: In a standby server that exists primarily for high availability, it's best to set the delay parameters relatively short, so that the server cannot fall far behind the primary due to delays caused by standby queries. However, if the standby server is meant for executing long-running queries, then a high or even infinite delay value may be preferable. Keep in mind however that a long-running query could cause other sessions on the standby server to not see recent changes on the primary, if it delays application of WAL records.
ru: На резервном сервере, созданном преимущественно для отказоустойчивости, лучше выставлять параметры задержек относительно небольшими, чтобы он не мог сильно отстать от ведущего из-за задержек, связанных с ожиданием запросов горячего резерва. Однако если резервный сервер предназначен для выполнения длительных запросов, то высокое значение или даже бесконечное ожидание могут быть предпочтительнее. Тем не менее, следует иметь в виду, что длительные запросы могут оказать влияние на другие сессии на резервном сервере в виде отсутствия последних изменений от ведущего из-за задержки применения записей WAL.

source: Once the delay specified by <varname>max_standby_archive_delay</varname> or <varname>max_standby_streaming_delay</varname> has been exceeded, conflicting queries will be canceled. This usually results just in a cancellation error, although in the case of replaying a <command>DROP DATABASE</command> the entire conflicting session will be terminated. Also, if the conflict is over a lock held by an idle transaction, the conflicting session is terminated (this behavior might change in the future).
ru: В случае, если задержка, определённая <varname>max_standby_archive_delay</varname> или <varname>max_standby_streaming_delay</varname> будет превышена, конфликтующий запрос будет отменён. Обычно это выражается в виде ошибки отмены, но в случае проигрывания команды <command>DROP DATABASE</command> обрывается вся конфликтная сессия. Так же, если конфликт произошел при блокировке, вызванной транзакцией в состоянии IDLE, конфликтная сессия разрывается (это поведение может изменить в будущем).

source: Canceled queries may be retried immediately (after beginning a new transaction, of course). Since query cancellation depends on the nature of the WAL records being replayed, a query that was canceled may well succeed if it is executed again.
ru: Отменённые запросы могут быть немедленно повторены (конечно после старта новой транзакции). Так как причина отмены зависит от природы проигрываемых записей WAL, запрос, который был отменён, может быть успешно выполнен вновь.

source: Keep in mind that the delay parameters are compared to the elapsed time since the WAL data was received by the standby server. Thus, the grace period allowed to any one query on the standby is never more than the delay parameter, and could be considerably less if the standby has already fallen behind as a result of waiting for previous queries to complete, or as a result of being unable to keep up with a heavy update load.
ru: Следует учесть, что параметры задержки отсчитываются от времени получения резервным сервером данных WAL. Таким образом, период дозволенной работы для запроса на резервном сервере никогда не может быть длиннее параметра задержки и может быть существенно короче, если резервный уже находится в режиме задержки в результате ожидания предыдущего запроса или результат не доступен из-за высокой нагрузки обновлений.
