Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/high-availability.po
Languages: ru

source: In normal (non-recovery) mode, if you issue <command>DROP USER</command> or <command>DROP ROLE</command> for a role with login capability while that user is still connected then nothing happens to the connected user - they remain connected. The user cannot reconnect however. This behavior applies in recovery also, so a <command>DROP USER</command> on the primary does not disconnect that user on the standby.
ru: Если вы в обычном режиме (не в режиме восстановления) выполните <command>DROP USER</command> или <command>DROP ROLE</command> для роли с возможностью подключения, в момент, когда этот пользователь подключён, на данном пользователе это никак не отразится — он останется подключённым. Однако переподключиться он уже не сможет. Это же поведение действует в режиме восстановления — если выполнить <command>DROP USER</command> на ведущем сервере, пользователь не будет отключён от резервного.

source: The statistics collector is active during recovery. All scans, reads, blocks, index usage, etc., will be recorded normally on the standby. Replayed actions will not duplicate their effects on primary, so replaying an insert will not increment the Inserts column of pg_stat_user_tables. The stats file is deleted at the start of recovery, so stats from primary and standby will differ; this is considered a feature, not a bug.
ru: Сборщик статистики работает во время восстановления. Все операции сканирования, чтения, блоки, использование индексов и т. п. будут записаны обычным образом на резервном сервере. Действия, происходящие при проигрывании, не будут дублировать действия на ведущем сервере, то есть проигрывание команды вставки не увеличит значение столбца Inserts в представлении pg_stat_user_tables. Файлы статистики удаляются с началом восстановления, таким образом, статистика на ведущем сервере и резервном будет разной. Это является особенностью, не ошибкой.

source: Autovacuum is not active during recovery. It will start normally at the end of recovery.
ru: Автоматическая очистка не работает во время восстановления. Она запустится в обычном режиме после завершения восстановления.

source: The background writer is active during recovery and will perform restartpoints (similar to checkpoints on the primary) and normal block cleaning activities. This can include updates of the hint bit information stored on the standby server. The <command>CHECKPOINT</command> command is accepted during recovery, though it performs a restartpoint rather than a new checkpoint.
ru: Во время восстановления активен фоновый процесс записи, он обрабатывает точки перезапуска (подобно контрольным точкам на ведущем сервере) и выполняет обычную очистку блоков. В том числе он может обновлять вспомогательные биты, сохранённые на резервном. Во время восстановления принимается команда <command>CHECKPOINT</command>, но она производит точку перезапуска, а не создаёт новую точку восстановления.

source: Hot Standby Parameter Reference
ru: Ссылки на параметры горячего резерва

source: Various parameters have been mentioned above in <xref linkend="hot-standby-conflict"/> and <xref linkend="hot-standby-admin"/>.
ru: Различные параметры были упомянуты выше в <xref remap="6" linkend="hot-standby-conflict"/> и <xref remap="6" linkend="hot-standby-admin"/>.

source: On the primary, parameters <xref linkend="guc-wal-level"/> and <xref linkend="guc-vacuum-defer-cleanup-age"/> can be used. <xref linkend="guc-max-standby-archive-delay"/> and <xref linkend="guc-max-standby-streaming-delay"/> have no effect if set on the primary.
ru: На ведущем могут применяться параметры <xref linkend="guc-wal-level"/> и <xref linkend="guc-vacuum-defer-cleanup-age"/>. Параметры <xref linkend="guc-max-standby-archive-delay"/> и <xref linkend="guc-max-standby-streaming-delay"/> на ведущем не действуют.

source: On the standby, parameters <xref linkend="guc-hot-standby"/>, <xref linkend="guc-max-standby-archive-delay"/> and <xref linkend="guc-max-standby-streaming-delay"/> can be used. <xref linkend="guc-vacuum-defer-cleanup-age"/> has no effect as long as the server remains in standby mode, though it will become relevant if the standby becomes primary.
ru: На резервном сервере могут применяться параметры <xref linkend="guc-hot-standby"/>, <xref linkend="guc-max-standby-archive-delay"/> и <xref linkend="guc-max-standby-streaming-delay"/>. Параметр <xref linkend="guc-vacuum-defer-cleanup-age"/> на нём не действует, пока сервер остаётся в режиме резервного сервера. Но если он станет ведущим, его значение вступит в силу.

source: Caveats
ru: Ограничения

source: Operations on hash indexes are not presently WAL-logged, so replay will not update these indexes.
ru: Операции с хеш-индексами в настоящее время не проходят через журнал WAL, таким образом, при воспроизведении WAL эти индексы не обновляются.

source: Full knowledge of running transactions is required before snapshots can be taken. Transactions that use large numbers of subtransactions (currently greater than 64) will delay the start of read only connections until the completion of the longest running write transaction. If this situation occurs, explanatory messages will be sent to the server log.
ru: Требуется информация о всех запущенных транзакциях перед тем как будет создан снимок данных. Транзакции, использующие большое количество подтранзакций (в настоящий момент больше 64), будут задерживать начало соединения только для чтения до завершения самой длинной пишущей транзакции. При возникновении этой ситуации поясняющее сообщение будет записано в журнал сервера.

source: Valid starting points for standby queries are generated at each checkpoint on the master. If the standby is shut down while the master is in a shutdown state, it might not be possible to re-enter Hot Standby until the primary is started up, so that it generates further starting points in the WAL logs. This situation isn't a problem in the most common situations where it might happen. Generally, if the primary is shut down and not available anymore, that's likely due to a serious failure that requires the standby being converted to operate as the new primary anyway. And in situations where the primary is being intentionally taken down, coordinating to make sure the standby becomes the new primary smoothly is also standard procedure.
ru: Подходящие стартовые точки для запросов на резервном сервере создаются при каждой контрольной точке на главном. Если резервный сервер отключается, в то время как главный был в отключённом состоянии, может оказаться невозможным возобновить его работу в режиме горячего резерва, до того, как запустится ведущий и добавит следующие стартовые точки в журналы WAL. Подобная ситуация не является проблемой для большинства случаев, в которых она может произойти. Обычно, если ведущий сервер выключен и больше не доступен, это является следствием серьёзного сбоя и в любом случае требует преобразования резервного в новый ведущий. Так же в ситуации, когда ведущий отключён намеренно, проверка готовности резервного к преобразованию в ведущий тоже является обычной процедурой.

source: At the end of recovery, <literal>AccessExclusiveLocks</literal> held by prepared transactions will require twice the normal number of lock table entries. If you plan on running either a large number of concurrent prepared transactions that normally take <literal>AccessExclusiveLocks</literal>, or you plan on having one large transaction that takes many <literal>AccessExclusiveLocks</literal>, you are advised to select a larger value of <varname>max_locks_per_transaction</varname>, perhaps as much as twice the value of the parameter on the primary server. You need not consider this at all if your setting of <varname>max_prepared_transactions</varname> is 0.
ru: В конце восстановления блокировки <literal>AccessExclusiveLocks</literal>, вызванные подготовленными транзакциями, требуют удвоенное, в сравнении с нормальным, количество блокировок записей таблицы. Если планируется использовать либо большое количество конкурирующих подготовленных транзакций, обычно вызывающие <literal>AccessExclusiveLocks</literal>, либо большие транзакции с применением большого количества <literal>AccessExclusiveLocks</literal>, то рекомендуется выбрать большое значение параметра <varname>max_locks_per_transaction</varname>, возможно в два раза большее, чем значение параметра на ведущем сервере. Всё это не имеет значения, когда <varname>max_prepared_transactions</varname> равно 0.

source: The Serializable transaction isolation level is not yet available in hot standby. (See <xref linkend="xact-serializable"/> and <xref linkend="serializable-consistency"/> for details.) An attempt to set a transaction to the serializable isolation level in hot standby mode will generate an error.
ru: Уровень изоляции транзакции Serializable в настоящее время недоступен в горячем резерве. (За подробностями обратитесь к <xref remap="3" linkend="xact-serializable"/> и <xref remap="3" linkend="serializable-consistency"/>) Попытка выставить для транзакции такой уровень изоляции в режиме горячего резерва вызовет ошибку.

source: There are several limitations of Hot Standby. These can and probably will be fixed in future releases: <placeholder-1/>
ru: Имеются следующие ограничения горячего резерва. Они могут и скорее всего будут исправлены в следующих выпусках: <placeholder-1/>
