Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/high-availability.po
Languages: ru

source: If <varname>archive_mode</varname> is set to <literal>on</literal>, the archiver is not enabled during recovery or standby mode. If the standby server is promoted, it will start archiving after the promotion, but will not archive any WAL it did not generate itself. To get a complete series of WAL files in the archive, you must ensure that all WAL is archived, before it reaches the standby. This is inherently true with file-based log shipping, as the standby can only restore files that are found in the archive, but not if streaming replication is enabled. When a server is not in recovery mode, there is no difference between <literal>on</literal> and <literal>always</literal> modes.
ru: Если в <varname>archive_mode</varname> установлено значение <literal>on</literal>, архивация в режиме восстановления или резерва не производится. В случае повышения резервного сервера, он начнёт архивацию после повышения, но в архив не попадут те файлы WAL, которые генерировал не он сам. Поэтому, чтобы в архиве оказался полный набор файлов WAL, необходимо обеспечить архивацию всех файлов WAL до того, как они попадут на резервный сервер. Это естественным образом происходит при трансляции файлов журналов, так как резервный сервер может восстановить только файлы, которые находятся в архиве, однако при потоковой репликации это не так. Когда сервер работает не в режиме резерва, различий между режимами <literal>on</literal> и <literal>always</literal> нет.

source: Failover
ru: Отработка отказа

source: If the primary server fails then the standby server should begin failover procedures.
ru: Если ведущий сервер отказывает, резервный должен начать процедуры отработки отказа.

source: If the standby server fails then no failover need take place. If the standby server can be restarted, even some time later, then the recovery process can also be restarted immediately, taking advantage of restartable recovery. If the standby server cannot be restarted, then a full new standby server instance should be created.
ru: Если отказывает резервный сервер, никакие действия по отработке отказа не требуются. Если резервный сервер будет перезапущен, даже через некоторое время, немедленно начнётся операция восстановления, благодаря возможности возобновляемого восстановления. Если вернуть резервный сервер в строй невозможно, необходимо создать полностью новый экземпляр резервного сервера.

source: If the primary server fails and the standby server becomes the new primary, and then the old primary restarts, you must have a mechanism for informing the old primary that it is no longer the primary. This is sometimes known as <acronym>STONITH</acronym> (Shoot The Other Node In The Head), which is necessary to avoid situations where both systems think they are the primary, which will lead to confusion and ultimately data loss.
ru: Когда ведущий сервер отказывает и резервный сервер становится новым ведущим, а затем старый ведущий включается снова, необходим механизм для предотвращения возврата старого к роли ведущего. Иногда его называют <acronym>STONITH</acronym> (Shoot The Other Node In The Head, &laquo;Выстрелите в голову другому узлу&raquo;), что позволяет избежать ситуации, когда обе системы считают себя ведущими, и в результате возникают конфликты и потеря данных.

source: Many failover systems use just two systems, the primary and the standby, connected by some kind of heartbeat mechanism to continually verify the connectivity between the two and the viability of the primary. It is also possible to use a third system (called a witness server) to prevent some cases of inappropriate failover, but the additional complexity might not be worthwhile unless it is set up with sufficient care and rigorous testing.
ru: Во многих отказоустойчивых конструкциях используются всего две системы: ведущая и резервная, с некоторым контрольным механизмом, который постоянно проверяет соединение между ними и работоспособность ведущей. Также возможно применение третьей системы (называемой следящим сервером) для исключения некоторых вариантов нежелательной отработки отказа, но эта дополнительная сложность оправдана, только если вся схема достаточно хорошо продумана и тщательно протестирована.

source: <productname>PostgreSQL</productname> does not provide the system software required to identify a failure on the primary and notify the standby database server. Many such tools exist and are well integrated with the operating system facilities required for successful failover, such as IP address migration.
ru: <productname>PostgreSQL</productname> не предоставляет системного программного обеспечения, необходимого для определения сбоя на ведущем и уведомления резервного сервера баз данных. Имеется множество подобных инструментов, которые хорошо интегрируются со средствами операционной системы, требуемыми для успешной отработки отказа, например, для миграции IP-адреса.

source: Once failover to the standby occurs, there is only a single server in operation. This is known as a degenerate state. The former standby is now the primary, but the former primary is down and might stay down. To return to normal operation, a standby server must be recreated, either on the former primary system when it comes up, or on a third, possibly new, system. The <xref linkend="app-pgrewind"/> utility can be used to speed up this process on large clusters. Once complete, the primary and standby can be considered to have switched roles. Some people choose to use a third server to provide backup for the new primary until the new standby server is recreated, though clearly this complicates the system configuration and operational processes.
ru: Когда происходит переключение на резервный сервер, только один сервер продолжает работу. Это состояние называется ущербным. Бывший резервный сервер теперь является ведущим, а бывший ведущий отключён и может оставаться отключённым. Для возвращения к нормальному состоянию необходимо запустить новый резервный сервер, либо на бывшем ведущем, либо в третьей, возможно, новой системе. Ускорить этот процесс в больших кластерах позволяет утилита <xref linkend="app-pgrewind"/>. По завершении этого процесса можно считать, что ведущий и резервный сервер поменялись ролями. Некоторые используют третий сервер в качестве запасного для нового ведущего, пока не будет воссоздан новый резервный сервер, хотя это, очевидно, усложняет конфигурацию системы и рабочие процедуры.

source: So, switching from primary to standby server can be fast but requires some time to re-prepare the failover cluster. Regular switching from primary to standby is useful, since it allows regular downtime on each system for maintenance. This also serves as a test of the failover mechanism to ensure that it will really work when you need it. Written administration procedures are advised.
ru: Таким образом, переключение с ведущего сервера на резервный может быть быстрым, но требует некоторого времени для повторной подготовки отказоустойчивого кластера. Регулярные переключения с ведущего сервера на резервный полезны, так как при этом появляется плановое время для отключения и проведения обслуживания. Это также позволяет убедиться в работоспособности механизма отработки отказа и гарантировать, что он действительно будет работать, когда потребуется. Эти административные процедуры рекомендуется документировать письменно.

source: To trigger failover of a log-shipping standby server, run <command>pg_ctl promote</command> or create a trigger file with the file name and path specified by the <varname>trigger_file</varname> setting in <filename>recovery.conf</filename>. If you're planning to use <command>pg_ctl promote</command> to fail over, <varname>trigger_file</varname> is not required. If you're setting up the reporting servers that are only used to offload read-only queries from the primary, not for high availability purposes, you don't need to promote it.
ru: Чтобы сделать ведущим резервный сервер, принимающий журналы, выполните команду <command>pg_ctl promote</command> или создайте файл-триггер с именем и путём, заданным в параметре <varname>trigger_file</varname> в файле <filename>recovery.conf</filename>. Если для переключения планируется использовать команду <command>pg_ctl promote</command>, указывать <varname>trigger_file</varname> не требуется. Если резервный сервер применяется для анализа данных, чтобы только разгрузить ведущий, выполняя запросы на чтение, а не обеспечивать отказоустойчивость, повышать его до ведущего не понадобится.

source: Alternative Method for Log Shipping
ru: Другие методы трансляции журнала

source: An alternative to the built-in standby mode described in the previous sections is to use a <varname>restore_command</varname> that polls the archive location. This was the only option available in versions 8.4 and below. In this setup, set <varname>standby_mode</varname> off, because you are implementing the polling required for standby operation yourself. See the <xref linkend="pgstandby"/> module for a reference implementation of this.
ru: Встроенному режиму резерва, описанному в предыдущем разделе, есть альтернатива — задать в <varname>restore_command</varname> команду, следящую за содержимым архива. Эта возможность доступна только для версии 8.4 и выше. В такой конфигурации режим <varname>standby_mode</varname> выключается, так как реализуется отдельный механизм слежения за данными, требующихся для резервного сервера. См. модуль <xref linkend="pgstandby"/> для примера реализации такой возможности.

source: Note that in this mode, the server will apply WAL one file at a time, so if you use the standby server for queries (see Hot Standby), there is a delay between an action in the master and when the action becomes visible in the standby, corresponding the time it takes to fill up the WAL file. <varname>archive_timeout</varname> can be used to make that delay shorter. Also note that you can't combine streaming replication with this method.
ru: Необходимо отметить, что в этом режиме сервер будет применять только один файл WAL одновременно, то есть если использовать резервный сервер для запросов (см. сервер горячего резерва), будет задержка между операциями на главном и моментом видимости этой операции резервным, соответствующей времени заполнения файла WAL. <varname>archive_timeout</varname> можно использовать для снижения этой задержки. Так же необходимо отметить, что нельзя совмещать этот метод с потоковой репликацией.

source: The operations that occur on both primary and standby servers are normal continuous archiving and recovery tasks. The only point of contact between the two database servers is the archive of WAL files that both share: primary writing to the archive, standby reading from the archive. Care must be taken to ensure that WAL archives from separate primary servers do not become mixed together or confused. The archive need not be large if it is only required for standby operation.
ru: В процессе работы на ведущем сервере и резервном будет происходить обычное формирование архивов и их восстановление. Единственной точкой соприкосновения двух серверов будут только архивы файлов WAL на обеих сторонах: на ведущем архивы формируются, на резервном происходит чтение данных из архивов. Следует внимательно следить за тем, чтобы архивы WAL от разных ведущих серверов не смешивались или не перепутывались. Архив не должен быть больше, чем это необходимо для работы резерва.

source: The magic that makes the two loosely coupled servers work together is simply a <varname>restore_command</varname> used on the standby that, when asked for the next WAL file, waits for it to become available from the primary. The <varname>restore_command</varname> is specified in the <filename>recovery.conf</filename> file on the standby server. Normal recovery processing would request a file from the WAL archive, reporting failure if the file was unavailable. For standby processing it is normal for the next WAL file to be unavailable, so the standby must wait for it to appear. For files ending in <literal>.backup</literal> or <literal>.history</literal> there is no need to wait, and a non-zero return code must be returned. A waiting <varname>restore_command</varname> can be written as a custom script that loops after polling for the existence of the next WAL file. There must also be some way to trigger failover, which should interrupt the <varname>restore_command</varname>, break the loop and return a file-not-found error to the standby server. This ends recovery and the standby will then come up as a normal server.
ru: Магия, заставляющая работать вместе два плотно связанных сервера, проста: <varname>restore_command</varname> выполняется на резервном для запроса следующего файла WAL, ожидает его доступности на ведущем. Команда <varname>restore_command</varname> задаётся в файле <filename>recovery.conf</filename> на резервном сервере. Обычно процесс восстановления запрашивает файл из архива WAL, сообщая об ошибке в случае его недоступности. Для работы резервного сервера недоступность очередного файла WAL является обычной ситуацией, резервный просто ожидает его появления. Для файлов, оканчивающихся на <literal>.backup</literal> или <literal>.history</literal> не требуется ожидания, поэтому возвращается ненулевой код. Ожидающая <varname>restore_command</varname> может быть написана как пользовательский скрипт, который в цикле опрашивает, не появился ли очередной файл WAL. Так же должен быть способ инициировать переключение роли, при котором цикл в <varname>restore_command</varname> должен прерваться, а резервный сервер должен получить ошибку &laquo;файл не найден&raquo;. При этом восстановление завершится и резервный сервер сможет станет обычным.

source: triggered = false; while (!NextWALFileReady() &amp;&amp; !triggered) { sleep(100000L); /* wait for ~0.1 sec */ if (CheckForExternalTrigger()) triggered = true; } if (!triggered) CopyWALFileForRecovery();
ru: triggered = false; while (!NextWALFileReady() &amp;&amp; !triggered) { sleep(100000L); /* ждать ~0.1 сек*/ if (CheckForExternalTrigger()) triggered = true; } if (!triggered) CopyWALFileForRecovery();

source: Pseudocode for a suitable <varname>restore_command</varname> is: <placeholder-1/>
ru: Псевдокод для подходящей <varname>restore_command</varname>: <placeholder-1/>

source: A working example of a waiting <varname>restore_command</varname> is provided in the <xref linkend="pgstandby"/> module. It should be used as a reference on how to correctly implement the logic described above. It can also be extended as needed to support specific configurations and environments.
ru: Рабочий пример ожидающей <varname>restore_command</varname> представлен в модуле <xref linkend="pgstandby"/>. К нему следует обратится за примером правильной реализации логики, описанной выше. Он так же может быть расширен для поддержки особых конфигураций и окружений.

source: The method for triggering failover is an important part of planning and design. One potential option is the <varname>restore_command</varname> command. It is executed once for each WAL file, but the process running the <varname>restore_command</varname> is created and dies for each file, so there is no daemon or server process, and signals or a signal handler cannot be used. Therefore, the <varname>restore_command</varname> is not suitable to trigger failover. It is possible to use a simple timeout facility, especially if used in conjunction with a known <varname>archive_timeout</varname> setting on the primary. However, this is somewhat error prone since a network problem or busy primary server might be sufficient to initiate failover. A notification mechanism such as the explicit creation of a trigger file is ideal, if this can be arranged.
ru: Метод вызова переключения является важной частью планирования и архитектуры. Один из возможных вариантов — команда <varname>restore_command</varname>. Она исполняется единожды для каждого файла WAL, но процесс, запускаемый <varname>restore_command</varname>, создаётся и завершается для каждого файла, так что это не служба и не серверный процесс, и применить сигналы и реализовать их обработчик в нём нельзя. Поэтому <varname>restore_command</varname> не подходит для отработки отказа. Можно организовать переключение по тайм-ауту, в частности, связав его с известным значением <varname>archive_timeout</varname> на ведущем. Однако это не очень надёжно, так как переключение может произойти и из-за проблем в сети или загруженности ведущего сервера. В идеале для этого следует использовать механизм уведомлений, например явно создавать файл-триггер, если это возможно.

source: Implementation
ru: Реализация

source: Set up primary and standby systems as nearly identical as possible, including two identical copies of <productname>PostgreSQL</productname> at the same release level.
ru: Разверните ведущую и резервную системы, сделав их максимально одинаковыми, включая две одинаковые копии <productname>PostgreSQL</productname> одного выпуска.

source: Set up continuous archiving from the primary to a WAL archive directory on the standby server. Ensure that <xref linkend="guc-archive-mode"/>, <xref linkend="guc-archive-command"/> and <xref linkend="guc-archive-timeout"/> are set appropriately on the primary (see <xref linkend="backup-archiving-wal"/>).
ru: Настройте постоянную архивацию с ведущего сервера в каталог архивов WAL на резервном. Убедитесь, что <xref linkend="guc-archive-mode"/>, <xref linkend="guc-archive-command"/> и <xref linkend="guc-archive-timeout"/> установлены в соответствующие значения на ведущем (см. <xref remap="4" linkend="backup-archiving-wal"/>).

source: Make a base backup of the primary server (see <xref linkend="backup-base-backup"/>), and load this data onto the standby.
ru: Создайте базовую копию данных ведущего сервера (см. <xref remap="4" linkend="backup-base-backup"/>) и восстановите её на резервном.

source: Begin recovery on the standby server from the local WAL archive, using a <filename>recovery.conf</filename> that specifies a <varname>restore_command</varname> that waits as described previously (see <xref linkend="backup-pitr-recovery"/>).
ru: Запустите восстановление на резервном сервере из локального архива WAL с помощью команды <varname>restore_command</varname> из файла <filename>recovery.conf</filename> как описано выше (см. <xref remap="4" linkend="backup-pitr-recovery"/>).

source: The short procedure for configuring a standby server using this alternative method is as follows. For full details of each step, refer to previous sections as noted. <placeholder-1/>
ru: Сокращённая процедура настройки для резервного сервера с применением альтернативного метода указана ниже. Для подробностей по каждому шагу следует обратиться к указанному разделу. <placeholder-1/>

source: Recovery treats the WAL archive as read-only, so once a WAL file has been copied to the standby system it can be copied to tape at the same time as it is being read by the standby database server. Thus, running a standby server for high availability can be performed at the same time as files are stored for longer term disaster recovery purposes.
ru: Поток восстановления только читает архив WAL, поэтому, как только файл WAL скопирован на резервную систему, его можно копировать на ленту в то время, как его читает резервный сервер. Таким образом, работа резервного сервера в целях отказоустойчивости может быть совмещена с долговременным сохранением файлов для восстановления после катастрофических сбоев.

source: For testing purposes, it is possible to run both primary and standby servers on the same system. This does not provide any worthwhile improvement in server robustness, nor would it be described as HA.
ru: Для целей тестирования возможен запуск ведущего и резервного сервера в одной системе. Это не обеспечивает надёжность серверов, так же как и не подходит под описание высокой доступности.

source: Record-based Log Shipping
ru: Построчная трансляция журнала

source: It is also possible to implement record-based log shipping using this alternative method, though this requires custom development, and changes will still only become visible to hot standby queries after a full WAL file has been shipped.
ru: Так же возможна реализация построчной трансляции журналов с применением альтернативного метода, хотя это требует дополнительных доработок, а изменения будут видны для запросов на сервере горячего резерва только после передачи полного файла WAL.

source: An external program can call the <function>pg_xlogfile_name_offset()</function> function (see <xref linkend="functions-admin"/>) to find out the file name and the exact byte offset within it of the current end of WAL. It can then access the WAL file directly and copy the data from the last known end of WAL through the current end over to the standby servers. With this approach, the window for data loss is the polling cycle time of the copying program, which can be very small, and there is no wasted bandwidth from forcing partially-used segment files to be archived. Note that the standby servers' <varname>restore_command</varname> scripts can only deal with whole WAL files, so the incrementally copied data is not ordinarily made available to the standby servers. It is of use only when the primary dies &mdash; then the last partial WAL file is fed to the standby before allowing it to come up. The correct implementation of this process requires cooperation of the <varname>restore_command</varname> script with the data copying program.
ru: Внешняя программа может вызвать функцию <function>pg_xlogfile_name_offset()</function> (см. <xref remap="4" linkend="functions-admin"/>) для поиска имени файла и точного смещения в нём от текущего конца WAL. Можно получить доступ к файлу WAL напрямую и скопировать данные из последнего известного окончания WAL до текущего окончания на резервном сервере. При таком подходе интервал возможной потери данных определяется временем цикла работы программы копирования, что может составлять очень малую величину. Так же не потребуется напрасно использовать широкую полосу пропускания для принудительного архивирования частично заполненного файла сегмента. Следует отметить, что на резервном сервере скрипт команды <varname>restore_command</varname> работает только с файлом WAL целиком, таким образом, копирование данных нарастающим итогом не может быть выполнено на резервном обычными средствами. Это используется только в случае отказа ведущего &mdash; когда последний частично сформированный файл WAL предоставляется резервному непосредственно перед переключением. Корректная реализация этого процесса требует взаимодействия скрипта команды <varname>restore_command</varname> с данными из программы копирования.

source: Starting with <productname>PostgreSQL</productname> version 9.0, you can use streaming replication (see <xref linkend="streaming-replication"/>) to achieve the same benefits with less effort.
ru: Начиная с <productname>PostgreSQL</productname> версии 9.0 можно использовать потоковую репликацию (см. <xref remap="4" linkend="streaming-replication"/>) для получения этих же преимуществ меньшими усилиями.

source: Hot Standby
ru: Горячий резерв

source: <primary>Hot Standby</primary>
ru: <primary>горячий резерв</primary>
