Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/high-availability.po
Languages: ru

source: The most common reason for conflict between standby queries and WAL replay is <quote>early cleanup</quote>. Normally, <productname>PostgreSQL</productname> allows cleanup of old row versions when there are no transactions that need to see them to ensure correct visibility of data according to MVCC rules. However, this rule can only be applied for transactions executing on the master. So it is possible that cleanup on the master will remove row versions that are still visible to a transaction on the standby.
ru: Наиболее частой причиной конфликтов между запросами на резервном сервере и проигрыванием WAL является преждевременная очистка. Обычно <productname>PostgreSQL</productname> допускает очистку старых версий записей при условии что ни одна из транзакций их не видит согласно правилам видимости данных для MVCC. Тем не менее, эти правила применяются только для транзакций, выполняемых на главном сервере. Таким образом, допустима ситуация, когда на главном запись уже очищена, но эта же запись всё ещё видна для транзакций на резервном сервере.

source: Experienced users should note that both row version cleanup and row version freezing will potentially conflict with standby queries. Running a manual <command>VACUUM FREEZE</command> is likely to cause conflicts even on tables with no updated or deleted rows.
ru: Для опытных пользователей следует отметить, что как очистка старых версий строк, так и заморозка версии строки могут потенциально вызвать конфликт с запросами на резервном сервере. Ручной запуск команды <command>VACUUM FREEZE</command> может привести к конфликту, даже в таблице без обновленных и удалённых строк.

source: Users should be clear that tables that are regularly and heavily updated on the primary server will quickly cause cancellation of longer running queries on the standby. In such cases the setting of a finite value for <varname>max_standby_archive_delay</varname> or <varname>max_standby_streaming_delay</varname> can be considered similar to setting <varname>statement_timeout</varname>.
ru: Пользователи должны понимать, что регулярное и активное изменение данных в таблицах на ведущем сервере чревато отменой длительных запросов на резервном. В таком случае установка конечного значения для <varname>max_standby_archive_delay</varname> или <varname>max_standby_streaming_delay</varname> действует подобно ограничению <varname>statement_timeout</varname>.

source: Remedial possibilities exist if the number of standby-query cancellations is found to be unacceptable. The first option is to set the parameter <varname>hot_standby_feedback</varname>, which prevents <command>VACUUM</command> from removing recently-dead rows and so cleanup conflicts do not occur. If you do this, you should note that this will delay cleanup of dead rows on the primary, which may result in undesirable table bloat. However, the cleanup situation will be no worse than if the standby queries were running directly on the primary server, and you are still getting the benefit of off-loading execution onto the standby. If standby servers connect and disconnect frequently, you might want to make adjustments to handle the period when <varname>hot_standby_feedback</varname> feedback is not being provided. For example, consider increasing <varname>max_standby_archive_delay</varname> so that queries are not rapidly canceled by conflicts in WAL archive files during disconnected periods. You should also consider increasing <varname>max_standby_streaming_delay</varname> to avoid rapid cancellations by newly-arrived streaming WAL entries after reconnection.
ru: В случае, если количество отменённых запросов на резервном сервере получается неприемлемым, существует ряд дополнительных возможностей. Первая возможность — установить параметр <varname>hot_standby_feedback</varname>, который не даёт команде <command>VACUUM</command> удалять записи, ставшие недействительными недавно, что предотвращает конфликты очистки. При этом следует учесть, что это вызывает задержку очистки мёртвых строк на ведущем, что может привести к нежелательному распуханию таблицы. Тем не менее, в итоге ситуация будет не хуже, чем если бы запросы к резервному серверу исполнялись непосредственно на ведущем, но при этом сохранится положительный эффект от разделения нагрузки. В случае, когда соединение резервных серверов с ведущим часто разрывается, следует скорректировать период, в течение которого обратная связь через <varname>hot_standby_feedback</varname> не обеспечивается. Например, следует подумать об увеличении <varname>max_standby_archive_delay</varname>, чтобы запросы отменялись не сразу при конфликтах с архивом WAL в период разъединения. Также может иметь смысл увеличить <varname>max_standby_streaming_delay</varname> для предотвращения быстрой отмены запросов из-за полученных записей WAL после восстановления соединения.

source: Another option is to increase <xref linkend="guc-vacuum-defer-cleanup-age"/> on the primary server, so that dead rows will not be cleaned up as quickly as they normally would be. This will allow more time for queries to execute before they are canceled on the standby, without having to set a high <varname>max_standby_streaming_delay</varname>. However it is difficult to guarantee any specific execution-time window with this approach, since <varname>vacuum_defer_cleanup_age</varname> is measured in transactions executed on the primary server.
ru: Другая возможность — увеличение <xref linkend="guc-vacuum-defer-cleanup-age"/> на ведущем сервере таким образом, чтобы мёртвые записи не очищались бы так быстро, как при обычном режиме работы. Это даёт запросам на резервном сервере больше времени на выполнение, прежде чем они могут быть отменены, без увеличения задержки <varname>max_standby_streaming_delay</varname>. Тем не менее при таком подходе очень трудно обеспечить какое-то определённое окно по времени, так как <varname>vacuum_defer_cleanup_age</varname> измеряется в количестве транзакций, выполняемых на ведущем сервере.

source: The number of query cancels and the reason for them can be viewed using the <structname>pg_stat_database_conflicts</structname> system view on the standby server. The <structname>pg_stat_database</structname> system view also contains summary information.
ru: Количество отменённых запросов и причины отмены можно просмотреть через системное представление <structname>pg_stat_database_conflicts</structname> на резервном сервере. Системное представление <structname>pg_stat_database</structname> так же содержит итоговую информацию.

source: Administrator's Overview
ru: Обзор административной части

source: A write transaction has more than 64 subtransactions
ru: Пишущая транзакция имеет более 64 подтранзакций

source: Very long-lived write transactions
ru: Очень длительные пишущие транзакции

source: If <varname>hot_standby</varname> is turned <literal>on</literal> in <filename>postgresql.conf</filename> and there is a <filename>recovery.conf</filename> file present, the server will run in Hot Standby mode. However, it may take some time for Hot Standby connections to be allowed, because the server will not accept connections until it has completed sufficient recovery to provide a consistent state against which queries can run. During this period, clients that attempt to connect will be refused with an error message. To confirm the server has come up, either loop trying to connect from the application, or look for these messages in the server logs: <placeholder-1/> Consistency information is recorded once per checkpoint on the primary. It is not possible to enable hot standby when reading WAL written during a period when <varname>wal_level</varname> was not set to <literal>replica</literal> or <literal>logical</literal> on the primary. Reaching a consistent state can also be delayed in the presence of both of these conditions: <placeholder-2/> If you are running file-based log shipping ("warm standby"), you might need to wait until the next WAL file arrives, which could be as long as the <varname>archive_timeout</varname> setting on the primary.
ru: Если в файле <filename>postgresql.conf</filename> для параметра <varname>hot_standby</varname> задано значение <literal>on</literal> и существует файл <filename>recovery.conf</filename>, сервер запустится в режиме горячего резерва. Однако может пройти некоторое время, прежде чем к нему можно будет подключиться, так как он не будет принимать подключения, пока не произведёт восстановление до согласованного состояния, подходящего для выполнения запросов. (Информация о согласованности состояния записывается на ведущем сервере в контрольной точке.) В течение этого периода клиенты при попытке подключения будут получать сообщение об ошибке. Убедиться, что сервер включился в работу, можно либо повторяя попытки подключения из приложения до успешного подключения, либо дождавшись появления в журналах сервера этих сообщений: <placeholder-1/> Включить горячий резерв нельзя, если WAL был записан в период, когда на ведущем сервере параметр <varname>wal_level</varname> имел значение не <literal>replica</literal> и не <literal>logical</literal>. Достижение согласованного состояния также может быть отсрочено, если имеют место оба этих условия: <placeholder-2/> Если вы применяете файловую репликацию журналов (&laquo;тёплый резерв&raquo;), возможно, придётся ожидать прибытия следующего файла WAL (максимальное время ожидания задаётся параметром <varname>archive_timeout</varname> на ведущем сервере).

source: The setting of some parameters on the standby will need reconfiguration if they have been changed on the primary. For these parameters, the value on the standby must be equal to or greater than the value on the primary. If these parameters are not set high enough then the standby will refuse to start. Higher values can then be supplied and the server restarted to begin recovery again. These parameters are: <placeholder-1/>
ru: Значения некоторых параметров на резервном сервере необходимо изменить при модификации их на ведущем. Для таких параметров значения на резервном сервере должны быть равны или больше значений на ведущем. Если параметр имеет недостаточно большое значение, резервный сервер не сможет начать работу. Следует увеличить значение и повторить попытку восстановления ещё раз. Это касается следующих параметров: <placeholder-1/>

source: It is important that the administrator select appropriate settings for <xref linkend="guc-max-standby-archive-delay"/> and <xref linkend="guc-max-standby-streaming-delay"/>. The best choices vary depending on business priorities. For example if the server is primarily tasked as a High Availability server, then you will want low delay settings, perhaps even zero, though that is a very aggressive setting. If the standby server is tasked as an additional server for decision support queries then it might be acceptable to set the maximum delay values to many hours, or even -1 which means wait forever for queries to complete.
ru: Очень важно для администратора выбрать подходящие значения для <xref linkend="guc-max-standby-archive-delay"/> и <xref linkend="guc-max-standby-streaming-delay"/>. Оптимальное значение зависит от приоритетов. Например, если основное назначение сервера — обеспечение высокой степени доступности, то следует установить короткий период, возможно даже нулевой, хотя это очень жёсткий вариант. Если резервный сервер планируется как дополнительный сервер для аналитических запросов, то приемлемой будет максимальная задержка в несколько часов или даже -1, что означает бесконечное ожидание окончания запроса.

source: Transaction status "hint bits" written on the primary are not WAL-logged, so data on the standby will likely re-write the hints again on the standby. Thus, the standby server will still perform disk writes even though all users are read-only; no changes occur to the data values themselves. Users will still write large sort temporary files and re-generate relcache info files, so no part of the database is truly read-only during hot standby mode. Note also that writes to remote databases using <application>dblink</application> module, and other operations outside the database using PL functions will still be possible, even though the transaction is read-only locally.
ru: Вспомогательные биты статуса транзакций, записанные на ведущем, не попадают в WAL, так что они, скорее всего, будут перезаписаны на нём при работе с данными. Таким образом, резервный сервер будет производить запись на диск, даже если все пользователи только читают данные, ничего не меняя. Кроме того, пользователи будут записывать временные файлы при сортировке больших объёмов и обновлять файлы кеша. Поэтому в режиме горячего резерва ни одна часть базы данных фактически не работает в режиме &laquo;только чтение&raquo;. Следует отметить, что также возможно выполнить запись в удалённую базу данных с помощью модуля <application>dblink</application> и другие операции вне базы данных с применением PL-функций, несмотря на то, что транзакции по-прежнему смогут только читать данные.

source: Data Definition Language (DDL) - e.g. <command>CREATE INDEX</command>
ru: Команды определения данных (DDL) — например: <command>CREATE INDEX</command>

source: Privilege and Ownership - <command>GRANT</command>, <command>REVOKE</command>, <command>REASSIGN</command>
ru: Команды выдачи привилегий и назначения владельца — <command>GRANT</command>, <command>REVOKE</command>, <command>REASSIGN</command>

source: Maintenance commands - <command>ANALYZE</command>, <command>VACUUM</command>, <command>CLUSTER</command>, <command>REINDEX</command>
ru: Команды обслуживания — <command>ANALYZE</command>, <command>VACUUM</command>, <command>CLUSTER</command>, <command>REINDEX</command>

source: The following types of administration commands are not accepted during recovery mode: <placeholder-1/>
ru: Следующие типы административных команд недоступны в течение режима восстановления: <placeholder-1/>

source: Again, note that some of these commands are actually allowed during "read only" mode transactions on the primary.
ru: Ещё раз следует отметить, что некоторые из этих команд фактически доступны на ведущем сервере для транзакций в режиме только для чтения.

source: As a result, you cannot create additional indexes that exist solely on the standby, nor statistics that exist solely on the standby. If these administration commands are needed, they should be executed on the primary, and eventually those changes will propagate to the standby.
ru: В результате нельзя создать дополнительные индексы или статистику, чтобы они существовали только на резервном. Если подобные административные команды нужны, то их следует выполнить на ведущем сервере, затем эти изменения будут распространены на резервные серверы.

source: <function>pg_cancel_backend()</function> and <function>pg_terminate_backend()</function> will work on user backends, but not the Startup process, which performs recovery. <structname>pg_stat_activity</structname> does not show an entry for the Startup process, nor do recovering transactions show as active. As a result, <structname>pg_prepared_xacts</structname> is always empty during recovery. If you wish to resolve in-doubt prepared transactions, view <literal>pg_prepared_xacts</literal> on the primary and issue commands to resolve transactions there.
ru: Функции <function>pg_cancel_backend()</function> и <function>pg_terminate_backend()</function> работают на стороне пользователя, но не для процесса запуска, который обеспечивает восстановление. Представление <structname>pg_stat_activity</structname> не показывает ни вхождение для процесса запуска, ни восстановление транзакций в активном состоянии. В результате <structname>pg_prepared_xacts</structname> всегда пусто в ходе восстановления. Если требуется разрешить сомнительные подготовленные транзакции, следует обратиться к <literal>pg_prepared_xacts</literal> на ведущем и выполнить команду для разрешения транзакции там.

source: <structname>pg_locks</structname> will show locks held by backends, as normal. <structname>pg_locks</structname> also shows a virtual transaction managed by the Startup process that owns all <literal>AccessExclusiveLocks</literal> held by transactions being replayed by recovery. Note that the Startup process does not acquire locks to make database changes, and thus locks other than <literal>AccessExclusiveLocks</literal> do not show in <structname>pg_locks</structname> for the Startup process; they are just presumed to exist.
ru: <structname>pg_locks</structname> отображает блокировки, происходящие в процессе работы сервера как обычно. <structname>pg_locks</structname> так же показывает виртуальные транзакции, обработанные процессом запуска, которому принадлежат все <literal>AccessExclusiveLocks</literal>, наложенные транзакциями в режиме восстановления. Следует отметить, что процесс запуска не запрашивает блокировки, чтобы внести изменения в базу данных, поэтому блокировки, отличные от <literal>AccessExclusiveLocks</literal> не показываются в <structname>pg_locks</structname> для процесса запуска, подразумевается их существование.

source: The <productname>Nagios</productname> plugin <productname>check_pgsql</productname> will work, because the simple information it checks for exists. The <productname>check_postgres</productname> monitoring script will also work, though some reported values could give different or confusing results. For example, last vacuum time will not be maintained, since no vacuum occurs on the standby. Vacuums running on the primary do still send their changes to the standby.
ru: Модуль <productname>check_pgsql</productname> для <productname>Nagios</productname> будет работать, так как сервер выдаёт простую информацию, наличие которой он проверяет. Скрипт мониторинга <productname>check_postgres</productname> так же работает, хотя для некоторых выдаваемых показателей результаты могут различаться или вводить в заблуждение. Например, нельзя отследить время последней очистки, так как очистка не производится на резервном сервере. Очистка запускается на ведущем сервере и результаты её работы передаются резервному.

source: WAL file control commands will not work during recovery, e.g. <function>pg_start_backup</function>, <function>pg_switch_xlog</function> etc.
ru: Команды контроля файлов WAL так же не будут работать во время восстановления, например: <function>pg_start_backup</function>, <function>pg_switch_xlog</function> и т. п.

source: Dynamically loadable modules work, including <structname>pg_stat_statements</structname>.
ru: Динамически загружаемые модули работать будут, включая <structname>pg_stat_statements</structname>.

source: Advisory locks work normally in recovery, including deadlock detection. Note that advisory locks are never WAL logged, so it is impossible for an advisory lock on either the primary or the standby to conflict with WAL replay. Nor is it possible to acquire an advisory lock on the primary and have it initiate a similar advisory lock on the standby. Advisory locks relate only to the server on which they are acquired.
ru: Рекомендательная блокировка работает обычно при восстановлении, включая обнаружение взаимных блокировок. Следует отметить, что рекомендательная блокировка никогда не попадает в WAL, таким образом для рекомендательной блокировки как на ведущем сервере, так и на резервном, невозможен конфликт с проигрыванием WAL. Но возможно получение рекомендательной блокировки на ведущем сервере, а затем получение подобной рекомендательной блокировки на резервном. Рекомендательная блокировка относится только к серверу, на котором она получена.

source: Trigger-based replication systems such as <productname>Slony</productname>, <productname>Londiste</productname> and <productname>Bucardo</productname> won't run on the standby at all, though they will run happily on the primary server as long as the changes are not sent to standby servers to be applied. WAL replay is not trigger-based so you cannot relay from the standby to any system that requires additional database writes or relies on the use of triggers.
ru: Системы репликации на базе триггеров, подобные <productname>Slony</productname>, <productname>Londiste</productname> и <productname>Bucardo</productname> не могут запускаться на резервном сервере вовсе, хотя они превосходно работают на ведущем до тех пор, пока не будет подана команда не пересылать изменения на резервный. Проигрывание WAL не основано на триггерах, поэтому поток WAL нельзя транслировать с резервного сервера в другую систему, которая требует дополнительной записи в БД или работает на основе триггеров.

source: New OIDs cannot be assigned, though some <acronym>UUID</acronym> generators may still work as long as they do not rely on writing new status to the database.
ru: Новые OID не могут быть выданы, хотя, например генераторы <acronym>UUID</acronym> смогут работать, если они не пытаются записывать новое состояние в базу данных.

source: Currently, temporary table creation is not allowed during read only transactions, so in some cases existing scripts will not run correctly. This restriction might be relaxed in a later release. This is both a SQL Standard compliance issue and a technical issue.
ru: В настоящий момент создание временных таблиц недопустимо при транзакции только для чтения, в некоторых случаях существующий скрипт будет работать неверно. Это ограничение может быть ослаблено в следующих выпусках. Это одновременно требование SQL стандарта и техническое требование.

source: <command>DROP TABLESPACE</command> can only succeed if the tablespace is empty. Some standby users may be actively using the tablespace via their <varname>temp_tablespaces</varname> parameter. If there are temporary files in the tablespace, all active queries are canceled to ensure that temporary files are removed, so the tablespace can be removed and WAL replay can continue.
ru: Команда <command>DROP TABLESPACE</command> может быть выполнена только если табличное пространство пусто. Некоторые пользователи резервного сервера могут активно использовать табличное пространство через параметр <varname>temp_tablespaces</varname>. Если имеются временные файлы в табличных пространствах, все активные запросы отменяются для обеспечения удаления временных файлов, затем табличное пространство может быть удалено и продолжено проигрывание WAL.

source: Running <command>DROP DATABASE</command> or <command>ALTER DATABASE ... SET TABLESPACE</command> on the primary will generate a WAL entry that will cause all users connected to that database on the standby to be forcibly disconnected. This action occurs immediately, whatever the setting of <varname>max_standby_streaming_delay</varname>. Note that <command>ALTER DATABASE ... RENAME</command> does not disconnect users, which in most cases will go unnoticed, though might in some cases cause a program confusion if it depends in some way upon database name.
ru: Выполнение команды <command>DROP DATABASE</command> или <command>ALTER DATABASE ... SET TABLESPACE</command> на ведущем сервере приводит к созданию записи в WAL, которая вызывает принудительное отключение всех пользователей, подключённых к этой базе данных на резервном. Это происходит немедленно, вне зависимости от значения <varname>max_standby_streaming_delay</varname>. Следует отметить, что команда <command>ALTER DATABASE ... RENAME</command> не приводит к отключению пользователей, так что обычно она действует незаметно, хотя в некоторых случаях возможны сбои программ, которые зависят от имени базы данных.
