Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/installation.po
Languages: ru

source: PostgreSQL relies on the system's <function>getaddrinfo</function> function to parse IP addresses in <varname>listen_addresses</varname>, <filename>pg_hba.conf</filename>, etc. Older versions of AIX have assorted bugs in this function. If you have problems related to these settings, updating to the appropriate AIX fix level shown above should take care of it.
ru: PostgreSQL пользуется системной функцией <function>getaddrinfo</function> для разбора IP-адресов, указанных в параметре <varname>listen_addresses</varname>, файле <filename>pg_hba.conf</filename> и т. д. В старых версиях AIX эта функция работала некорректно. Если вы столкнулись с проблемами в этой области, обновление до уровня исправлений AIX, обозначенного выше, должно решить их.

source: One user reports:
ru: Один пользователь сообщает:

source: When implementing PostgreSQL version 8.1 on AIX 5.3, we periodically ran into problems where the statistics collector would <quote>mysteriously</quote> not come up successfully. This appears to be the result of unexpected behavior in the IPv6 implementation. It looks like PostgreSQL and IPv6 do not play very well together on AIX 5.3.
ru: Используя PostgreSQL версии 8.1 в AIX 5.3, мы периодически сталкивались с тем, что сборщик статистики <quote>загадочным образом</quote> не запускается. Кажется, это результат незапланированного поведения реализации IPv6. Похоже, что PostgreSQL и IPv6 не дружат в AIX 5.3.

source: Delete the IPv6 address for localhost: <screen> (as root) # ifconfig lo0 inet6 ::1/0 delete </screen>
ru: Удалите адрес IPv6 для localhost: <screen> (от имени root) # ifconfig lo0 inet6 ::1/0 delete </screen>

source: Remove IPv6 from net services. The file <filename>/etc/netsvc.conf</filename> on AIX is roughly equivalent to <filename>/etc/nsswitch.conf</filename> on Solaris/Linux. The default, on AIX, is thus: <placeholder-1/> Replace this with: <placeholder-2/> to deactivate searching for IPv6 addresses.
ru: Удалите IPv6 из сетевых сервисов. Файл <filename>/etc/netsvc.conf</filename> в AIX примерно соответствует файлу <filename>/etc/nsswitch.conf</filename> в Solaris/Linux. По умолчанию в AIX он выглядит так: <placeholder-1/> Чтобы отключить поиск адресов IPv6, замените его содержимое следующим: <placeholder-2/>

source: Any of the following actions <quote>fix</quote> the problem. <placeholder-1/>
ru: Для <quote>решения</quote> проблемы можно выполнить одно из следующих действий. <placeholder-1/>

source: This is really a workaround for problems relating to immaturity of IPv6 support, which improved visibly during the course of AIX 5.3 releases. It has worked with AIX version 5.3, but does not represent an elegant solution to the problem. It has been reported that this workaround is not only unnecessary, but causes problems on AIX 6.1, where IPv6 support has become more mature.
ru: К этим временным решениям приходилось прибегать из-за проблем, связанных с сырой реализацией IPv6, которая заметно улучшилась в последующих выпусках AIX 5.3. Эти решения работали в AIX версии 5.3, но они конечно далеки от идеальных. Кроме того, сообщалось, что они не только не требуются, но и приводят к другим проблемам в AIX 6.1, где поддержка IPv6 стала более зрелой.

source: Memory Management
ru: Управление памятью

source: AIX can be somewhat peculiar with regards to the way it does memory management. You can have a server with many multiples of gigabytes of RAM free, but still get out of memory or address space errors when running applications. One example is <command>createlang</command> failing with unusual errors. For example, running as the owner of the PostgreSQL installation: <screen> -bash-3.00$ createlang plperl template1 createlang: language installation failed: ERROR: could not load library "/opt/dbs/pgsql748/lib/plperl.so": A memory address is not in the address space for the process. </screen> Running as a non-owner in the group possessing the PostgreSQL installation: <screen> -bash-3.00$ createlang plperl template1 createlang: language installation failed: ERROR: could not load library "/opt/dbs/pgsql748/lib/plperl.so": Bad address </screen> Another example is out of memory errors in the PostgreSQL server logs, with every memory allocation near or greater than 256 MB failing.
ru: Иногда управление памятью в AIX может работать несколько странно. В системе может быть свободно несколько гигабайт ОЗУ, но при запуске приложений всё равно возможны ошибки, связанные с адресным пространством или нехваткой памяти. Например, необычную ошибку может выдать команда <command>createlang</command>. При запуске от имени владельца инсталляции PostgreSQL: <screen> -bash-3.00$ createlang plperl template1 createlang: language installation failed: ERROR: could not load library "/opt/dbs/pgsql748/lib/plperl.so": A memory address is not in the address space for the process. </screen> (createlang: установить язык не удалось: ОШИБКА: не удалось загрузить библиотеку "/opt/dbs/pgsql748/lib/plperl.so": Адрес памяти находится не в адресном пространстве процесса.) При запуске от имени не владельца, а члена группы-владельца инсталляции PostgreSQL: <screen> -bash-3.00$ createlang plperl template1 createlang: language installation failed: ERROR: could not load library "/opt/dbs/pgsql748/lib/plperl.so": Bad address </screen> (createlang: установить язык не удалось: ОШИБКА: не удалось загрузить библиотеку "/opt/dbs/pgsql748/lib/plperl.so": Неверный адрес) Также сообщения о нехватке памяти могут появляться в журнале PostgreSQL при попытке выделить блок памяти размером около 256 МиБ или больше.

source: The overall cause of all these problems is the default bittedness and memory model used by the server process. By default, all binaries built on AIX are 32-bit. This does not depend upon hardware type or kernel in use. These 32-bit processes are limited to 4 GB of memory laid out in 256 MB segments using one of a few models. The default allows for less than 256 MB in the heap as it shares a single segment with the stack.
ru: Общая причина всех этих проблем связана с битностью и моделью памяти серверного процесса. По умолчанию все исполняемые файлы для AIX собираются как 32-битные, вне зависимости от того, какой тип оборудования или ядра используется. Такие 32-битные процессы ограничиваются общим пространством в 4 ГиБ, разделённым на сегменты по 256 МиБ, по одной из нескольких моделей. По умолчанию в куче можно выделить меньше 256 МиБ, так как она разделяет один сегмент со стеком.

source: In the case of the <command>createlang</command> example, above, check your umask and the permissions of the binaries in your PostgreSQL installation. The binaries involved in that example were 32-bit and installed as mode 750 instead of 755. Due to the permissions being set in this fashion, only the owner or a member of the possessing group can load the library. Since it isn't world-readable, the loader places the object into the process' heap instead of the shared library segments where it would otherwise be placed.
ru: В ситуации с показанным выше примером <command>createlang</command>, проверьте umask и разрешения, назначенные для двоичных файлов в вашей инсталляции PostgreSQL. Задействованные в данном примере двоичные файлы были 32-битными и установились с режимом 750 вместо 755. Из-за таких разрешений только владелец или член группы-владельца могли загрузить требуемую библиотеку. Так как она недоступна для чтения всеми, загрузчик помещал этот объект в область кучи процесса, а не в сегменты разделяемых библиотек, где он должен находиться.

source: The <quote>ideal</quote> solution for this is to use a 64-bit build of PostgreSQL, but that is not always practical, because systems with 32-bit processors can build, but not run, 64-bit binaries.
ru: В <quote>идеале</quote> эту проблему можно решить, если использовать 64-битную сборку PostgreSQL, но это не всегда практично, так как с 32-битным процессором нельзя будет запустить 64-битный код (можно только собрать).

source: If a 32-bit binary is desired, set <symbol>LDR_CNTRL</symbol> to <literal>MAXDATA=0x<replaceable>n</replaceable>0000000</literal>, where 1 &lt;= n &lt;= 8, before starting the PostgreSQL server, and try different values and <filename>postgresql.conf</filename> settings to find a configuration that works satisfactorily. This use of <symbol>LDR_CNTRL</symbol> tells AIX that you want the server to have <symbol>MAXDATA</symbol> bytes set aside for the heap, allocated in 256 MB segments. When you find a workable configuration, <command>ldedit</command> can be used to modify the binaries so that they default to using the desired heap size. PostgreSQL can also be rebuilt, passing <literal>configure LDFLAGS="-Wl,-bmaxdata:0x<replaceable>n</replaceable>0000000"</literal> to achieve the same effect.
ru: При желании использовать 32-битную версию сервера установите в <symbol>LDR_CNTRL</symbol> значение <literal>MAXDATA=0x<replaceable>n</replaceable>0000000</literal>, где 1 &lt;= n &lt;= 8, до запуска PostgreSQL, и попробуйте подобрать подходящее значение и параметры <filename>postgresql.conf</filename>. Переменная окружения <symbol>LDR_CNTRL</symbol> говорит AIX, что вы хотите, чтобы сервер получил <symbol>MAXDATA</symbol> байт для области кучи, в сегментах по 256 МиБ. Подобрав рабочее значение, можно воспользоваться <command>ldedit</command> и модифицировать двоичные файлы, чтобы они использовали такой размер кучи по умолчанию. Тот же эффект можно получить, пересобрав PostgreSQL с указанием <literal>configure LDFLAGS="-Wl,-bmaxdata:0x<replaceable>n</replaceable>0000000"</literal>.

source: For a 64-bit build, set <envar>OBJECT_MODE</envar> to 64 and pass <literal>CC="gcc -maix64"</literal> and <literal>LDFLAGS="-Wl,-bbigtoc"</literal> to <command>configure</command>. (Options for <command>xlc</command> might differ.) If you omit the export of <envar>OBJECT_MODE</envar>, your build may fail with linker errors. When <envar>OBJECT_MODE</envar> is set, it tells AIX's build utilities such as <command>ar</command>, <command>as</command>, and <command>ld</command> what type of objects to default to handling.
ru: Для 64-битной сборки определите переменную <envar>OBJECT_MODE</envar> со значением 64 и передайте <command>configure</command> указания <literal>CC="gcc -maix64"</literal> и <literal>LDFLAGS="-Wl,-bbigtoc"</literal>. (Для <command>xlc</command> параметры могут быть другими.) Если нужное значение <envar>OBJECT_MODE</envar> не будет экспортировано, при сборке могут произойти ошибки на стадии компоновки. Когда переменная <envar>OBJECT_MODE</envar> установлена, она говорит сборочным утилитам AIX, таким как <command>ar</command>, <command>as</command> и <command>ld</command>, какие типы объектов обрабатывать по умолчанию.

source: By default, overcommit of paging space can happen. While we have not seen this occur, AIX will kill processes when it runs out of memory and the overcommit is accessed. The closest to this that we have seen is fork failing because the system decided that there was not enough memory for another process. Like many other parts of AIX, the paging space allocation method and out-of-memory kill is configurable on a system- or process-wide basis if this becomes a problem.
ru: По умолчанию система может чрезмерно выделять память в пространстве подкачки. Хотя нам не приходилось с этим сталкиваться, AIX уничтожает процессы при попытке обращения к чрезмерно выделенной памяти, когда её фактически не хватает. Наиболее близкое, что мы наблюдали, была ошибка порождения процесса из-за того, что система решала, что для него не хватает памяти. Как и многие другие компоненты AIX, механизмы распределения пространства подкачки и уничтожения процессов при нехватке памяти можно настроить на уровне системы или процесса, если возникают подобные проблемы.

source: References and Resources
ru: Ссылки и ресурсы

source: AIX Documentation: General Programming Concepts: Writing and Debugging Programs
ru: Документация AIX: Общие концепции программирования: Написание и отладка программ

source: AIX Documentation: Performance Management Guide
ru: Документация AIX: Руководство по управлению производительностью

source: IBM Redbook
ru: Красная книга IBM

source: <primary>Cygwin</primary> <secondary>installation on</secondary>
ru: <primary>Cygwin</primary> <secondary>установка в</secondary>

source: PostgreSQL can be built using Cygwin, a Linux-like environment for Windows, but that method is inferior to the native Windows build <phrase condition="default">(see <xref linkend="install-windows"/>)</phrase> and running a server under Cygwin is no longer recommended.
ru: PostgreSQL можно собрать с применением Cygwin, Linux-подобной среды для Windows, но сейчас этому методу предпочитается обычная сборка в Windows <phrase condition="default">(см. <xref remap="4" linkend="install-windows"/>)</phrase>, и запускать сервер в среде Cygwin более не рекомендуется.

source: Set your path to use the Cygwin bin directory before the Windows utilities. This will help prevent problems with compilation.
ru: Настройте путь поиска так, чтобы каталог bin в Cygwin стоял перед каталогами утилит Windows. Это поможет избавиться от проблем при компиляции.

source: The <command>adduser</command> command is not supported; use the appropriate user management application on Windows NT, 2000, or XP. Otherwise, skip this step.
ru: Команда <command>adduser</command> не поддерживается; воспользуйтесь соответствующим средством управления пользователями для Windows NT, 2000 или XP. Либо просто пропустите этот шаг.

source: The <command>su</command> command is not supported; use ssh to simulate su on Windows NT, 2000, or XP. Otherwise, skip this step.
ru: Команда <command>su</command> не поддерживается; для эмуляции su в Windows NT, 2000 или XP воспользуйтесь ssh. Либо пропустите этот шаг.

source: OpenSSL is not supported.
ru: OpenSSL не поддерживается.

source: Start <command>cygserver</command> for shared memory support. To do this, enter the command <literal>/usr/sbin/cygserver &amp;</literal>. This program needs to be running anytime you start the PostgreSQL server or initialize a database cluster (<command>initdb</command>). The default <command>cygserver</command> configuration may need to be changed (e.g., increase <symbol>SEMMNS</symbol>) to prevent PostgreSQL from failing due to a lack of system resources.
ru: Запустите <command>cygserver</command> для поддержки разделяемой памяти. Для этого введите команду <literal>/usr/sbin/cygserver &amp;</literal>. Эта программа должна работать всегда при запуске сервера PostgreSQL или инициализации кластера баз данных (<command>initdb</command>). Возможно, вам придётся настроить конфигурацию <command>cygserver</command> (например, увеличить <symbol>SEMMNS</symbol>), чтобы PostgreSQL мог получить требуемые системные ресурсы.

source: Building might fail on some systems where a locale other than C is in use. To fix this, set the locale to C by doing <command>export LANG=C.utf8</command> before building, and then setting it back to the previous setting, after you have installed PostgreSQL.
ru: Сборка может завершиться ошибкой в некоторых системах, где используется локаль, отличная от C. Чтобы исправить это, выберите локаль C, выполнив <command>export LANG=C.utf8</command> до сборки, а затем восстановите предыдущее значение после установки PostgreSQL.

source: The parallel regression tests (<literal>make check</literal>) can generate spurious regression test failures due to overflowing the <function>listen()</function> backlog queue which causes connection refused errors or hangs. You can limit the number of connections using the make variable <varname>MAX_CONNECTIONS</varname> thus: <placeholder-1/> (On some systems you can have up to about 10 simultaneous connections).
ru: Параллельные регрессионные тесты (<literal>make check</literal>) могут выдавать ложные ошибки тестирования при переполнении очереди <function>listen()</function>, из-за чего подключения могут не устанавливаться или зависать. Вы можете ограничить число подключений, определив переменную make <varname>MAX_CONNECTIONS</varname> так: <placeholder-1/> (В некоторых системах поддерживается до 10 одновременных подключений).

source: When building from source, proceed according to the normal installation procedure (i.e., <literal>./configure; make</literal>; etc.), noting the following-Cygwin specific differences: <placeholder-1/>
ru: Выполняя сборку, следуйте обычной процедуре установки (т. е., <literal>./configure; make</literal>; и т. д.), с учётом следующих особенностей Cygwin: <placeholder-1/>

source: It is possible to install <command>cygserver</command> and the PostgreSQL server as Windows NT services. For information on how to do this, please refer to the <filename>README</filename> document included with the PostgreSQL binary package on Cygwin. It is installed in the directory <filename>/usr/share/doc/Cygwin</filename>.
ru: Сервер PostgreSQL и <command>cygserver</command> можно запустить в виде служб Windows NT. Как это сделать, рассказывается в описании <filename>README</filename>, включённом в двоичный пакет PostgreSQL для Cygwin. Оно устанавливается в каталог <filename>/usr/share/doc/Cygwin</filename>.

source: <primary>HP-UX</primary> <secondary>installation on</secondary>
ru: <primary>HP-UX</primary> <secondary>установка в</secondary>

source: PostgreSQL 7.3+ should work on Series 700/800 PA-RISC machines running HP-UX 10.X or 11.X, given appropriate system patch levels and build tools. At least one developer routinely tests on HP-UX 10.20, and we have reports of successful installations on HP-UX 11.00 and 11.11.
ru: PostgreSQL 7.3+ должен работать на машинах Series 700/800 PA-RISC под управлением HP-UX 10.X или 11.X, с подходящими уровнями системных исправлений и средствами сборки. Как минимум один разработчик регулярно тестирует сборку в HP-UX 10.20, и мы получали сообщения об успешных установках в HP-UX 11.00 и 11.11.

source: Aside from the PostgreSQL source distribution, you will need GNU make (HP's make will not do), and either GCC or HP's full ANSI C compiler. If you intend to build from Git sources rather than a distribution tarball, you will also need Flex (GNU lex) and Bison (GNU yacc). We also recommend making sure you are fairly up-to-date on HP patches. At a minimum, if you are building 64 bit binaries on HP-UX 11.11 you may need PHSS_30966 (11.11) or a successor patch otherwise <command>initdb</command> may hang: <literallayout> PHSS_30966 s700_800 ld(1) and linker tools cumulative patch </literallayout> On general principles you should be current on libc and ld/dld patches, as well as compiler patches if you are using HP's C compiler. See HP's support sites such as <ulink url="http://itrc.hp.com"/> and <ulink url="ftp://us-ffs.external.hp.com/"/> for free copies of their latest patches.
ru: Помимо пакета исходного кода PostgreSQL, вам потребуется GNU make (HP make не подойдёт) и GCC или полный компилятор ANSI C от HP. Если вы намерены выполнить сборку не из дистрибутивного пакета исходного кода, а из Git, вам также потребуется Flex (GNU lex) и Bison (GNU yacc). Мы также рекомендуем убедиться, что у вас установлены довольно свежие исправления HP. Для сборки 64-битного кода в HP-UX 11.11 вам потребуется PHSS_30966 (11.11) или более новое исправление, без него <command>initdb</command> может зависать. Как правило, для сборки нужно иметь текущие исправления libc и ld/dld, а также компилятора (если вы используете компилятор HP). Получить эти исправления бесплатно можно на сайтах поддержки HP <ulink url="http://itrc.hp.com"/> и <ulink url="ftp://us-ffs.external.hp.com/"/>.

source: If you are building on a PA-RISC 2.0 machine and want to have 64-bit binaries using GCC, you must use GCC 64-bit version. GCC binaries for HP-UX PA-RISC and Itanium are available from <ulink url="http://www.hp.com/go/gcc"/>. Don't forget to get and install binutils at the same time.
ru: Если вы проводите сборку на машине PA-RISC 2.0 и хотите получить 64-битный исполняемый код, вы должны использовать 64-битную версию GCC. Скомпилированный GCC для HP-UX PA-RISC и Itanium доступен по адресу <ulink url="http://www.hp.com/go/gcc"/>. Не забудьте также загрузить и установить binutils.

source: If you are building on a PA-RISC 2.0 machine and want the compiled binaries to run on PA-RISC 1.1 machines you will need to specify <option>+DAportable</option> in <envar>CFLAGS</envar>.
ru: Если вы проводите сборку на машине PA-RISC 2.0 и хотите, чтобы скомпилированный код запускался на машинах PA-RISC 1.1, также потребуется указать <option>+DAportable</option> в <envar>CFLAGS</envar>.

source: If you are building on a HP-UX Itanium machine, you will need the latest HP ANSI C compiler with its dependent patch or successor patches: <literallayout> PHSS_30848 s700_800 HP C Compiler (A.05.57) PHSS_30849 s700_800 u2comp/be/plugin library Patch </literallayout>
ru: Если вы проводите сборку на машине HP-UX Itanium, вам потребуется последний компилятор ANSI C от HP с соответствующим исправлением или более новыми: <literallayout> PHSS_30848 s700_800 HP C Compiler (A.05.57) PHSS_30849 s700_800 u2comp/be/plugin library Patch </literallayout>

source: If you have both HP's C compiler and GCC's, then you might want to explicitly select the compiler to use when you run <command>configure</command>: <placeholder-1/> for HP's C compiler, or <placeholder-2/> for GCC. If you omit this setting, then configure will pick <command>gcc</command> if it has a choice.
ru: Если вы используете компилятор HP C и GCC, может потребоваться явно выбрать предпочитаемый компилятор при запуске <command>configure</command>: <placeholder-1/> для использования компилятора C от HP, либо <placeholder-2/> для выбора GCC. При отсутствии явного указания configure выберет <command>gcc</command>, если есть такая возможность.

source: The default install target location is <filename>/usr/local/pgsql</filename>, which you might want to change to something under <filename>/opt</filename>. If so, use the <option>--prefix</option> switch to <command>configure</command>.
ru: По умолчанию целевой каталог установки — <filename>/usr/local/pgsql</filename>, но вы, возможно, захотите его изменить на другой, внутри <filename>/opt</filename>. В этом случае передайте его <command>configure</command> с ключом <option>--prefix</option>.

source: In the regression tests, there might be some low-order-digit differences in the geometry tests, which vary depending on which compiler and math library versions you use. Any other error is cause for suspicion.
ru: В регрессионных тестах возможны отклонения при геометрических проверках, в наименее значащих цифрах, в зависимости от применяемого компилятора и математической библиотеки. Любые другие ошибки заслуживают внимания.

source: MinGW/Native Windows
ru: MinGW/Собственная сборка Windows

source: <primary>MinGW</primary> <secondary>installation on</secondary>
ru: <primary>MinGW</primary> <secondary>установка в</secondary>
