Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/install-windows.po
Languages: ru

source: Installation from Source Code on <productname>Windows</productname>
ru: Установка из исходного кода в <productname>Windows</productname>

source: <primary>installation</primary> <secondary>on Windows</secondary>
ru: <primary>установка</primary> <secondary>в Windows</secondary>

source: It is recommended that most users download the binary distribution for Windows, available as a graphical installer package from the <productname>PostgreSQL</productname> website. Building from source is only intended for people developing <productname>PostgreSQL</productname> or extensions.
ru: Для большинства пользователей рекомендуется просто загрузить дистрибутив для Windows с сайта <productname>PostgreSQL</productname>. Компиляция из исходного кода описана только для разработчиков сервера <productname>PostgreSQL</productname> или его расширений.

source: There are several different ways of building PostgreSQL on <productname>Windows</productname>. The simplest way to build with Microsoft tools is to install <productname>Visual Studio Express 2015 for Windows Desktop</productname> and use the included compiler. It is also possible to build with the full <productname>Microsoft Visual C++ 2005 to 2015</productname>. In some cases that requires the installation of the <productname>Windows SDK</productname> in addition to the compiler.
ru: Существует несколько различных способов сборки PostgreSQL для <productname>Windows</productname>. Самый простой способ сборки с применением инструментов Microsoft — установить <productname>Visual Studio Express 2015 для Windows Desktop</productname> и использовать входящий в её состав компилятор. Также возможна сборка с помощью полной версии <productname>Microsoft Visual C++ 2005-2015</productname>. В некоторых случаях помимо компилятора требуется установить <productname>Windows SDK</productname>.

source: It is also possible to build PostgreSQL using the GNU compiler tools provided by <productname>MinGW</productname>, or using <productname>Cygwin</productname> for older versions of <productname>Windows</productname>.
ru: Также возможно собрать PostgreSQL с помощью средств компиляции GNU, используя среду <productname>MinGW</productname>, либо с помощью <productname>Cygwin</productname> для более старых версий <productname>Windows</productname>.

source: Finally, the client access library (<application>libpq</application>) can be built using <productname>Visual C++ 7.1</productname> or <productname>Borland C++</productname> for compatibility with statically linked applications built using these tools.
ru: Наконец, клиентскую библиотеку (<application>libpq</application>) можно собрать с помощью <productname>Visual C++ 7.1</productname> или <productname>Borland C++</productname> для совместимости со статически компилируемыми приложениями, создаваемыми этими средствами разработки.

source: Building using <productname>MinGW</productname> or <productname>Cygwin</productname> uses the normal build system, see <xref linkend="installation"/> and the specific notes in <xref linkend="installation-notes-mingw"/> and <xref linkend="installation-notes-cygwin"/>. To produce native 64 bit binaries in these environments, use the tools from <productname>MinGW-w64</productname>. These tools can also be used to cross-compile for 32 bit and 64 bit <productname>Windows</productname> targets on other hosts, such as <productname>Linux</productname> and <productname>Darwin</productname>. <productname>Cygwin</productname> is not recommended for running a production server, and it should only be used for running on older versions of <productname>Windows</productname> where the native build does not work, such as <productname>Windows 98</productname>. The official binaries are built using <productname>Visual Studio</productname>.
ru: При компиляции с помощью <productname>MinGW</productname> или <productname>Cygwin</productname> сборка производится как обычно, см. <xref remap="4" linkend="installation"/> и дополнительные замечания в <xref remap="6" linkend="installation-notes-mingw"/> и <xref remap="6" linkend="installation-notes-cygwin"/>. Чтобы получить в этих окружениях &laquo;родные&raquo; 64-битные двоичные файлы, используйте инструменты из <productname>MinGW-w64</productname>. Данные инструменты также могут быть использованы для кросс-компиляции для 32- и 64-битной <productname>Windows</productname> в других системах, например в <productname>Linux</productname> и <productname>Darwin</productname>. <productname>Cygwin</productname> не рекомендуется применять в производственной среде, его следует использовать только для запуска в старых версиях <productname>Windows</productname>, где &laquo;родная&raquo; сборка невозможна, таких как <productname>Windows 98</productname>. Официальные двоичные файлы собираются с использованием <productname>Visual Studio</productname>.

source: Native builds of <application>psql</application> don't support command line editing. The <productname>Cygwin</productname> build does support command line editing, so it should be used where psql is needed for interactive use on <productname>Windows</productname>.
ru: &laquo;Родные&raquo; сборки <application>psql</application> не поддерживают редактирование командной строки. Однако сборка в <productname>Cygwin</productname> это поддерживает, так что следует выбрать её, когда необходимо интерактивно использовать psql в <productname>Windows</productname>.

source: Building with <productname>Visual C++</productname> or the <productname>Microsoft Windows SDK</productname>
ru: Сборка с помощью <productname>Visual C++</productname> или <productname>Microsoft Windows SDK</productname>

source: PostgreSQL can be built using the Visual C++ compiler suite from Microsoft. These compilers can be either from <productname>Visual Studio</productname>, <productname>Visual Studio Express</productname> or some versions of the <productname>Microsoft Windows SDK</productname>. If you do not already have a <productname>Visual Studio</productname> environment set up, the easiest ways are to use the compilers from <productname>Visual Studio Express 2015 for Windows Desktop</productname> or those in the <productname>Windows SDK 7.1</productname>, which are both free downloads from Microsoft.
ru: PostgreSQL может быть собран с помощью компилятора Visual C++ от Microsoft. Этот компилятор есть в пакетах <productname>Visual Studio</productname>, <productname>Visual Studio Express</productname> или в некоторых версиях <productname>Microsoft Windows SDK</productname>. Если у вас ещё не установлена среда <productname>Visual Studio</productname>, проще всего будет использовать компиляторы из <productname>Visual Studio Express 2015 для Windows Desktop</productname> или из <productname>Windows SDK 7.1</productname>, которые Microsoft распространяет бесплатно.

source: Both 32-bit and 64-bit builds are possible with the Microsoft Compiler suite. 32-bit PostgreSQL builds are possible with <productname>Visual Studio 2005</productname> to <productname>Visual Studio 2015</productname> (including Express editions), as well as standalone Windows SDK releases 6.0 to 7.1. 64-bit PostgreSQL builds are supported with <productname>Microsoft Windows SDK</productname> version 6.0a to 7.1 or <productname>Visual Studio 2008</productname> and above. Compilation is supported down to <productname>Windows XP</productname> and <productname>Windows Server 2003</productname> when building with <productname>Visual Studio 2005</productname> to <productname>Visual Studio 2013</productname>. Building with <productname>Visual Studio 2015</productname> is supported down to <productname>Windows Vista</productname> and <productname>Windows Server 2008</productname>.
ru: С пакетом компиляторов Microsoft можно получить как 32-, так и 64-битные сборки. 32-битные сборки можно произвести, используя выпуски <productname>Visual Studio 2005</productname> — <productname>Visual Studio 2015</productname> (включая редакции Express), а также отдельные выпуски Windows SDK версии с 6.0 по 7.1. 64-битные сборки PostgreSQL поддерживаются с <productname>Microsoft Windows SDK</productname> версий 6.0a — 7.1 или <productname>Visual Studio 2008</productname> и новее. При сборке с <productname>Visual Studio 2005</productname> — <productname>Visual Studio 2013</productname> поддерживается компиляция для систем вплоть до <productname>Windows XP</productname> и <productname>Windows Server 2003</productname>. При сборке с <productname>Visual Studio 2015</productname> в качестве целевых поддерживаются системы, начиная с <productname>Windows Vista</productname> и <productname>Windows Server 2008</productname>.

source: The tools for building using <productname>Visual C++</productname> or <productname>Platform SDK</productname> are in the <filename>src/tools/msvc</filename> directory. When building, make sure there are no tools from <productname>MinGW</productname> or <productname>Cygwin</productname> present in your system PATH. Also, make sure you have all the required Visual C++ tools available in the PATH. In <productname>Visual Studio</productname>, start the <application>Visual Studio Command Prompt</application>. If you wish to build a 64-bit version, you must use the 64-bit version of the command, and vice versa. In the <productname>Microsoft Windows SDK</productname>, start the <application>CMD shell</application> listed under the SDK on the Start Menu. In recent SDK versions you can change the targeted CPU architecture, build type, and target OS by using the <command>setenv</command> command, e.g. <command>setenv /x86 /release /xp</command> to target Windows XP or later with a 32-bit release build. See <command>/?</command> for other options to <command>setenv</command>. All commands should be run from the <filename>src\tools\msvc</filename> directory.
ru: Инструменты для компиляции с помощью <productname>Visual C++</productname> или <productname>Platform SDK</productname> находятся в каталоге <filename>src/tools/msvc</filename>. При сборке убедитесь, что в системном пути PATH не подключаются инструменты из набора <productname>MinGW</productname> или <productname>Cygwin</productname>. Также убедитесь, что в пути PATH указаны каталоги всех необходимых инструментов Visual C++. Если вы используете <productname>Visual Studio</productname>, запустите <application>Visual Studio Command Prompt</application>. Если вы хотите собрать 64-битную версию, вы должны выбрать 64-битную версию данной оболочки, и наоборот. Если вы используете <productname>Microsoft Windows SDK</productname>, запустите через стартовое меню, подменю SDK оболочку <application>CMD shell</application>. В последних версиях SDK можно изменить целевую архитектуру процессора, вариант сборки и целевую ОС с помощью команды <command>setenv</command>, например после <command>setenv /x86 /release /xp</command> будет получена выпускаемая 32-битная сборка для Windows XP. О других параметрах <command>setenv</command> можно узнать с ключом <command>/?</command>. Все команды должны запускаться из каталога <filename>src\tools\msvc</filename>.

source: Before you build, you may need to edit the file <filename>config.pl</filename> to reflect any configuration options you want to change, or the paths to any third party libraries to use. The complete configuration is determined by first reading and parsing the file <filename>config_default.pl</filename>, and then apply any changes from <filename>config.pl</filename>. For example, to specify the location of your <productname>Python</productname> installation, put the following in <filename>config.pl</filename>: <placeholder-1/> You only need to specify those parameters that are different from what's in <filename>config_default.pl</filename>.
ru: До начала сборки может потребоваться отредактировать файл <filename>config.pl</filename> и изменить в нём желаемые параметры конфигурации или пути к сторонним библиотекам, которые будут использоваться. Для получения конфигурации сначала считывается и разбирается файл <filename>config_default.pl</filename>, а затем применяются все изменения из <filename>config.pl</filename>. Например, чтобы указать, куда установлен <productname>Python</productname>, следует добавить в <filename>config.pl</filename>: <placeholder-1/> Вам нужно задать только те параметры, которые отличаются от заданных в <filename>config_default.pl</filename>.

source: If you need to set any other environment variables, create a file called <filename>buildenv.pl</filename> and put the required commands there. For example, to add the path for bison when it's not in the PATH, create a file containing: <placeholder-1/>
ru: Если вам необходимо установить какие-либо другие переменные окружения, создайте файл с именем <filename>buildenv.pl</filename> и поместите в него требуемые команды. Например, чтобы добавить путь к bison, которого нет в PATH, создайте файл следующего содержания: <placeholder-1/>

source: Requirements
ru: Требования

source: If your build environment doesn't ship with a supported version of the <productname>Microsoft Windows SDK</productname> it is recommended that you upgrade to the latest version (currently version 7.1), available for download from <ulink url="https://www.microsoft.com/download"/>.
ru: Если с вашим инструментарием для разработки не поставляется поддерживаемая версия <productname>Microsoft Windows SDK</productname>, рекомендуется установить последнюю версию SDK (в настоящее время 7.1), которую можно загрузить с <ulink url="https://www.microsoft.com/download/"/>.

source: You must always include the <application>Windows Headers and Libraries</application> part of the SDK. If you install a <productname>Windows SDK</productname> including the <application>Visual C++ Compilers</application>, you don't need <productname>Visual Studio</productname> to build. Note that as of Version 8.0a the Windows SDK no longer ships with a complete command-line build environment.
ru: Устанавливая SDK, вы всегда должны выбирать для установки пункт <application>Windows Headers and Libraries</application> (Заголовочные файлы и библиотеки Windows). Если вы установили <productname>Windows SDK</productname>, включая <application>Visual C++ Compilers</application>, <productname>Visual Studio</productname> для сборки вам не нужна. Обратите внимание, что с версии 8.0a в SDK для Windows не включается полное окружение для сборки в командной строке.

source: The following additional products are required to build <productname>PostgreSQL</productname>. Use the <filename>config.pl</filename> file to specify which directories the libraries are available in. <placeholder-1/>
ru: Для сборки <productname>PostgreSQL</productname> требуется следующее дополнительное ПО. Укажите каталоги, в которых находятся соответствующие библиотеки, в файле конфигурации <filename>config.pl</filename>. <placeholder-1/>

source: Required for building <application>PL/TCL</application> (Note: version 8.4 is required, the free Standard Distribution is sufficient).
ru: Требуется для компиляции <application>PL/TCL</application> (Заметьте, что требуется версия 8.4 или выше, при этом достаточно бесплатного стандартного дистрибутива (Standard Distribution).

source: <productname>Bison</productname> and <productname>Flex</productname>
ru: <productname>Bison</productname> и <productname>Flex</productname>

source: <productname>Bison</productname> and <productname>Flex</productname> are required to build from Git, but not required when building from a release file. Only <productname>Bison</productname> 1.875 or versions 2.2 and later will work. <productname>Flex</productname> must be version 2.5.31 or later.
ru: Для компиляции из Git требуются <productname>Bison</productname> и <productname>Flex</productname>, хотя они не нужны для компиляции из дистрибутивного пакета исходного кода. <productname>Bison</productname> должен быть версии 1.875 или 2.2, либо новее, а <productname>Flex</productname> — версии 2.5.31 или новее.

source: Both <productname>Bison</productname> and <productname>Flex</productname> are included in the <productname>msys</productname> tool suite, available from <ulink url="http://www.mingw.org/wiki/MSYS"/> as part of the <productname>MinGW</productname> compiler suite.
ru: И <productname>Bison</productname>, и <productname>Flex</productname> входят в комплект утилит <productname>msys</productname>, который можно загрузить с <ulink url="http://www.mingw.org/wiki/MSYS"/> в качестве компонента набора <productname>MinGW</productname>.

source: You will need to add the directory containing <filename>flex.exe</filename> and <filename>bison.exe</filename> to the PATH environment variable in <filename>buildenv.pl</filename> unless they are already in PATH. In the case of MinGW, the directory is the <filename>\msys\1.0\bin</filename> subdirectory of your MinGW installation directory.
ru: Вам потребуется добавить каталог, содержащий <filename>flex.exe</filename> и <filename>bison.exe</filename>, в путь, задаваемый переменной PATH, в <filename>buildenv.pl</filename>, если она его ещё не включает. В случае с MinGW, это будет подкаталог <filename>\msys\1.0\bin</filename> в каталоге вашей инсталляции MinGW.

source: The Bison distribution from GnuWin32 appears to have a bug that causes Bison to malfunction when installed in a directory with spaces in the name, such as the default location on English installations <filename>C:\Program Files\GnuWin32</filename>. Consider installing into <filename>C:\GnuWin32</filename> or use the NTFS short name path to GnuWin32 in your PATH environment setting (e.g. <filename>C:\PROGRA~1\GnuWin32</filename>).
ru: Bison, поставляемый в составе GnuWin32, может работать некорректно, когда он установлен в каталог с именем, содержащим пробелы, например, <filename>C:\Program Files\GnuWin32</filename> (целевой каталог по умолчанию в англоязычной системе). В таком случае, возможно, стоит установить его в <filename>C:\GnuWin32</filename> или задать в переменной окружения PATH короткий путь NTFS к GnuWin32 (например, <filename>C:\PROGRA~1\GnuWin32</filename>).

source: The obsolete <literal>winflex</literal> binaries distributed on the PostgreSQL FTP site and referenced in older documentation will fail with <quote>flex: fatal internal error, exec failed</quote> on 64-bit Windows hosts. Use Flex from MSYS instead.
ru: Старые программы <literal>winflex</literal>, которые раньше размещались на FTP-сайте PostgreSQL и упоминались в старой документации, не будут работать в 64-битной Windows, выдавая ошибку <quote>flex: fatal internal error, exec failed</quote>. Используйте Flex из набора MSYS.

source: Diff is required to run the regression tests, and can be downloaded from <ulink url="http://gnuwin32.sourceforge.net"/>.
ru: Diff требуется для запуска регрессионных тестов, его можно загрузить с <ulink url="http://gnuwin32.sourceforge.net"/>.

source: Gettext is required to build with NLS support, and can be downloaded from <ulink url="http://gnuwin32.sourceforge.net"/>. Note that binaries, dependencies and developer files are all needed.
ru: Gettext требуется для сборки с поддержкой NLS, его можно загрузить с <ulink url="http://gnuwin32.sourceforge.net"/>. Заметьте, что для сборки потребуются и исполняемые файлы, и зависимости, и файлы для разработки.

source: Required for GSSAPI authentication support. MIT Kerberos can be downloaded from <ulink url="http://web.mit.edu/Kerberos/dist/index.html"/>.
ru: Требуется для поддержки проверки подлинности GSSAPI. MIT Kerberos можно загрузить с <ulink url="http://web.mit.edu/Kerberos/dist/index.html"/>.

source: <productname>libxml2</productname> and <productname>libxslt</productname>
ru: <productname>libxml2</productname> и <productname>libxslt</productname>

source: Required for XML support. Binaries can be downloaded from <ulink url="http://zlatkovic.com/pub/libxml"/> or source from <ulink url="http://xmlsoft.org"/>. Note that libxml2 requires iconv, which is available from the same download location.
ru: Требуется для поддержки XML. Двоичный пакет можно загрузить с <ulink url="http://zlatkovic.com/pub/libxml"/>, а исходный код с <ulink url="http://xmlsoft.org"/>. Учтите, что для libxml2 требуется iconv, который можно загрузить там же.

source: Required for SSL support. Binaries can be downloaded from <ulink url="http://www.slproweb.com/products/Win32OpenSSL.html"/> or source from <ulink url="http://www.openssl.org"/>.
ru: Требуется для поддержки SSL. Двоичные пакеты можно загрузить с <ulink url="http://www.slproweb.com/products/Win32OpenSSL.html"/>, а исходный код с <ulink url="http://www.openssl.org"/>.

source: Required for UUID-OSSP support (contrib only). Source can be downloaded from <ulink url="http://www.ossp.org/pkg/lib/uuid/"/>.
ru: Требуется для поддержки UUID-OSSP (только для contrib). Исходный код можно загрузить с <ulink url="http://www.ossp.org/pkg/lib/uuid/"/>.

source: Required for building <application>PL/Python</application>. Binaries can be downloaded from <ulink url="http://www.python.org"/>.
ru: Требуется для сборки <application>PL/Python</application>. Двоичные пакеты можно загрузить с <ulink url="http://www.python.org"/>.

source: Required for compression support in <application>pg_dump</application> and <application>pg_restore</application>. Binaries can be downloaded from <ulink url="http://www.zlib.net"/>.
ru: Требуется для поддержки сжатия в <application>pg_dump</application> и <application>pg_restore</application>. Двоичные пакеты можно загрузить с <ulink url="http://www.zlib.net"/>.

source: The following additional products are not required to get started, but are required to build the complete package. Use the <filename>config.pl</filename> file to specify which directories the libraries are available in. <placeholder-1/>
ru: Следующее дополнительное ПО не требуется для базовой сборки, но требуется для сборки полного пакета. Укажите каталоги, в которых находятся соответствующие библиотеки, в файле конфигурации <filename>config.pl</filename>. <placeholder-1/>

source: Special Considerations for 64-bit Windows
ru: Специальные замечания для 64-битной Windows

source: PostgreSQL will only build for the x64 architecture on 64-bit Windows, there is no support for Itanium processors.
ru: PostgreSQL для архитектуры x64 можно собрать только в 64-битной Windows, процессоры Itanium не поддерживаются.

source: Mixing 32- and 64-bit versions in the same build tree is not supported. The build system will automatically detect if it's running in a 32- or 64-bit environment, and build PostgreSQL accordingly. For this reason, it is important to start the correct command prompt before building.
ru: Совместная сборка 32- и 64-битных версий в одном дереве не поддерживается. Система сборки автоматически определит, в каком окружении (32- или 64-битном) она запущена, и соберёт соответствующий вариант PostgreSQL. Поэтому перед сборкой важно запустить требуемую версию командного интерпретатора.

source: To use a server-side third party library such as <productname>python</productname> or <productname>openssl</productname>, this library <emphasis>must</emphasis> also be 64-bit. There is no support for loading a 32-bit library in a 64-bit server. Several of the third party libraries that PostgreSQL supports may only be available in 32-bit versions, in which case they cannot be used with 64-bit PostgreSQL.
ru: Для использования на стороне сервера сторонних библиотек, таких как <productname>python</productname> или <productname>openssl</productname>, эти библиотеки также <emphasis>должны быть</emphasis> 64-битными. 64-битный сервер не поддерживает загрузку 32-битных библиотек. Некоторые библиотеки сторонних разработчиков, предназначенные для PostgreSQL, могут быть доступны только в 32-битных версиях и в таком случае их нельзя будет использовать с 64-битной версией PostgreSQL.

source: Building
ru: Сборка
