Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/installation.po
Languages: ru

source: The first step of the installation procedure is to configure the source tree for your system and choose the options you would like. This is done by running the <filename>configure</filename> script. For a default installation simply enter: <screen> <userinput>./configure</userinput> </screen> This script will run a number of tests to determine values for various system dependent variables and detect any quirks of your operating system, and finally will create several files in the build tree to record what it found. You can also run <filename>configure</filename> in a directory outside the source tree, if you want to keep the build directory separate. This procedure is also called a <placeholder-1/><firstterm>VPATH</firstterm> build. Here's how: <screen> <userinput>mkdir build_dir</userinput> <userinput>cd build_dir</userinput> <userinput>/path/to/source/tree/configure [options go here]</userinput> <userinput>make</userinput> </screen>
ru: На первом шаге установки требуется сконфигурировать дерево установки для вашей системы и выбрать желаемые параметры сборки. Для этого нужно запустить скрипт <filename>configure</filename>. Чтобы выполнить стандартную сборку, просто введите: <screen> <userinput>./configure</userinput> </screen> Этот скрипт проведёт несколько проверок с целью определить значения для различных переменных, зависящих от системы, и выявить любые странности вашей ОС, а затем создаст несколько файлов в дереве сборки, в которых отразит полученные результаты. Вы также можете выполнить <filename>configure</filename> вне дерева исходного кода, если хотите сохранить каталог сборки отдельно. Эта процедура также называется сборкой с <placeholder-1/><firstterm>VPATH</firstterm>. Выполняется она так: <screen> <userinput>mkdir build_dir</userinput> <userinput>cd build_dir</userinput> <userinput>/путь/к/каталогу/исходного/кода/configure [параметры]</userinput> <userinput>make</userinput> </screen>

source: The default configuration will build the server and utilities, as well as all client applications and interfaces that require only a C compiler. All files will be installed under <filename>/usr/local/pgsql</filename> by default.
ru: В стандартной конфигурации собираются сервер и утилиты, а также клиентские приложения и интерфейсы, которым требуется только компилятор C. Все файлы по умолчанию устанавливаются в <filename>/usr/local/pgsql</filename>.

source: PREFIX
ru: ПРЕФИКС

source: Install all files under the directory <replaceable>PREFIX</replaceable> instead of <filename>/usr/local/pgsql</filename>. The actual files will be installed into various subdirectories; no files will ever be installed directly into the <replaceable>PREFIX</replaceable> directory.
ru: Разместить все файлы внутри каталога <replaceable>ПРЕФИКС</replaceable>, а не в <filename>/usr/local/pgsql</filename>. Собственно файлы будут установлены в различные подкаталоги этого каталога; в самом каталоге <replaceable>ПРЕФИКС</replaceable> никакие файлы не размещаются.

source: If you have special needs, you can also customize the individual subdirectories with the following options. However, if you leave these with their defaults, the installation will be relocatable, meaning you can move the directory after installation. (The <literal>man</literal> and <literal>doc</literal> locations are not affected by this.)
ru: Если у вас есть особые требования, вы также можете изменить отдельные подкаталоги, определив следующие параметры. Однако, если вы оставите для них значения по умолчанию, инсталляция будет перемещаемой, то есть вы сможете переместить каталог после установки. (Это не распространяется на каталоги <literal>man</literal> и <literal>doc</literal>.)

source: For relocatable installs, you might want to use <filename>configure</filename>'s <literal>--disable-rpath</literal> option. Also, you will need to tell the operating system how to find the shared libraries.
ru: Для перемещаемых инсталляций можно передать <filename>configure</filename> указание <literal>--disable-rpath</literal>. Кроме того, вы должны будете сказать операционной системе, как найти разделяемые библиотеки.

source: EXEC-PREFIX
ru: ИСП-ПРЕФИКС

source: You can install architecture-dependent files under a different prefix, <replaceable>EXEC-PREFIX</replaceable>, than what <replaceable>PREFIX</replaceable> was set to. This can be useful to share architecture-independent files between hosts. If you omit this, then <replaceable>EXEC-PREFIX</replaceable> is set equal to <replaceable>PREFIX</replaceable> and both architecture-dependent and independent files will be installed under the same tree, which is probably what you want.
ru: Вы можете установить архитектурно-зависимые файлы в размещение с другим префиксом, <replaceable>ИСП-ПРЕФИКС</replaceable>, отличным от <replaceable>ПРЕФИКС</replaceable>. Это бывает полезно для совместного использования таких файлов несколькими системами. По умолчанию <replaceable>ИСП-ПРЕФИКС</replaceable> считается равным <replaceable>ПРЕФИКС</replaceable> и все файлы, архитектурно-зависимые и независимые, устанавливаются в одно дерево каталогов, что вам скорее всего и нужно.

source: DIRECTORY
ru: КАТАЛОГ

source: Specifies the directory for executable programs. The default is <filename><replaceable>EXEC-PREFIX</replaceable>/bin</filename>, which normally means <filename>/usr/local/pgsql/bin</filename>.
ru: Задаёт каталог для исполняемых двоичных программ. По умолчанию это <filename><replaceable>ИСП-ПРЕФИКС</replaceable>/bin</filename>, что обычно означает <filename>/usr/local/pgsql/bin</filename>.

source: Sets the directory for various configuration files, <filename><replaceable>PREFIX</replaceable>/etc</filename> by default.
ru: Задаёт каталог для различных файлов конфигурации, <filename><replaceable>ПРЕФИКС</replaceable>/etc</filename> по умолчанию.

source: Sets the location to install libraries and dynamically loadable modules. The default is <filename><replaceable>EXEC-PREFIX</replaceable>/lib</filename>.
ru: Задаёт каталог для установки библиотек и динамически загружаемых модулей. Значение по умолчанию — <filename><replaceable>ИСП-ПРЕФИКС</replaceable>/lib</filename>.

source: Sets the directory for installing C and C++ header files. The default is <filename><replaceable>PREFIX</replaceable>/include</filename>.
ru: Задаёт каталог для установки заголовочных файлов C и C++. Значение по умолчанию — <filename><replaceable>ПРЕФИКС</replaceable>/include</filename>.

source: Sets the root directory for various types of read-only data files. This only sets the default for some of the following options. The default is <filename><replaceable>PREFIX</replaceable>/share</filename>.
ru: Задаёт корневой каталог для разного рода статических файлов. Этот параметр определяет только базу для некоторых из следующих параметров. Значение по умолчанию — <filename><replaceable>ПРЕФИКС</replaceable>/share</filename>.

source: Sets the directory for read-only data files used by the installed programs. The default is <filename><replaceable>DATAROOTDIR</replaceable></filename>. Note that this has nothing to do with where your database files will be placed.
ru: Задаёт каталог для статических файлов данных, используемых установленными программами. Значение по умолчанию — <filename><replaceable>DATAROOTDIR</replaceable></filename>. Заметьте, что это совсем не тот каталог, в котором будут размещены файлы базы данных.

source: Sets the directory for installing locale data, in particular message translation catalog files. The default is <filename><replaceable>DATAROOTDIR</replaceable>/locale</filename>.
ru: Задаёт каталог для установки данных локализации, в частности, каталогов перевода сообщений. Значение по умолчанию — <filename><replaceable>DATAROOTDIR</replaceable>/locale</filename>.

source: The man pages that come with <productname>PostgreSQL</productname> will be installed under this directory, in their respective <filename>man<replaceable>x</replaceable></filename> subdirectories. The default is <filename><replaceable>DATAROOTDIR</replaceable>/man</filename>.
ru: Страницы man, поставляемые в составе <productname>PostgreSQL</productname>, будут установлены в этот каталог, в соответствующие подкаталоги <filename>man<replaceable>x</replaceable></filename>. Значение по умолчанию — <filename><replaceable>DATAROOTDIR</replaceable>/man</filename>.

source: Sets the root directory for installing documentation files, except <quote>man</quote> pages. This only sets the default for the following options. The default value for this option is <filename><replaceable>DATAROOTDIR</replaceable>/doc/postgresql</filename>.
ru: Задаёт корневой каталог для установки файлов документации, кроме страниц <quote>man</quote>. Этот параметр только определяет базу для следующих параметров. Значение по умолчанию — <filename><replaceable>DATAROOTDIR</replaceable>/doc/postgresql</filename>.

source: The HTML-formatted documentation for <productname>PostgreSQL</productname> will be installed under this directory. The default is <filename><replaceable>DATAROOTDIR</replaceable></filename>.
ru: В этот каталог будет помещена документация <productname>PostgreSQL</productname> в формате HTML. Значение по умолчанию — <filename><replaceable>DATAROOTDIR</replaceable></filename>.

source: Care has been taken to make it possible to install <productname>PostgreSQL</productname> into shared installation locations (such as <filename>/usr/local/include</filename>) without interfering with the namespace of the rest of the system. First, the string <quote><literal>/postgresql</literal></quote> is automatically appended to <varname>datadir</varname>, <varname>sysconfdir</varname>, and <varname>docdir</varname>, unless the fully expanded directory name already contains the string <quote><literal>postgres</literal></quote> or <quote><literal>pgsql</literal></quote>. For example, if you choose <filename>/usr/local</filename> as prefix, the documentation will be installed in <filename>/usr/local/doc/postgresql</filename>, but if the prefix is <filename>/opt/postgres</filename>, then it will be in <filename>/opt/postgres/doc</filename>. The public C header files of the client interfaces are installed into <varname>includedir</varname> and are namespace-clean. The internal header files and the server header files are installed into private directories under <varname>includedir</varname>. See the documentation of each interface for information about how to access its header files. Finally, a private subdirectory will also be created, if appropriate, under <varname>libdir</varname> for dynamically loadable modules.
ru: Чтобы <productname>PostgreSQL</productname> можно было установить в стандартные системные размещения (например, в <filename>/usr/local/include</filename>), не затрагивая пространство имён остальной системы, приняты определённые меры. Во-первых, к путям <varname>datadir</varname>, <varname>sysconfdir</varname> и <varname>docdir</varname> автоматически добавляется строка <quote><literal>/postgresql</literal></quote>, если только полный развёрнутый путь каталога уже не содержит строку <quote><literal>postgres</literal></quote> или <quote><literal>pgsql</literal></quote>. Так, если вы выберете в качестве префикса <filename>/usr/local</filename>, документация будет установлена в <filename>/usr/local/doc/postgresql</filename>, но с префиксом <filename>/opt/postgres</filename> она будет помещена в <filename>/opt/postgres/doc</filename>. Внешние заголовочные файлы C для клиентских интерфейсов устанавливаются в <varname>includedir</varname>, не загрязняя пространство имён. Внутренние и серверные заголовочные файлы устанавливаются в частные подкаталоги внутри <varname>includedir</varname>. Чтобы узнать, как обращаться к заголовочным файлам того или иного интерфейса, обратитесь к документации этого интерфейса. Наконец, для динамически загружаемых модулей, если требуется, будет также создан частный подкаталог внутри <varname>libdir</varname>.

source: You can customize the build and installation process by supplying one or more of the following command line options to <filename>configure</filename>: <placeholder-1/> <placeholder-2/>
ru: Вы можете настроить процесс сборки и установки, передав <filename>configure</filename> один или несколько следующих параметров командной строки: <placeholder-1/> <placeholder-2/>

source: STRING
ru: СТРОКА

source: Append <replaceable>STRING</replaceable> to the PostgreSQL version number. You can use this, for example, to mark binaries built from unreleased Git snapshots or containing custom patches with an extra version string such as a <command>git describe</command> identifier or a distribution package release number.
ru: Заданная <replaceable>СТРОКА</replaceable> добавляется к номеру версии PostgreSQL. Это можно использовать, например, чтобы двоичные файлы, собранные из промежуточных снимков Git или кода с дополнительными правками, отличались от стандартных дополнительной строкой в версии, например, содержащей идентификатор <command>git describe</command> или номер выпуска дистрибутивного пакета.

source: DIRECTORIES
ru: КАТАЛОГИ

source: <replaceable>DIRECTORIES</replaceable> is a colon-separated list of directories that will be added to the list the compiler searches for header files. If you have optional packages (such as GNU <application>Readline</application>) installed in a non-standard location, you have to use this option and probably also the corresponding <option>--with-libraries</option> option.
ru: Значение <replaceable>КАТАЛОГИ</replaceable> представляет список каталогов через двоеточие, которые будут просмотрены компилятором при поиске заголовочных файлов. Если дополнительные пакеты (например, GNU <application>Readline</application>) установлены у вас в нестандартное расположение, вам придётся использовать этот параметр и, возможно, также добавить соответствующий параметр <option>--with-libraries</option>.

source: Example: <literal>--with-includes=/opt/gnu/include:/usr/sup/include</literal>.
ru: Пример: <literal>--with-includes=/opt/gnu/include:/usr/sup/include</literal>.

source: <replaceable>DIRECTORIES</replaceable> is a colon-separated list of directories to search for libraries. You will probably have to use this option (and the corresponding <option>--with-includes</option> option) if you have packages installed in non-standard locations.
ru: Значение <replaceable>КАТАЛОГИ</replaceable> представляет список каталогов через двоеточие, в котором следует искать библиотеки. Возможно, вам потребуется использовать этот параметр (и соответствующий <option>--with-includes</option>), если какие-то пакеты установлены у вас в нестандартное размещение.

source: Example: <literal>--with-libraries=/opt/gnu/lib:/usr/sup/lib</literal>.
ru: Пример: <literal>--with-libraries=/opt/gnu/lib:/usr/sup/lib</literal>.

source: LANGUAGES
ru: ЯЗЫКИ

source: Enables Native Language Support (<acronym>NLS</acronym>), that is, the ability to display a program's messages in a language other than English. <replaceable>LANGUAGES</replaceable> is an optional space-separated list of codes of the languages that you want supported, for example <literal>--enable-nls='de fr'</literal>. (The intersection between your list and the set of actually provided translations will be computed automatically.) If you do not specify a list, then all available translations are installed.
ru: Включает поддержку национальных языков (<acronym>NLS</acronym>, Native Language Support), то есть возможность выводить сообщения программы не только на английском языке. Значение <replaceable>ЯЗЫКИ</replaceable> представляет необязательный список кодов языков через пробел, поддержка которых вам нужна, например: <literal>--enable-nls='de fr ru'</literal>. (Пересечение заданного вами списка и множества действительно доступных переводов будет вычислено автоматически.) Если список не задаётся, устанавливаются все доступные переводы.

source: To use this option, you will need an implementation of the <application>Gettext</application> API; see above.
ru: Для использования этой возможности вам потребуется реализация API <application>Gettext</application>; см. выше.

source: NUMBER
ru: НОМЕР

source: Set <replaceable>NUMBER</replaceable> as the default port number for server and clients. The default is 5432. The port can always be changed later on, but if you specify it here then both server and clients will have the same default compiled in, which can be very convenient. Usually the only good reason to select a non-default value is if you intend to run multiple <productname>PostgreSQL</productname> servers on the same machine.
ru: Задаёт <replaceable>НОМЕР</replaceable> порта по умолчанию для сервера и клиентов. Стандартное значение — 5432. Этот порт всегда можно изменить позже, но если вы укажете другой номер здесь, и сервер, и клиенты будут скомпилированы с одним значением, что очень удобно. Обычно менять это значение имеет смысл, только если вы намерены запускать в одной системе несколько серверов <productname>PostgreSQL</productname>.

source: Build the <application>PL/Perl</application> server-side language.
ru: Включает поддержку языка <application>PL/Perl</application> на стороне сервера.

source: Build the <application>PL/Python</application> server-side language.
ru: Включает поддержку языка <application>PL/Python</application> на стороне сервера.

source: Build the <application>PL/Tcl</application> server-side language.
ru: Включает поддержку языка <application>PL/Tcl</application> на стороне сервера.

source: Tcl installs the file <filename>tclConfig.sh</filename>, which contains configuration information needed to build modules interfacing to Tcl. This file is normally found automatically at a well-known location, but if you want to use a different version of Tcl you can specify the directory in which to look for it.
ru: Tcl устанавливает файл <filename>tclConfig.sh</filename>, содержащий конфигурационные данные, необходимые для сборки модулей, взаимодействующих с Tcl. Этот файл обычно находится автоматически в известном размещении, но если вы хотите использовать другую версию Tcl, вы должны указать каталог, где искать этот файл.

source: Build with support for GSSAPI authentication. On many systems, the GSSAPI (usually a part of the Kerberos installation) system is not installed in a location that is searched by default (e.g., <filename>/usr/include</filename>, <filename>/usr/lib</filename>), so you must use the options <option>--with-includes</option> and <option>--with-libraries</option> in addition to this option. <filename>configure</filename> will check for the required header files and libraries to make sure that your GSSAPI installation is sufficient before proceeding.
ru: Включает поддержку аутентификации GSSAPI. На многих платформах подсистема GSSAPI (обычно входящая в состав Kerberos) устанавливается не в то размещение, которое просматривается по умолчанию (например, <filename>/usr/include</filename>, <filename>/usr/lib</filename>), так что помимо этого параметра вам придётся задать параметры <option>--with-includes</option> и <option>--with-libraries</option>. Скрипт <filename>configure</filename> проверит наличие необходимых заголовочных файлов и библиотек, чтобы убедиться в целостности инсталляции GSSAPI, прежде чем продолжить.

source: NAME
ru: ИМЯ

source: The default name of the Kerberos service principal used by GSSAPI. <literal>postgres</literal> is the default. There's usually no reason to change this unless you have a Windows environment, in which case it must be set to upper case <literal>POSTGRES</literal>.
ru: Задаёт имя по умолчанию для субъекта-службы Kerberos, используемое GSSAPI (по умолчанию это <literal>postgres</literal>). Обычно менять его имеет смысл только в среде Windows, где оно должно быть задано в верхнем регистре (<literal>POSTGRES</literal>).

source: Build with support for <acronym>SSL</acronym> (encrypted) connections. This requires the <productname>OpenSSL</productname> package to be installed. <filename>configure</filename> will check for the required header files and libraries to make sure that your <productname>OpenSSL</productname> installation is sufficient before proceeding.
ru: Включает поддержку соединений <acronym>SSL</acronym> (зашифрованных). Для этого необходимо установить пакет <productname>OpenSSL</productname>. Скрипт <filename>configure</filename> проверит наличие необходимых заголовочных файлов и библиотек, чтобы убедиться в целостности инсталляции <productname>OpenSSL</productname>, прежде чем продолжить.

source: Build with <acronym>PAM</acronym><placeholder-1/> (Pluggable Authentication Modules) support.
ru: Включает поддержку <acronym>PAM</acronym><placeholder-1/> (Pluggable Authentication Modules, подключаемых модулей аутентификации).

source: Build with BSD Authentication support. (The BSD Authentication framework is currently only available on OpenBSD.)
ru: Включает поддержку аутентификации BSD. (Инфраструктура аутентификации BSD в настоящее время доступна только в OpenBSD.)

source: Build with <acronym>LDAP</acronym><placeholder-1/> support for authentication and connection parameter lookup (see <phrase condition="standalone">the documentation about client authentication and libpq</phrase><phrase condition="default"><xref linkend="libpq-ldap"/> and <xref linkend="auth-ldap"/></phrase> for more information). On Unix, this requires the <productname>OpenLDAP</productname> package to be installed. On Windows, the default <productname>WinLDAP</productname> library is used. <filename>configure</filename> will check for the required header files and libraries to make sure that your <productname>OpenLDAP</productname> installation is sufficient before proceeding.
ru: Включает поддержку <acronym>LDAP</acronym><placeholder-1/> для проверки подлинности и получения параметров соединения (за дополнительными сведениями обратитесь к <phrase condition="standalone">описанию проверки подлинности клиентов с libpq</phrase><phrase condition="default"><xref remap="3" linkend="libpq-ldap"/> и <xref remap="3" linkend="auth-ldap"/></phrase>). В Unix для этого нужно установить пакет <productname>OpenLDAP</productname>. В Windows используется стандартная библиотека <productname>WinLDAP</productname>. Скрипт <filename>configure</filename> проверит наличие необходимых заголовочных файлов и библиотек, чтобы убедиться в целостности инсталляции <productname>OpenLDAP</productname>, прежде чем продолжить.

source: Build with support for <application>systemd</application><placeholder-1/> service notifications. This improves integration if the server binary is started under <application>systemd</application> but has no impact otherwise<phrase condition="default">; see <xref linkend="server-start"/> for more information</phrase>. <application>libsystemd</application> and the associated header files need to be installed to be able to use this option.
ru: Включает поддержку служебных уведомлений для <application>systemd</application><placeholder-1/>. Это улучшает интеграцию с системой, когда процесс сервера запускается под управлением <application>systemd</application>, и не оказывает никакого влияния в противном случае<phrase condition="default">; за дополнительными сведениями обратитесь к <xref remap="3" linkend="server-start"/></phrase>. Для использования этой поддержки в системе должна быть установлена <application>libsystemd</application> с сопутствующими заголовочными файлами.
