Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/installation.po
Languages: ru

source: Prevents use of the <application>Readline</application> library (and <application>libedit</application> as well). This option disables command-line editing and history in <application>psql</application>, so it is not recommended.
ru: Запрещает использование библиотеки <application>Readline</application> (а также <application>libedit</application>). При этом отключается редактирование командной строки и история в <application>psql</application>, так что этот вариант не рекомендуется.

source: Favors the use of the BSD-licensed <application>libedit</application> library rather than GPL-licensed <application>Readline</application>. This option is significant only if you have both libraries installed; the default in that case is to use <application>Readline</application>.
ru: Отдаёт предпочтение библиотеке <application>libedit</application> с лицензией BSD, а не <application>Readline</application> (GPL). Этот параметр имеет значение, только если установлены обе библиотеки; по умолчанию в этом случае используется <application>Readline</application>.

source: Build with Bonjour support. This requires Bonjour support in your operating system. Recommended on OS X.
ru: Включает поддержку Bonjour. Для этого Bonjour должен поддерживаться самой операционной системой. Рекомендуется для OS X.

source: LIBRARY
ru: БИБЛИОТЕКА

source: Build the <phrase condition="standalone">uuid-ossp</phrase> <phrase condition="default"><xref linkend="uuid-ossp"/></phrase> module (which provides functions to generate UUIDs), using the specified UUID library.<placeholder-1/> <replaceable>LIBRARY</replaceable> must be one of:
ru: Собрать модуль <phrase condition="standalone">uuid-ossp</phrase> <phrase condition="default"><xref linkend="uuid-ossp"/></phrase> (предоставляющий функции для генерирования UUID.<placeholder-1/> <replaceable>БИБЛИОТЕКА</replaceable> может быть следующей:

source: <option>bsd</option> to use the UUID functions found in FreeBSD, NetBSD, and some other BSD-derived systems
ru: <option>bsd</option>, чтобы использовались функции получения UUID, имеющиеся во FreeBSD, NetBSD и некоторых других системах на базе BSD

source: <option>e2fs</option> to use the UUID library created by the <literal>e2fsprogs</literal> project; this library is present in most Linux systems and in OS X, and can be obtained for other platforms as well
ru: <option>e2fs</option>, чтобы использовалась библиотека получения UUID, созданная в рамках проекта <literal>e2fsprogs</literal>; эта библиотека присутствует в большинстве систем Linux и OS X, также её можно найти и для других платформ.

source: <option>ossp</option> to use the <ulink url="http://www.ossp.org/pkg/lib/uuid/">OSSP UUID library</ulink>
ru: <option>ossp</option>, чтобы использовалась библиотека <ulink url="http://www.ossp.org/pkg/lib/uuid/">OSSP UUID</ulink>

source: Obsolete equivalent of <literal>--with-uuid=ossp</literal>.
ru: Устаревший вариант указания <literal>--with-uuid=ossp</literal>.

source: Build with libxml (enables SQL/XML support). Libxml version 2.6.23 or later is required for this feature.
ru: Собрать с libxml (включает поддержку SQL/XML). Для этого требуется libxml версии 2.6.23 или новее.

source: Libxml installs a program <command>xml2-config</command> that can be used to detect the required compiler and linker options. PostgreSQL will use it automatically if found. To specify a libxml installation at an unusual location, you can either set the environment variable <envar>XML2_CONFIG</envar> to point to the <command>xml2-config</command> program belonging to the installation, or use the options <option>--with-includes</option> and <option>--with-libraries</option>.
ru: В составе libxml устанавливается программа <command>xml2-config</command>, с помощью которой можно получить требуемые параметры компилятора и компоновщика. PostgreSQL будет использовать её автоматически, если найдёт. Чтобы указать нестандартное размещение libxml, вы можете воспользоваться переменной окружения <envar>XML2_CONFIG</envar> и указать в ней путь к программе <command>xml2-config</command> нужной инсталляции, либо задать параметры <option>--with-includes</option> и <option>--with-libraries</option>.

source: Use libxslt when building the <phrase condition="standalone">xml2</phrase> <phrase condition="default"><xref linkend="xml2"/></phrase> module. <application>xml2</application> relies on this library to perform XSL transformations of XML.
ru: Использовать libxslt при сборке модуля <phrase condition="standalone">xml2</phrase> <phrase condition="default"><xref linkend="xml2"/></phrase>. Библиотека <application>xml2</application> задействует её для выполнения XSL-преобразований XML.

source: Disable support for 64-bit integer storage for timestamps and intervals, and store datetime values as floating-point numbers instead. Floating-point datetime storage was the default in <productname>PostgreSQL</productname> releases prior to 8.4, but it is now deprecated, because it does not support microsecond precision for the full range of <type>timestamp</type> values. However, integer-based datetime storage requires a 64-bit integer type. Therefore, this option can be used when no such type is available, or for compatibility with applications written for prior versions of <productname>PostgreSQL</productname>. See <phrase condition="standalone">the documentation about datetime datatypes</phrase> <phrase condition="default"><xref linkend="datatype-datetime"/></phrase> for more information.
ru: Отключает применение 64-битных целых для хранения времени и интервалов, чтобы значения даты/времени хранились в виде чисел с плавающей точкой. Числа с плавающей точкой применялись для хранения дат/времени по умолчанию в <productname>PostgreSQL</productname> до версии 8.4, но сейчас этот вариант считается устаревшим, так как с ним не поддерживается точность до микросекунд во всём диапазоне значений <type>timestamp</type>. Однако для хранения таких значений в целочисленном виде требуется поддержка целочисленного 64-битного типа. Поэтому прежний вариант может использоваться, когда такой тип не поддерживается или для совместимости с приложениями, написанными для предыдущих версий <productname>PostgreSQL</productname>. Подробнее об этом можно узнать в <phrase condition="standalone">документации о типах даты/времени</phrase> <phrase condition="default"><xref remap="6" linkend="datatype-datetime"/></phrase>.

source: Disable passing float4 values <quote>by value</quote>, causing them to be passed <quote>by reference</quote> instead. This option costs performance, but may be needed for compatibility with old user-defined functions that are written in C and use the <quote>version 0</quote> calling convention. A better long-term solution is to update any such functions to use the <quote>version 1</quote> calling convention.
ru: Запрещает передачу типа float4 <quote>по значению</quote>, чтобы он передавался <quote>по ссылке</quote>. Это снижает быстродействие, но может быть необходимо для совместимости со старыми пользовательскими функциями на языке C, которые используют соглашение о вызовах <quote>версии 0</quote>. В качестве более долгосрочного решения лучше модернизировать такие функции, чтобы они использовали соглашение <quote>версии 1</quote>.

source: Disable passing float8 values <quote>by value</quote>, causing them to be passed <quote>by reference</quote> instead. This option costs performance, but may be needed for compatibility with old user-defined functions that are written in C and use the <quote>version 0</quote> calling convention. A better long-term solution is to update any such functions to use the <quote>version 1</quote> calling convention. Note that this option affects not only float8, but also int8 and some related types such as timestamp. On 32-bit platforms, <option>--disable-float8-byval</option> is the default and it is not allowed to select <option>--enable-float8-byval</option>.
ru: Запрещает передачу типа float8 <quote>по значению</quote>, чтобы он передавался <quote>по ссылке</quote>. Это снижает быстродействие, но может быть необходимо для совместимости со старыми пользовательскими функциями на языке C, которые используют соглашение о вызовах <quote>версии 0</quote>. В качестве более долгосрочного решения лучше модернизировать такие функции, чтобы они использовали соглашение <quote>версии 1</quote>. Заметьте, что этот параметр влияет не только на float8, но и на int8, а также некоторые другие типы, например timestamp. На 32-битных платформах параметр <option>--disable-float8-byval</option> действует по умолчанию и задать <option>--enable-float8-byval</option> нельзя.

source: SEGSIZE
ru: РАЗМЕР_СЕГМЕНТА

source: Set the <firstterm>segment size</firstterm>, in gigabytes. Large tables are divided into multiple operating-system files, each of size equal to the segment size. This avoids problems with file size limits that exist on many platforms. The default segment size, 1 gigabyte, is safe on all supported platforms. If your operating system has <quote>largefile</quote> support (which most do, nowadays), you can use a larger segment size. This can be helpful to reduce the number of file descriptors consumed when working with very large tables. But be careful not to select a value larger than is supported by your platform and the file systems you intend to use. Other tools you might wish to use, such as <application>tar</application>, could also set limits on the usable file size. It is recommended, though not absolutely required, that this value be a power of 2. Note that changing this value requires an initdb.
ru: Задаёт <firstterm>размер сегмента</firstterm> (в гигабайтах). Сервер делит большие таблицы на несколько файлов в файловой системе, ограничивая размер каждого данным размером сегмента. Это позволяет обойти ограничения на размер файлов, существующие на многих платформах. Размер сегмента по умолчанию, 1 гигабайт, безопасен для всех поддерживаемых платформ. Если же ваша операционная система поддерживает <quote>большие файлы</quote> (а сегодня это поддерживают почти все), вы можете установить больший размер сегмента. Это позволит уменьшить число файловых дескрипторов, используемых при работе с очень большими таблицами. Но будьте осторожны, чтобы выбранное значение не превысило максимум, поддерживаемый вашей платформой и файловыми системами, которые вы будете применять. Возможно, допустимый размер файла будет ограничиваться и другими утилитами, которые вы захотите использовать, например <application>tar</application>. Рекомендуется, хотя и не требуется, чтобы это значение было степенью 2. Заметьте, что при изменении значения требуется выполнить initdb.

source: BLOCKSIZE
ru: РАЗМЕР_БЛОКА

source: Set the <firstterm>block size</firstterm>, in kilobytes. This is the unit of storage and I/O within tables. The default, 8 kilobytes, is suitable for most situations; but other values may be useful in special cases. The value must be a power of 2 between 1 and 32 (kilobytes). Note that changing this value requires an initdb.
ru: Задаёт <firstterm>размер блока</firstterm> (в килобайтах). Эта величина будет единицей хранения и ввода/вывода данных таблиц. Значение по умолчанию, 8 килобайт, достаточно универсально; но в особых случаях может быть оправдан другой размер блока. Это значение должно быть степенью 2 от 1 до 32 (в килобайтах). Заметьте, что при изменении значения требуется выполнить initdb.

source: Set the <firstterm>WAL segment size</firstterm>, in megabytes. This is the size of each individual file in the WAL log. It may be useful to adjust this size to control the granularity of WAL log shipping. The default size is 16 megabytes. The value must be a power of 2 between 1 and 64 (megabytes). Note that changing this value requires an initdb.
ru: Задаёт <firstterm>размер сегмента WAL</firstterm> (в мегабайтах). Эта величина определяет размер каждого отдельного файла журнала WAL. Изменять этот размер бывает полезно для оптимизации фрагментации при трансляции журналов. Значение по умолчанию — 16 мегабайт. Значение должно задаваться степенью 2 от 1 до 64 (в мегабайтах). Заметьте, что при изменении значения требуется выполнить initdb.

source: Set the <firstterm>WAL block size</firstterm>, in kilobytes. This is the unit of storage and I/O within the WAL log. The default, 8 kilobytes, is suitable for most situations; but other values may be useful in special cases. The value must be a power of 2 between 1 and 64 (kilobytes). Note that changing this value requires an initdb.
ru: Задаёт <firstterm>размер блока WAL</firstterm> (в килобайтах) Эта величина будет единицей хранения и ввода/вывода записей WAL. Значение по умолчанию, 8 килобайт, достаточно универсально; но в особых случаях может быть оправдан другой размер блока. Это значение должно быть степенью 2 от 1 до 64 (в килобайтах). Заметьте, что при изменении значения требуется выполнить initdb.

source: Allow the build to succeed even if <productname>PostgreSQL</productname> has no CPU spinlock support for the platform. The lack of spinlock support will result in poor performance; therefore, this option should only be used if the build aborts and informs you that the platform lacks spinlock support. If this option is required to build <productname>PostgreSQL</productname> on your platform, please report the problem to the <productname>PostgreSQL</productname> developers.
ru: Позволяет провести сборку, если <productname>PostgreSQL</productname> не может воспользоваться циклическими блокировками CPU на данной платформе. Отсутствие таких блокировок приводит к снижению производительности, поэтому использовать этот вариант следует, только если сборка прерывается и выдаётся сообщение, что ваша платформа эти блокировки не поддерживает. Если вы не можете собрать <productname>PostgreSQL</productname> на вашей платформе без этого указания, сообщите о данной проблеме разработчикам <productname>PostgreSQL</productname>.

source: Disable the thread-safety of client libraries. This prevents concurrent threads in <application>libpq</application> and <application>ECPG</application> programs from safely controlling their private connection handles.
ru: Отключает потокобезопасное поведение клиентских библиотек. При этом параллельные потоки программ на базе <application>libpq</application> и <application>ECPG</application> не будут безопасно контролировать собственные дескрипторы соединений.

source: <primary>time zone data</primary>
ru: <primary>данные часовых поясов</primary>

source: <productname>PostgreSQL</productname> includes its own time zone database, which it requires for date and time operations. This time zone database is in fact compatible with the IANA time zone database provided by many operating systems such as FreeBSD, Linux, and Solaris, so it would be redundant to install it again. When this option is used, the system-supplied time zone database in <replaceable>DIRECTORY</replaceable> is used instead of the one included in the PostgreSQL source distribution. <replaceable>DIRECTORY</replaceable> must be specified as an absolute path. <filename>/usr/share/zoneinfo</filename> is a likely directory on some operating systems. Note that the installation routine will not detect mismatching or erroneous time zone data. If you use this option, you are advised to run the regression tests to verify that the time zone data you have pointed to works correctly with <productname>PostgreSQL</productname>.
ru: В <productname>PostgreSQL</productname> включена собственная база данных часовых поясов, необходимая для операций с датой и временем. На самом деле эта база данных совместима с базой часовых поясов IANA, поставляемой в составе многих операционных систем FreeBSD, Linux, Solaris, поэтому устанавливать её дополнительно может быть излишне. С этим параметром вместо базы данных, включённой в пакет исходного кода PostgreSQL, будет использоваться системная база данных часовых поясов, находящаяся в заданном <replaceable>КАТАЛОГЕ</replaceable>. <replaceable>КАТАЛОГ</replaceable> должен задаваться абсолютным путём (в ряде операционных систем принят путь <filename>/usr/share/zoneinfo</filename>). Заметьте, что процедура установки не будет проверять несоответствия или ошибки в данных часовых поясов. Поэтому, используя этот параметр, рекомендуется выполнить регрессионные тесты, чтобы убедиться, что выбранная вами база данных часовых поясов работает корректно с <productname>PostgreSQL</productname>.

source: <primary>cross compilation</primary>
ru: <primary>кросс-компиляция</primary>

source: This option is mainly aimed at binary package distributors who know their target operating system well. The main advantage of using this option is that the PostgreSQL package won't need to be upgraded whenever any of the many local daylight-saving time rules change. Another advantage is that PostgreSQL can be cross-compiled more straightforwardly if the time zone database files do not need to be built during the installation.
ru: Этот параметр в основном предназначен для тех, кто собирает двоичные пакеты для дистрибутивов и хорошо знает свою операционную систему. Основной плюс от использования системных данных в том, что пакет PostgreSQL не придётся обновлять при изменениях местных определений часовых поясов. Ещё один плюс заключается в упрощении кросс-компиляции, так как при инсталляции не требуется собирать базу данных часовых поясов.

source: <placeholder-1/> Prevents use of the <application>Zlib</application> library. This disables support for compressed archives in <application>pg_dump</application> and <application>pg_restore</application>. This option is only intended for those rare systems where this library is not available.
ru: <placeholder-1/> Запрещает использование библиотеки <application>Zlib</application>. При этом отключается поддержка сжатых архивов утилитами <application>pg_dump</application> и <application>pg_restore</application>. Этот параметр предназначен только для тех редких систем, в которых нет этой библиотеки.

source: Compiles all programs and libraries with debugging symbols. This means that you can run the programs in a debugger to analyze problems. This enlarges the size of the installed executables considerably, and on non-GCC compilers it usually also disables compiler optimization, causing slowdowns. However, having the symbols available is extremely helpful for dealing with any problems that might arise. Currently, this option is recommended for production installations only if you use GCC. But you should always have it on if you are doing development work or running a beta version.
ru: Включает компиляцию всех программ и библиотек с отладочными символами. Это значит, что вы сможете запускать программы в отладчике для анализа проблем. При такой компиляции размер установленных исполняемых файлов значительно увеличивается, а компиляторы, кроме GCC, обычно отключают оптимизацию, что снижает быстродействие. Однако, наличие отладочных символов очень полезно при решении возможных проблем любой сложности. В настоящее время рекомендуется использовать этот параметр для производственной среды, только если применяется компилятор GCC. Но если вы занимаетесь разработкой или испытываете бета-версию, его следует использовать всегда.

source: If using GCC, all programs and libraries are compiled with code coverage testing instrumentation. When run, they generate files in the build directory with code coverage metrics. <phrase condition="default">See <xref linkend="regress-coverage"/> for more information.</phrase> This option is for use only with GCC and when doing development work.
ru: При использовании GCC все программы и библиотеки компилируются с инструментарием, оценивающим покрытие кода тестами. Если его запустить, в каталоге сборки будут сформированы файлы с метриками покрытия кода. <phrase condition="default">За дополнительными сведениями обратитесь к <xref remap="3" linkend="regress-coverage"/>.</phrase> Этот параметр предназначен только для GCC и только для использования в процессе разработки.

source: If using GCC, all programs and libraries are compiled so they can be profiled. On backend exit, a subdirectory will be created that contains the <filename>gmon.out</filename> file for use in profiling. This option is for use only with GCC and when doing development work.
ru: При использовании GCC все программы и библиотеки компилируются так, чтобы их можно было профилировать. В результате по завершении серверного процесса будет создаваться подкаталог с файлом <filename>gmon.out</filename> для профилирования. Этот параметр предназначен только для GCC и только для тех, кто занимается разработкой.

source: Enables <firstterm>assertion</firstterm> checks in the server, which test for many <quote>cannot happen</quote> conditions. This is invaluable for code development purposes, but the tests can slow down the server significantly. Also, having the tests turned on won't necessarily enhance the stability of your server! The assertion checks are not categorized for severity, and so what might be a relatively harmless bug will still lead to server restarts if it triggers an assertion failure. This option is not recommended for production use, but you should have it on for development work or when running a beta version.
ru: Включает для сервера проверочные <firstterm>утверждения</firstterm>, проверяющие множество условий, которые <quote>не должны происходить</quote>. Это бесценно в процессе разработке кода, но эти проверки могут значительно замедлить работу сервера. Кроме того, включение этих проверок не обязательно увеличит стабильность вашего сервера! Проверочные утверждения не категоризируются по важности, поэтому относительно безвредная ошибка может привести к перезапуску сервера, если утверждение не выполнится. Применять это следует, только если вы занимаетесь разработкой или испытываете бета-версию, но не в производственной среде.

source: Enables automatic dependency tracking. With this option, the makefiles are set up so that all affected object files will be rebuilt when any header file is changed. This is useful if you are doing development work, but is just wasted overhead if you intend only to compile once and install. At present, this option only works with GCC.
ru: Включает автоматическое отслеживание зависимостей. С этим параметром скрипты Makefile настраиваются так, чтобы при изменении любого заголовочного файла пересобирались все зависимые объектные файлы. Это полезно в процессе разработки, но если вам нужно только скомпилировать и установить сервер, это будет лишней тратой времени. В настоящее время это работает только с GCC.

source: <placeholder-1/> Compiles <productname>PostgreSQL</productname> with support for the dynamic tracing tool DTrace. <phrase condition="default">See <xref linkend="dynamic-trace"/> for more information.</phrase>
ru: <placeholder-1/> Включает при компиляции <productname>PostgreSQL</productname> поддержку средства динамической трассировки DTrace. <phrase condition="default">За дополнительными сведениями обратитесь к <xref remap="3" linkend="dynamic-trace"/>.</phrase>

source: To point to the <command>dtrace</command> program, the environment variable <envar>DTRACE</envar> can be set. This will often be necessary because <command>dtrace</command> is typically installed under <filename>/usr/sbin</filename>, which might not be in the path.
ru: Задать расположение программы <command>dtrace</command> можно в переменной окружения <envar>DTRACE</envar>. Часто это необходимо, потому что <command>dtrace</command> обычно устанавливается в каталог <filename>/usr/sbin</filename>, который может отсутствовать в пути поиска.
