Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/installation.po
Languages: ru

source: PostgreSQL for Windows can be built using MinGW, a Unix-like build environment for Microsoft operating systems, or using Microsoft's <productname>Visual C++</productname> compiler suite. The MinGW build variant uses the normal build system described in this chapter; the Visual C++ build works completely differently and is described in <phrase condition="standalone">the documentation</phrase><phrase condition="default"><xref linkend="install-windows"/></phrase>. It is a fully native build and uses no additional software like MinGW. A ready-made installer is available on the main PostgreSQL web site.
ru: PostgreSQL для Windows можно собрать с использованием MinGW, Unix-подобной среды сборки для операционных систем Microsoft, либо используя набор средств разработки Microsoft <productname>Visual C++</productname>. При использовании MinGW применяется обычная система сборки, описанная в этой главе; сборка с Visual C++ выполняется по-другому, как описано в <phrase condition="standalone">документации</phrase><phrase condition="default"><xref remap="6" linkend="install-windows"/></phrase>. Это полностью естественная сборка для Windows, для которой не требуется дополнительное ПО вроде MinGW. Готовый инсталлятор для Windows можно найти на сайте PostgreSQL.

source: The native Windows port requires a 32 or 64-bit version of Windows 2000 or later. Earlier operating systems do not have sufficient infrastructure (but Cygwin may be used on those). MinGW, the Unix-like build tools, and MSYS, a collection of Unix tools required to run shell scripts like <command>configure</command>, can be downloaded from <ulink url="http://www.mingw.org/"/>. Neither is required to run the resulting binaries; they are needed only for creating the binaries.
ru: PostgreSQL, портированный в Windows, будет работать в 32- или 64-битной версии Windows 2000 или новее. В предыдущих операционных системах нет достаточной инфраструктуры (но там можно использовать Cygwin). MinGW, Unix-подобные средства сборки, и MSYS, набор утилит Unix, требуемых для исполнения скриптов типа <command>configure</command>, можно загрузить с сайта <ulink url="http://www.mingw.org/"/>. Эти дополнительные программы нужны только для сборки, для запуска полученных исполняемых файлов они не требуются.

source: To build 64 bit binaries using MinGW, install the 64 bit tool set from <ulink url="http://mingw-w64.sourceforge.net/"/>, put its bin directory in the <envar>PATH</envar>, and run <command>configure</command> with the <command>--host=x86_64-w64-mingw32</command> option.
ru: Чтобы собрать 64-битную версию с использованием MinGW, установите набор 64-битных утилит с <ulink url="http://mingw-w64.sourceforge.net/"/>, добавьте путь к его каталогу bin в <envar>PATH</envar> и запустите <command>configure</command> с параметром <command>--host=x86_64-w64-mingw32</command>.

source: After you have everything installed, it is suggested that you run <application>psql</application> under <command>CMD.EXE</command>, as the MSYS console has buffering issues.
ru: Когда вы всё установите, запускать <application>psql</application> предлагается из <command>CMD.EXE</command>, так как в консоли MSYS есть проблемы с буферизацией.

source: Collecting Crash Dumps on Windows
ru: Сбор аварийных дампов в Windows

source: If PostgreSQL on Windows crashes, it has the ability to generate <productname>minidumps</productname> that can be used to track down the cause for the crash, similar to core dumps on Unix. These dumps can be read using the <productname>Windows Debugger Tools</productname> or using <productname>Visual Studio</productname>. To enable the generation of dumps on Windows, create a subdirectory named <filename>crashdumps</filename> inside the cluster data directory. The dumps will then be written into this directory with a unique name based on the identifier of the crashing process and the current time of the crash.
ru: В случае аварии PostgreSQL в Windows он может сгенерировать минидамп памяти, который помогает выяснить причину аварии, подобно дампам памяти в Unix. Проанализировать эти дампы можно, используя <productname>Windows Debugger Tools</productname> (Средства отладки Windows) или <productname>Visual Studio</productname>. Чтобы в Windows получить дамп в случае аварии, создайте подкаталог <filename>crashdumps</filename> в каталоге данных кластера. Дампы будут записываться в этот каталог с уникальным именем, составленным из идентификатора процесса, давшего сбой, и времени сбоя.

source: SCO OpenServer and SCO UnixWare
ru: SCO OpenServer и SCO UnixWare

source: <primary>SCO</primary> <secondary>installation on</secondary>
ru: <primary>SCO</primary> <secondary>установка в</secondary>

source: <primary>UnixWare</primary> <secondary>installation on</secondary>
ru: <primary>UnixWare</primary> <secondary>установка в</secondary>

source: PostgreSQL can be built on SCO UnixWare 7 and SCO OpenServer 5. On OpenServer, you can use either the OpenServer Development Kit or the Universal Development Kit. However, some tweaking may be needed, as described below.
ru: PostgreSQL можно собрать в SCO UnixWare 7 и SCO OpenServer 5. В OpenServer для сборки можно использовать либо Инструменты разработки OpenServer (OpenServer Development Kit), либо Универсальные средства разработки (Universal Development Kit). Возможно, при этом потребуется выполнить дополнительные действия, как описано ниже.

source: You should locate your copy of the SCO Skunkware CD. The Skunkware CD is included with UnixWare 7 and current versions of OpenServer 5. Skunkware includes ready-to-install versions of many popular programs that are available on the Internet. For example, gzip, gunzip, GNU Make, Flex, and Bison are all included. For UnixWare 7.1, this CD is now labeled "Open License Software Supplement". If you do not have this CD, the software on it is available from <ulink url="http://www.sco.com/skunkware/"/>.
ru: Вы должны найти свою копию SCO Skunkware CD. Skunkware CD поставлялся с UnixWare 7 и текущими версиями OpenServer 5. В набор Skunkware входят готовые к установке версии многих популярных программ, доступных в Интернете. В частности, в него входят gzip, gunzip, GNU Make, Flex и Bison. Для UnixWare 7.1 этот CD называется "Open License Software Supplement" (Дополнительное ПО с открытыми лицензиями). Если у вас нет такого CD, это ПО можно найти на сайте <ulink url="http://www.sco.com/skunkware/"/>.

source: Skunkware has different versions for UnixWare and OpenServer. Make sure you install the correct version for your operating system, except as noted below.
ru: Версии Skunkware для UnixWare и OpenServer различаются. Убедитесь, что вы устанавливаете правильную версию для вашей ОС, но учтите следующие замечания.

source: On UnixWare 7.1.3 and beyond, the GCC compiler is included on the UDK CD as is GNU Make.
ru: В UnixWare 7.1.3 и новее компилятор GCC поставляется на UDK CD, вместе с GNU Make.

source: You need to use the GNU Make program, which is on the Skunkware CD. By default, it installs as <filename>/usr/local/bin/make</filename>.
ru: Вам потребуется программа GNU Make, которая находится на Skunkware CD. По умолчанию она устанавливается в <filename>/usr/local/bin/make</filename>.

source: As of UnixWare 7.1.3 and above, the GNU Make program is the OSTK portion of the UDK CD, and is in <filename>/usr/gnu/bin/gmake</filename>.
ru: В UnixWare 7.1.3 и новее программа GNU Make включена в раздел OSTK диска UDK и устанавливается в <filename>/usr/gnu/bin/gmake</filename>.

source: The Readline library is on the Skunkware CD. But it is not included on the UnixWare 7.1 Skunkware CD. If you have the UnixWare 7.0.0 or 7.0.1 Skunkware CDs, you can install it from there. Otherwise, try <ulink url="http://www.sco.com/skunkware/"/>.
ru: Библиотека Readline поставляется на Skunkware CD, но она не включена в Skunkware CD для UnixWare 7.1. Если у вас есть Skunkware CD для UnixWare 7.0.0 или 7.0.1, вы можете установить её с этого диска. В противном случае, обратитесь к <ulink url="http://www.sco.com/skunkware/"/>.

source: By default, Readline installs into <filename>/usr/local/lib</filename> and <filename>/usr/local/include</filename>. However, the PostgreSQL <command>configure</command> program will not find it there without help. If you installed Readline, then use the following options to <command>configure</command>: <placeholder-1/>
ru: По умолчанию Readline устанавливается в <filename>/usr/local/lib</filename> и <filename>/usr/local/include</filename>. Однако <command>configure</command> для PostgreSQL не сможет найти её там без дополнительной помощи. Поэтому, если вы установили Readline, передайте <command>configure</command> следующие параметры: <placeholder-1/>

source: Using the UDK on OpenServer
ru: Использование UDK в OpenServer

source: If you are using the new Universal Development Kit (UDK) compiler on OpenServer, you need to specify the locations of the UDK libraries: <placeholder-1/> Putting these together with the Readline options from above: <placeholder-2/>
ru: Если вы используете новый компилятор из Универсальных средств разработки (UDK, Universal Development Kit) в OpenServer, вам потребуется задать размещение библиотек UDK: <placeholder-1/> Совместите эти параметры с заданными выше для Readline: <placeholder-2/>

source: Reading the PostgreSQL Man Pages
ru: Получение справки man по PostgreSQL

source: By default, the PostgreSQL man pages are installed into <filename>/usr/local/pgsql/share/man</filename>. By default, UnixWare does not look there for man pages. To be able to read them you need to modify the <varname>MANPATH</varname> variable in <filename>/etc/default/man</filename>, for example: <placeholder-1/>
ru: По умолчанию страницы man для PostgreSQL устанавливаются в <filename>/usr/local/pgsql/share/man</filename>. Но UnixWare по умолчанию не ищет там эти страницы. Чтобы вы могли обращаться к ним, потребуется изменить переменную <varname>MANPATH</varname> в <filename>/etc/default/man</filename>, например так: <placeholder-1/>

source: On OpenServer, some extra research needs to be invested to make the man pages usable, because the man system is a bit different from other platforms. Currently, PostgreSQL will not install them at all.
ru: В OpenServer необходимо провести дополнительные исследования, чтобы справкой man можно было пользоваться, потому что в этой системе man работает немного не так, как в других. В настоящее время PostgreSQL просто не устанавливает справочные страницы в ней.

source: C99 Issues with the 7.1.1b Feature Supplement
ru: Проблемы C99 с функциональным дополнением 7.1.1b

source: For compilers earlier than the one released with OpenUNIX 8.0.0 (UnixWare 7.1.2), including the 7.1.1b Feature Supplement, you may need to specify <option>-Xb</option> in <varname>CFLAGS</varname> or the <varname>CC</varname> environment variable. The indication of this is an error in compiling <filename>tuplesort.c</filename> referencing inline functions. Apparently there was a change in the 7.1.2(8.0.0) compiler and beyond.
ru: Для компиляторов, более ранних, чем выпущенный с OpenUNIX 8.0.0 (UnixWare 7.1.2), в том числе с функциональным дополнением 7.1.1b, может потребоваться указать <option>-Xb</option> в переменной окружения <varname>CC</varname> или <varname>CFLAGS</varname>. Признаком этой проблемы будет ошибка при компиляции <filename>tuplesort.c</filename> в коде, ссылающемся на встроенные функции. Судя по всему, соответствующее исправление включено в компилятор версии 7.1.2(8.0.0) и новее.

source: Threading on UnixWare
ru: Многопоточность в UnixWare

source: For threading, you<emphasis>must</emphasis> use <option>-Kpthread</option> on <emphasis>all</emphasis> libpq-using programs. libpq uses <function>pthread_*</function> calls, which are only available with the <option>-Kpthread</option>/<option>-Kthread</option> flag.
ru: Для использования многопоточности вы <emphasis>должны</emphasis> добавлять указание <option>-Kpthread</option> при компиляции <emphasis>всех</emphasis> программ на базе libpq. Библиотека libpq вызывает функции <function>pthread_*</function>, которые доступны только при компиляции с флагом <option>-Kpthread</option>/<option>-Kthread</option>.

source: <primary>Solaris</primary> <secondary>installation on</secondary>
ru: <primary>Solaris</primary> <secondary>установка в</secondary>

source: PostgreSQL is well-supported on Solaris. The more up to date your operating system, the fewer issues you will experience; details below.
ru: PostgreSQL хорошо поддерживается в Solaris. Чем новее операционная система, тем меньше затруднений будет; подробнее об этом ниже.

source: Required Tools
ru: Требуемые инструменты

source: You can build with either GCC or Sun's compiler suite. For better code optimization, Sun's compiler is strongly recommended on the SPARC architecture. We have heard reports of problems when using GCC 2.95.1; GCC 2.95.3 or later is recommended. If you are using Sun's compiler, be careful not to select <filename>/usr/ucb/cc</filename>; use <filename>/opt/SUNWspro/bin/cc</filename>.
ru: Вы можете выполнить сборку с GCC или с набором компиляторов Sun. Для лучшей оптимизации кода на архитектуре SPARC настоятельно рекомендуется использовать компилятор Sun. Мы слышали о проблемах с GCC 2.95.1, поэтому рекомендуется использовать GCC 2.95.3 или новее. Если вы решили применить компилятор Sun, не выберите по ошибке <filename>/usr/ucb/cc</filename>; правильный путь — <filename>/opt/SUNWspro/bin/cc</filename>.

source: You can download Sun Studio from <ulink url="http://www.oracle.com/technetwork/server-storage/solarisstudio/downloads/"/>. Many of GNU tools are integrated into Solaris 10, or they are present on the Solaris companion CD. If you like packages for older version of Solaris, you can find these tools at <ulink url="http://www.sunfreeware.com"/>. If you prefer sources, look at <ulink url="http://www.gnu.org/order/ftp.html"/>.
ru: Sun Studio вы можете загрузить с сайта <ulink url="http://www.oracle.com/technetwork/server-storage/solarisstudio/downloads/"/>. Средства GNU по большей части интегрированы в Solaris 10, либо представлены на сопутствующем CD. Если вам нужны пакеты для старых версий Solaris, вы можете найти их на сайте <ulink url="http://www.sunfreeware.com"/>. Если вы предпочитаете исходный код, обратитесь к <ulink url="http://www.gnu.org/order/ftp.html"/>.

source: Problems with OpenSSL
ru: Проблемы с OpenSSL

source: When you build PostgreSQL with OpenSSL support you might get compilation errors in the following files: <placeholder-1/> This is because of a namespace conflict between the standard <filename>/usr/include/crypt.h</filename> header and the header files provided by OpenSSL.
ru: Собирая PostgreSQL с поддержкой OpenSSL, вы можете получить ошибки компиляции в следующих файлах: <placeholder-1/> Это вызвано конфликтом имён между стандартным <filename>/usr/include/crypt.h</filename> и заголовочными файлами в составе OpenSSL.

source: Upgrading your OpenSSL installation to version 0.9.6a fixes this problem. Solaris 9 and above has a newer version of OpenSSL.
ru: Эту проблему можно решить, обновив инсталляцию OpenSSL до версии 0.9.6a. Solaris 9 и новее уже включает обновлённую версию OpenSSL.

source: configure Complains About a Failed Test Program
ru: Процедура configure сообщает о сбое тестовой программы

source: If <command>configure</command> complains about a failed test program, this is probably a case of the run-time linker being unable to find some library, probably libz, libreadline or some other non-standard library such as libssl. To point it to the right location, set the <envar>LDFLAGS</envar> environment variable on the <command>configure</command> command line, e.g., <placeholder-1/> See the <citerefentry><refentrytitle>ld</refentrytitle><manvolnum>1</manvolnum></citerefentry> man page for more information.
ru: Если <command>configure</command> сообщает о сбое тестовой программы, это может быть вызвано тем, что при связывании во время выполнения не удаётся найти некоторую библиотеку, вероятно, libz, libreadline или какую-то другую нестандартную, например, libssl. Чтобы указать правильное размещение библиотеки, задайте переменную окружения <envar>LDFLAGS</envar> в командной строке <command>configure</command>, например так: <placeholder-1/> За дополнительными сведениями обратитесь к странице man <citerefentry><refentrytitle>ld</refentrytitle><manvolnum>1</manvolnum></citerefentry>.

source: 64-bit Build Sometimes Crashes
ru: Периодические сбои 64-битной сборки

source: On Solaris 7 and older, the 64-bit version of libc has a buggy <function>vsnprintf</function> routine, which leads to erratic core dumps in PostgreSQL. The simplest known workaround is to force PostgreSQL to use its own version of <function>vsnprintf</function> rather than the library copy. To do this, after you run <command>configure</command> edit a file produced by <command>configure</command>: In <filename>src/Makefile.global</filename>, change the line <placeholder-1/> to read <placeholder-2/> (There might be other files already listed in this variable. Order does not matter.) Then build as usual.
ru: В Solaris 7 и старее 64-битная версия libc содержала бракованную функцию <function>vsnprintf</function>, которая могла вызывать непредсказуемые сбои PostgreSQL. Самое простое известное решение — сделать, чтобы PostgreSQL использовал собственную версию <function>vsnprintf</function> вместо библиотечной версии. Для этого, выполнив <command>configure</command>, отредактируйте полученный в результате <command>configure</command> файл. В <filename>src/Makefile.global</filename> поменяйте строку <placeholder-1/> на такую <placeholder-2/> (В этой переменной уже также могут быть перечислены и другие файлы.) Затем продолжите сборку как обычно.

source: Compiling for Optimal Performance
ru: Компиляция для максимальной производительности

source: On the SPARC architecture, Sun Studio is strongly recommended for compilation. Try using the <option>-xO5</option> optimization flag to generate significantly faster binaries. Do not use any flags that modify behavior of floating-point operations and <varname>errno</varname> processing (e.g., <option>-fast</option>). These flags could raise some nonstandard PostgreSQL behavior for example in the date/time computing.
ru: Для архитектуры SPARC настоятельно рекомендуется проводить компиляцию с использованием Sun Studio. Добавив флаг <option>-xO5</option>, вы можете получить исполняемый код, который будет работать значительно быстрее. Но не добавляйте никакие флаги, влияющие на вычисления с плавающей точкой или обработку <varname>errno</varname> (например, <option>-fast</option>). С такими флагами PostgreSQL может вести себя нестандартно, например, выполняя операции с датами/временем.

source: If you do not have a reason to use 64-bit binaries on SPARC, prefer the 32-bit version. The 64-bit operations are slower and 64-bit binaries are slower than the 32-bit variants. And on other hand, 32-bit code on the AMD64 CPU family is not native, and that is why 32-bit code is significant slower on this CPU family.
ru: Если у вас нет причины использовать 64-битные программы в архитектуре SPARC, собирайте 32-битную версию, так как 64-битные операции, а значит и 64-битные программы, выполняются медленнее 32-битных. С другой стороны, 32-битный код для процессоров семейства AMD64 не является &laquo;родным&raquo;, поэтому на таких процессорах значительно медленнее работает 32-битный код.

source: Using DTrace for Tracing PostgreSQL
ru: Применение DTrace для трассировки PostgreSQL

source: Yes, using DTrace is possible. See <phrase condition="standalone">the documentation</phrase> <phrase condition="default"><xref linkend="dynamic-trace"/></phrase> for further information. You can also find more information in this article: <ulink url="https://blogs.oracle.com/robertlor/entry/user_level_dtrace_probes_in"/>.
ru: Да, вы можете использовать DTrace. За дополнительными сведениями обратитесь к <phrase condition="standalone">документации</phrase> <phrase condition="default"><xref remap="3" linkend="dynamic-trace"/></phrase>. Другую полезную информацию можно найти в этой статье: <ulink url="https://blogs.oracle.com/robertlor/entry/user_level_dtrace_probes_in"/>.

source: If you see the linking of the <command>postgres</command> executable abort with an error message like: <screen> Undefined first referenced symbol in file AbortTransaction utils/probes.o CommitTransaction utils/probes.o ld: fatal: Symbol referencing errors. No output written to postgres collect2: ld returned 1 exit status make: *** [postgres] Error 1 </screen> your DTrace installation is too old to handle probes in static functions. You need Solaris 10u4 or newer.
ru: Если компоновка исполняемого файла <command>postgres</command> прерывается с таким сообщением об ошибке: <screen> Undefined first referenced symbol in file AbortTransaction utils/probes.o CommitTransaction utils/probes.o ld: fatal: Symbol referencing errors. No output written to postgres collect2: ld returned 1 exit status make: *** [postgres] Error 1 </screen> Это означает, что ваша инсталляция DTrace слишком стара и неспособна работать с пробами в статических функциях. В этом случае вам нужна версия Solaris 10u4 или новее.
