Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/installation.po
Languages: ru

source: Extra command-line options for the <command>dtrace</command> program can be specified in the environment variable <envar>DTRACEFLAGS</envar>. On Solaris, to include DTrace support in a 64-bit binary, you must specify <literal>DTRACEFLAGS="-64"</literal> to configure. For example, using the GCC compiler: <screen> ./configure CC='gcc -m64' --enable-dtrace DTRACEFLAGS='-64' ... </screen> Using Sun's compiler: <screen> ./configure CC='/opt/SUNWspro/bin/cc -xtarget=native64' --enable-dtrace DTRACEFLAGS='-64' ... </screen>
ru: Дополнительные параметры командной строки для <command>dtrace</command> можно задать в переменной окружения <envar>DTRACEFLAGS</envar>. В Solaris, чтобы включить поддержку DTrace для 64-битной сборки, необходимо передать configure параметр <literal>DTRACEFLAGS="-64"</literal>. Например, с компилятором GCC: <screen> ./configure CC='gcc -m64' --enable-dtrace DTRACEFLAGS='-64' ... </screen> С компилятором Sun: <screen> ./configure CC='/opt/SUNWspro/bin/cc -xtarget=native64' --enable-dtrace DTRACEFLAGS='-64' ... </screen>

source: Enable tests using the Perl TAP tools. This requires a Perl installation and the Perl module <literal>IPC::Run</literal>. <phrase condition="default">See <xref linkend="regress-tap"/> for more information.</phrase>
ru: Включает тесты по технологии Perl TAP. Для этого у вас должен быть установлен Perl и модуль <literal>IPC::Run</literal>. <phrase condition="default">За дополнительными сведениями обратитесь к <xref remap="3" linkend="regress-tap"/>.</phrase>

source: If you prefer a C compiler different from the one <filename>configure</filename> picks, you can set the environment variable <envar>CC</envar> to the program of your choice. By default, <filename>configure</filename> will pick <filename>gcc</filename> if available, else the platform's default (usually <filename>cc</filename>). Similarly, you can override the default compiler flags if needed with the <envar>CFLAGS</envar> variable.
ru: Если вы предпочитаете компилятор C, отличный от выбираемого скриптом <filename>configure</filename>, укажите его в переменной <envar>CC</envar>. По умолчанию <filename>configure</filename> выбирает <filename>gcc</filename> (если он находится) или стандартный компилятор платформы (обычно <filename>cc</filename>). Подобным образом, при необходимости можно переопределить флаги компилятора по умолчанию с помощью переменной <envar>CFLAGS</envar>.

source: You can specify environment variables on the <filename>configure</filename> command line, for example: <screen> <userinput>./configure CC=/opt/bin/gcc CFLAGS='-O2 -pipe'</userinput> </screen>
ru: Вы можете задать переменные окружения в командной строке <filename>configure</filename>, например, так: <screen> <userinput>./configure CC=/opt/bin/gcc CFLAGS='-O2 -pipe'</userinput> </screen>

source: Bison program
ru: Программа Bison

source: C compiler
ru: компилятор C

source: options to pass to the C compiler
ru: параметры, передаваемые компилятору C

source: C preprocessor
ru: препроцессор C

source: options to pass to the C preprocessor
ru: параметры, передаваемые препроцессору C

source: location of the <command>dtrace</command> program
ru: расположение программы <command>dtrace</command>

source: options to pass to the <command>dtrace</command> program
ru: параметры, передаваемые программе <command>dtrace</command>

source: Flex program
ru: программа Flex

source: options to use when linking either executables or shared libraries
ru: параметры, которые должны использоваться при компоновке исполняемых программ или разделяемых библиотек

source: additional options for linking executables only
ru: дополнительные параметры для компоновки только исполняемых программ

source: additional options for linking shared libraries only
ru: дополнительные параметры для компоновки только разделяемых библиотек

source: <command>msgfmt</command> program for native language support
ru: расположение программы <command>msgfmt</command> для поддержки национальных языков

source: Full path name of the Perl interpreter. This will be used to determine the dependencies for building PL/Perl.
ru: Полный путь к интерпретатору Perl. Он нужен для определения зависимостей при сборке PL/Perl.

source: Full path name of the Python interpreter. This will be used to determine the dependencies for building PL/Python. Also, whether Python 2 or 3 is specified here (or otherwise implicitly chosen) determines which variant of the PL/Python language becomes available. See <phrase condition="standalone">the <application>PL/Python</application> documentation</phrase> <phrase condition="default"><xref linkend="plpython-python23"/></phrase> for more information.
ru: Полный путь к интерпретатору Python. Он нужен для определения зависимостей при сборке PL/Python. Кроме того, версия Python, 2 или 3, выбранная таким образом (или неявно как-то ещё), определяет вариацию языка PL/Python, которая будет доступна. За дополнительными сведениями обратитесь к <phrase condition="standalone">документации <application>PL/Python</application></phrase> <phrase condition="default"><xref remap="3" linkend="plpython-python23"/></phrase>.

source: Full path name of the Tcl interpreter. This will be used to determine the dependencies for building PL/Tcl, and it will be substituted into Tcl scripts.
ru: Полный путь к интерпретатору Tcl. Он нужен для определения зависимостей при сборке PL/Tcl и будет подставляться в скрипты Tcl.

source: <command>xml2-config</command> program used to locate the libxml installation.
ru: Программа <command>xml2-config</command> помогает найти инсталляцию libxml.

source: Here is a list of the significant variables that can be set in this manner: <placeholder-1/>
ru: Ниже приведён список значимых переменных, которые можно установить таким образом: <placeholder-1/>

source: When developing code inside the server, it is recommended to use the configure options <option>--enable-cassert</option> (which turns on many run-time error checks) and <option>--enable-debug</option> (which improves the usefulness of debugging tools).
ru: Разрабатывая внутренний код сервера, рекомендуется использовать указания configure <option>--enable-cassert</option> (которое включает множество проверок во время выполнения) и <option>--enable-debug</option> (которое упрощает использование средств отладки).

source: If using GCC, it is best to build with an optimization level of at least <option>-O1</option>, because using no optimization (<option>-O0</option>) disables some important compiler warnings (such as the use of uninitialized variables). However, non-zero optimization levels can complicate debugging because stepping through compiled code will usually not match up one-to-one with source code lines. If you get confused while trying to debug optimized code, recompile the specific files of interest with <option>-O0</option>. An easy way to do this is by passing an option to <application>make</application>: <command>make PROFILE=-O0 file.o</command>.
ru: Используя GCC, лучше выполнять сборку с уровнем оптимизации не ниже <option>-O1</option>, так как без оптимизации (<option>-O0</option>) отключаются некоторые важные предупреждения компилятора (например, об использовании неинициализированных переменных). Однако оптимизация ненулевого уровня может затруднить отладку, так как при пошаговом выполнении скомпилированный код обычно не соответствует в точности строкам исходного кода. При возникновении сложностей с отладкой оптимизированного кода, перекомпилируйте интересующие вас файлы с ключом <option>-O0</option>. Это можно сделать, просто передав соответствующий параметр <application>make</application>: <command>make PROFILE=-O0 file.o</command>.

source: Build
ru: Сборка

source: To start the build, type: <screen> <userinput>make</userinput> </screen> (Remember to use <acronym>GNU</acronym> <application>make</application>.) The build will take a few minutes depending on your hardware. The last line displayed should be: <screen> All of PostgreSQL successfully made. Ready to install. </screen>
ru: Чтобы запустить сборку, введите: <screen> <userinput>make</userinput> </screen> (Помните, что нужно использовать <acronym>GNU</acronym> <application>make</application>.) Сборка займёт несколько минут, в зависимости от мощности вашего компьютера. В конце должно появиться сообщение: <screen> All of PostgreSQL successfully made. Ready to install. </screen> (Весь PostgreSQL собран успешно и готов к установке.)

source: If you want to build everything that can be built, including the documentation (HTML and man pages), and the additional modules (<filename>contrib</filename>), type instead: <screen> <userinput>make world</userinput> </screen> The last line displayed should be: <screen> PostgreSQL, contrib, and documentation successfully made. Ready to install. </screen>
ru: Если вы хотите собрать всё, что может быть собрано, включая документацию (страницы HTML и man) и дополнительные модули (<filename>contrib</filename>), введите: <screen> <userinput>make world</userinput> </screen> В конце должно появиться сообщение: <screen> PostgreSQL, contrib and documentation successfully made. Ready to install. </screen> (PostgreSQL, contrib и документация собраны успешно и готовы к установке.)

source: Regression Tests
ru: Регрессионные тесты

source: <primary>regression test</primary>
ru: <primary>регрессионный тест</primary>

source: If you want to test the newly built server before you install it, you can run the regression tests at this point. The regression tests are a test suite to verify that <productname>PostgreSQL</productname> runs on your machine in the way the developers expected it to. Type: <screen> <userinput>make check</userinput> </screen> (This won't work as root; do it as an unprivileged user.) <phrase condition="standalone">The file <filename>src/test/regress/README</filename> and the documentation contain</phrase> <phrase condition="default"><xref linkend="regress"/> contains</phrase> detailed information about interpreting the test results. You can repeat this test at any later time by issuing the same command.
ru: Если вы хотите протестировать только что собранный сервер, прежде чем устанавливать его, на этом этапе вы можете запустить регрессионные тесты. Регрессионные тесты — это комплектов тестов, проверяющих, что <productname>PostgreSQL</productname> работает на вашем компьютере так, как задумано разработчиками. Введите: <screen> <userinput>make check</userinput> </screen> (Это должен выполнять обычный пользователь, не root.) Как интерпретировать результаты проверки, подробно описывается в <phrase condition="standalone">файле <filename>src/test/regress/README</filename> и документации</phrase> <phrase condition="default"><xref remap="6" linkend="regress"/></phrase>. Вы можете повторить эту проверку позже в любой момент, выполнив ту же команду.

source: Installing the Files
ru: Установка файлов

source: If you are upgrading an existing system be sure to read <phrase condition="standalone">the documentation,</phrase> <phrase condition="default"><xref linkend="upgrading"/></phrase> which has instructions about upgrading a cluster.
ru: Если вы обновляете существующую систему, обязательно прочитайте инструкции по обновлению кластера, приведённые в <phrase condition="standalone">документации</phrase> <phrase condition="default"><xref remap="6" linkend="upgrading"/></phrase>.

source: To install <productname>PostgreSQL</productname> enter: <screen> <userinput>make install</userinput> </screen> This will install files into the directories that were specified in <xref linkend="configure"/>. Make sure that you have appropriate permissions to write into that area. Normally you need to do this step as root. Alternatively, you can create the target directories in advance and arrange for appropriate permissions to be granted.
ru: Чтобы установить <productname>PostgreSQL</productname>, введите: <screen> <userinput>make install</userinput> </screen> При этом файлы будут установлены в каталоги, заданные в <xref remap="6" linkend="configure"/>. Убедитесь в том, что у вас есть соответствующие разрешения для записи туда. Обычно это действие нужно выполнять от имени root. Также возможно заранее создать целевые каталоги и дать требуемый доступ к ним.

source: To install the documentation (HTML and man pages), enter: <screen> <userinput>make install-docs</userinput> </screen>
ru: Чтобы установить документацию (HTML и страницы man), введите: <screen> <userinput>make install-docs</userinput> </screen>

source: If you built the world above, type instead: <screen> <userinput>make install-world</userinput> </screen> This also installs the documentation.
ru: Если вы собирали цель world, введите вместо этого: <screen> <userinput>make install-world</userinput> </screen> При этом также будет установлена документация.

source: You can use <literal>make install-strip</literal> instead of <literal>make install</literal> to strip the executable files and libraries as they are installed. This will save some space. If you built with debugging support, stripping will effectively remove the debugging support, so it should only be done if debugging is no longer needed. <literal>install-strip</literal> tries to do a reasonable job saving space, but it does not have perfect knowledge of how to strip every unneeded byte from an executable file, so if you want to save all the disk space you possibly can, you will have to do manual work.
ru: Вы можете запустить <literal>make install-strip</literal> вместо <literal>make install</literal>, чтобы убрать лишнее из устанавливаемых исполняемых файлов и библиотек. Это позволит сэкономить немного места. Если вы выполняете сборку для отладки, при этом фактически вырежется поддержка отладки, поэтому этот вариант подходит только если отладка больше не планируется. Процедура <literal>install-strip</literal> пытается оптимизировать объём разумными способами, но не рассчитывайте, что она способна удалить каждый ненужный байт из исполняемого файла. Если вы хотите освободить как можно больше места, вам придётся проделать это вручную.

source: The standard installation provides all the header files needed for client application development as well as for server-side program development, such as custom functions or data types written in C. (Prior to <productname>PostgreSQL</productname> 8.0, a separate <literal>make install-all-headers</literal> command was needed for the latter, but this step has been folded into the standard install.)
ru: При стандартной установке в систему устанавливаются все заголовочные файлы для разработки клиентских приложений, а также программ на стороне сервера, в частности, собственных функций или типов данных, реализованных на C. (До <productname>PostgreSQL</productname> 8.0 для этого требовалось выполнить <literal>make install-all-headers</literal>, но сейчас это включено в стандартную установку.)

source: Client-only installation:
ru: Установка только клиентской части:

source: If you want to install only the client applications and interface libraries, then you can use these commands: <screen> <userinput>make -C src/bin install</userinput> <userinput>make -C src/include install</userinput> <userinput>make -C src/interfaces install</userinput> <userinput>make -C doc install</userinput> </screen> <filename>src/bin</filename> has a few binaries for server-only use, but they are small.
ru: Если вы хотите установить только клиентские приложения и интерфейсные библиотеки, можно выполнить эти команды: <screen> <userinput>make -C src/bin install</userinput> <userinput>make -C src/include install</userinput> <userinput>make -C src/interfaces install</userinput> <userinput>make -C doc install</userinput> </screen> В <filename>src/bin</filename> есть несколько программ, применимых только на сервере, но они очень малы.

source: Uninstallation:
ru: Удаление:

source: To undo the installation use the command <command>make uninstall</command>. However, this will not remove any created directories.
ru: Чтобы отменить установку, воспользуйтесь командой <command>make uninstall</command>. Однако созданные каталоги при этом удалены не будут.

source: Cleaning:
ru: Очистка:

source: After the installation you can free disk space by removing the built files from the source tree with the command <command>make clean</command>. This will preserve the files made by the <command>configure</command> program, so that you can rebuild everything with <command>make</command> later on. To reset the source tree to the state in which it was distributed, use <command>make distclean</command>. If you are going to build for several platforms within the same source tree you must do this and re-configure for each platform. (Alternatively, use a separate build tree for each platform, so that the source tree remains unmodified.)
ru: После установки вы можете освободить место на диске, удалив файлы сборки из дерева исходного кода, выполнив <command>make clean</command>. При этом файлы, созданные программой <command>configure</command>, будут сохранены, так что позже вы сможете пересобрать всё заново, выполнив <command>make</command>. Чтобы сбросить дерево исходного кода к состоянию, в котором оно распространяется, выполните <command>make distclean</command>. Если вы намерены выполнять сборку одного дерева исходного кода для нескольких платформ, вам придётся делать это и переконфигурировать сборочную среду для каждой. (Также можно использовать отдельное дерево сборки для каждой платформы, чтобы дерево исходного кода оставалось неизменным.)

source: If you perform a build and then discover that your <command>configure</command> options were wrong, or if you change anything that <command>configure</command> investigates (for example, software upgrades), then it's a good idea to do <command>make distclean</command> before reconfiguring and rebuilding. Without this, your changes in configuration choices might not propagate everywhere they need to.
ru: Если в процессе сборки вы обнаружите, что заданные вами параметры <command>configure</command> оказались ошибочными, либо вы изменили что-то, от чего зависит работа <command>configure</command> (например, обновили пакеты), стоит выполнить <command>make distclean</command>, прежде чем переконфигурировать и пересобирать всё заново. Если этого не сделать, ваши изменения в конфигурации могут распространиться не везде, где они важны.

source: Post-Installation Setup
ru: Действия после установки

source: Shared Libraries
ru: Разделяемые библиотеки

source: <primary>shared library</primary>
ru: <primary>разделяемая библиотека</primary>

source: On some systems with shared libraries you need to tell the system how to find the newly installed shared libraries. The systems on which this is <emphasis>not</emphasis> necessary include <systemitem class="osname">FreeBSD</systemitem>, <systemitem class="osname">HP-UX</systemitem>, <systemitem class="osname">Linux</systemitem>, <systemitem class="osname">NetBSD</systemitem>, <systemitem class="osname">OpenBSD</systemitem>, and <systemitem class="osname">Solaris</systemitem>.
ru: В некоторых системах с разделяемыми библиотеками необходимо указать системе, как найти недавно установленные разделяемые библиотеки. К числу систем, где это <emphasis>не</emphasis> требуется, относятся <systemitem class="osname">FreeBSD</systemitem>, <systemitem class="osname">HP-UX</systemitem>, <systemitem class="osname">Linux</systemitem>, <systemitem class="osname">NetBSD</systemitem>, <systemitem class="osname">OpenBSD</systemitem> и <systemitem class="osname">Solaris</systemitem>.

source: The method to set the shared library search path varies between platforms, but the most widely-used method is to set the environment variable <envar>LD_LIBRARY_PATH</envar> like so: In Bourne shells (<command>sh</command>, <command>ksh</command>, <command>bash</command>, <command>zsh</command>): <placeholder-1/> or in <command>csh</command> or <command>tcsh</command>: <placeholder-2/> Replace <literal>/usr/local/pgsql/lib</literal> with whatever you set <option><literal>--libdir</literal></option> to in <xref linkend="configure"/>. You should put these commands into a shell start-up file such as <filename>/etc/profile</filename> or <filename>~/.bash_profile</filename>. Some good information about the caveats associated with this method can be found at <ulink url="http://xahlee.org/UnixResource_dir/_/ldpath.html"/>.
ru: Путь поиска разделяемых библиотек на разных платформах может устанавливаться по-разному, но наиболее распространённый способ — установить переменную окружения <envar>LD_LIBRARY_PATH</envar>, например так: в оболочках Bourne (<command>sh</command>, <command>ksh</command>, <command>bash</command>, <command>zsh</command>): <placeholder-1/> или в <command>csh</command>, <command>tcsh</command>: <placeholder-2/> Замените <literal>/usr/local/pgsql/lib</literal> значением, переданным <xref linkend="configure"/> в <option><literal>--libdir</literal></option>. Эти команды следует поместить в стартовый файл оболочки, например, в <filename>/etc/profile</filename> или <filename>~/.bash_profile</filename>. Полезные предостережения об использовании этого метода приведены на странице <ulink url="http://xahlee.org/UnixResource_dir/_/ldpath.html"/>.

source: On some systems it might be preferable to set the environment variable <envar>LD_RUN_PATH</envar> <emphasis>before</emphasis> building.
ru: В некоторых системах предпочтительнее установить переменную окружения <envar>LD_RUN_PATH</envar> <emphasis>до</emphasis> сборки.

source: On <systemitem class="osname">Cygwin</systemitem>, put the library directory in the <envar>PATH</envar> or move the <filename>.dll</filename> files into the <filename>bin</filename> directory.
ru: В <systemitem class="osname">Cygwin</systemitem> добавьте каталог с библиотеками в <envar>PATH</envar> или переместите файлы <filename>.dll</filename> в каталог <filename>bin</filename>.

source: If in doubt, refer to the manual pages of your system (perhaps <command>ld.so</command> or <command>rld</command>). If you later get a message like: <screen> psql: error in loading shared libraries libpq.so.2.1: cannot open shared object file: No such file or directory </screen> then this step was necessary. Simply take care of it then.
ru: В случае сомнений обратитесь к страницам руководства по вашей системе (возможно, к справке по <command>ld.so</command> или <command>rld</command>). Если вы позже получаете сообщение: <screen> psql: error in loading shared libraries libpq.so.2.1: cannot open shared object file: No such file or directory </screen> (psql: ошибка при загрузке разделяемых библиотек libpq.so.2.1: не удалось открыть разделяемый объектный файл: Нет такого файла или каталога), значит этот шаг был необходим. Тогда вам просто нужно вернуться к нему.
