Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/installation.po
Languages: ru

source: <placeholder-1/> If you are on <systemitem class="osname">Linux</systemitem> and you have root access, you can run: <placeholder-2/> (or equivalent directory) after installation to enable the run-time linker to find the shared libraries faster. Refer to the manual page of <command>ldconfig</command> for more information. On <systemitem class="osname">FreeBSD</systemitem>, <systemitem class="osname">NetBSD</systemitem>, and <systemitem class="osname">OpenBSD</systemitem> the command is: <placeholder-3/> instead. Other systems are not known to have an equivalent command.
ru: <placeholder-1/> Если вы используете <systemitem class="osname">Linux</systemitem> и имеете права root, вы можете запустить: <placeholder-2/> (возможно, с другим каталогом) после установки, чтобы механизм связывания во время выполнения мог найти разделяемые библиотеки быстрее. За дополнительными сведениями обратитесь к странице руководства по <command>ldconfig</command>. Во <systemitem class="osname">FreeBSD</systemitem>, <systemitem class="osname">NetBSD</systemitem> и <systemitem class="osname">OpenBSD</systemitem> команда будет такой: <placeholder-3/> В других системах подобной команды может не быть.

source: Environment Variables
ru: Переменные окружения

source: If you installed into <filename>/usr/local/pgsql</filename> or some other location that is not searched for programs by default, you should add <filename>/usr/local/pgsql/bin</filename> (or whatever you set <option><literal>--bindir</literal></option> to in <xref linkend="configure"/>) into your <envar>PATH</envar>. Strictly speaking, this is not necessary, but it will make the use of <productname>PostgreSQL</productname> much more convenient.
ru: Если целевым каталогом был выбран <filename>/usr/local/pgsql</filename> или какой-то другой, по умолчанию отсутствующий в пути поиска, вам следует добавить <filename>/usr/local/pgsql/bin</filename> (или другой путь, переданный <xref linkend="configure"/> в указании <option><literal>--bindir</literal></option>) в вашу переменную <envar>PATH</envar>. Строго говоря, это не обязательно, но при этом использовать <productname>PostgreSQL</productname> будет гораздо удобнее.

source: To do this, add the following to your shell start-up file, such as <filename>~/.bash_profile</filename> (or <filename>/etc/profile</filename>, if you want it to affect all users): <placeholder-1/> If you are using <command>csh</command> or <command>tcsh</command>, then use this command: <placeholder-2/>
ru: Для этого добавьте в ваш скрипт запуска оболочки, например <filename>~/.bash_profile</filename> (или в <filename>/etc/profile</filename>, если это нужно всем пользователям): <placeholder-1/> Для оболочек <command>csh</command> или <command>tcsh</command> команда должна быть такой: <placeholder-2/>

source: <placeholder-1/> To enable your system to find the <application>man</application> documentation, you need to add lines like the following to a shell start-up file unless you installed into a location that is searched by default: <placeholder-2/>
ru: <placeholder-1/> Чтобы ваша система могла найти документацию <application>man</application>, вам нужно добавить в скрипт запуска оболочки примерно следующие строки, если только она не установлена в размещение, просматриваемое по умолчанию: <placeholder-2/>

source: The environment variables <envar>PGHOST</envar> and <envar>PGPORT</envar> specify to client applications the host and port of the database server, overriding the compiled-in defaults. If you are going to run client applications remotely then it is convenient if every user that plans to use the database sets <envar>PGHOST</envar>. This is not required, however; the settings can be communicated via command line options to most client programs.
ru: Переменные окружения <envar>PGHOST</envar> и <envar>PGPORT</envar> задают для клиентских приложений адрес компьютера и порт сервера базы данных, переопределяя стандартные значения. Если планируется запускать клиентские приложения удалённо, пользователям, которые будут использовать определённый сервер, будет удобно, если они установят <envar>PGHOST</envar>. Однако это не обязательно, так как большинство клиентских программ могут принять эти параметры через аргументы командной строки.

source: Getting Started
ru: Начало

source: The following is a quick summary of how to get <productname>PostgreSQL</productname> up and running once installed. The main documentation contains more information.
ru: Далее вкратце рассказывается, как после установки <productname>PostgreSQL</productname> начать с ним работу. Более подробно об этом рассказывается в основной документации.

source: Create a user account for the <productname>PostgreSQL</productname> server. This is the user the server will run as. For production use you should create a separate, unprivileged account (<quote>postgres</quote> is commonly used). If you do not have root access or just want to play around, your own user account is enough, but running the server as root is a security risk and will not work. <screen> <userinput>adduser postgres</userinput> </screen>
ru: Создайте в системе пользователя для сервера <productname>PostgreSQL</productname>. Сервер будет запускаться и работать под именем этого пользователя. В производственной среде для этой цели нужно создать отдельную, непривилегированную учётную запись (обычно ей дают имя <quote>postgres</quote>). Если же у вас нет прав администратора или вы хотите просто поэкспериментировать, можно использовать и вашу собственную учётную запись (но учтите, что запуск сервера под именем root угрожает безопасности и поэтому не допускается). <screen> <userinput>adduser postgres</userinput> </screen>

source: Create a database installation with the <command>initdb</command> command. To run <command>initdb</command> you must be logged in to your <productname>PostgreSQL</productname> server account. It will not work as root. <screen> root# <userinput>mkdir /usr/local/pgsql/data</userinput> root# <userinput>chown postgres /usr/local/pgsql/data</userinput> root# <userinput>su - postgres</userinput> postgres$ <userinput>/usr/local/pgsql/bin/initdb -D /usr/local/pgsql/data</userinput> </screen>
ru: Подготовьте базы данных с помощью команды <command>initdb</command>. Запускать <command>initdb</command> вы должны с именем пользователя, выбранного для сервера <productname>PostgreSQL</productname>. Под именем root она не запустится. <screen> root# <userinput>mkdir /usr/local/pgsql/data</userinput> root# <userinput>chown postgres /usr/local/pgsql/data</userinput> root# <userinput>su - postgres</userinput> postgres$ <userinput>/usr/local/pgsql/bin/initdb -D /usr/local/pgsql/data</userinput> </screen>

source: The <option>-D</option> option specifies the location where the data will be stored. You can use any path you want, it does not have to be under the installation directory. Just make sure that the server account can write to the directory (or create it, if it doesn't already exist) before starting <command>initdb</command>, as illustrated here.
ru: Параметр <option>-D</option> задаёт место, куда будут помещены данные. Вы можете задать любой путь, это не обязательно должен быть каталог внутри дерева инсталляции. Достаточно убедиться в том, что серверный пользователь имеет право записи в этот каталог, (а если он не существует, создать его) прежде чем запускать <command>initdb</command>, как показано здесь.

source: At this point, if you did not use the <command>initdb</command> <literal>-A</literal> option, you might want to modify <filename>pg_hba.conf</filename> to control local access to the server before you start it. The default is to trust all local users.
ru: На данном этапе, если вы не применяли параметр <command>initdb</command> <literal>-A</literal>, может понадобиться модифицировать <filename>pg_hba.conf</filename> для разрешения локального доступа к серверу, прежде чем запускать его. По умолчанию он доверяет всем локальным пользователям.

source: The previous <command>initdb</command> step should have told you how to start up the database server. Do so now. The command should look something like: <placeholder-1/> This will start the server in the foreground. To put the server in the background use something like: <placeholder-2/>
ru: На предыдущем шаге программа <command>initdb</command> должна была сказать вам, как запускать сервер баз данных. Выполните эти указания сейчас. Например, команда может быть такой: <placeholder-1/> При этом сервер будет запущен на переднем плане. Запустить его на заднем плане можно примерно так: <placeholder-2/>

source: To stop a server running in the background you can type: <placeholder-1/>
ru: Чтобы остановить сервер, работающий в фоновом процессе, можно ввести: <placeholder-1/>

source: Create a database: <screen> <userinput>createdb testdb</userinput> </screen> Then enter: <screen> <userinput>psql testdb</userinput> </screen> to connect to that database. At the prompt you can enter SQL commands and start experimenting.
ru: Создайте базу данных: <screen> <userinput>createdb testdb</userinput> </screen> Затем введите: <screen> <userinput>psql testdb</userinput> </screen> для того чтобы подключиться к этой базе. В появившемся приглашении вы сможете вводить команды SQL и приступить к экспериментам.

source: What Now?
ru: Что теперь?

source: The <productname>PostgreSQL</productname> distribution contains a comprehensive documentation set, which you should read sometime. After installation, the documentation can be accessed by pointing your browser to <filename>/usr/local/pgsql/doc/html/index.html</filename>, unless you changed the installation directories.
ru: Дистрибутив <productname>PostgreSQL</productname> содержит всеобъемлющую документацию, с которой вам следует со временем ознакомиться. Завершив установку, просмотреть документацию можно, открыв в браузере страницу <filename>/usr/local/pgsql/doc/html/index.html</filename> (если пути инсталляции не были изменены).

source: The first few chapters of the main documentation are the Tutorial, which should be your first reading if you are completely new to <acronym>SQL</acronym> databases. If you are familiar with database concepts then you want to proceed with part on server administration, which contains information about how to set up the database server, database users, and authentication.
ru: Первые несколько глав основной документации вводные, и если вы совершенно не знакомы с базами данных <acronym>SQL</acronym>, начать следует с них. Если же основы баз данных вам изучать не требуется, вы можете перейти к части, посвящённой администрированию сервера, в которой описывается как настроить сервер, создать пользователей и организовать аутентификацию.

source: Usually, you will want to modify your computer so that it will automatically start the database server whenever it boots. Some suggestions for this are in the documentation.
ru: Обычно бывает желательно настроить компьютер так, чтобы при его загрузке сервер баз данных запускался автоматически. Как это сделать, вы можете узнать в документации.

source: Run the regression tests against the installed server (using <command>make installcheck</command>). If you didn't run the tests before installation, you should definitely do it now. This is also explained in the documentation.
ru: Ещё раз запустите регрессионные тесты для проверки установленного сервера (выполнив <command>make installcheck</command>). Если вы не запускали тесты до установки, это, определённо, стоит сделать сейчас. Об этом также рассказывается в документации.

source: By default, <productname>PostgreSQL</productname> is configured to run on minimal hardware. This allows it to start up with almost any hardware configuration. The default configuration is, however, not designed for optimum performance. To achieve optimum performance, several server parameters must be adjusted, the two most common being <varname>shared_buffers</varname> and <varname>work_mem</varname>. Other parameters mentioned in the documentation also affect performance.
ru: По умолчанию <productname>PostgreSQL</productname> ориентирован на работу с минимальными аппаратными требованиями. Это позволяет запускать его практически на любом оборудовании. Однако эта конфигурация не оптимизирована для высокой производительности. Чтобы получить наилучшую производительность, потребуется настроить несколько параметров сервера, в том числе <varname>shared_buffers</varname> и <varname>work_mem</varname> (одни из наиболее важных). На быстродействие сервера также влияют и другие параметры, описанные в документации.

source: Supported Platforms
ru: Поддерживаемые платформы

source: A platform (that is, a CPU architecture and operating system combination) is considered supported by the <productname>PostgreSQL</productname> development community if the code contains provisions to work on that platform and it has recently been verified to build and pass its regression tests on that platform. Currently, most testing of platform compatibility is done automatically by test machines in the <ulink url="http://buildfarm.postgresql.org/">PostgreSQL Build Farm</ulink>. If you are interested in using <productname>PostgreSQL</productname> on a platform that is not represented in the build farm, but on which the code works or can be made to work, you are strongly encouraged to set up a build farm member machine so that continued compatibility can be assured.
ru: Платформа (то есть комбинация архитектуры процессора и операционной системы) считается поддерживаемой сообществом разработчиков <productname>PostgreSQL</productname>, если код адаптирован для работы на этой платформе, и он в настоящее время успешно собирается и проходит регрессионные тесты на ней. В настоящее время тестирование совместимости в основном выполняется автоматически в <ulink url="http://buildfarm.postgresql.org/">Ферме сборки PostgreSQL</ulink>. Если вы заинтересованы в использовании <productname>PostgreSQL</productname> на платформе, ещё не представленной в ферме сборки, но уверены, что код на ней работает или может работать, мы очень хотели бы, чтобы вы включили в ферму сборки свой компьютер с этой платформой для постоянной гарантии совместимости.

source: In general, <productname>PostgreSQL</productname> can be expected to work on these CPU architectures: x86, x86_64, IA64, PowerPC, PowerPC 64, S/390, S/390x, Sparc, Sparc 64, ARM, MIPS, MIPSEL, M68K, and PA-RISC. Code support exists for M32R and VAX, but these architectures are not known to have been tested recently. It is often possible to build on an unsupported CPU type by configuring with <option>--disable-spinlocks</option>, but performance will be poor.
ru: Вообще следует ожидать, что <productname>PostgreSQL</productname> будет работать на процессорах следующих архитектур: x86, x86_64, IA64, PowerPC, PowerPC 64, S/390, S/390x, Sparc, Sparc 64, ARM, MIPS, MIPSEL, M68K и PA-RISC. Есть также код для поддержки M32R и VAX, но неизвестно, проверялась ли его работа в последнее время. Часто сервер можно собрать для неподдерживаемого типа процессора, сконфигурировав сборку с указанием <option>--disable-spinlocks</option>, но производительность при этом будет неудовлетворительной.

source: <productname>PostgreSQL</productname> can be expected to work on these operating systems: Linux (all recent distributions), Windows (Win2000 SP4 and later), FreeBSD, OpenBSD, NetBSD, OS X, AIX, HP/UX, Solaris, and UnixWare. Other Unix-like systems may also work but are not currently being tested. In most cases, all CPU architectures supported by a given operating system will work. Look in the <xref linkend="installation-platform-notes"/> below to see if there is information specific to your operating system, particularly if using an older system.
ru: Также следует ожидать, что сервер <productname>PostgreSQL</productname> будет работать в следующих операционных системах: Linux (все последние дистрибутивы), Windows (Win2000 SP4 и новее), FreeBSD, OpenBSD, NetBSD, OS X, AIX, HP/UX, Solaris и UnixWare. Возможна также работа в других Unix-подобных системах, но в настоящее время она не проверяется. При этом в большинстве случаев он будет работать на процессорах всех архитектур, поддерживаемых данной операционной системой. Перейдите к <xref remap="3" linkend="installation-platform-notes"/> и проверьте, нет ли там замечаний, относящихся именно к вашей операционной системе, особенно, если вы используете не самую новую систему.

source: If you have installation problems on a platform that is known to be supported according to recent build farm results, please report it to <email>pgsql-bugs@postgresql.org</email>. If you are interested in porting <productname>PostgreSQL</productname> to a new platform, <email>pgsql-hackers@postgresql.org</email> is the appropriate place to discuss that.
ru: Если вы столкнулись с проблемами установки на платформе, которая считается поддерживаемой согласно последним результатам сборки в нашей ферме, пожалуйста, сообщите о них по адресу <email>pgsql-bugs@postgresql.org</email>. Если вы заинтересованы в переносе <productname>PostgreSQL</productname> на новую платформу, обсудить это можно в рассылке <email>pgsql-hackers@postgresql.org</email>.

source: Platform-specific Notes
ru: Замечания по отдельным платформам

source: This section documents additional platform-specific issues regarding the installation and setup of PostgreSQL. Be sure to read the installation instructions, and in particular <xref linkend="install-requirements"/> as well. Also, check <phrase condition="standalone">the file <filename>src/test/regress/README</filename> and the documentation</phrase> <phrase condition="default"><xref linkend="regress"/></phrase> regarding the interpretation of regression test results.
ru: В этом разделе приведены дополнительные замечания по отдельным платформам, связанные с установкой и подготовкой к работе PostgreSQL. Обязательно изучите ещё инструкции по установке, в частности <xref remap="4" linkend="install-requirements"/>. Также обратитесь к <phrase condition="standalone"><filename>src/test/regress/README</filename> и документации</phrase> <phrase condition="default"><xref remap="3" linkend="regress"/></phrase>, где рассказывается, как прочитать результаты регрессионных тестов.

source: Platforms that are not covered here have no known platform-specific installation issues.
ru: Если какие-то платформы здесь не упоминаются, значит каких-либо известных особенностей установки в них нет.

source: <primary>AIX</primary> <secondary>installation on</secondary>
ru: <primary>AIX</primary> <secondary>установка в</secondary>

source: PostgreSQL works on AIX, but getting it installed properly can be challenging. AIX versions from 4.3.3 to 6.1 are considered supported. You can use GCC or the native IBM compiler <command>xlc</command>. In general, using recent versions of AIX and PostgreSQL helps. Check the build farm for up to date information about which versions of AIX are known to work.
ru: PostgreSQL работает в AIX, но установить его правильно может быть непростой задачей. Поддерживаемыми считаются версии AIX с 4.3.3 до 6.1. Для сборки вы можете применить GCC или собственный компилятор IBM <command>xlc</command>. Вообще говоря, полезно использовать последние версии AIX и PostgreSQL. Получить актуальную информацию о версиях AIX, работа в которых проверена на данный момент, можно на сайте фермы сборки.

source: The minimum recommended fix levels for supported AIX versions are:
ru: Минимальные рекомендуемые уровни исправлений для поддерживаемых версий AIX:

source: Maintenance Level 11 + post ML11 bundle
ru: Эксплуатационный уровень (ML) 11 + пакет исправлений после ML11

source: Maintenance Level 9 + post ML9 bundle
ru: Эксплуатационный уровень (ML) 9 + пакет исправлений после ML9

source: Technology Level 10 Service Pack 3
ru: Технологический уровень (TL) 10, Пакет обновлений (SP) 3

source: Technology Level 7
ru: Технологический уровень (TL) 7

source: Base Level
ru: Базовый уровень

source: To check your current fix level, use <command>oslevel -r</command> in AIX 4.3.3 to AIX 5.2 ML 7, or <command>oslevel -s</command> in later versions.
ru: Чтобы проверить ваш текущий уровень исправлений, выполните <command>oslevel -r</command> в AIX версии с 4.3.3 по 5.2 ML 7, либо <command>oslevel -s</command> в более поздних версиях.

source: Use the following <command>configure</command> flags in addition to your own if you have installed Readline or libz in <literal>/usr/local</literal>: <literal>--with-includes=/usr/local/include --with-libraries=/usr/local/lib</literal>.
ru: Если Readline или libz у вас установлены не в <literal>/usr/local</literal>, передайте <command>configure</command> следующие ключи в дополнение к вашим: <literal>--with-includes=/usr/local/include --with-libraries=/usr/local/lib</literal>.

source: GCC Issues
ru: Особенности использования GCC

source: On AIX 5.3, there have been some problems getting PostgreSQL to compile and run using GCC.
ru: В AIX 5.3 наблюдались проблемы с компиляцией и запуском PostgreSQL с использованием GCC.

source: You will want to use a version of GCC subsequent to 3.3.2, particularly if you use a prepackaged version. We had good success with 4.0.1. Problems with earlier versions seem to have more to do with the way IBM packaged GCC than with actual issues with GCC, so that if you compile GCC yourself, you might well have success with an earlier version of GCC.
ru: Для успешной сборки вам потребуется GCC версии новее 3.3.2, особенно, если вы используете версию из системного пакета. Мы добивались успеха с 4.0.1. Проблемы с предыдущими версиями, судя по всему, были связаны больше с тем, как IBM упаковала GCC, а не собственно с GCC, поэтому если вы скомпилируете GCC самостоятельно, положительный исход возможен и с ранней версией GCC.

source: Unix-Domain Sockets Broken
ru: Неработающие доменные сокеты Unix

source: AIX 5.3 has a problem where <structname>sockaddr_storage</structname> is not defined to be large enough. In version 5.3, IBM increased the size of <structname>sockaddr_un</structname>, the address structure for Unix-domain sockets, but did not correspondingly increase the size of <structname>sockaddr_storage</structname>. The result of this is that attempts to use Unix-domain sockets with PostgreSQL lead to libpq overflowing the data structure. TCP/IP connections work OK, but not Unix-domain sockets, which prevents the regression tests from working.
ru: В AIX 5.3 была проблема с размером структуры <structname>sockaddr_storage</structname>. В версии 5.3 IBM увеличила размер <structname>sockaddr_un</structname>, структуры адреса для доменных сокетов Unix, но не увеличила соответственно размер <structname>sockaddr_storage</structname>. В итоге при попытке PostgreSQL использовать доменные сокеты Unix происходило переполнение этой структуры в libpq. Подключение через TCP/IP устанавливается корректно, а через доменные сокеты Unix — нет, и в результате регрессионные тесты не проходят.

source: The problem was reported to IBM, and is recorded as bug report PMR29657. If you upgrade to maintenance level 5300-03 or later, that will include this fix. A quick workaround is to alter <symbol>_SS_MAXSIZE</symbol> to 1025 in <filename>/usr/include/sys/socket.h</filename>. In either case, recompile PostgreSQL once you have the corrected header file.
ru: Об этой проблеме было сообщено IBM, она зафиксирована в отчёте об ошибке PMR29657. Если вы обновите систему до эксплуатационного уровня 5300-03 или новее, она получит соответствующее исправление. В качестве временного решения можно присвоить <symbol>_SS_MAXSIZE</symbol> значение 1025 в <filename>/usr/include/sys/socket.h</filename>. В любом случае, после исправления этого заголовочного файла перекомпилируйте PostgreSQL.

source: Internet Address Issues
ru: Проблемы с сетевыми адресами
