Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/installation.po
Languages: ru

source: <phrase condition="standalone"><productname>PostgreSQL</productname></phrase> Installation from Source Code
ru: Установка <phrase condition="standalone"><productname>PostgreSQL</productname></phrase> из исходного кода

source: <primary>installation</primary>
ru: <primary>установка</primary>

source: This <phrase condition="standalone">document</phrase> <phrase condition="default">chapter</phrase> describes the installation of <productname>PostgreSQL</productname> using the source code distribution. (If you are installing a pre-packaged distribution, such as an RPM or Debian package, ignore this <phrase condition="standalone">document</phrase> <phrase condition="default">chapter</phrase> and read the packager's instructions instead.)
ru: В <phrase condition="standalone">этом документе</phrase> <phrase condition="default">этой главе</phrase> описывается установка <productname>PostgreSQL</productname> из дистрибутивного пакета исходного кода. (Если вы устанавливаете собранный двоичный пакет, например RPM или Debian, вам нужно прочитать инструкции по установке пакета, а не <phrase condition="standalone">этот документ</phrase> <phrase condition="default">эту главу</phrase>.)

source: Short Version
ru: Краткий вариант

source: <synopsis> ./configure make su make install adduser postgres mkdir /usr/local/pgsql/data chown postgres /usr/local/pgsql/data su - postgres /usr/local/pgsql/bin/initdb -D /usr/local/pgsql/data /usr/local/pgsql/bin/postgres -D /usr/local/pgsql/data &gt;logfile 2&gt;&amp;1 &amp; /usr/local/pgsql/bin/createdb test /usr/local/pgsql/bin/psql test </synopsis> The long version is the rest of this <phrase condition="standalone">document.</phrase> <phrase condition="default">chapter.</phrase>
ru: <synopsis> ./configure make su make install adduser postgres mkdir /usr/local/pgsql/data chown postgres /usr/local/pgsql/data su - postgres /usr/local/pgsql/bin/initdb -D /usr/local/pgsql/data /usr/local/pgsql/bin/postgres -D /usr/local/pgsql/data &gt;logfile 2&gt;&amp;1 &amp; /usr/local/pgsql/bin/createdb test /usr/local/pgsql/bin/psql test </synopsis> Развёрнутый вариант представлен в продолжении <phrase condition="standalone">этого документа.</phrase> <phrase condition="default">этой главы.</phrase>

source: Requirements
ru: Требования

source: In general, a modern Unix-compatible platform should be able to run <productname>PostgreSQL</productname>. The platforms that had received specific testing at the time of release are listed in <xref linkend="supported-platforms"/> below. In the <filename>doc</filename> subdirectory of the distribution there are several platform-specific <acronym>FAQ</acronym> documents you might wish to consult if you are having trouble.
ru: В принципе, запустить <productname>PostgreSQL</productname> должно быть возможно на любой современной Unix-совместимой платформе. Платформы, прошедшие специальную проверку на совместимость к моменту выпуска версии, перечислены далее в <xref remap="6" linkend="supported-platforms"/>. В подкаталоге <filename>doc</filename> дистрибутива <productname>PostgreSQL</productname> вы можете найти несколько документов <acronym>FAQ</acronym> по разным платформам, к которым следует обратиться в случае затруднений.

source: <placeholder-1/> <acronym>GNU</acronym> <application>make</application> version 3.80 or newer is required; other <application>make</application> programs or older <acronym>GNU</acronym> <application>make</application> versions will <emphasis>not</emphasis> work. (<acronym>GNU</acronym> <application>make</application> is sometimes installed under the name <filename>gmake</filename>.) To test for <acronym>GNU</acronym> <application>make</application> enter: <screen> <userinput>make --version</userinput> </screen>
ru: <placeholder-1/> Требуется <acronym>GNU</acronym> <application>make</application> версии 3.80 или новее; другие программы <application>make</application> или ранние версии <acronym>GNU</acronym> <application>make</application> работать <emphasis>не</emphasis> будут. (Иногда <acronym>GNU</acronym> <application>make</application> устанавливается под именем <filename>gmake</filename>.) Чтобы проверить наличие и версию <acronym>GNU</acronym> <application>make</application>, введите: <screen> <userinput>make --version</userinput> </screen>

source: You need an <acronym>ISO</acronym>/<acronym>ANSI</acronym> C compiler (at least C89-compliant). Recent versions of <productname>GCC</productname> are recommended, but <productname>PostgreSQL</productname> is known to build using a wide variety of compilers from different vendors.
ru: Вам потребуется компилятор C, соответствующий <acronym>ISO</acronym>/<acronym>ANSI</acronym> (как минимум, совместимый с C89). Рекомендуется использовать последние версии <productname>GCC</productname>, но известно, что <productname>PostgreSQL</productname> собирается самыми разными компиляторами и других производителей.

source: <application>tar</application> is required to unpack the source distribution, in addition to either <application>gzip</application> or <application>bzip2</application>.
ru: Для распаковки пакета исходного кода необходим <application>tar</application>, а также <application>gzip</application> или <application>bzip2</application>.

source: <placeholder-1/> <placeholder-2/> The <acronym>GNU</acronym> <productname>Readline</productname> library is used by default. It allows <application>psql</application> (the PostgreSQL command line SQL interpreter) to remember each command you type, and allows you to use arrow keys to recall and edit previous commands. This is very helpful and is strongly recommended. If you don't want to use it then you must specify the <option>--without-readline</option> option to <filename>configure</filename>. As an alternative, you can often use the BSD-licensed <filename>libedit</filename> library, originally developed on <productname>NetBSD</productname>. The <filename>libedit</filename> library is GNU <productname>Readline</productname>-compatible and is used if <filename>libreadline</filename> is not found, or if <option>--with-libedit-preferred</option> is used as an option to <filename>configure</filename>. If you are using a package-based Linux distribution, be aware that you need both the <literal>readline</literal> and <literal>readline-devel</literal> packages, if those are separate in your distribution.
ru: <placeholder-1/> <placeholder-2/> По умолчанию при сборке используется библиотека <acronym>GNU</acronym> <productname>Readline</productname>. Она позволяет запоминать все вводимые команды в <application>psql</application> (SQL-интерпретатор командной строки для PostgreSQL) и затем, пользуясь клавишами-стрелками, возвращаться к ним и редактировать их. Это очень удобно и мы настоятельно рекомендуем пользоваться этим. Если вы не желаете использовать эту возможность, вы должны добавить указание <option>--without-readline</option> для <filename>configure</filename>. В качестве альтернативы часто можно использовать библиотеку <filename>libedit</filename> с лицензией BSD, изначально разработанную для <productname>NetBSD</productname>. Библиотека <filename>libedit</filename> совместима с GNU <productname>Readline</productname> и подключается, если <filename>libreadline</filename> не найдена, или когда <filename>configure</filename> передаётся указание <option>--with-libedit-preferred</option>. Если вы используете систему на базе Linux с пакетами, учтите, что вам потребуются два пакета: <literal>readline</literal> и <literal>readline-devel</literal>, если в вашем дистрибутиве они разделены.

source: <placeholder-1/> The <productname>zlib</productname> compression library is used by default. If you don't want to use it then you must specify the <option>--without-zlib</option> option to <filename>configure</filename>. Using this option disables support for compressed archives in <application>pg_dump</application> and <application>pg_restore</application>.
ru: <placeholder-1/> По умолчанию для сжатия данных используется библиотека <productname>zlib</productname>. Если вы не хотите её использовать, вы должны передать <filename>configure</filename> указание <option>--without-zlib</option>. Это указание отключает поддержку сжатых архивов в <application>pg_dump</application> и <application>pg_restore</application>.

source: The following software packages are required for building <productname>PostgreSQL</productname>: <placeholder-1/>
ru: Для сборки <productname>PostgreSQL</productname> требуются следующие программные пакеты: <placeholder-1/>

source: To build the server programming language <application>PL/Perl</application> you need a full <productname>Perl</productname> installation, including the <filename>libperl</filename> library and the header files. Since <application>PL/Perl</application> will be a shared library, the <placeholder-1/> <filename>libperl</filename> library must be a shared library also on most platforms. This appears to be the default in recent <productname>Perl</productname> versions, but it was not in earlier versions, and in any case it is the choice of whomever installed Perl at your site. <filename>configure</filename> will fail if building <application>PL/Perl</application> is selected but it cannot find a shared <filename>libperl</filename>. In that case, you will have to rebuild and install <productname>Perl</productname> manually to be able to build <application>PL/Perl</application>. During the configuration process for <productname>Perl</productname>, request a shared library.
ru: Чтобы собрать поддержку языка программирования <application>PL/Perl</application>, вам потребуется полная инсталляция <productname>Perl</productname>, включая библиотеку <filename>libperl</filename> и заголовочные файлы. Так как <application>PL/Perl</application> будет разделяемой библиотекой, библиотека <placeholder-1/><filename>libperl</filename> тоже должна быть разделяемой для большинства платформ. В последних версиях <productname>Perl</productname> это вариант по умолчанию, но в ранних версиях это было не так, и в любом случае это выбирает тот, кто устанавливает Perl в вашей системе. Скрипт <filename>configure</filename> выдаст ошибку, если не сможет найти разделяемую <filename>libperl</filename>, когда выбрана сборка <application>PL/Perl</application>. В этом случае, чтобы собрать <application>PL/Perl</application>, вам придётся пересобрать и переустановить <productname>Perl</productname>. В процессе конфигурирования <productname>Perl</productname> выберите сборку разделяемой библиотеки.

source: If you intend to make more than incidental use of <application>PL/Perl</application>, you should ensure that the <productname>Perl</productname> installation was built with the <literal>usemultiplicity</literal> option enabled (<literal>perl -V</literal> will show whether this is the case).
ru: Если вы планируете отвести <application>PL/Perl</application> не второстепенную роль, следует убедиться в том, что инсталляция <productname>Perl</productname> была собрана с флагом <literal>usemultiplicity</literal> (так ли это, может показать команда <literal>perl -V</literal>).

source: To build the <application>PL/Python</application> server programming language, you need a <productname>Python</productname> installation with the header files and the <application>distutils</application> module. The minimum required version is <productname>Python</productname> 2.3. (To work with function arguments of type <type>numeric</type>, a 2.3.x installation must include the separately-available <filename>cdecimal</filename> module; note the <application>PL/Python</application> regression tests will not pass if that is missing.) <productname>Python 3</productname> is supported if it's version 3.1 or later; but see <phrase condition="standalone">the <application>PL/Python</application> documentation</phrase> <phrase condition="default"><xref linkend="plpython-python23"/></phrase> when using Python 3.
ru: Чтобы собрать сервер с поддержкой языка программирования <application>PL/Python</application>, вам потребуется инсталляция <productname>Python</productname> с заголовочными файлами и модулем <application>distutils</application>. Версия <productname>Python</productname> должна быть не меньше 2.3. (Чтобы работать с аргументами функций типа <type>numeric</type>, в инсталляции 2.3.x должен быть включён отдельно устанавливаемый модуль <filename>cdecimal</filename>; заметьте, что регрессионные тесты <application>PL/Python</application> не будут пройдены, если он отсутствует.) <productname>Python 3</productname> поддерживается, начиная с версии 3.1; но используя Python 3, следует учитывать написанное в <phrase condition="standalone">документации <application>PL/Python</application></phrase> <phrase condition="default"><xref remap="6" linkend="plpython-python23"/></phrase>.

source: Since <application>PL/Python</application> will be a shared library, the <placeholder-1/> <filename>libpython</filename> library must be a shared library also on most platforms. This is not the case in a default <productname>Python</productname> installation built from source, but a shared library is available in many operating system distributions. <filename>configure</filename> will fail if building <application>PL/Python</application> is selected but it cannot find a shared <filename>libpython</filename>. That might mean that you either have to install additional packages or rebuild (part of) your <productname>Python</productname> installation to provide this shared library. When building from source, run <productname>Python</productname>'s configure with the <literal>--enable-shared</literal> flag.
ru: Так как <application>PL/Python</application> будет разделяемой библиотекой, библиотека <placeholder-1/><filename>libpython</filename> тоже должна быть разделяемой для большинства платформ. По умолчанию при сборке инсталляции <productname>Python</productname> из пакета исходного кода это не так, но во многих дистрибутивах имеется нужная разделяемая библиотека. Скрипт <filename>configure</filename> выдаст ошибку, если не сможет найти разделяемую <filename>libpython</filename>, когда выбрана сборка <application>PL/Python</application>. Это может означать, что вам нужно либо установить дополнительные пакеты, либо пересобрать (частично) вашу инсталляцию <productname>Python</productname>, чтобы получить эту библиотеку. При сборке <productname>Python</productname> из исходного кода выполните configure с флагом <literal>--enable-shared</literal>.

source: To build the <application>PL/Tcl</application> procedural language, you of course need a <productname>Tcl</productname> installation. The minimum required version is <productname>Tcl</productname> 8.4.
ru: Чтобы собрать поддержку процедурного языка <application>PL/Tcl</application>, вам конечно потребуется инсталляция <productname>Tcl</productname>. Версия <productname>Tcl</productname> должна быть не старее 8.4.

source: To enable Native Language Support (<acronym>NLS</acronym>), that is, the ability to display a program's messages in a language other than English, you need an implementation of the <application>Gettext</application> <acronym>API</acronym>. Some operating systems have this built-in (e.g., <systemitem class="osname">Linux</systemitem>, <systemitem class="osname">NetBSD</systemitem>, <systemitem class="osname">Solaris</systemitem>), for other systems you can download an add-on package from <ulink url="http://www.gnu.org/software/gettext/"/>. If you are using the <application>Gettext</application> implementation in the <acronym>GNU</acronym> C library then you will additionally need the <productname>GNU Gettext</productname> package for some utility programs. For any of the other implementations you will not need it.
ru: Чтобы включить поддержку национальных языков (<acronym>NLS</acronym>, Native Language Support), то есть возможность выводить сообщения программы не только на английском языке, вам потребуется реализация <acronym>API</acronym> <application>Gettext</application>. В некоторых системах эта реализация встроена (например, в <systemitem class="osname">Linux</systemitem>, <systemitem class="osname">NetBSD</systemitem>, <systemitem class="osname">Solaris</systemitem>), а для других вы можете получить дополнительный пакет по адресу <ulink url="http://www.gnu.org/software/gettext/"/>. Если вы используете реализацию <application>Gettext</application> в библиотеке <acronym>GNU</acronym>, вам понадобится ещё пакет <productname>GNU Gettext</productname> для некоторых утилит. Для любых других реализаций он не требуется.

source: You need <application>Kerberos</application>, <productname>OpenSSL</productname>, <productname>OpenLDAP</productname>, and/or <application>PAM</application>, if you want to support authentication or encryption using those services.
ru: Вам могут понадобиться пакеты <application>Kerberos</application>, <productname>OpenSSL</productname>, <productname>OpenLDAP</productname> и/или <application>PAM</application>, если вам нужна поддержка аутентификации или шифрования, которую они обеспечивают.

source: To build the <productname>PostgreSQL</productname> documentation, there is a separate set of requirements; see <phrase condition="default"><xref linkend="docguide-toolsets"/>.</phrase> <phrase condition="standalone">the main documentation's appendix on documentation.</phrase>
ru: Для сборки документации <productname>PostgreSQL</productname> предъявляется отдельный набор требований; см. <phrase condition="default"><xref remap="4" linkend="docguide-toolsets"/>.</phrase> <phrase condition="standalone">посвящённое этому приложение к основной документации.</phrase>

source: The following packages are optional. They are not required in the default configuration, but they are needed when certain build options are enabled, as explained below: <placeholder-1/>
ru: Следующие пакеты не являются обязательными. Они не требуются в стандартной конфигурации, но они необходимы для определённых вариантов сборки, описанных ниже: <placeholder-1/>

source: <placeholder-1/> <placeholder-2/> <placeholder-3/> <placeholder-4/> GNU <application>Flex</application> and <application>Bison</application> are needed to build from a Git checkout, or if you changed the actual scanner and parser definition files. If you need them, be sure to get <application>Flex</application> 2.5.31 or later and <application>Bison</application> 1.875 or later. Other <application>lex</application> and <application>yacc</application> programs cannot be used.
ru: <placeholder-1/> <placeholder-2/> <placeholder-3/> <placeholder-4/> GNU <application>Flex</application> и <application>Bison</application> потребуются для сборки из содержимого Git или если вы меняете собственно файлы определений анализа и разбора. Если они вам понадобятся, то версия <application>Flex</application> должна быть не меньше 2.5.31, а <application>Bison</application> — не меньше 1.875. Другие программы <application>lex</application> и <application>yacc</application> работать не будут.

source: <placeholder-1/> <application>Perl</application> 5.8 or later is needed to build from a Git checkout, or if you changed the input files for any of the build steps that use Perl scripts. If building on Windows you will need <application>Perl</application> in any case. <application>Perl</application> is also required to run some test suites.
ru: <placeholder-1/> <application>Perl</application> 5.8 или новее потребуется для сборки из содержимого Git, либо если вы меняете исходные файлы этапов сборки, построенных на скриптах Perl. Если вы выполняете сборку в Windows, вам потребуется <application>Perl</application> в любом случае. <application>Perl</application> также требуется для выполнения некоторых комплектов тестов.

source: If you are building from a <productname>Git</productname> tree instead of using a released source package, or if you want to do server development, you also need the following packages: <placeholder-1/>
ru: Если вы хотите скомпилировать код из дерева <productname>Git</productname>, а не из специального пакета исходного кода, либо вы хотите работать с этим кодом, вам также понадобятся следующие пакеты: <placeholder-1/>

source: If you need to get a <acronym>GNU</acronym> package, you can find it at your local <acronym>GNU</acronym> mirror site (see <ulink url="http://www.gnu.org/order/ftp.html"/> for a list) or at <ulink url="ftp://ftp.gnu.org/gnu/"/>.
ru: Если вам понадобится какой-либо пакет <acronym>GNU</acronym>, вы можете найти его на вашем локальном зеркале <acronym>GNU</acronym> (список зеркал: <ulink url="http://www.gnu.org/order/ftp.html"/>) или на сайте <ulink url="ftp://ftp.gnu.org/gnu/"/>.

source: Also check that you have sufficient disk space. You will need about 100 MB for the source tree during compilation and about 20 MB for the installation directory. An empty database cluster takes about 35 MB; databases take about five times the amount of space that a flat text file with the same data would take. If you are going to run the regression tests you will temporarily need up to an extra 150 MB. Use the <command>df</command> command to check free disk space.
ru: Также проверьте, достаточно ли места на диске. Вам потребуется около 100 Мб для исходного кода в процессе компиляции и около 20 Мб для каталога инсталляции. Пустой кластер баз данных занимает около 35 Мб; базы данных занимают примерно в пять раз больше места, чем те же данные в обычном текстовом файле. Если вы планируете запускать регрессионные тесты, вам может временно понадобиться ещё около 150 Мб. Проверить наличие свободного места можно с помощью команды <command>df</command>.

source: Getting The Source
ru: Получение исходного кода

source: The <productname>PostgreSQL</productname> &version; sources can be obtained from the download section of our website: <ulink url="http://www.postgresql.org/download/"/>. You should get a file named <filename>postgresql-&version;.tar.gz</filename> or <filename>postgresql-&version;.tar.bz2</filename>. After you have obtained the file, unpack it: <screen> <userinput>gunzip postgresql-&version;.tar.gz</userinput> <userinput>tar xf postgresql-&version;.tar</userinput> </screen> (Use <command>bunzip2</command> instead of <command>gunzip</command> if you have the <filename>.bz2</filename> file.) This will create a directory <filename>postgresql-&version;</filename> under the current directory with the <productname>PostgreSQL</productname> sources. Change into that directory for the rest of the installation procedure.
ru: Исходные коды <productname>PostgreSQL</productname> &version; можно загрузить из соответствующего раздела нашего сайта: <ulink url="http://www.postgresql.org/download/"/>. Вам следует выбрать файл <filename>postgresql-&version;.tar.gz</filename> или <filename>postgresql-&version;.tar.bz2</filename>. Получив этот файл, распакуйте его: <screen> <userinput>gunzip postgresql-&version;.tar.gz</userinput> <userinput>tar xf postgresql-&version;.tar</userinput> </screen> (Если вы выбрали файл <filename>.bz2</filename>, используйте <command>bunzip2</command> вместо <command>gunzip</command>.) При этом в текущем каталоге будет создан подкаталог <filename>postgresql-&version;</filename> с исходными кодами <productname>PostgreSQL</productname>. Перейдите в этот подкаталог для продолжения процедуры установки.

source: You can also get the source directly from the version control repository, see <xref linkend="sourcerepo"/>.
ru: Вы также можете получить исходный код непосредственно из репозитория системы управления версиями (см. <xref remap="4" linkend="sourcerepo"/>).

source: Installation Procedure
ru: Процедура установки

source: Configuration
ru: Конфигурирование
