Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/install-windows.po
Languages: ru

source: To build all of PostgreSQL in release configuration (the default), run the command: <screen> <userinput>build</userinput> </screen> To build all of PostgreSQL in debug configuration, run the command: <screen> <userinput>build DEBUG</userinput> </screen> To build just a single project, for example psql, run the commands: <screen> <userinput>build psql</userinput> <userinput>build DEBUG psql</userinput> </screen> To change the default build configuration to debug, put the following in the <filename>buildenv.pl</filename> file: <placeholder-1/>
ru: Чтобы собрать весь PostgreSQL в конфигурации выпуска (по умолчанию), запустите команду: <screen> <userinput>build</userinput> </screen> Чтобы собрать весь PostgreSQL в конфигурации отладки, запустите команду: <screen> <userinput>build DEBUG</userinput> </screen> Для сборки отдельного проекта, например psql, выполните, соответственно: <screen> <userinput>build psql</userinput> <userinput>build DEBUG psql</userinput> </screen> Чтобы сменить конфигурацию по умолчанию на отладочную, поместите в файл <filename>buildenv.pl</filename> следующую строку: <placeholder-1/>

source: It is also possible to build from inside the Visual Studio GUI. In this case, you need to run: <screen> <userinput>perl mkvcbuild.pl</userinput> </screen> from the command prompt, and then open the generated <filename>pgsql.sln</filename> (in the root directory of the source tree) in Visual Studio.
ru: Также возможна сборка из графической среды Visual Studio. В этом случае вам нужно запустить в командной строке: <screen> <userinput>perl mkvcbuild.pl</userinput> </screen> и затем открыть в Visual Studio полученный <filename>pgsql.sln</filename> в корневом каталоге дерева исходных кодов.

source: Cleaning and Installing
ru: Очистка и установка

source: Most of the time, the automatic dependency tracking in Visual Studio will handle changed files. But if there have been large changes, you may need to clean the installation. To do this, simply run the <filename>clean.bat</filename> command, which will automatically clean out all generated files. You can also run it with the <parameter>dist</parameter> parameter, in which case it will behave like <userinput>make distclean</userinput> and remove the flex/bison output files as well.
ru: В большинстве случаев за изменением файлов будет следить автоматическая система отслеживания зависимостей в Visual Studio. Но если изменений было слишком много, может понадобиться очистка установки. Чтобы её выполнить, просто запустите команду <filename>clean.bat</filename>, которая автоматически очистит все сгенерированные файлы. Вы также можете запустить эту команду с параметром <parameter>dist</parameter>, в этом случае она отработает подобно <userinput>make distclean</userinput> и удалит также выходные файлы flex/bison.

source: By default, all files are written into a subdirectory of the <filename>debug</filename> or <filename>release</filename> directories. To install these files using the standard layout, and also generate the files required to initialize and use the database, run the command: <screen> <userinput>install c:\destination\directory</userinput> </screen>
ru: По умолчанию все файлы сохраняются в подкаталогах <filename>debug</filename> или <filename>release</filename>. Чтобы установить эти файлы стандартным образом, а также сгенерировать файлы, требуемые для инициализации и использования базы данных, запустите команду: <screen> <userinput>install c:\destination\directory</userinput> </screen>

source: If you want to install only the client applications and interface libraries, then you can use these commands: <screen> <userinput>install c:\destination\directory client</userinput> </screen>
ru: Если вы хотите установить только клиентские приложения и интерфейсные библиотеки, выполните команду: <screen> <userinput>install c:\destination\directory client</userinput> </screen>

source: Running the Regression Tests
ru: Запуск регрессионных тестов

source: To run the regression tests, make sure you have completed the build of all required parts first. Also, make sure that the DLLs required to load all parts of the system (such as the Perl and Python DLLs for the procedural languages) are present in the system path. If they are not, set it through the <filename>buildenv.pl</filename> file. To run the tests, run one of the following commands from the <filename>src\tools\msvc</filename> directory: <screen> <userinput>vcregress check</userinput> <userinput>vcregress installcheck</userinput> <userinput>vcregress plcheck</userinput> <userinput>vcregress contribcheck</userinput> <userinput>vcregress modulescheck</userinput> <userinput>vcregress ecpgcheck</userinput> <userinput>vcregress isolationcheck</userinput> <userinput>vcregress bincheck</userinput> <userinput>vcregress recoverycheck</userinput> <userinput>vcregress upgradecheck</userinput> </screen> To change the schedule used (default is parallel), append it to the command line like: <screen> <userinput>vcregress check serial</userinput> </screen> For more information about the regression tests, see <xref linkend="regress"/>.
ru: Чтобы запустить регрессионные тесты, важно сначала собрать все необходимые для них компоненты. Также убедитесь, что в системном пути могут быть найдены все DLL, требуемые для загрузки всех подсистем СУБД (например, DLL Perl и Python для процедурных языков). Если их каталоги в пути поиска отсутствуют, задайте их в файле <filename>buildenv.pl</filename>. Чтобы запустить тесты, выполните одну из следующих команд в каталоге <filename>src\tools\msvc</filename>: <screen> <userinput>vcregress check</userinput> <userinput>vcregress installcheck</userinput> <userinput>vcregress plcheck</userinput> <userinput>vcregress contribcheck</userinput> <userinput>vcregress modulescheck</userinput> <userinput>vcregress ecpgcheck</userinput> <userinput>vcregress isolationcheck</userinput> <userinput>vcregress bincheck</userinput> <userinput>vcregress recoverycheck</userinput> <userinput>vcregress upgradecheck</userinput> </screen> Чтобы выбрать другой планировщик выполнения тестов (по умолчанию выбран параллельный), укажите его в командной строке, например: <screen> <userinput>vcregress check serial</userinput> </screen> За дополнительными сведениями о регрессионных тестах обратитесь к <xref remap="3" linkend="regress"/>.

source: As of this writing, <literal>IPC::Run</literal> is not included in the ActiveState Perl installation, nor in the ActiveState Perl Package Manager (PPM) library. To install, download the <filename>IPC-Run-&lt;version&gt;.tar.gz</filename> source archive from CPAN, at <ulink url="http://search.cpan.org/dist/IPC-Run/"/>, and uncompress. Edit the <filename>buildenv.pl</filename> file, and add a PERL5LIB variable to point to the <filename>lib</filename> subdirectory from the extracted archive. For example: <placeholder-1/>
ru: На момент написания документации, модуль <literal>IPC::Run</literal> не включается ни в инсталляцию Perl ActiveState, ни в библиотеку ActiveState PPM (Perl Package Manager, Менеджер пакетов Perl). Чтобы установить его, загрузите архив исходного кода <filename>IPC-Run-&lt;version&gt;.tar.gz</filename> из CPAN, по адресу <ulink url="http://search.cpan.org/dist/IPC-Run/"/>, и распакуйте его. Откройте файл <filename>buildenv.pl</filename> и добавьте в него переменную PERL5LIB, указывающую на подкаталог <filename>lib</filename> из извлечённого архива. Например: <placeholder-1/>

source: Running the regression tests on client programs, with <command>vcregress bincheck</command>, or on recovery tests, with <command>vcregress recoverycheck</command>, requires an additional Perl module to be installed: <placeholder-1/>
ru: Для запуска регрессионных тестов клиентских программ с применением команды <command>vcregress bincheck</command> или тестов восстановления, с применением <command>vcregress recoverycheck</command>, должен быть установлен дополнительный модуль Perl: <placeholder-1/>

source: Building the Documentation
ru: Сборка документации

source: Download from <ulink url="http://sourceforge.net/projects/openjade/files/openjade/1.3.1/openjade-1_3_1-2-bin.zip/download"/> and uncompress in the subdirectory <filename>openjade-1.3.1</filename>.
ru: Загрузите архив <ulink url="http://sourceforge.net/projects/openjade/files/openjade/1.3.1/openjade-1_3_1-2-bin.zip/download"/> и распакуйте его в подкаталог <filename>openjade-1.3.1</filename>.

source: Download from <ulink url="http://www.oasis-open.org/docbook/sgml/4.2/docbook-4.2.zip"/> and uncompress in the subdirectory <filename>docbook</filename>.
ru: Загрузите архив с <ulink url="http://www.oasis-open.org/docbook/sgml/4.2/docbook-4.2.zip"/> и распакуйте его в подкаталог <filename>docbook</filename>.

source: Download from <ulink url="http://sourceforge.net/projects/docbook/files/docbook-dsssl/1.79/docbook-dsssl-1.79.zip/download"/> and uncompress in the subdirectory <filename>docbook-dsssl-1.79</filename>.
ru: Загрузите архив с <ulink url="http://sourceforge.net/projects/docbook/files/docbook-dsssl/1.79/docbook-dsssl-1.79.zip/download"/> и распакуйте его в подкаталог <filename>docbook-dsssl-1.79</filename>.

source: ISO character entities
ru: Сущности символов ISO

source: Download from <ulink url="http://www.oasis-open.org/cover/ISOEnts.zip"/> and uncompress in the subdirectory <filename>docbook</filename>.
ru: Загрузите архив с <ulink url="http://www.oasis-open.org/cover/ISOEnts.zip"/> и распакуйте его в подкаталог <filename>docbook</filename>.

source: Building the PostgreSQL documentation in HTML format requires several tools and files. Create a root directory for all these files, and store them in the subdirectories in the list below. <placeholder-1/> Edit the <filename>buildenv.pl</filename> file, and add a variable for the location of the root directory, for example: <placeholder-2/> To build the documentation, run the command <filename>builddoc.bat</filename>. Note that this will actually run the build twice, in order to generate the indexes. The generated HTML files will be in <filename>doc\src\sgml</filename>.
ru: Для сборки документации PostgreSQL в формате HTML требуются дополнительные инструменты и файлы. Создайте общий каталог для всех этих файлов и сохраните их в названные подкаталоги. <placeholder-1/> Добавьте в <filename>buildenv.pl</filename> переменную, задающую местоположение ранее созданного общего каталога, например: <placeholder-2/> Чтобы собрать документацию, запустите <filename>builddoc.bat</filename>. Обратите внимание, что при этом сборка фактически будет запущена дважды; это нужно для построения индексов. Сгенерированные HTML-файлы окажутся в каталоге <filename>doc\src\sgml</filename>.

source: Building <application>libpq</application> with <productname>Visual C++</productname> or <productname>Borland C++</productname>
ru: Сборка <application>libpq</application> с помощью <productname>Visual C++</productname> или <productname>Borland C++</productname>

source: Using <productname>Visual C++ 7.1-9.0</productname> or <productname>Borland C++</productname> to build libpq is only recommended if you need a version with different debug/release flags, or if you need a static library to link into an application. For normal use the <productname>MinGW</productname> or <productname>Visual Studio</productname> or <productname>Windows SDK</productname> method is recommended.
ru: Использовать <productname>Visual C++ 7.1-9.0</productname> или <productname>Borland C++</productname> для компиляции libpq рекомендуется, только если вам нужна версия с другими флагами для отладки/выпуска, либо вам нужна статическая библиотека для компоновки приложения. Для нормального использования рекомендуется вариант сборки с <productname>MinGW</productname>, либо <productname>Visual Studio</productname>, либо <productname>Windows SDK</productname>.

source: To build the <application>libpq</application> client library using <productname>Visual Studio 7.1 or later</productname>, change into the <filename>src</filename> directory and type the command: <screen> <userinput>nmake /f win32.mak</userinput> </screen>
ru: Чтобы собрать клиентскую библиотеку <application>libpq</application>, используя <productname>Visual Studio 7.1</productname> или новее, перейдите в каталог <filename>src</filename> и введите команду: <screen> <userinput>nmake /f win32.mak</userinput> </screen>

source: To build a 64-bit version of the <application>libpq</application> client library using <productname>Visual Studio 8.0 or later</productname>, change into the <filename>src</filename> directory and type in the command: <screen> <userinput>nmake /f win32.mak CPU=AMD64</userinput> </screen> See the <filename>win32.mak</filename> file for further details about supported variables.
ru: Чтобы собрать 64-битную версию клиентской библиотеки <application>libpq</application>, используя <productname>Visual Studio 8.0</productname> или выше, перейдите в каталог <filename>src</filename> и введите команду: <screen> <userinput>nmake /f win32.mak CPU=AMD64</userinput> </screen> Подробнее узнать о поддерживаемых переменных можно в файле <filename>win32.mak</filename>.

source: To build the <application>libpq</application> client library using <productname>Borland C++</productname>, change into the <filename>src</filename> directory and type the command: <screen> <userinput>make -N -DCFG=Release /f bcc32.mak</userinput> </screen>
ru: Чтобы собрать клиентскую библиотеку <application>libpq</application>, используя <productname>Borland C++</productname>, перейдите в каталог <filename>src</filename> и введите команду: <screen> <userinput>make -N -DCFG=Release /f bcc32.mak</userinput> </screen>

source: Generated Files
ru: Генерируемые файлы

source: The dynamically linkable frontend library
ru: Динамически связываемая клиентская библиотека

source: Import library to link your programs to <filename>libpq.dll</filename>
ru: Библиотека импорта для связывания программ с <filename>libpq.dll</filename>

source: Static version of the frontend library
ru: Статическая версия клиентской библиотеки

source: The following files will be built: <placeholder-1/>
ru: При сборке будут получены следующие файлы: <placeholder-1/>

source: Normally you do not need to install any of the client files. You should place the <filename>libpq.dll</filename> file in the same directory as your applications executable file. Do not install <filename>libpq.dll</filename> into your <filename>Windows</filename>, <filename>System</filename> or <filename>System32</filename> directory unless absolutely necessary. If this file is installed using a setup program, then it should be installed with version checking using the <symbol>VERSIONINFO</symbol> resource included in the file, to ensure that a newer version of the library is not overwritten.
ru: Обычно устанавливать какие-либо клиентские файлы не требуется. Достаточно поместить файл <filename>libpq.dll</filename> в тот каталог, где находится исполняемый файл приложения. Не устанавливайте <filename>libpq.dll</filename> в каталоги Windows, <filename>System</filename> или <filename>System32</filename>, если только это не абсолютно необходимо. Если эта библиотека устанавливается программой setup, при установке нужно проверить версию по содержимому включённого в неё ресурса <symbol>VERSIONINFO</symbol>, чтобы более новая версия библиотеки не была заменена старой.

source: If you are planning to do development using <application>libpq</application> on this machine, you will have to add the <filename>src\include</filename> and <filename>src\interfaces\libpq</filename> subdirectories of the source tree to the include path in your compiler's settings.
ru: Если вы планируете разрабатывать программы, использующие <application>libpq</application> в текущей системе, вы должны добавить подкаталоги <filename>src\include</filename> и <filename>src\interfaces\libpq</filename> в путь поиска заголовочных файлов для компилятора.

source: To use the library, you must add the <filename>libpqdll.lib</filename> file to your project. (In Visual C++, just right-click on the project and choose to add it.)
ru: Чтобы использовать данную библиотеку, вы должны добавить файл <filename>libpqdll.lib</filename> в ваш проект. (В Visual C++ просто щёлкните проект правой кнопкой и выберите соответствующее действие.)
