Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: The <acronym>URI</acronym> scheme designator can be either <literal>postgresql://</literal> or <literal>postgres://</literal>. Each of the <acronym>URI</acronym> parts is optional. The following examples illustrate valid <acronym>URI</acronym> syntax uses: <placeholder-1/> Components of the hierarchical part of the <acronym>URI</acronym> can also be given as parameters. For example: <placeholder-2/>
ru: В качестве обозначения схемы <acronym>URI</acronym> может использоваться либо <literal>postgresql://</literal>, либо <literal>postgres://</literal>. Каждая из частей <acronym>URI</acronym> является необязательной. В следующих примерах показано правильное использование синтаксиса <acronym>URI</acronym>: <placeholder-1/> Компоненты иерархической части <acronym>URI</acronym> можно также передавать в виде параметров. Например: <placeholder-2/>

source: Percent-encoding may be used to include symbols with special meaning in any of the <acronym>URI</acronym> parts.
ru: Для включения символов, имеющих специальное значение, в любой части <acronym>URI</acronym> можно применять URL-кодирование (с использованием символа %).

source: Any connection parameters not corresponding to key words listed in <xref linkend="libpq-paramkeywords"/> are ignored and a warning message about them is sent to <filename>stderr</filename>.
ru: Любые параметры соединения, не соответствующие ключевым словам, приведённым в <xref remap="6" linkend="libpq-paramkeywords"/>, игнорируются, а предупреждающее сообщение об этом направляется на <filename>stderr</filename>.

source: For improved compatibility with JDBC connection <acronym>URI</acronym>s, instances of parameter <literal>ssl=true</literal> are translated into <literal>sslmode=require</literal>.
ru: Для улучшения совместимости с теми <acronym>URI</acronym>, которые служат для подключения через JDBC, все экземпляры параметра <literal>ssl=true</literal> преобразуются в <literal>sslmode=require</literal>.

source: The host part may be either host name or an IP address. To specify an IPv6 host address, enclose it in square brackets: <synopsis> postgresql://[2001:db8::1234]/database </synopsis>
ru: Сервер можно представить либо доменным именем, либо IP-адресом. При использовании протокола IPv6 нужно заключить адрес в квадратные скобки: <synopsis format="linespecific ">postgresql://[2001:db8::1234]/database </synopsis>

source: The host component is interpreted as described for the parameter <xref linkend="libpq-connect-host"/>. In particular, a Unix-domain socket connection is chosen if the host part is either empty or starts with a slash, otherwise a TCP/IP connection is initiated. Note, however, that the slash is a reserved character in the hierarchical part of the URI. So, to specify a non-standard Unix-domain socket directory, either omit the host specification in the URI and specify the host as a parameter, or percent-encode the path in the host component of the URI: <placeholder-1/>
ru: Компонент "host" интерпретируется в соответствии с описанием параметра <xref linkend="libpq-connect-host"/>. В частности, если этот компонент пуст или начинается с символа косой черты, выбирается соединение через доменные сокеты Unix, а в противном случае инициируется соединение по TCP/IP. Обратите внимание, однако, что символ косой черты в иерархической части URI является зарезервированным. Поэтому, чтобы указать нестандартный каталог Unix-сокета, нужно поступить одним из двух способов: не задавать сервер в URI и указать сервер в качестве параметра, либо закодировать путь в компоненте "host" с процентами: <placeholder-1/>

source: Parameter Key Words
ru: Ключевые слова-параметры

source: <primary>host name</primary>
ru: <primary>имя компьютера</primary>

source: <primary>Unix domain socket</primary>
ru: <primary>доменный сокет Unix</primary>

source: Name of host to connect to.<placeholder-1/> If this begins with a slash, it specifies Unix-domain communication rather than TCP/IP communication; the value is the name of the directory in which the socket file is stored. The default behavior when <literal>host</literal> is not specified is to connect to a Unix-domain socket<placeholder-2/> in <filename>/tmp</filename> (or whatever socket directory was specified when <productname>PostgreSQL</productname> was built). On machines without Unix-domain sockets, the default is to connect to <literal>localhost</literal>.
ru: Имя компьютера для подключения.<placeholder-1/> Если оно начинается с косой черты, то тогда предписывается установление связи через домен Unix, а не посредством TCP/IP; значением является имя каталога, в котором создаётся файл сокета. По умолчанию, когда <literal>host</literal> не указан, подключение производится к доменному сокету Unix <placeholder-2/> в каталоге <filename>/tmp</filename> (или в том каталоге, который был назначен при сборке <productname>PostgreSQL</productname>). В системах, не поддерживающих доменные сокеты Unix, подключение по умолчанию производится к <literal>localhost</literal>.

source: Numeric IP address of host to connect to. This should be in the standard IPv4 address format, e.g., <literal>172.28.40.9</literal>. If your machine supports IPv6, you can also use those addresses. TCP/IP communication is always used when a nonempty string is specified for this parameter.
ru: Числовой IP-адрес компьютера для подключения. Он должен быть представлен в стандартном формате адресов IPv4, например, <literal>172.28.40.9</literal>. Если ваша машина поддерживает IPv6, вы можете использовать и эти адреса. Связь по протоколу TCP/IP используется всегда, когда в качестве этого параметра передана непустая строка.

source: If <literal>host</literal> is specified without <literal>hostaddr</literal>, a host name lookup occurs.
ru: Если <literal>host</literal> указан, а <literal>hostaddr</literal> не указан, тогда выполняется поиск на сервере имён.

source: If <literal>hostaddr</literal> is specified without <literal>host</literal>, the value for <literal>hostaddr</literal> gives the server network address. The connection attempt will fail if the authentication method requires a host name.
ru: Если указан <literal>hostaddr</literal>, а <literal>host</literal> не указан, тогда значение <literal>hostaddr</literal> даёт сетевой адрес сервера. Попытка подключения завершится неудачей, если метод аутентификации требует наличия имени компьютера.

source: If both <literal>host</literal> and <literal>hostaddr</literal> are specified, the value for <literal>hostaddr</literal> gives the server network address. The value for <literal>host</literal> is ignored unless the authentication method requires it, in which case it will be used as the host name.
ru: Если указаны как <literal>host</literal>, так и <literal>hostaddr</literal>, тогда значение <literal>hostaddr</literal> даёт сетевой адрес сервера, а значение <literal>host</literal> игнорируется, если только метод аутентификации его не потребует. В таком случае оно будет использоваться в качестве имени компьютера.

source: Using <literal>hostaddr</literal> instead of <literal>host</literal> allows the application to avoid a host name look-up, which might be important in applications with time constraints. However, a host name is required for GSSAPI or SSPI authentication methods, as well as for <literal>verify-full</literal> SSL certificate verification. The following rules are used: <placeholder-1/> Note that authentication is likely to fail if <literal>host</literal> is not the name of the server at network address <literal>hostaddr</literal>. Also, note that <literal>host</literal> rather than <literal>hostaddr</literal> is used to identify the connection in <filename>~/.pgpass</filename> (see <xref linkend="libpq-pgpass"/>).
ru: Использование <literal>hostaddr</literal> вместо <literal>host</literal> позволяет приложению избежать поиска на сервере имён, что может быть важно для приложений, имеющих временные ограничения. Однако, имя компьютера требуется для методов аутентификации GSSAPI или SSPI, а также для проверки полномочий на основе SSL-сертификатов в режиме <literal>verify-full</literal>. Используются следующие правила: <placeholder-1/> Заметьте, что аутентификация может завершится неудачей, если <literal>host</literal> не является именем сервера, имеющего сетевой адрес <literal>hostaddr</literal>. Заметьте также, что <literal>host</literal>, а не <literal>hostaddr</literal> используется для того, чтобы идентифицировать соединение в <filename>~/.pgpass</filename> (см. <xref remap="4" linkend="libpq-pgpass"/>).

source: Without either a host name or host address, <application>libpq</application> will connect using a local Unix-domain socket; or on machines without Unix-domain sockets, it will attempt to connect to <literal>localhost</literal>.
ru: Если не указаны ни имя компьютера, ни его адрес, <application>libpq</application> будет производить подключение, используя локальный доменный сокет Unix; в системах, не поддерживающих сокеты Unix, она будет пытаться подключиться к <literal>localhost</literal>.

source: Port number to connect to at the server host, or socket file name extension for Unix-domain connections.<placeholder-1/>
ru: Номер порта для подключения на сервере или расширение имени файла-сокета для подключений на основе домена Unix.<placeholder-1/>

source: The database name. Defaults to be the same as the user name. In certain contexts, the value is checked for extended formats; see <xref linkend="libpq-connstring"/> for more details on those.
ru: Имя базы данных. По умолчанию оно совпадает с именем пользователя. В определённых контекстах это значение проверяется на соответствие расширенным форматам; см. <xref remap="4" linkend="libpq-connstring"/> для получения подробной информации.

source: <productname>PostgreSQL</productname> user name to connect as. Defaults to be the same as the operating system name of the user running the application.
ru: Имя пользователя <productname>PostgreSQL</productname>, используемое для подключения. По умолчанию используется то же имя, которое имеет в операционной системе пользователь, от лица которого выполняется приложение.

source: Password to be used if the server demands password authentication.
ru: Пароль, используемый в случае, когда сервер требует аутентификации по паролю.

source: Maximum wait for connection, in seconds (write as a decimal integer string). Zero or not specified means wait indefinitely. It is not recommended to use a timeout of less than 2 seconds.
ru: Максимальный период ожидания подключения, в секундах (записывается в виде строки, представляющей десятичное целое число).

source: This sets the <varname>client_encoding</varname> configuration parameter for this connection. In addition to the values accepted by the corresponding server option, you can use <literal>auto</literal> to determine the right encoding from the current locale in the client (<envar>LC_CTYPE</envar> environment variable on Unix systems).
ru: Этим устанавливается конфигурационный параметр <varname>client_encoding</varname> для данного подключения. В дополнение к значениям, которые принимает соответствующий параметр сервера, вы можете использовать значение <literal>auto</literal>. В этом случае правильная кодировка определяется на основе текущей локали на стороне клиента (в системах Unix это переменная системного окружения <envar>LC_CTYPE</envar>).

source: Specifies command-line options to send to the server at connection start. For example, setting this to <literal>-c geqo=off</literal> sets the session's value of the <varname>geqo</varname> parameter to <literal>off</literal>. Spaces within this string are considered to separate command-line arguments, unless escaped with a backslash (<literal>\</literal>); write <literal>\\</literal> to represent a literal backslash. For a detailed discussion of the available options, consult <xref linkend="runtime-config"/>.
ru: Задаёт параметры командной строки, которые будут отправлены серверу при установлении соединения. Например, значение <literal>-c geqo=off</literal> установит для параметра сеанса <varname>geqo</varname> значение <literal>off</literal>. Пробелы в этой строке считаются разделяющими аргументы командной строки, если только перед ними не стоит обратная косая черта (<literal>\</literal>); чтобы записать собственно обратную косую черту, её нужно продублировать (<literal>\\</literal>). Подробное описание возможных параметров можно найти в <xref remap="6" linkend="runtime-config"/>.

source: Specifies a value for the <xref linkend="guc-application-name"/> configuration parameter.
ru: Устанавливает значение для конфигурационного параметра <xref linkend="guc-application-name"/>.

source: Specifies a fallback value for the <xref linkend="guc-application-name"/> configuration parameter. This value will be used if no value has been given for <literal>application_name</literal> via a connection parameter or the <envar>PGAPPNAME</envar> environment variable. Specifying a fallback name is useful in generic utility programs that wish to set a default application name but allow it to be overridden by the user.
ru: Устанавливает альтернативное значение для конфигурационного параметра <xref linkend="guc-application-name"/>. Это значение будет использоваться, если для параметра <literal>application_name</literal> не было передано никакого значения с помощью параметров подключения или переменной системного окружения <envar>PGAPPNAME</envar>. Задание альтернативного имени полезно для универсальных программ-утилит, которые желают установить имя приложения по умолчанию, но позволяют пользователю изменить его.

source: Controls whether client-side TCP keepalives are used. The default value is 1, meaning on, but you can change this to 0, meaning off, if keepalives are not wanted. This parameter is ignored for connections made via a Unix-domain socket.
ru: Управляет использованием сообщений keepalive протокола TCP на стороне клиента. Значение по умолчанию равно 1, что означает использование сообщений. Вы можете изменить его на 0, если эти сообщения не нужны. Для соединений, установленных через доменный сокет Unix, этот параметр игнорируется.

source: Ignored (formerly, this specified where to send server debug output).
ru: Игнорируется (прежде он указывал, куда направить вывод отладочных сообщений сервера).

source: only try a non-<acronym>SSL</acronym> connection
ru: следует пытаться установить только соединение без использования <acronym>SSL</acronym>

source: first try a non-<acronym>SSL</acronym> connection; if that fails, try an <acronym>SSL</acronym> connection
ru: сначала следует попытаться установить соединение без использования <acronym>SSL</acronym>; если попытка будет неудачной, нужно попытаться установить <acronym>SSL</acronym>-соединение

source: <literal>prefer</literal> (default)
ru: <literal>prefer</literal> (по умолчанию)

source: first try an <acronym>SSL</acronym> connection; if that fails, try a non-<acronym>SSL</acronym> connection
ru: сначала следует попытаться установить <acronym>SSL</acronym>-соединение; если попытка будет неудачной, нужно попытаться установить соединение без использования <acronym>SSL</acronym>

source: only try an <acronym>SSL</acronym> connection. If a root CA file is present, verify the certificate in the same way as if <literal>verify-ca</literal> was specified
ru: следует попытаться установить только <acronym>SSL</acronym>-соединение. Если присутствует файл корневого центра сертификации, то нужно верифицировать сертификат таким же способом, как будто был указан параметр <literal>verify-ca</literal>

source: only try an <acronym>SSL</acronym> connection, and verify that the server certificate is issued by a trusted certificate authority (<acronym>CA</acronym>)
ru: следует попытаться установить только <acronym>SSL</acronym>-соединение, при этом проконтролировать, чтобы сертификат сервера был выпущен доверенным центром сертификации (<acronym>CA</acronym>)

source: only try an <acronym>SSL</acronym> connection, verify that the server certificate is issued by a trusted <acronym>CA</acronym> and that the requested server host name matches that in the certificate
ru: следует попытаться установить только <acronym>SSL</acronym>-соединение, при этом проконтролировать, чтобы сертификат сервера был выпущен доверенным центром сертификации (<acronym>CA</acronym>) и чтобы имя запрошенного сервера соответствовало имени в сертификате

source: This option determines whether or with what priority a secure <acronym>SSL</acronym> TCP/IP connection will be negotiated with the server. There are six modes: <placeholder-1/> See <xref linkend="libpq-ssl"/> for a detailed description of how these options work.
ru: Этот параметр определяет, будет ли согласовываться с сервером защищённое <acronym>SSL</acronym>-соединение по протоколу TCP/IP, и если да, то в какой очередности. Всего предусмотрено шесть режимов: <placeholder-1/> В <xref remap="6" linkend="libpq-ssl"/> приведено подробное описание работы этих режимов.

source: <primary>SSL</primary><secondary sortas="libpq">with libpq</secondary>
ru: <primary>SSL</primary> <secondary sortas="libpq">с libpq</secondary>

source: <literal>sslmode</literal> is ignored for Unix domain socket communication. If <productname>PostgreSQL</productname> is compiled without SSL support, using options <literal>require</literal>, <literal>verify-ca</literal>, or <literal>verify-full</literal> will cause an error, while options <literal>allow</literal> and <literal>prefer</literal> will be accepted but <application>libpq</application> will not actually attempt an <acronym>SSL</acronym> connection.<placeholder-1/>
ru: <literal>sslmode</literal> игнорируется при использовании сокетов домена Unix. Если <productname>PostgreSQL</productname> скомпилирован без поддержки SSL, использование параметров <literal>require</literal>, <literal>verify-ca</literal> или <literal>verify-full</literal> приведёт к ошибке, в то время как параметры <literal>allow</literal> и <literal>prefer</literal> будут приняты, но <application>libpq</application> в действительности не будет пытаться установить <acronym>SSL</acronym>-соединение.<placeholder-1/>

source: This option is deprecated in favor of the <literal>sslmode</literal> setting.
ru: Использовать этот параметр не рекомендуется, в качестве замены предлагается установить <literal>sslmode</literal>.

source: If set to 1, an <acronym>SSL</acronym> connection to the server is required (this is equivalent to <literal>sslmode</literal> <literal>require</literal>). <application>libpq</application> will then refuse to connect if the server does not accept an <acronym>SSL</acronym> connection. If set to 0 (default), <application>libpq</application> will negotiate the connection type with the server (equivalent to <literal>sslmode</literal> <literal>prefer</literal>). This option is only available if <productname>PostgreSQL</productname> is compiled with SSL support.
ru: Если установлено значение 1, то требуется <acronym>SSL</acronym>-соединение с сервером (это эквивалентно <literal>sslmode</literal> <literal>require</literal>). <application>libpq</application> в таком случае откажется подключаться, если сервер не принимает <acronym>SSL</acronym>-соединений. Если установлено значение 0 (по умолчанию), тогда <application>libpq</application> будет согласовывать тип подключения с сервером (эквивалентно <literal>sslmode</literal> <literal>prefer</literal>). Этот параметр доступен, если только <productname>PostgreSQL</productname> скомпилирован с поддержкой SSL.

source: If set to 1 (default), data sent over SSL connections will be compressed (this requires <productname>OpenSSL</productname> version 0.9.8 or later). If set to 0, compression will be disabled (this requires <productname>OpenSSL</productname> 1.0.0 or later). This parameter is ignored if a connection without SSL is made, or if the version of <productname>OpenSSL</productname> used does not support it.
ru: Если установлено значение 1 (по умолчанию), данные, пересылаемые через SSL-соединения, будут сжиматься (это требует <productname>OpenSSL</productname> версии 0.9.8 или более поздней). Если установлено значение 0, сжатие будет отключено (это требует <productname>OpenSSL</productname> версии 1.0.0 или более поздней). Этот параметр игнорируется, если выполнено подключение без SSL, или если используемая версия <productname>OpenSSL</productname> не поддерживает его.

source: Compression uses CPU time, but can improve throughput if the network is the bottleneck. Disabling compression can improve response time and throughput if CPU performance is the limiting factor.
ru: Сжатие требует процессорного времени, но может улучшить пропускную способность, если узким местом является сеть. Отключение сжатия может улучшить время отклика и пропускную способность, если ограничивающим фактором является производительность CPU.

source: This parameter specifies the file name of the client SSL certificate, replacing the default <filename>~/.postgresql/postgresql.crt</filename>. This parameter is ignored if an SSL connection is not made.
ru: Этот параметр предписывает имя файла для SSL-сертификата клиента, заменяющего файл по умолчанию <filename> ~/.postgresql/postgresql.crt</filename>. Этот параметр игнорируется, если SSL-подключение не выполнено.

source: This parameter specifies the location for the secret key used for the client certificate. It can either specify a file name that will be used instead of the default <filename>~/.postgresql/postgresql.key</filename>, or it can specify a key obtained from an external <quote>engine</quote> (engines are <productname>OpenSSL</productname> loadable modules). An external engine specification should consist of a colon-separated engine name and an engine-specific key identifier. This parameter is ignored if an SSL connection is not made.
ru: Этот параметр предписывает местоположение секретного ключа, используемого для сертификата клиента. Он может либо указывать имя файла, которое будет использоваться вместо имени по умолчанию <filename> ~/.postgresql/postgresql.key</filename>, либо он может указывать ключ, полученный от внешнего <quote>криптомодуля</quote> (криптомодули — это загружаемые модули <productname>OpenSSL</productname>). Спецификация внешнего криптомодуля должна состоять из имени модуля и ключевого идентификатора, зависящего от конкретного модуля, разделённых двоеточием. Этот параметр игнорируется, если SSL-подключение не выполнено.

source: This parameter specifies the name of a file containing SSL certificate authority (<acronym>CA</acronym>) certificate(s). If the file exists, the server's certificate will be verified to be signed by one of these authorities. The default is <filename>~/.postgresql/root.crt</filename>.
ru: Этот параметр указывает имя файла, содержащего SSL-сертификаты, выданные Центром сертификации (<acronym>CA</acronym>). Если файл существует, сертификат сервера будет проверен на предмет его подписания одним из этих центров. Имя по умолчанию — <filename> ~/.postgresql/root.crt</filename>.

source: This parameter specifies the file name of the SSL certificate revocation list (CRL). Certificates listed in this file, if it exists, will be rejected while attempting to authenticate the server's certificate. The default is <filename>~/.postgresql/root.crl</filename>.
ru: Этот параметр указывает имя файла, содержащего список отозванных SSL-сертификатов (CRL). Сертификаты, перечисленные в этом файле, если он существует, будут отвергаться при попытке установить подлинность сертификата сервера. Имя по умолчанию такое <filename>~/.postgresql/root.crl</filename>.
