Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: A sample LDAP entry that has been created with the LDIF file <placeholder-1/> might be queried with the following LDAP URL: <placeholder-2/>
ru: Простую запись LDAP, созданную из такого файла LDIF <placeholder-1/> можно запросить из каталога LDAP, указав следующий URL: <placeholder-2/>

source: # only host and port are stored in LDAP, specify dbname and user explicitly [customerdb] dbname=customer user=appuser ldap://ldap.acme.com/cn=dbserver,cn=hosts?pgconnectinfo?base?(objectclass=*)
ru: # в LDAP хранится только имя и порт сервера; имя базы и пользователя нужно задать явно [customerdb] dbname=customer user=appuser ldap://ldap.acme.com/cn=dbserver,cn=hosts?pgconnectinfo?base?(objectclass=*)

source: You can also mix regular service file entries with LDAP lookups. A complete example for a stanza in <filename>pg_service.conf</filename> would be: <placeholder-1/>
ru: Также возможно сочетать обычные записи в файле служб с поиском в LDAP. Полный пример описания службы в <filename>pg_service.conf</filename> может быть таким: <placeholder-1/>

source: SSL Support
ru: Поддержка SSL

source: <productname>PostgreSQL</productname> has native support for using <acronym>SSL</acronym> connections to encrypt client/server communications for increased security. See <xref linkend="ssl-tcp"/> for details about the server-side <acronym>SSL</acronym> functionality.
ru: <productname>PostgreSQL</productname> реализует собственную поддержку <acronym>SSL</acronym>-подключений для шифрования клиент-серверного взаимодействия в качестве меры безопасности. Подробнее функциональность <acronym>SSL</acronym> на стороне сервера описывается в <xref remap="6" linkend="ssl-tcp"/>.

source: <application>libpq</application> reads the system-wide <productname>OpenSSL</productname> configuration file. By default, this file is named <filename>openssl.cnf</filename> and is located in the directory reported by <literal>openssl version -d</literal>. This default can be overridden by setting environment variable <envar>OPENSSL_CONF</envar> to the name of the desired configuration file.
ru: Библиотека <application>libpq</application> читает системный файл конфигурации <productname>OpenSSL</productname>. По умолчанию этот файл называется <filename>openssl.cnf</filename> и находится в каталоге, который сообщает команда <literal>openssl version -d</literal>. Если требуется указать другое расположение файла конфигурации, его можно задать в переменной окружения <envar>OPENSSL_CONF</envar>.

source: Client Verification of Server Certificates
ru: Проверка сертификатов сервера на стороне клиента

source: By default, <productname>PostgreSQL</productname> will not perform any verification of the server certificate. This means that it is possible to spoof the server identity (for example by modifying a DNS record or by taking over the server IP address) without the client knowing. In order to prevent spoofing, <acronym>SSL</acronym> certificate verification must be used.
ru: По умолчанию <productname>PostgreSQL</productname> не выполняет никакие проверки сертификата сервера. Это означает, что клиента можно ввести в заблуждение, подменив сервер (например, изменив запись в DNS или заняв его IP-адрес). Чтобы предотвратить подобную подмену, необходимо включить проверку сертификатов <acronym>SSL</acronym>.

source: If the parameter <literal>sslmode</literal> is set to <literal>verify-ca</literal>, libpq will verify that the server is trustworthy by checking the certificate chain up to a trusted certificate authority (<acronym>CA</acronym>). If <literal>sslmode</literal> is set to <literal>verify-full</literal>, libpq will <emphasis>also</emphasis> verify that the server host name matches its certificate. The SSL connection will fail if the server certificate cannot be verified. <literal>verify-full</literal> is recommended in most security-sensitive environments.
ru: Если в <literal>sslmode</literal> выбран режим <literal>verify-ca</literal>, libpq будет определять, можно ли доверять серверу, проверяя всю цепочку сертификатов до доверенного центра сертификации (<acronym>ЦС</acronym>). Если режим <literal>sslmode</literal> — <literal>verify-full</literal>, libpq будет <emphasis>также</emphasis> проверять, соответствует ли имя сервера имени в сертификате. Подключение SSL не будет установлено, если проверить сертификат сервера не удастся. В максимально защищённых окружениях рекомендуется использовать режим <literal>verify-full</literal>.

source: In <literal>verify-full</literal> mode, the host name is matched against the certificate's Subject Alternative Name attribute(s), or against the Common Name attribute if no Subject Alternative Name of type <literal>dNSName</literal> is present. If the certificate's name attribute starts with an asterisk (<literal>*</literal>), the asterisk will be treated as a wildcard, which will match all characters <emphasis>except</emphasis> a dot (<literal>.</literal>). This means the certificate will not match subdomains. If the connection is made using an IP address instead of a host name, the IP address will be matched (without doing any DNS lookups).
ru: В режиме <literal>verify-full</literal> имя компьютера сверяется с атрибутом (или атрибутами) Subject Alternative Name (Альтернативное имя субъекта) в сертификате или с атрибутом Common Name (Общее имя), если в сертификате отсутствует атрибут Subject Alternative Name типа <literal>dNSName</literal>. Если атрибут имени сертификата начинается со звёздочки (<literal>*</literal>), звёздочка воспринимается как подстановочный знак и ей будут соответствовать все символы, <emphasis>кроме</emphasis> точки (<literal>.</literal>). Это означает, что такой сертификат не будет соответствовать поддоменам. Если подключение устанавливается по IP-адресу, а не по имени компьютера, проверяться будет IP-адрес (без поиска в DNS).

source: To allow server certificate verification, the certificate(s) of one or more trusted <acronym>CA</acronym>s must be placed in the file <filename>~/.postgresql/root.crt</filename> in the user's home directory. If intermediate <acronym>CA</acronym>s appear in <filename>root.crt</filename>, the file must also contain certificate chains to their root <acronym>CA</acronym>s. (On Microsoft Windows the file is named <filename>%APPDATA%\postgresql\root.crt</filename>.)
ru: Чтобы можно было проверить сертификат сервера, файл <filename>~/.postgresql/root.crt</filename> в домашнем каталоге пользователя должен содержать сертификат(ы) одного или нескольких доверенных <acronym>ЦС</acronym>. Если <filename>root.crt</filename> содержит сертификаты промежуточных <acronym>ЦС</acronym>, он также должен содержать цепочки сертификатов до их корневого <acronym>ЦС</acronym>. (В Microsoft Windows этот файл называется <filename>%APPDATA%\postgresql\root.crt</filename>.)

source: Certificate Revocation List (CRL) entries are also checked if the file <filename>~/.postgresql/root.crl</filename> exists (<filename>%APPDATA%\postgresql\root.crl</filename> on Microsoft Windows).
ru: Если существует файл <filename>~/.postgresql/root.crl</filename> (или <filename>%APPDATA%\postgresql\root.crl</filename> в Microsoft Windows), при проверке также учитывается содержащийся в нём список отозванных сертификатов (CRL, Certificate Revocation List).

source: The location of the root certificate file and the CRL can be changed by setting the connection parameters <literal>sslrootcert</literal> and <literal>sslcrl</literal> or the environment variables <envar>PGSSLROOTCERT</envar> and <envar>PGSSLCRL</envar>.
ru: Размещение файла корневых сертификатов и CRL можно поменять, задав параметры соединения <literal>sslrootcert</literal> и <literal>sslcrl</literal> или переменные окружения <envar>PGSSLROOTCERT</envar> и <envar>PGSSLCRL</envar>, соответственно.

source: For backwards compatibility with earlier versions of PostgreSQL, if a root CA file exists, the behavior of <literal>sslmode</literal>=<literal>require</literal> will be the same as that of <literal>verify-ca</literal>, meaning the server certificate is validated against the CA. Relying on this behavior is discouraged, and applications that need certificate validation should always use <literal>verify-ca</literal> or <literal>verify-full</literal>.
ru: Для обратной совместимости с предыдущими версиями PostgreSQL, при наличии файла с сертификатами корневых ЦС поведение режима <literal>sslmode</literal>=<literal>require</literal> не отличается от режима <literal>verify-ca</literal>, то есть сертификат сервера будет проверяться по сертификату ЦС. Полагаться на это поведение не рекомендуется — приложения, которым нужно проверять сертификат, должны всегда выбирать режим <literal>verify-ca</literal> или <literal>verify-full</literal>.

source: Client Certificates
ru: Клиентские сертификаты

source: If the server requests a trusted client certificate, <application>libpq</application> will send the certificate stored in file <filename>~/.postgresql/postgresql.crt</filename> in the user's home directory. The certificate must be signed by one of the certificate authorities (<acronym>CA</acronym>) trusted by the server. A matching private key file <filename>~/.postgresql/postgresql.key</filename> must also be present. The private key file must not allow any access to world or group; achieve this by the command <command>chmod 0600 ~/.postgresql/postgresql.key</command>. On Microsoft Windows these files are named <filename>%APPDATA%\postgresql\postgresql.crt</filename> and <filename>%APPDATA%\postgresql\postgresql.key</filename>, and there is no special permissions check since the directory is presumed secure. The location of the certificate and key files can be overridden by the connection parameters <literal>sslcert</literal> and <literal>sslkey</literal> or the environment variables <envar>PGSSLCERT</envar> and <envar>PGSSLKEY</envar>.
ru: Если сервер запрашивает доверенный клиентский сертификат, <application>libpq</application> передаёт ему сертификат из файла <filename>~/.postgresql/postgresql.crt</filename> в домашнем каталоге пользователя. Этот сертификат должен быть подписан одним из центров сертификации (<acronym>ЦС</acronym>), доверенным для сервера. Также должен присутствовать закрытый ключ в файле <filename>~/.postgresql/postgresql.key</filename>. Файл закрытого ключа не должен быть доступен всем или группе; этого можно добиться командой <command>chmod 0600 ~/.postgresql/postgresql.key</command>. В Microsoft Windows эти файлы называются <filename>%APPDATA%\postgresql\postgresql.crt</filename> и <filename>%APPDATA%\postgresql\postgresql.key</filename>, и никакие специальные проверки не производятся, так как предполагается, что этот каталог безопасен. Размещение файлов сертификата и ключа можно переопределить параметрами соединения <literal>sslcert</literal> и <literal>sslkey</literal>, либо переменными окружения <envar>PGSSLCERT</envar> и <envar>PGSSLKEY</envar>, соответственно.

source: In some cases, the client certificate might be signed by an <quote>intermediate</quote> certificate authority, rather than one that is directly trusted by the server. To use such a certificate, append the certificate of the signing authority to the <filename>postgresql.crt</filename> file, then its parent authority's certificate, and so on up to a certificate authority, <quote>root</quote> or <quote>intermediate</quote>, that is trusted by the server, i.e. signed by a certificate in the server's <filename>root.crt</filename> file.
ru: В некоторых случаях сертификат клиента может подписываться <quote>промежуточным</quote> центром сертификации, сам сертификат не обязательно должен быть доверенным для сервера. Чтобы использовать такой сертификат, нужно добавить в файл <filename>postgresql.crt</filename> сертификат выдавшего его центра сертификации, затем сертификат вышестоящего центра и так далее, до сертификата <quote>корневого</quote> или <quote>промежуточного</quote> центра, которому доверяет сервер. Сервер считает сертификат доверенным, если он подписан сертификатом, содержащимся в его собственном файле <filename>root.crt</filename>.

source: Note that the client's <filename>~/.postgresql/root.crt</filename> lists the top-level CAs that are considered trusted for signing server certificates. In principle it need not list the CA that signed the client's certificate, though in most cases that CA would also be trusted for server certificates.
ru: Заметьте, что файл <filename>~/.postgresql/root.crt</filename> на клиенте содержит сертификаты центров сертификации верхнего уровня, которые считаются доверенными для подписания серверных сертификатов. В принципе в нём может отсутствовать сертификат ЦС, подписавшего сертификат клиента, хотя в большинстве случаев этот ЦС также будет доверенным для клиентских сертификатов.

source: Protection Provided in Different Modes
ru: Защита, обеспечиваемая в различных режимах

source: Eavesdropping
ru: Прослушивание

source: If a third party can examine the network traffic between the client and the server, it can read both connection information (including the user name and password) and the data that is passed. <acronym>SSL</acronym> uses encryption to prevent this.
ru: Если третья сторона может прослушивать сетевой трафик между клиентом и сервером, она может получить как информацию соединения (включая имя пользователя и пароль), так и передаваемые данные. Чтобы защититься от этого, <acronym>SSL</acronym> шифрует трафик.

source: Man in the middle (<acronym>MITM</acronym>)
ru: Посредник (<acronym>MITM</acronym>)

source: If a third party can modify the data while passing between the client and server, it can pretend to be the server and therefore see and modify data <emphasis>even if it is encrypted</emphasis>. The third party can then forward the connection information and data to the original server, making it impossible to detect this attack. Common vectors to do this include DNS poisoning and address hijacking, whereby the client is directed to a different server than intended. There are also several other attack methods that can accomplish this. <acronym>SSL</acronym> uses certificate verification to prevent this, by authenticating the server to the client.
ru: Если третья сторона может модифицировать данные, передаваемые между клиентом и сервером, она может представиться сервером и, таким образом, сможет видеть и модифицировать данные, <emphasis>даже если они зашифрованы</emphasis>. Третья сторона затем может воспроизводить характеристики соединения и данные для подлинного сервера, что сделает невозможным обнаружение этой атаки. Векторами такой атаки может быть &laquo;отравление&raquo; DNS и подмена адресов, в результате чего клиент будет обращаться не к тому серверу, к которому нужно. Также есть несколько других вариантов реализации этой атаки. Для защиты в <acronym>SSL</acronym> применяется проверка сертификатов, в результате которой сервер доказывает свою подлинность клиенту.

source: Impersonation
ru: Олицетворение

source: If a third party can pretend to be an authorized client, it can simply access data it should not have access to. Typically this can happen through insecure password management. <acronym>SSL</acronym> uses client certificates to prevent this, by making sure that only holders of valid certificates can access the server.
ru: Если третья сторона может представляться авторизованным клиентом, она может просто обращаться к данным, к которым не должна иметь доступа. Обычно это происходит вследствие небезопасного управления паролями. В <acronym>SSL</acronym> для предотвращения этой угрозы используются клиентские сертификаты, гарантирующие, что к серверу могут обращаться только владельцы действительных сертификатов.

source: The different values for the <literal>sslmode</literal> parameter provide different levels of protection. SSL can provide protection against three types of attacks: <placeholder-1/>
ru: Разные значения параметра <literal>sslmode</literal> обеспечивают разные уровни защиты. SSL позволяет защититься от следующих типов атак: <placeholder-1/>

source: For a connection to be known secure, SSL usage must be configured on <emphasis>both the client and the server</emphasis> before the connection is made. If it is only configured on the server, the client may end up sending sensitive information (e.g. passwords) before it knows that the server requires high security. In libpq, secure connections can be ensured by setting the <literal>sslmode</literal> parameter to <literal>verify-full</literal> or <literal>verify-ca</literal>, and providing the system with a root certificate to verify against. This is analogous to using an <literal>https</literal> <acronym>URL</acronym> for encrypted web browsing.
ru: Чтобы соединение было гарантированно безопасным, SSL должен быть настроен <emphasis>на клиенте и на сервере</emphasis>, прежде чем будет установлено соединение. Если он настроен только на сервере, клиент может начать передавать важную информацию (например, пароли), до того как поймёт, что сервер требует высокого уровня безопасности. В libpq для установления безопасных соединений нужно задать для параметра <literal>sslmode</literal> значение <literal>verify-full</literal> или <literal>verify-ca</literal> и предоставить системе корневой сертификат для проверки. В качестве аналогии можно привести использование адреса с <literal>https</literal> для безопасного просмотра веб-содержимого.

source: Once the server has been authenticated, the client can pass sensitive data. This means that up until this point, the client does not need to know if certificates will be used for authentication, making it safe to specify that only in the server configuration.
ru: Когда подлинность сервера подтверждена, клиент может передавать конфиденциальные данные. Это значит, что до этого момента клиенту не нужно знать, применяются ли сертификаты для аутентификации, так что настройка использования сертификатов только на стороне сервера не угрожает безопасности.

source: All <acronym>SSL</acronym> options carry overhead in the form of encryption and key-exchange, so there is a trade-off that has to be made between performance and security. <xref linkend="libpq-ssl-sslmode-statements"/> illustrates the risks the different <literal>sslmode</literal> values protect against, and what statement they make about security and overhead.
ru: Все варианты использования <acronym>SSL</acronym> подразумевают издержки шифрования и обмена ключами, что порождает необходимость выбора между производительностью и безопасностью. В <xref remap="6" linkend="libpq-ssl-sslmode-statements"/> описываются риски, от которых защищают различные варианты <literal>sslmode</literal>, и приводятся утверждения относительно защиты и издержек.

source: SSL Mode Descriptions
ru: Описания режимов SSL

source: Eavesdropping protection
ru: Защита от прослушивания

source: <acronym>MITM</acronym> protection
ru: Защита от <acronym>MITM</acronym>

source: Statement
ru: Утверждение

source: No
ru: Нет

source: I don't care about security, and I don't want to pay the overhead of encryption.
ru: Мне не важна безопасность и я не приемлю издержки, связанные с шифрованием.

source: Maybe
ru: Возможно

source: I don't care about security, but I will pay the overhead of encryption if the server insists on it.
ru: Мне не важна безопасность, но я приемлю издержки, связанные с шифрованием, если на этом настаивает сервер.

source: I don't care about encryption, but I wish to pay the overhead of encryption if the server supports it.
ru: Мне не важна безопасность, но я предпочитаю шифрование (и приемлю связанные издержки), если это поддерживает сервер.

source: Yes
ru: Да

source: I want my data to be encrypted, and I accept the overhead. I trust that the network will make sure I always connect to the server I want.
ru: Я хочу, чтобы мои данные шифровались, и я приемлю сопутствующие издержки. Я доверяю сети в том, что она обеспечивает подключение к нужному серверу.

source: <literal>Depends on CA</literal>-policy
ru: Зависит от политики <acronym>ЦС</acronym>

source: I want my data encrypted, and I accept the overhead. I want to be sure that I connect to a server that I trust.
ru: Я хочу, чтобы мои данные шифровались, и я приемлю сопутствующие издержки. Мне нужна уверенность в том, что я подключаюсь к доверенному серверу.

source: I want my data encrypted, and I accept the overhead. I want to be sure that I connect to a server I trust, and that it's the one I specify.
ru: Я хочу, чтобы мои данные шифровались, и я приемлю сопутствующие издержки. Мне нужна уверенность в том, что я подключаюсь к доверенному серверу и это именно указанный мной сервер.

source: The difference between <literal>verify-ca</literal> and <literal>verify-full</literal> depends on the policy of the root <acronym>CA</acronym>. If a public <acronym>CA</acronym> is used, <literal>verify-ca</literal> allows connections to a server that <emphasis>somebody else</emphasis> may have registered with the <acronym>CA</acronym>. In this case, <literal>verify-full</literal> should always be used. If a local <acronym>CA</acronym> is used, or even a self-signed certificate, using <literal>verify-ca</literal> often provides enough protection.
ru: Различие вариантов <literal>verify-ca</literal> и <literal>verify-full</literal> зависит от характера корневого <acronym>ЦС</acronym>. Если используется публичный <acronym>ЦС</acronym>, режим <literal>verify-ca</literal> допускает подключение к серверу с сертификатом, который получил <emphasis>кто угодно</emphasis> в этом <acronym>ЦС</acronym>. В такой ситуации нужно всегда использовать режим <literal>verify-full</literal>. Если же используется локальный <acronym>ЦС</acronym> или даже самоподписанный сертификат, режим <literal>verify-ca</literal> обычно обеспечивает достаточную защиту.

source: The default value for <literal>sslmode</literal> is <literal>prefer</literal>. As is shown in the table, this makes no sense from a security point of view, and it only promises performance overhead if possible. It is only provided as the default for backward compatibility, and is not recommended in secure deployments.
ru: По умолчанию параметр <literal>sslmode</literal> имеет значение <literal>prefer</literal>. Как показано в этой таблице, он не имеет большого смысла с точки зрения безопасности, и даёт только выигрыш в производительности, если это возможно. Он выбран по умолчанию для обратной совместимости и не рекомендуется для защищённых окружений.

source: SSL Client File Usage
ru: Файлы, используемые клиентом SSL

source: <xref linkend="libpq-ssl-file-usage"/> summarizes the files that are relevant to the SSL setup on the client.
ru: В <xref remap="6" linkend="libpq-ssl-file-usage"/> перечислены файлы, имеющие отношение к настройке SSL на стороне клиента.

source: Libpq/Client SSL File Usage
ru: Файлы, используемые клиентом SSL/libpq

source: File
ru: Файл

source: Contents
ru: Содержимое

source: Effect
ru: Назначение

source: client certificate
ru: сертификат клиента

source: requested by server
ru: запрашивается сервером

source: client private key
ru: закрытый ключ клиента

source: proves client certificate sent by owner; does not indicate certificate owner is trustworthy
ru: подтверждает клиентский сертификат, передаваемый владельцем; не гарантирует, что владелец сертификата заслуживает доверия

source: trusted certificate authorities
ru: сертификаты доверенных ЦС

source: checks that server certificate is signed by a trusted certificate authority
ru: позволяет проверить, что сертификат сервера подписан доверенным центром сертификации

source: certificates revoked by certificate authorities
ru: сертификаты, отозванные центрами сертификации

source: server certificate must not be on this list
ru: сертификат сервера должен отсутствовать в этом списке

source: SSL Library Initialization
ru: Инициализация библиотеки SSL
