Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: Prepares the encrypted form of a <productname>PostgreSQL</productname> password. <synopsis> char * PQencryptPassword(const char *passwd, const char *user); </synopsis> This function is intended to be used by client applications that wish to send commands like <literal>ALTER USER joe PASSWORD 'pwd'</literal>. It is good practice not to send the original cleartext password in such a command, because it might be exposed in command logs, activity displays, and so on. Instead, use this function to convert the password to encrypted form before it is sent. The arguments are the cleartext password, and the SQL name of the user it is for. The return value is a string allocated by <function>malloc</function>, or <symbol>NULL</symbol> if out of memory. The caller can assume the string doesn't contain any special characters that would require escaping. Use <function>PQfreemem</function> to free the result when done with it.
ru: Подготавливает зашифрованную форму пароля <productname>PostgreSQL</productname>. <synopsis> char * PQencryptPassword(const char *passwd, const char *user); </synopsis> Эта функция предназначена для клиентских приложений, желающих передавать команды вида <literal>ALTER USER joe PASSWORD 'pwd'</literal>. В такой команде лучше не передавать исходный пароль открытым текстом, так как он может появиться в рабочих журналах, мониторе активности и т. д. Вместо этого, воспользуйтесь данной функцией и переведите пароль в зашифрованную форму, прежде чем передавать его. В аргументах ей передаётся пароль в открытом виде и имя пользователя SQL, для которого он предназначен. Возвращает она строку, выделенную функцией <function>malloc</function>, или <symbol>NULL</symbol> в случае нехватки памяти. Вызывающий код может рассчитывать на то, что в этой строке не будет специальных символов, требующих экранирования. Завершив работу с этой строкой, вызовите <function>PQfreemem</function>, чтобы освободить её.

source: Constructs an empty <structname>PGresult</structname> object with the given status. <synopsis> PGresult *PQmakeEmptyPGresult(PGconn *conn, ExecStatusType status); </synopsis>
ru: Конструирует пустой объект <structname>PGresult</structname> с указанным состоянием. <synopsis> PGresult *PQmakeEmptyPGresult(PGconn *conn, ExecStatusType status); </synopsis>

source: This is <application>libpq</application>'s internal function to allocate and initialize an empty <structname>PGresult</structname> object. This function returns <symbol>NULL</symbol> if memory could not be allocated. It is exported because some applications find it useful to generate result objects (particularly objects with error status) themselves. If <parameter>conn</parameter> is not null and <parameter>status</parameter> indicates an error, the current error message of the specified connection is copied into the <structname>PGresult</structname>. Also, if <parameter>conn</parameter> is not null, any event procedures registered in the connection are copied into the <structname>PGresult</structname>. (They do not get <literal>PGEVT_RESULTCREATE</literal> calls, but see <function>PQfireResultCreateEvents</function>.) Note that <function>PQclear</function> should eventually be called on the object, just as with a <structname>PGresult</structname> returned by <application>libpq</application> itself.
ru: Это внутренняя функция <application>libpq</application>, выделяющая память и инициализирующая пустой объект <structname>PGresult</structname>. Эта функция возвращает <symbol>NULL</symbol>, если не может выделить память. Она сделана экспортируемой, так как некоторые приложения находят полезным создавать объекты результатов (в частности, объекты с состоянием ошибки) самостоятельно. Если в <parameter>conn</parameter> передаётся не null и <parameter>status</parameter> указывает на ошибку, в <structname>PGresult</structname> копируется текущее сообщение об ошибке для заданного соединения. Также, если в <parameter>conn</parameter> передаётся не null, в <structname>PGresult</structname> копируются все процедуры событий, зарегистрированные для этого соединения. (При этом вызовы <literal>PGEVT_RESULTCREATE</literal> не выполняются; см. описание <function>PQfireResultCreateEvents</function>.) Заметьте, что в конце для этого объекта следует вызвать <function>PQclear</function>, как и для объекта <structname>PGresult</structname>, возвращённого самой библиотекой <application>libpq</application>.

source: Fires a <literal>PGEVT_RESULTCREATE</literal> event (see <xref linkend="libpq-events"/>) for each event procedure registered in the <structname>PGresult</structname> object. Returns non-zero for success, zero if any event procedure fails. <synopsis> int PQfireResultCreateEvents(PGconn *conn, PGresult *res); </synopsis>
ru: Вызывает событие <literal>PGEVT_RESULTCREATE</literal> (см. <xref remap="4" linkend="libpq-events"/>) для каждой процедуры событий, зарегистрированной в объекте <structname>PGresult</structname>. Возвращает ненулевое значение в случае успеха или ноль в случае ошибки в одной из процедур. <synopsis> int PQfireResultCreateEvents(PGconn *conn, PGresult *res); </synopsis>

source: The <literal>conn</literal> argument is passed through to event procedures but not used directly. It can be <symbol>NULL</symbol> if the event procedures won't use it.
ru: Аргумент <literal>conn</literal> передаётся процедурам событий, но непосредственно не используется. Он может быть равен <symbol>NULL</symbol>, если он не нужен процедурам событий.

source: Event procedures that have already received a <literal>PGEVT_RESULTCREATE</literal> or <literal>PGEVT_RESULTCOPY</literal> event for this object are not fired again.
ru: Процедуры событий, уже получившие событие <literal>PGEVT_RESULTCREATE</literal> или <literal>PGEVT_RESULTCOPY</literal> для этого объекта, больше не вызываются.

source: The main reason that this function is separate from <function>PQmakeEmptyPGresult</function> is that it is often appropriate to create a <structname>PGresult</structname> and fill it with data before invoking the event procedures.
ru: Основная причина отделения этой функции от <function>PQmakeEmptyPGresult</function> в том, что часто требуется создать объект <structname>PGresult</structname> и наполнить его данными, прежде чем вызывать процедуры событий.

source: Makes a copy of a <structname>PGresult</structname> object. The copy is not linked to the source result in any way and <function>PQclear</function> must be called when the copy is no longer needed. If the function fails, <symbol>NULL</symbol> is returned. <synopsis> PGresult *PQcopyResult(const PGresult *src, int flags); </synopsis>
ru: Создаёт копию объекта <structname>PGresult</structname>. Эта копия никак не связана с исходным результатом и поэтому, когда она становится не нужна, необходимо вызвать <function>PQclear</function>. Если функция завершается ошибкой, она возвращает <symbol>NULL</symbol>. <synopsis> PGresult *PQcopyResult(const PGresult *src, int flags); </synopsis>

source: This is not intended to make an exact copy. The returned result is always put into <literal>PGRES_TUPLES_OK</literal> status, and does not copy any error message in the source. (It does copy the command status string, however.) The <parameter>flags</parameter> argument determines what else is copied. It is a bitwise OR of several flags. <literal>PG_COPYRES_ATTRS</literal> specifies copying the source result's attributes (column definitions). <literal>PG_COPYRES_TUPLES</literal> specifies copying the source result's tuples. (This implies copying the attributes, too.) <literal>PG_COPYRES_NOTICEHOOKS</literal> specifies copying the source result's notify hooks. <literal>PG_COPYRES_EVENTS</literal> specifies copying the source result's events. (But any instance data associated with the source is not copied.)
ru: Создаваемая копия не будет точной. В возвращаемый результат всегда помещается состояние <literal>PGRES_TUPLES_OK</literal> и в него не копируются никакие сообщения об ошибках из исходного объекта. (Однако в него копируется строка состояния команды.) Что ещё в него будет копироваться, определяет аргумент <parameter>flags</parameter>, в котором складываются несколько флагов. Флаг <literal>PG_COPYRES_ATTRS</literal> включает копирование атрибутов исходного объекта (определений столбцов), а флаг <literal>PG_COPYRES_TUPLES</literal> включает копирование кортежей из исходного объекта (при этом также копируются и атрибуты.) Флаг <literal>PG_COPYRES_NOTICEHOOKS</literal> включает копирование обработчиков замечаний, а флаг <literal>PG_COPYRES_EVENTS</literal> — событий из исходного объекта результата. (Но любые данные, связанные с экземпляром исходного объекта, не копируются.)

source: Sets the attributes of a <structname>PGresult</structname> object. <synopsis> int PQsetResultAttrs(PGresult *res, int numAttributes, PGresAttDesc *attDescs); </synopsis>
ru: Устанавливает атрибуты объекта <structname>PGresult</structname>. <synopsis> int PQsetResultAttrs(PGresult *res, int numAttributes, PGresAttDesc *attDescs); </synopsis>

source: The provided <parameter>attDescs</parameter> are copied into the result. If the <parameter>attDescs</parameter> pointer is <symbol>NULL</symbol> or <parameter>numAttributes</parameter> is less than one, the request is ignored and the function succeeds. If <parameter>res</parameter> already contains attributes, the function will fail. If the function fails, the return value is zero. If the function succeeds, the return value is non-zero.
ru: Предоставленная структура <parameter>attDescs</parameter> копируется в результат. Если указатель <parameter>attDescs</parameter> равен <symbol>NULL</symbol> или <parameter>numAttributes</parameter> меньше одного, запрос игнорируется и функция выполняется без ошибки. Если <parameter>res</parameter> уже содержит атрибуты, функция завершается ошибкой. В случае ошибки функция возвращает ноль, а в обратном случае — ненулевое значение.

source: Sets a tuple field value of a <structname>PGresult</structname> object. <synopsis> int PQsetvalue(PGresult *res, int tup_num, int field_num, char *value, int len); </synopsis>
ru: Устанавливает значение поля кортежа в объекте <structname>PGresult</structname>. <synopsis> int PQsetvalue(PGresult *res, int tup_num, int field_num, char *value, int len); </synopsis>

source: The function will automatically grow the result's internal tuples array as needed. However, the <parameter>tup_num</parameter> argument must be less than or equal to <function>PQntuples</function>, meaning this function can only grow the tuples array one tuple at a time. But any field of any existing tuple can be modified in any order. If a value at <parameter>field_num</parameter> already exists, it will be overwritten. If <parameter>len</parameter> is -1 or <parameter>value</parameter> is <symbol>NULL</symbol>, the field value will be set to an SQL null value. The <parameter>value</parameter> is copied into the result's private storage, thus is no longer needed after the function returns. If the function fails, the return value is zero. If the function succeeds, the return value is non-zero.
ru: Эта функция автоматически увеличивает внутренний массив кортежей при необходимости. Однако значение <parameter>tup_num</parameter> должно быть меньше или равно <function>PQntuples</function>, что означает, что эта функция может увеличивать массив кортежей только на один кортеж. Но в существующем кортеже любые поля могут изменяться в любом порядке. Если значение в поле с номером <parameter>field_num</parameter> уже существует, оно будет перезаписано. Если <parameter>len</parameter> равно -1 или <parameter>value</parameter> равно <symbol>NULL</symbol>, в поле будет записано значение SQL NULL. Устанавливаемое значение (<parameter>value</parameter>) копируется в закрытую область объекта результата, так что от него можно избавиться после завершения функции. Если функция завершается ошибкой, она возвращает ноль, а в обратном случае — ненулевое значение.

source: Allocate subsidiary storage for a <structname>PGresult</structname> object. <synopsis> void *PQresultAlloc(PGresult *res, size_t nBytes); </synopsis>
ru: Выделяет подчинённую область памяти для объекта <structname>PGresult</structname>. <synopsis> void *PQresultAlloc(PGresult *res, size_t nBytes); </synopsis>

source: Any memory allocated with this function will be freed when <parameter>res</parameter> is cleared. If the function fails, the return value is <symbol>NULL</symbol>. The result is guaranteed to be adequately aligned for any type of data, just as for <function>malloc</function>.
ru: Любая память, выделенная этой функцией, будет освобождена при очистке объекта <parameter>res</parameter>. В случае ошибки эта функция возвращает <symbol>NULL</symbol>. Результат гарантированно выравнивается должным образом для любого типа данных, как и при <function>malloc</function>.

source: Return the version of <productname>libpq</productname> that is being used. <synopsis> int PQlibVersion(void); </synopsis>
ru: Возвращает версию используемой библиотеки <productname>libpq</productname>. <synopsis> int PQlibVersion(void); </synopsis>

source: The result of this function can be used to determine, at run time, if specific functionality is available in the currently loaded version of libpq. The function can be used, for example, to determine which connection options are available for <function>PQconnectdb</function> or if the <literal>hex</literal> <type>bytea</type> output added in PostgreSQL 9.0 is supported.
ru: По результату этой функции можно во время выполнения определить, предоставляется ли определённая функциональность загруженной в данный момент версией libpq. Эта функция может использоваться, например, чтобы понять, какие параметры соединения может принять <function>PQconnectdb</function> или поддерживается ли вывод <type>bytea</type> в формате <literal>hex</literal>, появившийся в PostgreSQL 9.0.

source: The number is formed by converting the major, minor, and revision numbers into two-decimal-digit numbers and appending them together. For example, version 9.1 will be returned as 90100, and version 9.1.2 will be returned as 90102 (leading zeroes are not shown).
ru: Это число формируется в результате преобразования номеров старшей, дополнительной и корректирующей версии в числа из двух цифр и соединения их вместе. Например, для версии 9.1 будет возвращено 90100, а для версии 9.1.2 — 90102 (ведущие нули не показываются).

source: This function appeared in <productname>PostgreSQL</productname> version 9.1, so it cannot be used to detect required functionality in earlier versions, since linking to it will create a link dependency on version 9.1.
ru: Эта функция появилась в <productname>PostgreSQL</productname> версии 9.1, поэтому с её помощью нельзя проверить функциональность предыдущих версий, так как при компоновке с ней будет создана зависимость от версии 9.1.

source: Notice Processing
ru: Обработка замечаний

source: <primary>notice processing</primary> <secondary>in libpq</secondary>
ru: <primary>обработка замечаний</primary> <secondary>в libpq</secondary>

source: Notice and warning messages generated by the server are not returned by the query execution functions, since they do not imply failure of the query. Instead they are passed to a notice handling function, and execution continues normally after the handler returns. The default notice handling function prints the message on <filename>stderr</filename>, but the application can override this behavior by supplying its own handling function.
ru: Сообщения с замечаниями и предупреждениями, выдаваемые сервером, не возвращаются функциями, выполняющими запросы, так как они не свидетельствуют об ошибке в запросе. Вместо этого они передаются функции обработки замечаний и после завершения этой функции выполнение продолжается как обычно. Стандартная функция обработки замечаний выводит сообщение в <filename>stderr</filename>, но приложение может переопределить это поведение, предоставив собственный обработчик.

source: For historical reasons, there are two levels of notice handling, called the notice receiver and notice processor. The default behavior is for the notice receiver to format the notice and pass a string to the notice processor for printing. However, an application that chooses to provide its own notice receiver will typically ignore the notice processor layer and just do all the work in the notice receiver.
ru: По историческим причинам обработка замечаний выполняется на двух уровнях, приёмником замечаний и обработчиком замечаний. По умолчанию приёмник замечаний форматирует замечание и передаёт сформированную строку обработчику замечаний для вывода. Однако приложения, которые реализуют свой приёмник замечаний, обычно просто игнорируют слой обработчика и выполняют все действия в коде приёмника.

source: <primary>notice receiver</primary>
ru: <primary>приёмник замечаний</primary>

source: <primary>notice processor</primary>
ru: <primary>обработчик замечаний</primary>

source: The function <function>PQsetNoticeReceiver</function> <placeholder-1/> <placeholder-2/> sets or examines the current notice receiver for a connection object. Similarly, <function>PQsetNoticeProcessor</function> <placeholder-3/> <placeholder-4/> sets or examines the current notice processor. <synopsis> typedef void (*PQnoticeReceiver) (void *arg, const PGresult *res); PQnoticeReceiver PQsetNoticeReceiver(PGconn *conn, PQnoticeReceiver proc, void *arg); typedef void (*PQnoticeProcessor) (void *arg, const char *message); PQnoticeProcessor PQsetNoticeProcessor(PGconn *conn, PQnoticeProcessor proc, void *arg); </synopsis> Each of these functions returns the previous notice receiver or processor function pointer, and sets the new value. If you supply a null function pointer, no action is taken, but the current pointer is returned.
ru: Функция <function>PQsetNoticeReceiver</function> <placeholder-1/> <placeholder-2/> устанавливает или возвращает текущий приёмник замечаний для объекта соединения. Подобным образом, <function>PQsetNoticeProcessor</function> <placeholder-3/> <placeholder-4/> устанавливает или возвращает текущий обработчик замечаний. <synopsis> typedef void (*PQnoticeReceiver) (void *arg, const PGresult *res); PQnoticeReceiver PQsetNoticeReceiver(PGconn *conn, PQnoticeReceiver proc, void *arg); typedef void (*PQnoticeProcessor) (void *arg, const char *message); PQnoticeProcessor PQsetNoticeProcessor(PGconn *conn, PQnoticeProcessor proc, void *arg); </synopsis> Каждая из этих функций возвращает указатель на ранее установленный приёмник или обработчик замечаний и устанавливает новый указатель. Если ей передаётся нулевой указатель, она ничего не делает, только возвращает текущий указатель.

source: When a notice or warning message is received from the server, or generated internally by <application>libpq</application>, the notice receiver function is called. It is passed the message in the form of a <symbol>PGRES_NONFATAL_ERROR</symbol> <structname>PGresult</structname>. (This allows the receiver to extract individual fields using <function>PQresultErrorField</function>, or obtain a complete preformatted message using <function>PQresultErrorMessage</function> or <function>PQresultVerboseErrorMessage</function>.) The same void pointer passed to <function>PQsetNoticeReceiver</function> is also passed. (This pointer can be used to access application-specific state if needed.)
ru: Когда сообщение с замечанием или предупреждением поступает от сервера, либо выдаётся самой библиотекой <application>libpq</application>, вызывается функция приёмника замечания. Сообщение передаётся ей в виде состояния <symbol>PGRES_NONFATAL_ERROR</symbol> объекта <structname>PGresult</structname>. (Это позволяет приёмнику извлечь из него отдельные поля, используя <function>PQresultErrorField</function>, либо получить полное готовое сообщение, вызвав <function>PQresultErrorMessage</function> или <function>PQresultVerboseErrorMessage</function>.) Ей также передаётся тот же неопределённый указатель, что был передан функции <function>PQsetNoticeReceiver</function>. (Этот указатель может пригодиться для обращения к внутреннему состоянию приложения при необходимости.)

source: The default notice receiver simply extracts the message (using <function>PQresultErrorMessage</function>) and passes it to the notice processor.
ru: Стандартный приёмник замечаний просто извлекает сообщение (вызывая <function>PQresultErrorMessage</function>) и передаёт его обработчику замечаний.

source: The notice processor is responsible for handling a notice or warning message given in text form. It is passed the string text of the message (including a trailing newline), plus a void pointer that is the same one passed to <function>PQsetNoticeProcessor</function>. (This pointer can be used to access application-specific state if needed.)
ru: Обработчик замечаний отвечает за обработку сообщения с замечанием или предупреждением в текстовом виде. Ему передаётся строка с текстом сообщения (включающая завершающий символ новой строки) и неопределённый указатель, который был передан функции <function>PQsetNoticeProcessor</function>. (Этот указатель может пригодиться для обращения к внутреннему состоянию приложения при необходимости.)

source: The default notice processor is simply: <placeholder-1/>
ru: Стандартный обработчик замечаний прост: <placeholder-1/>

source: Once you have set a notice receiver or processor, you should expect that that function could be called as long as either the <structname>PGconn</structname> object or <structname>PGresult</structname> objects made from it exist. At creation of a <structname>PGresult</structname>, the <structname>PGconn</structname>'s current notice handling pointers are copied into the <structname>PGresult</structname> for possible use by functions like <function>PQgetvalue</function>.
ru: Установив приёмник или обработчик замечаний, вы можете ожидать, что эта функция будет вызываться, пока будут существовать объект <structname>PGconn</structname> или объекты <structname>PGresult</structname>, созданные с ней. Когда создаётся <structname>PGresult</structname>, указатели текущих обработчиков замечаний, установленные в <structname>PGconn</structname>, копируются в <structname>PGresult</structname> для возможного использования функциями вроде <function>PQgetvalue</function>.

source: Event System
ru: Система событий

source: <application>libpq</application>'s event system is designed to notify registered event handlers about interesting <application>libpq</application> events, such as the creation or destruction of <structname>PGconn</structname> and <structname>PGresult</structname> objects. A principal use case is that this allows applications to associate their own data with a <structname>PGconn</structname> or <structname>PGresult</structname> and ensure that that data is freed at an appropriate time.
ru: Система событий <application>libpq</application> разработана для уведомления функций-обработчиков об интересных событиях <application>libpq</application>, например, о создании и уничтожении объектов <structname>PGconn</structname> и <structname>PGresult</structname>. Основное их предназначение в том, чтобы позволить приложениям связать собственные данные с объектами <structname>PGconn</structname> и <structname>PGresult</structname> и обеспечить их освобождение в нужное время.
