Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: <application>libpq</application> - C Library
ru: <application>libpq</application> — библиотека для языка C

source: <application>libpq</application> is the <acronym>C</acronym> application programmer's interface to <productname>PostgreSQL</productname>. <application>libpq</application> is a set of library functions that allow client programs to pass queries to the <productname>PostgreSQL</productname> backend server and to receive the results of these queries.
ru: <application>libpq</application> — это интерфейс <productname>PostgreSQL</productname> для программирования приложений на языке <acronym>C</acronym>. Библиотека <application>libpq</application> содержит набор функций, используя которые клиентские программы могут передавать запросы серверу <productname>PostgreSQL</productname> и принимать результаты этих запросов.

source: <application>libpq</application> is also the underlying engine for several other <productname>PostgreSQL</productname> application interfaces, including those written for C++, Perl, Python, Tcl and <application>ECPG</application>. So some aspects of <application>libpq</application>'s behavior will be important to you if you use one of those packages. In particular, <xref linkend="libpq-envars"/>, <xref linkend="libpq-pgpass"/> and <xref linkend="libpq-ssl"/> describe behavior that is visible to the user of any application that uses <application>libpq</application>.
ru: <application>libpq</application> также является базовым механизмом для нескольких других прикладных интерфейсов <productname>PostgreSQL</productname>, включая те, что написаны для C++, Perl, Python, Tcl и <application>ECPG</application>. Поэтому некоторые аспекты поведения <application>libpq</application> будут важны для вас, если вы используете один из этих пакетов. В частности, <xref linkend="libpq-envars"/>, <xref linkend="libpq-pgpass"/> и <xref linkend="libpq-ssl"/> описывают поведение, видимое пользователю любого приложения, использующего <application>libpq</application>.

source: Some short programs are included at the end of this chapter (<xref linkend="libpq-example"/>) to show how to write programs that use <application>libpq</application>. There are also several complete examples of <application>libpq</application> applications in the directory <filename>src/test/examples</filename> in the source code distribution.
ru: В конце этой главы включены короткие программы (<xref linkend="libpq-example"/>), показывающие, как писать программы, которые используют <application>libpq</application>. В каталоге <filename>src/test/examples</filename> дистрибутивного комплекта исходных текстов приведено несколько завершённых примеров приложений <application>libpq</application>.

source: Client programs that use <application>libpq</application> must include the header file <filename>libpq-fe.h</filename><placeholder-1/> and must link with the <application>libpq</application> library.
ru: Клиентские программы, которые используют <application>libpq</application>, должны включать заголовочный файл <filename>libpq-fe.h</filename><placeholder-1/> и должны компоноваться с библиотекой <application>libpq</application>.

source: Database Connection Control Functions
ru: Функции управления подключением к базе данных

source: On Unix, forking a process with open libpq connections can lead to unpredictable results because the parent and child processes share the same sockets and operating system resources. For this reason, such usage is not recommended, though doing an <function>exec</function> from the child process to load a new executable is safe.
ru: В системе Unix создание дочернего процесса на основе процесса, уже имеющего открытые подключения с помощью libpq, может привести к непредсказуемым результатам, потому что родительский и дочерний процессы совместно используют одни и те же сокеты и ресурсы операционной системы. По этой причине подобный подход не рекомендуется. Однако использование системного вызова <function>exec</function> из дочернего процесса для загрузки нового исполняемого файла является безопасным.

source: On Windows, there is a way to improve performance if a single database connection is repeatedly started and shutdown. Internally, libpq calls <function>WSAStartup()</function> and <function>WSACleanup()</function> for connection startup and shutdown, respectively. <function>WSAStartup()</function> increments an internal Windows library reference count which is decremented by <function>WSACleanup()</function>. When the reference count is just one, calling <function>WSACleanup()</function> frees all resources and all DLLs are unloaded. This is an expensive operation. To avoid this, an application can manually call <function>WSAStartup()</function> so resources will not be freed when the last database connection is closed.
ru: В системе Windows существует способ повышения производительности, при котором единственное соединение с базой данных повторно стартует и останавливается. На внутреннем уровне libpq вызывает <function>WSAStartup()</function> и <function>WSACleanup()</function> для старта и остановки соединения соответственно. <function>WSAStartup()</function> увеличивает на единицу внутренний счётчик ссылок в библиотеке Windows, который уменьшается на единицу при вызове <function>WSACleanup()</function>. Когда счётчик ссылок равен единице, вызов <function>WSACleanup()</function> освобождает все ресурсы, и все библиотеки DLL выгружаются. Это дорогостоящая операция. Для её избежания приложение может "вручную" вызвать <function>WSAStartup()</function>, чтобы ресурсы не были освобождены, когда закрыто последнее соединение с базой данных.

source: Makes a new connection to the database server. <synopsis> PGconn *PQconnectdbParams(const char * const *keywords, const char * const *values, int expand_dbname); </synopsis>
ru: Создаёт новое подключение к серверу баз данных. <synopsis> PGconn *PQconnectdbParams(const char * const *keywords, const char * const *values, int expand_dbname); </synopsis>

source: This function opens a new database connection using the parameters taken from two <symbol>NULL</symbol>-terminated arrays. The first, <literal>keywords</literal>, is defined as an array of strings, each one being a key word. The second, <literal>values</literal>, gives the value for each key word. Unlike <function>PQsetdbLogin</function> below, the parameter set can be extended without changing the function signature, so use of this function (or its nonblocking analogs <function>PQconnectStartParams</function> and <function>PQconnectPoll</function>) is preferred for new application programming.
ru: Эта функция открывает новое соединение с базой данных, используя параметры, содержащиеся в двух массивах, завершающихся символом <symbol>NULL</symbol>. Первый из них, <literal>keywords</literal>, определяется как массив строк, каждая из которых представляет собой ключевое слово. Второй, <literal>values</literal>, даёт значение для каждого ключевого слова. В отличие от <function>PQsetdbLogin</function>, описываемой ниже, набор параметров может быть расширен без изменения сигнатуры функции, поэтому использование данной функции (или её неблокирующих аналогов <function>PQconnectStartParams</function> и <function>PQconnectPoll</function>) является предпочтительным при разработке новых приложений.

source: The currently recognized parameter key words are listed in <xref linkend="libpq-paramkeywords"/>.
ru: Ключевые слова-параметры, распознаваемые в настоящее время, приведены в <xref remap="6" linkend="libpq-paramkeywords"/>.

source: When <literal>expand_dbname</literal> is non-zero, the <parameter>dbname</parameter> key word value is allowed to be recognized as a connection string. Only the first occurrence of <parameter>dbname</parameter> is expanded this way, any subsequent <parameter>dbname</parameter> value is processed as plain database name. More details on the possible connection string formats appear in <xref linkend="libpq-connstring"/>.
ru: Когда <literal>expand_dbname</literal> имеет ненулевое значение, тогда в качестве значения, соответствующего ключевому слову <parameter>dbname</parameter>, может быть указана строка подключения. Только первый экземпляр <parameter>dbname</parameter> расширяется таким образом, а все последующие значения <parameter>dbname</parameter> будут обработаны как обычные имена базы данных. Дополнительные сведения о возможных форматах строки подключения можно найти в <xref remap="6" linkend="libpq-connstring"/>.

source: The passed arrays can be empty to use all default parameters, or can contain one or more parameter settings. They should be matched in length. Processing will stop at the first <symbol>NULL</symbol> element in the <literal>keywords</literal> array.
ru: Передаваемые массивы могут быть пустыми. В этом случае используются все параметры по умолчанию. Массивы могут также содержать один или более элементов и должны быть согласованы по длине. Обработка прекращается, когда найден первый элемент со значением <symbol>NULL</symbol> в массиве <literal>keywords</literal>.

source: If any parameter is <symbol>NULL</symbol> or an empty string, the corresponding environment variable (see <xref linkend="libpq-envars"/>) is checked. If the environment variable is not set either, then the indicated built-in defaults are used.
ru: Если какой-либо параметр имеет значение <symbol>NULL</symbol> или содержит пустую строку, проверяется значение соответствующей переменной окружения (см. <xref remap="4" linkend="libpq-envars"/>). Если и переменная окружения не установлена, используется встроенное значение по умолчанию.

source: In general key words are processed from the beginning of these arrays in index order. The effect of this is that when key words are repeated, the last processed value is retained. Therefore, through careful placement of the <parameter>dbname</parameter> key word, it is possible to determine what may be overridden by a <parameter>conninfo</parameter> string, and what may not.
ru: В общем случае ключевые слова обрабатываются в индексном порядке, начиная с начала этих массивов. Вследствие такого подхода, когда ключевые слова повторяются, сохраняется последнее обработанное значение. Следовательно, за счёт соответствующего расположения ключевого слова <parameter>dbname</parameter> можно регулировать, что может быть переопределено строкой <parameter>conninfo</parameter>, а что не может.

source: Makes a new connection to the database server. <synopsis> PGconn *PQconnectdb(const char *conninfo); </synopsis>
ru: Создаёт новое подключение к серверу баз данных. <synopsis> PGconn *PQconnectdb(const char *conninfo); </synopsis>

source: This function opens a new database connection using the parameters taken from the string <literal>conninfo</literal>.
ru: Эта функция открывает новое соединение с базой данных, используя параметры, полученные из строки <literal>conninfo</literal>.

source: The passed string can be empty to use all default parameters, or it can contain one or more parameter settings separated by whitespace, or it can contain a <acronym>URI</acronym>. See <xref linkend="libpq-connstring"/> for details.
ru: Передаваемая строка может быть пустой. В этом случае используются все параметры по умолчанию. Она также может содержать одно или более значений параметров, разделённых пробелами, или <acronym>URI</acronym>. За подробностями обратитесь к <xref remap="3" linkend="libpq-connstring"/>.

source: Makes a new connection to the database server. <synopsis> PGconn *PQsetdbLogin(const char *pghost, const char *pgport, const char *pgoptions, const char *pgtty, const char *dbName, const char *login, const char *pwd); </synopsis>
ru: Создаёт новое подключение к серверу баз данных. <synopsis> PGconn *PQsetdbLogin(const char *pghost, const char *pgport, const char *pgoptions, const char *pgtty, const char *dbName, const char *login, const char *pwd); </synopsis>

source: This is the predecessor of <function>PQconnectdb</function> with a fixed set of parameters. It has the same functionality except that the missing parameters will always take on default values. Write <symbol>NULL</symbol> or an empty string for any one of the fixed parameters that is to be defaulted.
ru: Это предшественница функции <function>PQconnectdb</function> с фиксированным набором параметров. Она имеет такую же функциональность, за исключением того, что непереданные параметры всегда принимают значения по умолчанию. Подставьте <symbol>NULL</symbol> или пустую строку в качестве любого из фиксированных параметров, которые должны принять значения по умолчанию.

source: If the <parameter>dbName</parameter> contains an <symbol>=</symbol> sign or has a valid connection <acronym>URI</acronym> prefix, it is taken as a <parameter>conninfo</parameter> string in exactly the same way as if it had been passed to <function>PQconnectdb</function>, and the remaining parameters are then applied as specified for <function>PQconnectdbParams</function>.
ru: Если параметр <parameter>dbName</parameter> содержит знак <symbol>=</symbol> или имеет допустимый префикс <acronym>URI</acronym> для подключения, то он воспринимается в качестве строки <parameter>conninfo</parameter> точно таким же образом, как если бы он был передан функции <function>PQconnectdb</function>, а оставшиеся параметры затем применяются, как указано для <function>PQconnectdbParams</function>.

source: Makes a new connection to the database server. <synopsis> PGconn *PQsetdb(char *pghost, char *pgport, char *pgoptions, char *pgtty, char *dbName); </synopsis>
ru: Создаёт новое подключение к серверу баз данных. <synopsis> PGconn *PQsetdb(char *pghost, char *pgport, char *pgoptions, char *pgtty, char *dbName); </synopsis>

source: This is a macro that calls <function>PQsetdbLogin</function> with null pointers for the <parameter>login</parameter> and <parameter>pwd</parameter> parameters. It is provided for backward compatibility with very old programs.
ru: Это макрос, который вызывает <function>PQsetdbLogin</function> с нулевыми указателями в качестве значений параметров <parameter>login</parameter> и <parameter>pwd</parameter>. Обеспечивает обратную совместимость с очень старыми программами.

source: <primary>nonblocking connection</primary>
ru: <primary>неблокирующее соединение</primary>

source: <placeholder-1/> Make a connection to the database server in a nonblocking manner. <synopsis> PGconn *PQconnectStartParams(const char * const *keywords, const char * const *values, int expand_dbname); PGconn *PQconnectStart(const char *conninfo); PostgresPollingStatusType PQconnectPoll(PGconn *conn); </synopsis>
ru: <placeholder-1/> Создают подключение к серверу баз данных неблокирующим способом. <synopsis> PGconn *PQconnectStartParams(const char * const *keywords, const char * const *values, int expand_dbname); PGconn *PQconnectStart(const char *conninfo); PostgresPollingStatusType PQconnectPoll(PGconn *conn); </synopsis>

source: These three functions are used to open a connection to a database server such that your application's thread of execution is not blocked on remote I/O whilst doing so. The point of this approach is that the waits for I/O to complete can occur in the application's main loop, rather than down inside <function>PQconnectdbParams</function> or <function>PQconnectdb</function>, and so the application can manage this operation in parallel with other activities.
ru: Три эти функции используются для того, чтобы открыть подключение к серверу баз данных таким образом, чтобы поток исполнения вашего приложения не был заблокирован при выполнении удалённой операции ввода/вывода в процессе подключения. Суть этого подхода в том, чтобы ожидание завершения операций ввода/вывода могло происходить в главном цикле приложения, а не в внутри функций <function>PQconnectdbParams</function> или <function>PQconnectdb</function>, с тем, чтобы приложение могло управлять этой операцией параллельно с другой работой.

source: With <function>PQconnectStartParams</function>, the database connection is made using the parameters taken from the <literal>keywords</literal> and <literal>values</literal> arrays, and controlled by <literal>expand_dbname</literal>, as described above for <function>PQconnectdbParams</function>.
ru: С помощью функции <function>PQconnectStartParams</function> подключение к базе данных выполняется, используя параметры, взятые из массивов <literal>keywords</literal> и <literal>values</literal>, а управление осуществляется с помощью <literal>expand_dbname</literal>, как описано выше для <function>PQconnectdbParams</function>.

source: With <function>PQconnectStart</function>, the database connection is made using the parameters taken from the string <literal>conninfo</literal> as described above for <function>PQconnectdb</function>.
ru: С помощью функции <function>PQconnectStart</function> подключение к базе данных выполняется, используя параметры, взятые из строки <literal>conninfo</literal>, как описано выше для <function>PQconnectdb</function>.

source: The <literal>hostaddr</literal> and <literal>host</literal> parameters are used appropriately to ensure that name and reverse name queries are not made. See the documentation of these parameters in <xref linkend="libpq-paramkeywords"/> for details.
ru: Параметры <literal>hostaddr</literal> и <literal>host</literal> используются надлежащим образом, чтобы прямой и обратный DNS-запросы не выполнялись. Подробнее эти параметры описаны в <xref remap="6" linkend="libpq-paramkeywords"/>.

source: If you call <function>PQtrace</function>, ensure that the stream object into which you trace will not block.
ru: Если вы вызываете <function>PQtrace</function>, обеспечьте, чтобы поток, в который выводится трассировочная информация, не заблокировался.

source: You ensure that the socket is in the appropriate state before calling <function>PQconnectPoll</function>, as described below.
ru: Вы обеспечиваете, чтобы сокет находился в соответствующем состоянии перед вызовом <function>PQconnectPoll</function>, как описано ниже.

source: Neither <function>PQconnectStartParams</function> nor <function>PQconnectStart</function> nor <function>PQconnectPoll</function> will block, so long as a number of restrictions are met: <placeholder-1/>
ru: Ни <function>PQconnectStartParams</function>, ни <function>PQconnectStart</function>, ни <function>PQconnectPoll</function> не заблокируются до тех пор, пока выполняется ряд ограничений: <placeholder-1/>

source: Note: use of <function>PQconnectStartParams</function> is analogous to <function>PQconnectStart</function> shown below.
ru: Примечание: использование <function>PQconnectStartParams</function> аналогично использованию <function>PQconnectStart</function>, показанному ниже.

source: To begin a nonblocking connection request, call <literal>conn = PQconnectStart("<replaceable>connection_info_string</replaceable>")</literal>. If <varname>conn</varname> is null, then <application>libpq</application> has been unable to allocate a new <structname>PGconn</structname> structure. Otherwise, a valid <structname>PGconn</structname> pointer is returned (though not yet representing a valid connection to the database). On return from <function>PQconnectStart</function>, call <literal>status = PQstatus(conn)</literal>. If <varname>status</varname> equals <symbol>CONNECTION_BAD</symbol>, <function>PQconnectStart</function> has failed.
ru: Чтобы начать неблокирующий запрос на подключение, вызовите <literal>conn = PQconnectStart("<replaceable>connection_info_string</replaceable>")</literal>. Если значение <varname>conn</varname> пустое, то, значит, <application>libpq</application> не смогла распределить память для новой структуры <structname>PGconn</structname>. В противном случае будет возвращён корректный указатель <structname>PGconn</structname> (хотя ещё и не представляющий действительного подключения к базе данных). После возврата из <function>PQconnectStart</function> вызовите <literal>status = PQstatus(conn)</literal>. Если <varname>status</varname> имеет значение <symbol>CONNECTION_BAD</symbol>, то, значит, вызов <function>PQconnectStart</function> завершился сбоем.

source: If <function>PQconnectStart</function> succeeds, the next stage is to poll <application>libpq</application> so that it can proceed with the connection sequence. Use <function>PQsocket(conn)</function> to obtain the descriptor of the socket underlying the database connection. Loop thus: If <function>PQconnectPoll(conn)</function> last returned <symbol>PGRES_POLLING_READING</symbol>, wait until the socket is ready to read (as indicated by <function>select()</function>, <function>poll()</function>, or similar system function). Then call <function>PQconnectPoll(conn)</function> again. Conversely, if <function>PQconnectPoll(conn)</function> last returned <symbol>PGRES_POLLING_WRITING</symbol>, wait until the socket is ready to write, then call <function>PQconnectPoll(conn)</function> again. If you have yet to call <function>PQconnectPoll</function>, i.e., just after the call to <function>PQconnectStart</function>, behave as if it last returned <symbol>PGRES_POLLING_WRITING</symbol>. Continue this loop until <function>PQconnectPoll(conn)</function> returns <symbol>PGRES_POLLING_FAILED</symbol>, indicating the connection procedure has failed, or <symbol>PGRES_POLLING_OK</symbol>, indicating the connection has been successfully made.
ru: Если вызов <function>PQconnectStart</function> был успешным, теперь нужно опросить <application>libpq</application>, чтобы она могла возобновить процесс подключения. Используйте <function>PQsocket(conn)</function> для получения дескриптора сокета, лежащего в основе соединения с базой данных. Организуйте цикл таким образом: если <function>PQconnectPoll(conn)</function> в последний раз возвратила <symbol>PGRES_POLLING_READING</symbol>, то подождите, пока сокет не станет готовым к выполнению операции чтения (это покажет функция <function>select()</function>, <function>poll()</function> или подобная системная функция). Затем вызовите <function>PQconnectPoll(conn)</function> опять. И наоборот, если <function>PQconnectPoll(conn)</function> в последний раз возвратила <symbol>PGRES_POLLING_WRITING</symbol>, то подождите, пока сокет не станет готовым к выполнению операции записи, затем вызовите <function>PQconnectPoll(conn)</function> снова. Если вам всё же приходится вызвать <function>PQconnectPoll</function>, то есть сразу после вызова <function>PQconnectStart</function>, поступайте так, как будто она в последний раз возвратила <symbol>PGRES_POLLING_WRITING</symbol>. Продолжайте этот цикл до тех пор, пока <function>PQconnectPoll(conn)</function> не возвратит <symbol>PGRES_POLLING_FAILED</symbol>, показывая, что процедура подключения завершилась сбоем, или <symbol>PGRES_POLLING_OK</symbol>, показывая, что соединение было успешно установлено.

source: Waiting for connection to be made.
ru: Ожидание, пока соединение будет установлено.

source: Connection OK; waiting to send.
ru: Соединение установлено; ожидание отправки.

source: Waiting for a response from the server.
ru: Ожидание ответа от сервера.

source: Received authentication; waiting for backend start-up to finish.
ru: Аутентификация получена; ожидание завершения запуска серверной части.

source: Negotiating SSL encryption.
ru: Согласование SSL-шифрования.

source: Negotiating environment-driven parameter settings.
ru: Согласование значений параметров, зависящих от программной среды.

source: switch(PQstatus(conn)) { case CONNECTION_STARTED: feedback = "Connecting..."; break; case CONNECTION_MADE: feedback = "Connected to server..."; break; . . . default: feedback = "Connecting..."; }
ru: switch(PQstatus(conn)) { case CONNECTION_STARTED: feedback = "Подключение..."; break; case CONNECTION_MADE: feedback = "Подключён к серверу..."; break; . . . default: feedback = "Подключение..."; }
