Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: <function>PQescapeStringConn</function> escapes string literals, much like <function>PQescapeLiteral</function>. Unlike <function>PQescapeLiteral</function>, the caller is responsible for providing an appropriately sized buffer. Furthermore, <function>PQescapeStringConn</function> does not generate the single quotes that must surround <productname>PostgreSQL</productname> string literals; they should be provided in the SQL command that the result is inserted into. The parameter <parameter>from</parameter> points to the first character of the string that is to be escaped, and the <parameter>length</parameter> parameter gives the number of bytes in this string. A terminating zero byte is not required, and should not be counted in <parameter>length</parameter>. (If a terminating zero byte is found before <parameter>length</parameter> bytes are processed, <function>PQescapeStringConn</function> stops at the zero; the behavior is thus rather like <function>strncpy</function>.) <parameter>to</parameter> shall point to a buffer that is able to hold at least one more byte than twice the value of <parameter>length</parameter>, otherwise the behavior is undefined. Behavior is likewise undefined if the <parameter>to</parameter> and <parameter>from</parameter> strings overlap.
ru: <function>PQescapeStringConn</function> экранирует строковые литералы наподобие <function>PQescapeLiteral</function>. Но, в отличие от <function>PQescapeLiteral</function>, за предоставление буфера надлежащего размера отвечает вызывающая функция. Более того, <function>PQescapeStringConn</function> не добавляет одинарные кавычки, которые должны окружать строковые литералы <productname>PostgreSQL</productname>; они должны быть включены в SQL-команду, в которую вставляется результирующая строка. Параметр <parameter>from</parameter> указывает на первый символ строки, которая должна экранироваться, а параметр <parameter>length</parameter> задаёт число байтов в этой строке. Завершающий нулевой байт не требуется и не должен учитываться в параметре <parameter>length</parameter>. (Если завершающий нулевой байт был найден до того, как были обработаны <parameter>length</parameter> байтов, то <function>PQescapeStringConn</function> останавливает работу на нулевом байте; таким образом, поведение функции напоминает <function>strncpy</function>.) Параметр <parameter>to</parameter> должен указывать на буфер, который сможет вместить как минимум на один байт больше, чем предписывает удвоенное значение параметра <parameter>length</parameter>, в противном случае поведение функции не определено. Поведение будет также не определено, если строки <parameter>to</parameter> и <parameter>from</parameter> перекрываются.

source: If the <parameter>error</parameter> parameter is not <symbol>NULL</symbol>, then <literal>*error</literal> is set to zero on success, nonzero on error. Presently the only possible error conditions involve invalid multibyte encoding in the source string. The output string is still generated on error, but it can be expected that the server will reject it as malformed. On error, a suitable message is stored in the <parameter>conn</parameter> object, whether or not <parameter>error</parameter> is <symbol>NULL</symbol>.
ru: Если параметр <parameter>error</parameter> не равен <symbol>NULL</symbol>, тогда значение <literal>*error</literal> устанавливается равным нулю в случае успешной работы и не равным нулю в случае ошибки. В настоящее время единственным возможным условием возникновения ошибки является неверная мультибайтовая кодировка в исходной строке. Выходная строка формируется даже при наличии ошибки, но можно ожидать, что сервер отвергнет её как неверно сформированную. В случае ошибки в объект <parameter>conn</parameter> записывается соответствующее сообщение независимо от того, равно ли <symbol>NULL</symbol> значение параметра <parameter>error</parameter>.

source: <function>PQescapeStringConn</function> returns the number of bytes written to <parameter>to</parameter>, not including the terminating zero byte.
ru: <function>PQescapeStringConn</function> возвращает число байтов, записанных по адресу <parameter>to</parameter>, не включая завершающий нулевой байт.

source: <function>PQescapeString</function> is an older, deprecated version of <function>PQescapeStringConn</function>. <synopsis> size_t PQescapeString (char *to, const char *from, size_t length); </synopsis>
ru: <function>PQescapeString</function> является более старой, не рекомендованной к использованию версией функции <function>PQescapeStringConn</function>. <synopsis> size_t PQescapeString (char *to, const char *from, size_t length); </synopsis>

source: The only difference from <function>PQescapeStringConn</function> is that <function>PQescapeString</function> does not take <structname>PGconn</structname> or <parameter>error</parameter> parameters. Because of this, it cannot adjust its behavior depending on the connection properties (such as character encoding) and therefore <emphasis>it might give the wrong results</emphasis>. Also, it has no way to report error conditions.
ru: Единственное отличие от <function>PQescapeStringConn</function> состоит в том, что функция <function>PQescapeString</function> не принимает <structname>PGconn</structname> или <parameter>error</parameter> в качестве параметров. Из-за этого она не может скорректировать своё поведение в зависимости от свойств подключения (таких, как кодировка символов) и, следовательно, <emphasis>она может выдавать неверные результаты</emphasis>. Также она не имеет способа сообщить об ошибках.

source: <function>PQescapeString</function> can be used safely in client programs that work with only one <productname>PostgreSQL</productname> connection at a time (in this case it can find out what it needs to know <quote>behind the scenes</quote>). In other contexts it is a security hazard and should be avoided in favor of <function>PQescapeStringConn</function>.
ru: <function>PQescapeString</function> может безопасно использоваться в клиентских программах, которые работают лишь с одним подключением к <productname>PostgreSQL</productname> за один раз (в этом случае функция может найти то, что ей нужно знать, <quote>за кулисами</quote>). В других контекстах её использование несёт в себе угрозу безопасности и его следует избегать в пользу применения функции <function>PQescapeStringConn</function>.

source: Escapes binary data for use within an SQL command with the type <type>bytea</type>. As with <function>PQescapeStringConn</function>, this is only used when inserting data directly into an SQL command string. <synopsis> unsigned char *PQescapeByteaConn(PGconn *conn, const unsigned char *from, size_t from_length, size_t *to_length); </synopsis>
ru: Экранирует двоичные данные для их использования внутри SQL-команды с типом данных <type>bytea</type>. Как и в случае с <function>PQescapeStringConn</function>, эта функция применяется только тогда, когда данные вставляются непосредственно в строку SQL-команды. <synopsis> unsigned char *PQescapeByteaConn(PGconn *conn, const unsigned char *from, size_t from_length, size_t *to_length); </synopsis>

source: Certain byte values must be escaped when used as part of a <type>bytea</type> literal in an <acronym>SQL</acronym> statement. <function>PQescapeByteaConn</function> escapes bytes using either hex encoding or backslash escaping. See <xref linkend="datatype-binary"/> for more information.
ru: Байты, имеющие определённые значения, должны экранироваться, когда они используются в качестве составной части литерала, имеющего тип <type>bytea</type>, в <acronym>SQL</acronym>-операторе. <function>PQescapeByteaConn</function> экранирует байты, используя либо hex-кодирование, либо экранирование с помощью обратной косой черты. См. <xref remap="4" linkend="datatype-binary"/> для получения дополнительной информации.

source: The <parameter>from</parameter> parameter points to the first byte of the string that is to be escaped, and the <parameter>from_length</parameter> parameter gives the number of bytes in this binary string. (A terminating zero byte is neither necessary nor counted.) The <parameter>to_length</parameter> parameter points to a variable that will hold the resultant escaped string length. This result string length includes the terminating zero byte of the result.
ru: Параметр <parameter>from</parameter> указывает на первый байт строки, которая должна экранироваться, а параметр <parameter>from_length</parameter> задаёт число байтов в этой двоичной строке. (Завершающий нулевой байт не нужен и не учитывается.) Параметр <parameter>to_length</parameter> указывает на переменную, которая будет содержать длину результирующей экранированной строки. Эта длина включает завершающий нулевой байт результирующей строки.

source: <function>PQescapeByteaConn</function> returns an escaped version of the <parameter>from</parameter> parameter binary string in memory allocated with <function>malloc()</function>. This memory should be freed using <function>PQfreemem()</function> when the result is no longer needed. The return string has all special characters replaced so that they can be properly processed by the <productname>PostgreSQL</productname> string literal parser, and the <type>bytea</type> input function. A terminating zero byte is also added. The single quotes that must surround <productname>PostgreSQL</productname> string literals are not part of the result string.
ru: <function>PQescapeByteaConn</function> возвращает экранированную версию двоичной строки, на которую указывает параметр <parameter>from</parameter>, и размещает её в памяти, распределённой с помощью <function>malloc()</function>. Эта память должна быть освобождена с помощью функции <function>PQfreemem()</function>, когда результирующая строка больше не нужна. В возвращаемой строке все специальные символы заменены так, чтобы синтаксический анализатор литеральных строк <productname>PostgreSQL</productname> и функция ввода для типа <type>bytea</type> могли обработать их надлежащим образом. Завершающий нулевой байт также добавляется. Одинарные кавычки, которые должны окружать строковые литералы <productname>PostgreSQL</productname>, не являются частью результирующей строки.

source: On error, a null pointer is returned, and a suitable error message is stored in the <parameter>conn</parameter> object. Currently, the only possible error is insufficient memory for the result string.
ru: В случае ошибки возвращается нулевой указатель, и соответствующее сообщение об ошибке записывается в объект <parameter>conn</parameter>. В настоящее время единственной возможной ошибкой может быть нехватка памяти для результирующей строки.

source: <function>PQescapeBytea</function> is an older, deprecated version of <function>PQescapeByteaConn</function>. <synopsis> unsigned char *PQescapeBytea(const unsigned char *from, size_t from_length, size_t *to_length); </synopsis>
ru: <function>PQescapeBytea</function> является более старой, не рекомендуемой к использованию версией функции <function>PQescapeByteaConn</function>. <synopsis> unsigned char *PQescapeBytea(const unsigned char *from, size_t from_length, size_t *to_length); </synopsis>

source: The only difference from <function>PQescapeByteaConn</function> is that <function>PQescapeBytea</function> does not take a <structname>PGconn</structname> parameter. Because of this, <function>PQescapeBytea</function> can only be used safely in client programs that use a single <productname>PostgreSQL</productname> connection at a time (in this case it can find out what it needs to know <quote>behind the scenes</quote>). It <emphasis>might give the wrong results</emphasis> if used in programs that use multiple database connections (use <function>PQescapeByteaConn</function> in such cases).
ru: Единственное отличие от <function>PQescapeByteaConn</function> состоит в том, что функция <function>PQescapeBytea</function> не принимает <structname>PGconn</structname> в качестве параметра. Из-за этого <function>PQescapeBytea</function> может безопасно использоваться в клиентских программах, которые работают лишь с одним подключением к <productname>PostgreSQL</productname> за один раз (в этом случае функция может найти то, что ей нужно знать, <quote>за кулисами</quote>). Она <emphasis>может выдавать неверные результаты</emphasis> при использовании в программах, которые формируют множественные подключения к базе данных (в таких случаях используйте <function>PQescapeByteaConn</function>).

source: Converts a string representation of binary data into binary data &mdash; the reverse of <function>PQescapeBytea</function>. This is needed when retrieving <type>bytea</type> data in text format, but not when retrieving it in binary format. <synopsis> unsigned char *PQunescapeBytea(const unsigned char *from, size_t *to_length); </synopsis>
ru: Преобразует строковое представление двоичных данных в двоичные данные &mdash; является обратной функцией к функции <function>PQescapeBytea</function>. Она нужна, когда данные типа <type>bytea</type> извлекаются в текстовом формате, но не когда они извлекаются в двоичном формате. <synopsis> unsigned char *PQunescapeBytea(const unsigned char *from, size_t *to_length); </synopsis>

source: The <parameter>from</parameter> parameter points to a string such as might be returned by <function>PQgetvalue</function> when applied to a <type>bytea</type> column. <function>PQunescapeBytea</function> converts this string representation into its binary representation. It returns a pointer to a buffer allocated with <function>malloc()</function>, or <symbol>NULL</symbol> on error, and puts the size of the buffer in <parameter>to_length</parameter>. The result must be freed using <function>PQfreemem</function> when it is no longer needed.
ru: Параметр <parameter>from</parameter> указывает на строку, такую, какую могла бы возвратить функция <function>PQgetvalue</function>, применённая к столбцу типа <type>bytea</type>. <function>PQunescapeBytea</function> преобразует это строковое представление в его двоичное представление. Она возвращает указатель на буфер, распределённый с помощью функции <function>malloc()</function> (или <symbol>NULL</symbol> в случае ошибки) и помещает размер буфера по адресу <parameter>to_length</parameter>. Когда результат не будет нужен, необходимо освободить его память, вызвав <function>PQfreemem</function>.

source: This conversion is not exactly the inverse of <function>PQescapeBytea</function>, because the string is not expected to be <quote>escaped</quote> when received from <function>PQgetvalue</function>. In particular this means there is no need for string quoting considerations, and so no need for a <structname>PGconn</structname> parameter.
ru: Это преобразование не является точной инверсией для <function>PQescapeBytea</function>, поскольку ожидается, что строка, полученная от <function>PQgetvalue</function>, не будет <quote>экранированной</quote>. В частности, это означает, что учитывать режим спецпоследовательностей не нужно, и поэтому в параметре нет необходимости <structname>PGconn</structname>.

source: Asynchronous Command Processing
ru: Асинхронная обработка команд

source: <function>PQexec</function> waits for the command to be completed. The application might have other work to do (such as maintaining a user interface), in which case it won't want to block waiting for the response.
ru: <function>PQexec</function> ожидает завершения выполнения команды. Приложение может иметь и другую работу, которую нужно делать (такую, как поддержание пользовательского интерфейса), в таком случае оно не захочет блокироваться, ожидая ответа.

source: Since the execution of the client application is suspended while it waits for the result, it is hard for the application to decide that it would like to try to cancel the ongoing command. (It can be done from a signal handler, but not otherwise.)
ru: Поскольку выполнение клиентского приложения приостанавливается, пока оно ожидает результата, то приложению трудно решить, что оно хотело бы попытаться отменить выполняющуюся команду. (Это можно сделать из обработчика сигнала, но никак иначе.)

source: <function>PQexec</function> can return only one <structname>PGresult</structname> structure. If the submitted command string contains multiple <acronym>SQL</acronym> commands, all but the last <structname>PGresult</structname> are discarded by <function>PQexec</function>.
ru: <function>PQexec</function> может возвратить только одну структуру <structname>PGresult</structname>. Если отправленная серверу строка-команда содержит множественные <acronym>SQL</acronym>-команды, то все структуры <structname>PGresult</structname>, кроме последней, отбрасываются функцией <function>PQexec</function>.

source: <function>PQexec</function> always collects the command's entire result, buffering it in a single <structname>PGresult</structname>. While this simplifies error-handling logic for the application, it can be impractical for results containing many rows.
ru: <function>PQexec</function> всегда собирает все результаты выполнения команды, буферизуя их в единственной структуре <structname>PGresult</structname>. В то время как для приложения это упрощает логику обработки ошибок, это может быть непрактично, когда результат содержит много строк.

source: The <function>PQexec</function> function is adequate for submitting commands in normal, synchronous applications. It has a few deficiencies, however, that can be of importance to some users: <placeholder-1/>
ru: Функция <function>PQexec</function> хорошо подходит для отправки команд серверу в нормальных, синхронных приложениях. Однако, она имеет ряд недостатков, которые могут иметь значение для некоторых пользователей: <placeholder-1/>

source: Submits a command to the server without waiting for the result(s). 1 is returned if the command was successfully dispatched and 0 if not (in which case, use <function>PQerrorMessage</function> to get more information about the failure). <synopsis> int PQsendQuery(PGconn *conn, const char *command); </synopsis> After successfully calling <function>PQsendQuery</function>, call <function>PQgetResult</function> one or more times to obtain the results. <function>PQsendQuery</function> cannot be called again (on the same connection) until <function>PQgetResult</function> has returned a null pointer, indicating that the command is done.
ru: Отправляет команду серверу, не ожидая получения результата. Если команда была отправлена успешно, то функция возвратит значение 1, в противном случае она возвратит 0 (тогда нужно воспользоваться функцией <function>PQerrorMessage</function> для получения дополнительной информации о сбое). <synopsis> int PQsendQuery(PGconn *conn, const char *command); </synopsis> После успешного вызова <function>PQsendQuery</function> вызовите <function>PQgetResult</function> один или несколько раз, чтобы получить результат. Функцию <function>PQsendQuery</function> нельзя вызвать повторно (на том же самом соединении) до тех пор, пока <function>PQgetResult</function> не вернёт нулевой указатель, означающий, что выполнение команды завершено.

source: Submits a command and separate parameters to the server without waiting for the result(s). <synopsis> int PQsendQueryParams(PGconn *conn, const char *command, int nParams, const Oid *paramTypes, const char * const *paramValues, const int *paramLengths, const int *paramFormats, int resultFormat); </synopsis> This is equivalent to <function>PQsendQuery</function> except that query parameters can be specified separately from the query string. The function's parameters are handled identically to <function>PQexecParams</function>. Like <function>PQexecParams</function>, it will not work on 2.0-protocol connections, and it allows only one command in the query string.
ru: Отправляет серверу команду и обособленные параметры, не ожидая получения результатов. <synopsis> int PQsendQueryParams(PGconn *conn, const char *command, int nParams, const Oid *paramTypes, const char * const *paramValues, const int *paramLengths, const int *paramFormats, int resultFormat); </synopsis> Эта функция эквивалентна функции <function>PQsendQuery</function>, за исключением того, что параметры запроса можно указать отдельно от самой строки запроса. Эта функция обрабатывает свои параметры точно так же, как и функция <function>PQexecParams</function>. Аналогично функции <function>PQexecParams</function>, данная функция не будет работать при подключениях по протоколу версии 2.0, также она позволяет включить только одну команду в строку запроса.

source: Sends a request to create a prepared statement with the given parameters, without waiting for completion. <synopsis> int PQsendPrepare(PGconn *conn, const char *stmtName, const char *query, int nParams, const Oid *paramTypes); </synopsis> This is an asynchronous version of <function>PQprepare</function>: it returns 1 if it was able to dispatch the request, and 0 if not. After a successful call, call <function>PQgetResult</function> to determine whether the server successfully created the prepared statement. The function's parameters are handled identically to <function>PQprepare</function>. Like <function>PQprepare</function>, it will not work on 2.0-protocol connections.
ru: Посылает запрос на создание подготовленного оператора с данными параметрами и не дожидается завершения его выполнения.<synopsis> int PQsendPrepare(PGconn *conn, const char *stmtName, const char *query, int nParams, const Oid *paramTypes); </synopsis> Это асинхронная версия функции <function>PQprepare</function>. Она возвращает 1, если ей удалось отправить запрос, и 0 в противном случае. После её успешного вызова следует вызвать функцию <function>PQgetResult</function>, чтобы определить, успешно ли создал сервер подготовленный оператор. Эта функция обрабатывает свои параметры точно так же, как и функция <function>PQprepare</function>. Аналогично функции <function>PQprepare</function>, данная функция не будет работать при подключениях по протоколу версии 2.0.

source: Sends a request to execute a prepared statement with given parameters, without waiting for the result(s). <synopsis> int PQsendQueryPrepared(PGconn *conn, const char *stmtName, int nParams, const char * const *paramValues, const int *paramLengths, const int *paramFormats, int resultFormat); </synopsis> This is similar to <function>PQsendQueryParams</function>, but the command to be executed is specified by naming a previously-prepared statement, instead of giving a query string. The function's parameters are handled identically to <function>PQexecPrepared</function>. Like <function>PQexecPrepared</function>, it will not work on 2.0-protocol connections.
ru: Посылает запрос на выполнение подготовленного оператора с данными параметрами, не ожидая получения результата. <synopsis> int PQsendQueryPrepared(PGconn *conn, const char *stmtName, int nParams, const char * const *paramValues, const int *paramLengths, const int *paramFormats, int resultFormat); </synopsis> Эта функция подобна функции <function>PQsendQueryParams</function>, но команда, которая должна быть выполнена, задаётся путём указания предварительно подготовленного оператора, вместо задания строки запроса. Эта функция обрабатывает свои параметры точно так же, как и функция <function>PQexecPrepared</function>. Аналогично функции <function>PQexecPrepared</function>, данная функция не будет работать при подключениях по протоколу версии 2.0.
