Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: Submits a request to obtain information about the specified prepared statement, without waiting for completion. <synopsis> int PQsendDescribePrepared(PGconn *conn, const char *stmtName); </synopsis> This is an asynchronous version of <function>PQdescribePrepared</function>: it returns 1 if it was able to dispatch the request, and 0 if not. After a successful call, call <function>PQgetResult</function> to obtain the results. The function's parameters are handled identically to <function>PQdescribePrepared</function>. Like <function>PQdescribePrepared</function>, it will not work on 2.0-protocol connections.
ru: Отправляет запрос на получение информации об указанном подготовленном операторе и не дожидается завершения выполнения запроса. <synopsis> int PQsendDescribePrepared(PGconn *conn, const char *stmtName); </synopsis> Это асинхронная версия функции <function>PQdescribePrepared</function>. Она возвращает 1, если ей удалось отправить запрос, и 0 в противном случае. После её успешного вызова следует вызвать функцию <function>PQgetResult</function> для получения результата. Эта функция обрабатывает свои параметры точно так же, как и функция <function>PQdescribePrepared</function>. Аналогично функции <function>PQdescribePrepared</function>, данная функция не будет работать при подключениях по протоколу версии 2.0.

source: Submits a request to obtain information about the specified portal, without waiting for completion. <synopsis> int PQsendDescribePortal(PGconn *conn, const char *portalName); </synopsis> This is an asynchronous version of <function>PQdescribePortal</function>: it returns 1 if it was able to dispatch the request, and 0 if not. After a successful call, call <function>PQgetResult</function> to obtain the results. The function's parameters are handled identically to <function>PQdescribePortal</function>. Like <function>PQdescribePortal</function>, it will not work on 2.0-protocol connections.
ru: Отправляет запрос на получение информации об указанном портале и не дожидается завершения выполнения запроса. <synopsis> int PQsendDescribePortal(PGconn *conn, const char *portalName); </synopsis> Это асинхронная версия функции <function>PQdescribePortal</function>. Она возвращает 1, если ей удалось отправить запрос, и 0 в противном случае. После её успешного вызова следует вызвать функцию <function>PQgetResult</function> для получения результата. Эта функция обрабатывает свои параметры точно так же, как и функция <function>PQdescribePortal</function>. Аналогично функции <function>PQdescribePortal</function>, данная функция не будет работать при подключениях по протоколу версии 2.0.

source: Waits for the next result from a prior <function>PQsendQuery</function>, <function>PQsendQueryParams</function>, <function>PQsendPrepare</function>, <function>PQsendQueryPrepared</function>, <function>PQsendDescribePrepared</function>, or <function>PQsendDescribePortal</function> call, and returns it. A null pointer is returned when the command is complete and there will be no more results. <synopsis> PGresult *PQgetResult(PGconn *conn); </synopsis>
ru: Ожидает получения следующего результата после предшествующего вызова <function>PQsendQuery</function>, <function>PQsendQueryParams</function>, <function>PQsendPrepare</function>, <function>PQsendQueryPrepared</function>, <function>PQsendDescribePrepared</function> или <function>PQsendDescribePortal</function> и возвращает его. Когда команда завершена и результатов больше не будет, тогда возвращается нулевой указатель. <synopsis> PGresult *PQgetResult(PGconn *conn); </synopsis>

source: <function>PQgetResult</function> must be called repeatedly until it returns a null pointer, indicating that the command is done. (If called when no command is active, <function>PQgetResult</function> will just return a null pointer at once.) Each non-null result from <function>PQgetResult</function> should be processed using the same <structname>PGresult</structname> accessor functions previously described. Don't forget to free each result object with <function>PQclear</function> when done with it. Note that <function>PQgetResult</function> will block only if a command is active and the necessary response data has not yet been read by <function>PQconsumeInput</function>.
ru: Функция <function>PQgetResult</function> должна вызываться повторно до тех пор, пока она не вернёт нулевой указатель, означающий, что команда завершена. (Если она вызвана, когда нет ни одной активной команды, тогда <function>PQgetResult</function> просто возвратит нулевой указатель сразу же.) Каждый ненулевой результат, полученный от <function>PQgetResult</function>, должен обрабатываться с помощью тех же самых функций доступа к структуре <structname>PGresult</structname>, которые были описаны выше. Не забывайте освобождать память, занимаемую каждым результирующим объектом, с помощью функции <function>PQclear</function>, когда работа с этим объектом закончена. Обратите внимание, что <function>PQgetResult</function> заблокируется, только если какая-либо команда активна, а необходимые ответные данные ещё не были прочитаны функцией <function>PQconsumeInput</function>.

source: Even when <function>PQresultStatus</function> indicates a fatal error, <function>PQgetResult</function> should be called until it returns a null pointer, to allow <application>libpq</application> to process the error information completely.
ru: Даже когда <function>PQresultStatus</function> показывает фатальную ошибку, все равно следует вызывать функцию <function>PQgetResult</function> до тех пор, пока она не возвратит нулевой указатель, чтобы позволить <application>libpq</application> полностью обработать информацию об ошибке.

source: Applications that do not like these limitations can instead use the underlying functions that <function>PQexec</function> is built from: <function>PQsendQuery</function> and <function>PQgetResult</function>. There are also <function>PQsendQueryParams</function>, <function>PQsendPrepare</function>, <function>PQsendQueryPrepared</function>, <function>PQsendDescribePrepared</function>, and <function>PQsendDescribePortal</function>, which can be used with <function>PQgetResult</function> to duplicate the functionality of <function>PQexecParams</function>, <function>PQprepare</function>, <function>PQexecPrepared</function>, <function>PQdescribePrepared</function>, and <function>PQdescribePortal</function> respectively. <placeholder-1/>
ru: Приложения, которым эти ограничения не подходят, могут вместо <function>PQexec</function> использовать базовые функции, на основе которых и построена функция <function>PQexec</function>: <function>PQsendQuery</function> и <function>PQgetResult</function>. Есть также функции <function>PQsendQueryParams</function>, <function>PQsendPrepare</function>, <function>PQsendQueryPrepared</function>, <function>PQsendDescribePrepared</function> и <function>PQsendDescribePortal</function>, которые можно использовать совместно с <function>PQgetResult</function>, чтобы продублировать функциональность <function>PQexecParams</function>, <function>PQprepare</function>, <function>PQexecPrepared</function>, <function>PQdescribePrepared</function> и <function>PQdescribePortal</function> соответственно. <placeholder-1/>

source: Using <function>PQsendQuery</function> and <function>PQgetResult</function> solves one of <function>PQexec</function>'s problems: If a command string contains multiple <acronym>SQL</acronym> commands, the results of those commands can be obtained individually. (This allows a simple form of overlapped processing, by the way: the client can be handling the results of one command while the server is still working on later queries in the same command string.)
ru: Использование <function>PQsendQuery</function> и <function>PQgetResult</function> решает одну из проблем <function>PQexec</function>: если строка команды содержит несколько <acronym>SQL</acronym>-команд, то результаты каждой из них можно получить индивидуально. (Между прочим, это позволяет организовать частичное совмещение обработки: клиент может обрабатывать результаты одной команды, в то время как сервер ещё работает с более поздними запросами, содержащимися в той же самой строке-команде.)

source: Another frequently-desired feature that can be obtained with <function>PQsendQuery</function> and <function>PQgetResult</function> is retrieving large query results a row at a time. This is discussed in <xref linkend="libpq-single-row-mode"/>.
ru: Ещё одной часто требующейся функциональной возможностью, которую можно получить с помощью <function>PQsendQuery</function> и <function>PQgetResult</function>, является извлечение больших выборок по одной строке за раз. Это обсуждается в <xref remap="6" linkend="libpq-single-row-mode"/>.

source: If input is available from the server, consume it. <synopsis> int PQconsumeInput(PGconn *conn); </synopsis>
ru: Если сервер готов передать данные, принять их. <synopsis> int PQconsumeInput(PGconn *conn); </synopsis>

source: <function>PQconsumeInput</function> normally returns 1 indicating <quote>no error</quote>, but returns 0 if there was some kind of trouble (in which case <function>PQerrorMessage</function> can be consulted). Note that the result does not say whether any input data was actually collected. After calling <function>PQconsumeInput</function>, the application can check <function>PQisBusy</function> and/or <function>PQnotifies</function> to see if their state has changed.
ru: <function>PQconsumeInput</function> обычно возвращает 1, показывая, что <quote>ошибки нет</quote>, но возвращает 0, если имела место какая-либо проблема (в таком случае можно обратиться к функции <function>PQerrorMessage</function> за уточнением). Обратите внимание, что результат не говорит, были ли какие-либо входные данные фактически собраны. После вызова функции <function>PQconsumeInput</function> приложение может проверить <function>PQisBusy</function> и/или <function>PQnotifies</function>, чтобы посмотреть, не изменилось ли их состояние.

source: <function>PQconsumeInput</function> can be called even if the application is not prepared to deal with a result or notification just yet. The function will read available data and save it in a buffer, thereby causing a <function>select()</function> read-ready indication to go away. The application can thus use <function>PQconsumeInput</function> to clear the <function>select()</function> condition immediately, and then examine the results at leisure.
ru: <function>PQconsumeInput</function> можно вызвать, даже если приложение ещё не готово иметь дело с результатом или уведомлением. Функция прочитает доступные данные и сохранит их в буфере, при этом обрабатывая условие готовности к чтению функции <function>select()</function>. Таким образом, приложение может использовать <function>PQconsumeInput</function>, чтобы немедленно обработать это состояние <function>select()</function>, а изучать результаты позже.

source: Returns 1 if a command is busy, that is, <function>PQgetResult</function> would block waiting for input. A 0 return indicates that <function>PQgetResult</function> can be called with assurance of not blocking. <synopsis> int PQisBusy(PGconn *conn); </synopsis>
ru: Возвращает 1, если команда занята работой, то есть функция <function>PQgetResult</function> была бы заблокирована в ожидании ввода. Возвращаемое значение 0 показывает, что функция <function>PQgetResult</function> при её вызове гарантированно не будет заблокирована. <synopsis> int PQisBusy(PGconn *conn); </synopsis>

source: <function>PQisBusy</function> will not itself attempt to read data from the server; therefore <function>PQconsumeInput</function> must be invoked first, or the busy state will never end.
ru: Функция <function>PQisBusy</function> сама не будет пытаться прочитать данные с сервера; следовательно, сначала нужно вызвать <function>PQconsumeInput</function>, иначе состояние занятости никогда не прекратится.

source: By itself, calling <function>PQgetResult</function> will still cause the client to block until the server completes the next <acronym>SQL</acronym> command. This can be avoided by proper use of two more functions: <placeholder-1/>
ru: Сам по себе вызов <function>PQgetResult</function> всё же заставит клиента заблокироваться до те пор, пока сервер не завершит выполнение следующей <acronym>SQL</acronym>-команды. Этого можно избежать с помощью надлежащего использования ещё двух функций: <placeholder-1/>

source: A typical application using these functions will have a main loop that uses <function>select()</function> or <function>poll()</function> to wait for all the conditions that it must respond to. One of the conditions will be input available from the server, which in terms of <function>select()</function> means readable data on the file descriptor identified by <function>PQsocket</function>. When the main loop detects input ready, it should call <function>PQconsumeInput</function> to read the input. It can then call <function>PQisBusy</function>, followed by <function>PQgetResult</function> if <function>PQisBusy</function> returns false (0). It can also call <function>PQnotifies</function> to detect <command>NOTIFY</command> messages (see <xref linkend="libpq-notify"/>).
ru: В типичном приложении, использующем эти функции, будет главный цикл, в котором функции <function>select()</function> или <function>poll()</function> служат для организации ожидания наступления всех условий, на которые цикл должен отвечать. Одним из условий будет наличие ввода, доступного от сервера, что в терминах функции <function>select()</function> означает наличие данных, готовых для чтения на файловом дескрипторе, идентифицируемом с помощью <function>PQsocket</function>. Когда главный цикл обнаруживает ввод, готовый для чтения, он должен вызвать <function>PQconsumeInput</function>, чтобы прочитать этот ввод. Затем он может вызвать <function>PQisBusy</function>, а после неё уже <function>PQgetResult</function>, если <function>PQisBusy</function> возвратит "ложь" (0). Главный цикл может также вызвать <function>PQnotifies</function>, чтобы обнаружить сообщения <command>NOTIFY</command> (см. <xref remap="4" linkend="libpq-notify"/>).

source: A client that uses <function>PQsendQuery</function>/<function>PQgetResult</function> can also attempt to cancel a command that is still being processed by the server; see <xref linkend="libpq-cancel"/>. But regardless of the return value of <function>PQcancel</function>, the application must continue with the normal result-reading sequence using <function>PQgetResult</function>. A successful cancellation will simply cause the command to terminate sooner than it would have otherwise.
ru: Клиент, который использует <function>PQsendQuery</function>/<function>PQgetResult</function>, может также попытаться отменить команду, которая всё ещё обрабатывается сервером; см. <xref remap="4" linkend="libpq-cancel"/>. Но, независимо от возвращаемого значения функции <function>PQcancel</function>, приложение должно продолжать обычную последовательность операций чтения результатов запроса, используя <function>PQgetResult</function>. Успешная отмена просто заставит команду завершиться раньше, чем она сделала бы в противном случае.

source: Sets the nonblocking status of the connection. <synopsis> int PQsetnonblocking(PGconn *conn, int arg); </synopsis>
ru: Устанавливает неблокирующий статус подключения. <synopsis> int PQsetnonblocking(PGconn *conn, int arg); </synopsis>

source: Sets the state of the connection to nonblocking if <parameter>arg</parameter> is 1, or blocking if <parameter>arg</parameter> is 0. Returns 0 if OK, -1 if error.
ru: Устанавливает состояние подключения как неблокирующее, если <parameter>arg</parameter> равен 1, или блокирующее, если <parameter>arg</parameter> равен 0. Возвращает 0 в случае успешного завершения и -1 в случае ошибки.

source: In the nonblocking state, calls to <function>PQsendQuery</function>, <function>PQputline</function>, <function>PQputnbytes</function>, <function>PQputCopyData</function>, and <function>PQendcopy</function> will not block but instead return an error if they need to be called again.
ru: В неблокирующем состоянии вызовы <function>PQsendQuery</function>, <function>PQputline</function>, <function>PQputnbytes</function>, <function>PQputCopyData</function> и <function>PQendcopy</function> не будут блокироваться, а вместо этого возвратят ошибку, если вызов должен быть повторным.

source: Note that <function>PQexec</function> does not honor nonblocking mode; if it is called, it will act in blocking fashion anyway.
ru: Обратите внимание, что функция <function>PQexec</function> не соблюдает неблокирующий режим. Если она вызывается, она всё равно работает в блокирующем режиме.

source: Returns the blocking status of the database connection. <synopsis> int PQisnonblocking(const PGconn *conn); </synopsis>
ru: Возвращает режим блокирования для подключения базы данных. <synopsis> int PQisnonblocking(const PGconn *conn); </synopsis>

source: Returns 1 if the connection is set to nonblocking mode and 0 if blocking.
ru: Возвращает 1, если подключение установлено в неблокирующем режиме, и 0, если режим блокирующий.

source: Attempts to flush any queued output data to the server. Returns 0 if successful (or if the send queue is empty), -1 if it failed for some reason, or 1 if it was unable to send all the data in the send queue yet (this case can only occur if the connection is nonblocking). <synopsis> int PQflush(PGconn *conn); </synopsis>
ru: Пытается сбросить любые выходные данные, стоящие в очереди, на сервер. Возвращает 0 в случае успеха (или если очередь на отправку пуста), -1 в случае сбоя по какой-либо причине или 1, если она ещё не смогла отправить все данные, находящиеся в очереди (этот случай может иметь место, только если соединение неблокирующее). <synopsis> int PQflush(PGconn *conn); </synopsis>

source: By using the functions described above, it is possible to avoid blocking while waiting for input from the database server. However, it is still possible that the application will block waiting to send output to the server. This is relatively uncommon but can happen if very long SQL commands or data values are sent. (It is much more probable if the application sends data via <command>COPY IN</command>, however.) To prevent this possibility and achieve completely nonblocking database operation, the following additional functions can be used. <placeholder-1/>
ru: Используя функции, описанные выше, можно избежать блокирования, ожидая ввода от сервера баз данных. Однако, всё же возможно, что приложение будет заблокировано в ожидании отправки вывода на сервер. Это бывает относительно нечасто, но может иметь место, если отправлены очень длинные SQL-команды или значения данных. (Однако, это значительно более вероятно, если приложение отправляет данные через команду <command>COPY IN</command>.) Чтобы предотвратить эту возможность и достичь совершенно неблокирующего режима работы с базой данных, можно использовать следующие дополнительные функции. <placeholder-1/>

source: After sending any command or data on a nonblocking connection, call <function>PQflush</function>. If it returns 1, wait for the socket to become read- or write-ready. If it becomes write-ready, call <function>PQflush</function> again. If it becomes read-ready, call <function>PQconsumeInput</function>, then call <function>PQflush</function> again. Repeat until <function>PQflush</function> returns 0. (It is necessary to check for read-ready and drain the input with <function>PQconsumeInput</function>, because the server can block trying to send us data, e.g. NOTICE messages, and won't read our data until we read its.) Once <function>PQflush</function> returns 0, wait for the socket to be read-ready and then read the response as described above.
ru: После отправки любой команды или данных через неблокирующее подключение следует вызвать функцию <function>PQflush</function>. Если она возвратит 1, подождите, пока сокет станет готовым к чтению или записи. Если он станет готовым к записи, то вызовите <function>PQflush</function> снова. Если он станет готовым к чтению, то вызовите <function>PQconsumeInput</function>, а затем вызовите <function>PQflush</function> снова. Повторяйте до тех пор, пока <function>PQflush</function> не возвратит 0. (Необходимо выполнять проверку на состояние готовности к чтению и забирать входные данные с помощью <function>PQconsumeInput</function>, потому что сервер может заблокироваться, пытаясь отправить нам данные, например, сообщения NOTICE, и не будет читать наши данные до тех пор, пока мы не прочитаем его.) Как только <function>PQflush</function> возвратит 0, подождите, пока сокет не станет готовым к чтению, а затем прочитайте ответ, как описано выше.

source: Retrieving Query Results Row-By-Row
ru: Построчное извлечение результатов запроса

source: <primary>libpq</primary> <secondary>single-row mode</secondary>
ru: <primary>libpq</primary> <secondary>однострочный режим</secondary>

source: Ordinarily, <application>libpq</application> collects a SQL command's entire result and returns it to the application as a single <structname>PGresult</structname>. This can be unworkable for commands that return a large number of rows. For such cases, applications can use <function>PQsendQuery</function> and <function>PQgetResult</function> in <firstterm>single-row mode</firstterm>. In this mode, the result row(s) are returned to the application one at a time, as they are received from the server.
ru: Обычно <application>libpq</application> собирает весь результат выполнения SQL-команды и возвращает его приложению в виде единственной структуры <structname>PGresult</structname>. Это может оказаться неприемлемым для команд, которые возвращают большое число строк. В таких случаях приложение может воспользоваться функциями <function>PQsendQuery</function> и <function>PQgetResult</function> в <firstterm>однострочном режиме</firstterm>. В этом режиме результирующие строки передаются приложению по одной за один раз, по мере того, как они принимаются от сервера.
