Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: Returns true (1) if the connection authentication method required a password, but none was available. Returns false (0) if not. <synopsis> int PQconnectionNeedsPassword(const PGconn *conn); </synopsis>
ru: Возвращает true (1), если метод аутентификации соединения требовал пароля, однако он не был предоставлен. Возвращает false (0), если пароль не требовался. <synopsis> int PQconnectionNeedsPassword(const PGconn *conn); </synopsis>

source: This function can be applied after a failed connection attempt to decide whether to prompt the user for a password.
ru: Эту функцию можно применить после неудачной попытки подключения, чтобы решить, нужно ли предлагать пользователю ввести пароль.

source: Returns true (1) if the connection authentication method used a password. Returns false (0) if not. <synopsis> int PQconnectionUsedPassword(const PGconn *conn); </synopsis>
ru: Возвращает true (1), если метод аутентификации соединения использовал пароль. Возвращает false (0) в противном случае. <synopsis> int PQconnectionUsedPassword(const PGconn *conn); </synopsis>

source: This function can be applied after either a failed or successful connection attempt to detect whether the server demanded a password.
ru: Эту функцию можно применить как после неудачной, так и после успешной попытки подключения, чтобы определить, требовал ли сервер предоставления пароля.

source: The following functions return status data that can change as operations are executed on the <structname>PGconn</structname> object. <placeholder-1/>
ru: Следующие функции возвращают данные статуса, который может измениться в процессе выполнения операций на объекте <structname>PGconn</structname>. <placeholder-1/>

source: Returns true (1) if the connection uses SSL, false (0) if not. <synopsis> int PQsslInUse(const PGconn *conn); </synopsis>
ru: Возвращает true (1), если для текущего подключения используется SSL, и false (0) в противном случае. <synopsis> int PQsslInUse(const PGconn *conn); </synopsis>

source: Returns SSL-related information about the connection. <synopsis> const char *PQsslAttribute(const PGconn *conn, const char *attribute_name); </synopsis>
ru: Возвращает связанную с SSL информацию о соединении. <synopsis> const char *PQsslAttribute(const PGconn *conn, const char *attribute_name); </synopsis>

source: The list of available attributes varies depending on the SSL library being used, and the type of connection. If an attribute is not available, returns NULL.
ru: Список доступных атрибутов зависит от применяемой библиотеки SSL и типа подключения. Если атрибут недоступен, возвращается NULL.

source: Name of the SSL implementation in use. (Currently, only <literal>"OpenSSL"</literal> is implemented)
ru: Имя используемой реализации SSL. (В настоящее время поддерживается только <literal>"OpenSSL"</literal>)

source: SSL/TLS version in use. Common values are <literal>"SSLv2"</literal>, <literal>"SSLv3"</literal>, <literal>"TLSv1"</literal>, <literal>"TLSv1.1"</literal> and <literal>"TLSv1.2"</literal>, but an implementation may return other strings if some other protocol is used.
ru: Применяемая версия SSL/TLS. Наиболее распространены варианты <literal>"SSLv2"</literal>, <literal>"SSLv3"</literal>, <literal>"TLSv1"</literal>, <literal>"TLSv1.1"</literal> и <literal>"TLSv1.2"</literal>, но реализация может возвращать и другие строки, если применяется какой-то другой протокол.

source: Number of key bits used by the encryption algorithm.
ru: Число бит в ключе, используемом алгоритмом шифрования.

source: A short name of the ciphersuite used, e.g. <literal>"DHE-RSA-DES-CBC3-SHA"</literal>. The names are specific to each SSL implementation.
ru: Краткое имя применяемого комплекта шифров, например: <literal>"DHE-RSA-DES-CBC3-SHA"</literal>. Эти имена могут быть разными в разных реализациях SSL.

source: If SSL compression is in use, returns the name of the compression algorithm, or "on" if compression is used but the algorithm is not known. If compression is not in use, returns "off".
ru: Если применяется сжатие SSL, возвращает имя алгоритма сжатия, либо "on", если сжатие используется, но его алгоритм неизвестен. Если сжатие не применяется, возвращает "off".

source: The following attributes are commonly available: <placeholder-1/>
ru: Обычно доступны следующие атрибуты: <placeholder-1/>

source: Return an array of SSL attribute names available. The array is terminated by a NULL pointer. <synopsis> const char * const * PQsslAttributeNames(const PGconn *conn); </synopsis>
ru: Возвращает массив имён доступных атрибутов SSL. Завершается массив указателем NULL. <synopsis> const char * const * PQsslAttributeNames(const PGconn *conn); </synopsis>

source: Return a pointer to an SSL-implementation-specific object describing the connection. <synopsis> void *PQsslStruct(const PGconn *conn, const char *struct_name); </synopsis>
ru: Возвращает указатель на специфичный для реализации SSL объект, описывающий подключение. <synopsis> void *PQsslStruct(const PGconn *conn, const char *struct_name); </synopsis>

source: The struct(s) available depend on the SSL implementation in use. For OpenSSL, there is one struct, available under the name "OpenSSL", and it returns a pointer to the OpenSSL <literal>SSL</literal> struct. To use this function, code along the following lines could be used: <placeholder-1/>
ru: Доступная структура (или структуры) зависит от того, какая реализация SSL применяется. Для OpenSSL выдаётся одна структура под именем "OpenSSL", и эта структура, на которую указывает возвращённый указатель, имеет тип <literal>SSL</literal> (определённый в OpenSSL). Для обращения к этой функции можно воспользоваться кодом в следующих строках: <placeholder-1/>

source: This structure can be used to verify encryption levels, check server certificates, and more. Refer to the <productname>OpenSSL</productname> documentation for information about this structure.
ru: Эта структура может использоваться, чтобы сличить уровни шифрования, проверить сертификаты сервера и т. д. За информацией об этой структуре обратитесь к документации по <productname>OpenSSL</productname>.

source: <primary>SSL</primary><secondary sortas="libpq">in libpq</secondary>
ru: <primary>SSL</primary> <secondary sortas="libpq">в libpq</secondary>

source: <placeholder-1/> Returns the SSL structure used in the connection, or null if SSL is not in use. <synopsis> void *PQgetssl(const PGconn *conn); </synopsis>
ru: <placeholder-1/> Возвращает структуру SSL, использовавшуюся в соединении, или null, если SSL не используется. <synopsis> void *PQgetssl(const PGconn *conn); </synopsis>

source: This function is equivalent to <literal>PQsslStruct(conn, "OpenSSL")</literal>. It should not be used in new applications, because the returned struct is specific to OpenSSL and will not be available if another SSL implementation is used. To check if a connection uses SSL, call <function>PQsslInUse</function> instead, and for more details about the connection, use <function>PQsslAttribute</function>.
ru: Эта функция равнозначна <literal>PQsslStruct(conn, "OpenSSL")</literal>. Её не следует применять в новых приложениях, так как возвращаемая структура специфична для OpenSSL и её нельзя будет получить с другой реализацией SSL. Чтобы проверить, использует ли подключение SSL, лучше вызвать <function>PQsslInUse</function>, а чтобы получить свойства подключения — <function>PQsslAttribute</function>.

source: The following functions return information related to SSL. This information usually doesn't change after a connection is established. <placeholder-1/>
ru: Следующие функции возвращают информацию, относящуюся к SSL. Эта информация обычно не меняется после того, как подключение установлено. <placeholder-1/>

source: Command Execution Functions
ru: Функции для исполнения команд

source: Once a connection to a database server has been successfully established, the functions described here are used to perform SQL queries and commands.
ru: После того как соединение с сервером было успешно установлено, функции, описанные в этом разделе, используются для выполнения SQL-запросов и команд.

source: Main Functions
ru: Главные функции

source: Submits a command to the server and waits for the result. <synopsis> PGresult *PQexec(PGconn *conn, const char *command); </synopsis>
ru: Передаёт команду серверу и ожидает результата. <synopsis> PGresult *PQexec(PGconn *conn, const char *command); </synopsis>

source: Returns a <structname>PGresult</structname> pointer or possibly a null pointer. A non-null pointer will generally be returned except in out-of-memory conditions or serious errors such as inability to send the command to the server. The <function>PQresultStatus</function> function should be called to check the return value for any errors (including the value of a null pointer, in which case it will return <symbol>PGRES_FATAL_ERROR</symbol>). Use <function>PQerrorMessage</function> to get more information about such errors.
ru: Возвращает указатель на <structname>PGresult</structname> или, возможно, пустой указатель (null). Как правило, возвращается непустой указатель, исключением являются ситуации нехватки памяти или серьёзные ошибки, такие, как невозможность отправки команды серверу. Для проверки возвращаемого значения на наличие ошибок следует вызывать функцию <function>PQresultStatus</function> (в случае нулевого указателя она возвратит <symbol>PGRES_FATAL_ERROR</symbol>). Для получения дополнительной информации о таких ошибках используйте функцию <function>PQerrorMessage</function>.

source: <placeholder-1/> The command string can include multiple SQL commands (separated by semicolons). Multiple queries sent in a single <function>PQexec</function> call are processed in a single transaction, unless there are explicit <command>BEGIN</command>/<command>COMMIT</command> commands included in the query string to divide it into multiple transactions. Note however that the returned <structname>PGresult</structname> structure describes only the result of the last command executed from the string. Should one of the commands fail, processing of the string stops with it and the returned <structname>PGresult</structname> describes the error condition.
ru: <placeholder-1/> Строка команды может включать в себя более одной SQL-команды (которые разделяются точкой с запятой). Несколько запросов, отправленных с помощью одного вызова <function>PQexec</function>, обрабатываются в рамках одной транзакции, если только команды <command>BEGIN</command>/<command>COMMIT</command> не включены явно в строку запроса, чтобы разделить его на несколько транзакций. Обратите внимание, однако, что возвращаемая структура <structname>PGresult</structname> описывает только результат последней из выполненных команд, содержащихся в строке запроса. Если одна из команд завершается сбоем, то обработка строки запроса на этом останавливается, и возвращённая структура <structname>PGresult</structname> описывает состояние ошибки.

source: Submits a command to the server and waits for the result, with the ability to pass parameters separately from the SQL command text. <synopsis> PGresult *PQexecParams(PGconn *conn, const char *command, int nParams, const Oid *paramTypes, const char * const *paramValues, const int *paramLengths, const int *paramFormats, int resultFormat); </synopsis>
ru: Отправляет команду серверу и ожидает результата. Имеет возможность передать параметры отдельно от текста SQL-команды. <synopsis> PGresult *PQexecParams(PGconn *conn, const char *command, int nParams, const Oid *paramTypes, const char * const *paramValues, const int *paramLengths, const int *paramFormats, int resultFormat); </synopsis>

source: <function>PQexecParams</function> is like <function>PQexec</function>, but offers additional functionality: parameter values can be specified separately from the command string proper, and query results can be requested in either text or binary format. <function>PQexecParams</function> is supported only in protocol 3.0 and later connections; it will fail when using protocol 2.0.
ru: <function>PQexecParams</function> подобна <function>PQexec</function>, но предлагает дополнительную функциональность: значения параметров могут быть указаны отдельно от самой строки-команды, а результаты запроса могут быть затребованы либо в текстовом, либо в двоичном формате. <function>PQexecParams</function> поддерживается только при подключениях по протоколу версии 3.0 или более поздних версий. Её вызов завершится сбоем при использовании протокола версии 2.0.

source: The connection object to send the command through.
ru: Объект, описывающий подключение, через которое пересылается команда.

source: The SQL command string to be executed. If parameters are used, they are referred to in the command string as <literal>$1</literal>, <literal>$2</literal>, etc.
ru: Строка SQL-команды, которая должна быть выполнена. Если используются параметры, то в строке команды на них ссылаются, как <literal>$1</literal>, <literal>$2</literal> и т. д.

source: The number of parameters supplied; it is the length of the arrays <parameter>paramTypes[]</parameter>, <parameter>paramValues[]</parameter>, <parameter>paramLengths[]</parameter>, and <parameter>paramFormats[]</parameter>. (The array pointers can be <symbol>NULL</symbol> when <parameter>nParams</parameter> is zero.)
ru: Число предоставляемых параметров. Оно равно длине массивов <parameter>paramTypes[]</parameter>, <parameter>paramValues[]</parameter>, <parameter>paramLengths[]</parameter> и <parameter>paramFormats[]</parameter>. (Указатели на массивы могут быть равны <symbol>NULL</symbol>, когда <parameter>nParams</parameter> равно нулю.)

source: Specifies, by OID, the data types to be assigned to the parameter symbols. If <parameter>paramTypes</parameter> is <symbol>NULL</symbol>, or any particular element in the array is zero, the server infers a data type for the parameter symbol in the same way it would do for an untyped literal string.
ru: Предписывает, посредством OID, типы данных, которые должны быть назначены параметрам. Если значение <parameter>paramTypes </parameter> равно <symbol>NULL</symbol> или какой-либо отдельный элемент в массиве равен нулю, тогда сервер самостоятельно определит тип данных для параметра точно таким же образом, как он сделал бы для литеральной строки, тип которой не указан.

source: Specifies the actual values of the parameters. A null pointer in this array means the corresponding parameter is null; otherwise the pointer points to a zero-terminated text string (for text format) or binary data in the format expected by the server (for binary format).
ru: Указывает фактические значения параметров. Нулевой указатель в этом массиве означает, что соответствующий параметр равен null; в противном случае указатель указывает на текстовую строку, завершающуюся нулевым символом (для текстового формата), или на двоичные данные в формате, которого ожидает сервер (для двоичного формата).

source: Specifies the actual data lengths of binary-format parameters. It is ignored for null parameters and text-format parameters. The array pointer can be null when there are no binary parameters.
ru: Указывает фактические длины данных для параметров, представленных в двоичном формате. Он игнорируется для параметров, имеющих значение null, и для параметров, представленных в текстовом формате. Указатель на массив может быть нулевым, когда нет двоичных параметров.

source: Specifies whether parameters are text (put a zero in the array entry for the corresponding parameter) or binary (put a one in the array entry for the corresponding parameter). If the array pointer is null then all parameters are presumed to be text strings.
ru: Указывает, являются ли параметры текстовыми (поместите нуль в элемент массива, соответствующий такому параметру) или двоичными (поместите единицу в элемент массива, соответствующий такому параметру). Если указатель на массив является нулевым, тогда все параметры считаются текстовыми строками.

source: Values passed in binary format require knowledge of the internal representation expected by the backend. For example, integers must be passed in network byte order. Passing <type>numeric</type> values requires knowledge of the server storage format, as implemented in <filename>src/backend/utils/adt/numeric.c::numeric_send()</filename> and <filename>src/backend/utils/adt/numeric.c::numeric_recv()</filename>.
ru: Значения, переданные в двоичном формате, требуют знания внутреннего представления, которого ожидает сервер. Например, целые числа должны передаваться с использованием сетевого порядка байтов. Передача значений типа <type>numeric</type> требует знания того формата, в котором их хранит сервер, как это реализовано в <filename>src/backend/utils/adt/numeric.c::numeric_send()</filename> и <filename>src/backend/utils/adt/numeric.c::numeric_recv()</filename>.

source: Specify zero to obtain results in text format, or one to obtain results in binary format. (There is not currently a provision to obtain different result columns in different formats, although that is possible in the underlying protocol.)
ru: Требует указать ноль, чтобы получить результаты в текстовом формате, или единицу, чтобы получить результаты в двоичном формате. (В настоящее время нет возможности получить различные столбцы результата в разных форматах, хотя это и возможно на уровне протокола, лежащего в основе подключений.)

source: The function arguments are: <placeholder-1/>
ru: Параметры функции следующие: <placeholder-1/>

source: The primary advantage of <function>PQexecParams</function> over <function>PQexec</function> is that parameter values can be separated from the command string, thus avoiding the need for tedious and error-prone quoting and escaping.
ru: Важнейшим преимуществом <function>PQexecParams</function> над <function>PQexec</function> является то, что значения параметров могут быть отделены от строки-команды. Это позволяет избежать использования кавычек и экранирующих символов, что является трудоёмким методом, часто приводящим к ошибкам.

source: Unlike <function>PQexec</function>, <function>PQexecParams</function> allows at most one SQL command in the given string. (There can be semicolons in it, but not more than one nonempty command.) This is a limitation of the underlying protocol, but has some usefulness as an extra defense against SQL-injection attacks.
ru: В отличие от <function>PQexec</function>, <function>PQexecParams</function> позволяет включать не более одной SQL-команды в строку запроса. (В ней могут содержаться точки с запятой, однако может присутствовать не более одной непустой команды.) Это ограничение накладывается базовым протоколом, но оно приносит и некоторую пользу в качестве дополнительной защиты от атак методом SQL-инъекций.

source: Specifying parameter types via OIDs is tedious, particularly if you prefer not to hard-wire particular OID values into your program. However, you can avoid doing so even in cases where the server by itself cannot determine the type of the parameter, or chooses a different type than you want. In the SQL command text, attach an explicit cast to the parameter symbol to show what data type you will send. For example: <placeholder-1/> This forces parameter <literal>$1</literal> to be treated as <type>bigint</type>, whereas by default it would be assigned the same type as <literal>x</literal>. Forcing the parameter type decision, either this way or by specifying a numeric type OID, is strongly recommended when sending parameter values in binary format, because binary format has less redundancy than text format and so there is less chance that the server will detect a type mismatch mistake for you.
ru: Указание типов параметров с помощью OID является трудоёмким, особенно если вы предпочитаете не указывать явно значений OID в вашей программе. Однако, вы можете избежать этого даже в случаях, когда сервер самостоятельно не может определить тип параметра или выбирает не тот тип, который вы хотите. В строке SQL-команды добавьте явное приведение типа для этого параметра, чтобы показать, какой тип данных вы будете отправлять. Например: <placeholder-1/> Это приведёт к тому, что параметр <literal>$1</literal> будет считаться имеющим тип <type>bigint</type>, в то время как по умолчанию ему был бы назначен тот же самый тип, что и <literal>x</literal>. Такое явное принятие решения о типе параметра либо с помощью описанного метода, либо путём задания числового OID строго рекомендуется, когда значения параметров отправляются в двоичном формате, поскольку двоичный формат имеет меньшую избыточность, чем текстовый, и поэтому гораздо менее вероятно, что сервер обнаружит ошибку несоответствия типов, допущенную вами.

source: Submits a request to create a prepared statement with the given parameters, and waits for completion. <synopsis> PGresult *PQprepare(PGconn *conn, const char *stmtName, const char *query, int nParams, const Oid *paramTypes); </synopsis>
ru: Отправляет запрос, чтобы создать подготовленный оператор с конкретными параметрами, и ожидает завершения. <synopsis> PGresult *PQprepare(PGconn *conn, const char *stmtName, const char *query, int nParams, const Oid *paramTypes); </synopsis>

source: <function>PQprepare</function> creates a prepared statement for later execution with <function>PQexecPrepared</function>. This feature allows commands to be executed repeatedly without being parsed and planned each time; see <xref linkend="sql-prepare"/> for details. <function>PQprepare</function> is supported only in protocol 3.0 and later connections; it will fail when using protocol 2.0.
ru: <function>PQprepare</function> создаёт подготовленный оператор для последующего исполнения с помощью <function>PQexecPrepared</function>. Благодаря этому, команды, которые будут выполняться многократно, не потребуется разбирать и планировать каждый раз; за подробностями обратитесь к <xref remap="3" linkend="sql-prepare"/>. <function>PQprepare</function> поддерживается только с подключениями по протоколу 3.0 и новее; с протоколом 2.0 эта функция работать не будет.
