Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: Returns the result's <literal>instanceData</literal> associated with <parameter>proc</parameter>, or <symbol>NULL</symbol> if there is none. <synopsis> void *PQresultInstanceData(const PGresult *res, PGEventProc proc); </synopsis>
ru: Возвращает для объекта результата (<parameter>res</parameter>) указатель на <literal>instanceData</literal>, связанный с обработчиком <parameter>proc</parameter>, либо <symbol>NULL</symbol>, если такого обработчика нет. <synopsis> void *PQresultInstanceData(const PGresult *res, PGEventProc proc); </synopsis>

source: Event Example
ru: Пример обработки событий

source: Here is a skeleton example of managing private data associated with libpq connections and results.
ru: Ниже показан схематичный пример управления внутренними данными, связанными с подключениями и результатами libpq.

source: Environment Variables
ru: Переменные окружения

source: <primary>environment variable</primary>
ru: <primary>переменная окружения</primary>

source: <placeholder-1/> <envar>PGHOST</envar> behaves the same as the <xref linkend="libpq-connect-host"/> connection parameter.
ru: <placeholder-1/> <envar>PGHOST</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-host"/>.

source: <placeholder-1/> <envar>PGHOSTADDR</envar> behaves the same as the <xref linkend="libpq-connect-hostaddr"/> connection parameter. This can be set instead of or in addition to <envar>PGHOST</envar> to avoid DNS lookup overhead.
ru: <placeholder-1/> <envar>PGHOSTADDR</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-hostaddr"/>. Эту переменную можно задать вместо или вместе с <envar>PGHOST</envar> для предотвращения поиска адреса в DNS.

source: <placeholder-1/> <envar>PGPORT</envar> behaves the same as the <xref linkend="libpq-connect-port"/> connection parameter.
ru: <placeholder-1/> <envar>PGPORT</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-port"/>.

source: <placeholder-1/> <envar>PGDATABASE</envar> behaves the same as the <xref linkend="libpq-connect-dbname"/> connection parameter.
ru: <placeholder-1/> <envar>PGDATABASE</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-dbname"/>.

source: <placeholder-1/> <envar>PGUSER</envar> behaves the same as the <xref linkend="libpq-connect-user"/> connection parameter.
ru: <placeholder-1/> <envar>PGUSER</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-user"/>.

source: <placeholder-1/> <envar>PGPASSWORD</envar> behaves the same as the <xref linkend="libpq-connect-password"/> connection parameter. Use of this environment variable is not recommended for security reasons, as some operating systems allow non-root users to see process environment variables via <application>ps</application>; instead consider using the <filename>~/.pgpass</filename> file (see <xref linkend="libpq-pgpass"/>).
ru: <placeholder-1/> <envar>PGPASSWORD</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-password"/>. Использовать эту переменную окружения не рекомендуется по соображениям безопасности, так как в некоторых операционных системах непривилегированные пользователи могут видеть переменные окружения процессов в выводе <application>ps</application>; вместо этого лучше использовать файл <filename>~/.pgpass</filename> (см. <xref remap="4" linkend="libpq-pgpass"/>).

source: <placeholder-1/> <envar>PGPASSFILE</envar> specifies the name of the password file to use for lookups. If not set, it defaults to <filename>~/.pgpass</filename> (see <xref linkend="libpq-pgpass"/>).
ru: <placeholder-1/> <envar>PGPASSFILE</envar> устанавливает имя файла паролей, в котором будут находиться сохранённые пароли. По умолчанию применяется имя файла <filename>~/.pgpass</filename> (см. <xref remap="4" linkend="libpq-pgpass"/>).

source: <placeholder-1/> <envar>PGSERVICE</envar> behaves the same as the <xref linkend="libpq-connect-service"/> connection parameter.
ru: <placeholder-1/> <envar>PGSERVICE</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-service"/>.

source: <placeholder-1/> <envar>PGSERVICEFILE</envar> specifies the name of the per-user connection service file. If not set, it defaults to <filename>~/.pg_service.conf</filename> (see <xref linkend="libpq-pgservice"/>).
ru: <placeholder-1/> <envar>PGSERVICEFILE</envar> задаёт имя личного файла пользователя с параметрами подключения к службам. По умолчанию применяется имя файла <filename>~/.pg_service.conf</filename> (см. <xref remap="4" linkend="libpq-pgservice"/>).

source: <placeholder-1/> <envar>PGOPTIONS</envar> behaves the same as the <xref linkend="libpq-connect-options"/> connection parameter.
ru: <placeholder-1/> <envar>PGOPTIONS</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-options"/>.

source: <placeholder-1/> <envar>PGAPPNAME</envar> behaves the same as the <xref linkend="libpq-connect-application-name"/> connection parameter.
ru: <placeholder-1/> <envar>PGAPPNAME</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-application-name"/>.

source: <placeholder-1/> <envar>PGSSLMODE</envar> behaves the same as the <xref linkend="libpq-connect-sslmode"/> connection parameter.
ru: <placeholder-1/> <envar>PGSSLMODE</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-sslmode"/>.

source: <placeholder-1/> <envar>PGREQUIRESSL</envar> behaves the same as the <xref linkend="libpq-connect-requiressl"/> connection parameter. This environment variable is deprecated in favor of the <envar>PGSSLMODE</envar> variable; setting both variables suppresses the effect of this one.
ru: <placeholder-1/> <envar>PGREQUIRESSL</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-requiressl"/>. Эта переменная окружения утратила актуальность с появлением переменной <envar>PGSSLMODE</envar>; если установить обе переменные, значение данной не возымеет эффекта.

source: <placeholder-1/> <envar>PGSSLCOMPRESSION</envar> behaves the same as the <xref linkend="libpq-connect-sslcompression"/> connection parameter.
ru: <placeholder-1/> <envar>PGSSLCOMPRESSION</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-sslcompression"/>.

source: <placeholder-1/> <envar>PGSSLCERT</envar> behaves the same as the <xref linkend="libpq-connect-sslcert"/> connection parameter.
ru: <placeholder-1/> <envar>PGSSLCERT</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-sslcert"/>.

source: <placeholder-1/> <envar>PGSSLKEY</envar> behaves the same as the <xref linkend="libpq-connect-sslkey"/> connection parameter.
ru: <placeholder-1/> <envar>PGSSLKEY</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-sslkey"/>.

source: <placeholder-1/> <envar>PGSSLROOTCERT</envar> behaves the same as the <xref linkend="libpq-connect-sslrootcert"/> connection parameter.
ru: <placeholder-1/> <envar>PGSSLROOTCERT</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-sslrootcert"/>.

source: <placeholder-1/> <envar>PGSSLCRL</envar> behaves the same as the <xref linkend="libpq-connect-sslcrl"/> connection parameter.
ru: <placeholder-1/> <envar>PGSSLCRL</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-sslcrl"/>.

source: <placeholder-1/> <envar>PGREQUIREPEER</envar> behaves the same as the <xref linkend="libpq-connect-requirepeer"/> connection parameter.
ru: <placeholder-1/> <envar>PGREQUIREPEER</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-requirepeer"/>.

source: <placeholder-1/> <envar>PGKRBSRVNAME</envar> behaves the same as the <xref linkend="libpq-connect-krbsrvname"/> connection parameter.
ru: <placeholder-1/> <envar>PGKRBSRVNAME</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-krbsrvname"/>.

source: <placeholder-1/> <envar>PGGSSLIB</envar> behaves the same as the <xref linkend="libpq-connect-gsslib"/> connection parameter.
ru: <placeholder-1/> <envar>PGGSSLIB</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-gsslib"/>.

source: <placeholder-1/> <envar>PGCONNECT_TIMEOUT</envar> behaves the same as the <xref linkend="libpq-connect-connect-timeout"/> connection parameter.
ru: <placeholder-1/> <envar>PGCONNECT_TIMEOUT</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-connect-timeout"/>.

source: <placeholder-1/> <envar>PGCLIENTENCODING</envar> behaves the same as the <xref linkend="libpq-connect-client-encoding"/> connection parameter.
ru: <placeholder-1/> <envar>PGCLIENTENCODING</envar> действует так же, как параметр соединения <xref linkend="libpq-connect-client-encoding"/>.

source: The following environment variables can be used to select default connection parameter values, which will be used by <function>PQconnectdb</function>, <function>PQsetdbLogin</function> and <function>PQsetdb</function> if no value is directly specified by the calling code. These are useful to avoid hard-coding database connection information into simple client applications, for example. <placeholder-1/>
ru: Воспользовавшись следующими переменными окружения, можно задать значения параметров соединения по умолчанию, которые будут использоваться функциями <function>PQconnectdb</function>, <function>PQsetdbLogin</function> и <function>PQsetdb</function>, если никакое значение не будет задано вызывающим кодом. В частности, используя их, можно обойтись без жёсткого задания параметров соединения в простых клиентских приложениях. <placeholder-1/>

source: <placeholder-1/> <envar>PGDATESTYLE</envar> sets the default style of date/time representation. (Equivalent to <literal>SET datestyle TO ...</literal>.)
ru: <placeholder-1/> <envar>PGDATESTYLE</envar> устанавливает стиль представления даты/времени по умолчанию. (Равносильно <literal>SET datestyle TO ...</literal>.)

source: <placeholder-1/> <envar>PGTZ</envar> sets the default time zone. (Equivalent to <literal>SET timezone TO ...</literal>.)
ru: <placeholder-1/> <envar>PGTZ</envar> устанавливает часовой пояс по умолчанию. (Равносильно <literal>SET timezone TO ...</literal>.)

source: <placeholder-1/> <envar>PGGEQO</envar> sets the default mode for the genetic query optimizer. (Equivalent to <literal>SET geqo TO ...</literal>.)
ru: <placeholder-1/> <envar>PGGEQO</envar> устанавливает режим по умолчанию для генетического оптимизатора запросов. (Равносильно <literal>SET geqo TO ...</literal>.)

source: The following environment variables can be used to specify default behavior for each <productname>PostgreSQL</productname> session. (See also the <xref linkend="sql-alterrole"/> and <xref linkend="sql-alterdatabase"/> commands for ways to set default behavior on a per-user or per-database basis.) <placeholder-1/> Refer to the <acronym>SQL</acronym> command <xref linkend="sql-set"/> for information on correct values for these environment variables.
ru: Следующие переменные окружения позволяют задать поведение по умолчанию для каждого отдельного сеанса <productname>PostgreSQL</productname>. (См. также описание команд <xref linkend="sql-alterrole"/> и <xref linkend="sql-alterdatabase"/>, позволяющих установить поведение по умолчанию для отдельного пользователя или отдельной базы.) <placeholder-1/> Информацию о корректных значениях этих переменных окружения можно найти в описании <acronym>SQL</acronym>-команды <xref linkend="sql-set"/>.

source: <placeholder-1/> <envar>PGSYSCONFDIR</envar> sets the directory containing the <filename>pg_service.conf</filename> file and in a future version possibly other system-wide configuration files.
ru: <placeholder-1/> <envar>PGSYSCONFDIR</envar> задаёт каталог, в котором содержится файл <filename>pg_service.conf</filename>, а в будущем он может содержать и другие общесистемные файлы конфигурации.

source: <placeholder-1/> <envar>PGLOCALEDIR</envar> sets the directory containing the <literal>locale</literal> files for message localization.
ru: <placeholder-1/> <envar>PGLOCALEDIR</envar> задаёт каталог, содержащий файлы <literal>locale</literal>, предназначенные для перевода сообщений.

source: The following environment variables determine internal behavior of <application>libpq</application>; they override compiled-in defaults. <placeholder-1/>
ru: Следующие переменные среды определяют внутреннее поведение <application>libpq</application>; они переопределяют встроенные значения. <placeholder-1/>

source: The Password File
ru: Файл паролей

source: <primary>password file</primary>
ru: <primary>файл паролей</primary>

source: The file <filename>.pgpass</filename> in a user's home directory or the file referenced by <envar>PGPASSFILE</envar> can contain passwords to be used if the connection requires a password (and no password has been specified otherwise). On Microsoft Windows the file is named <filename>%APPDATA%\postgresql\pgpass.conf</filename> (where <filename>%APPDATA%</filename> refers to the Application Data subdirectory in the user's profile).
ru: Файл <filename>.pgpass</filename> в домашнем каталоге пользователя или файл, заданный в <envar>PGPASSFILE</envar>, может содержать пароли, которые будут использоваться, если для подключения требуется пароль (и пароль не задаётся другим способом). В Microsoft Windows этот файл называется <filename>%APPDATA%\postgresql\pgpass.conf</filename> (где <filename>%APPDATA%</filename> обозначает каталог данных приложений (Application Data) в профиле пользователя).

source: This file should contain lines of the following format: <synopsis> <replaceable>hostname</replaceable>:<replaceable>port</replaceable>:<replaceable>database</replaceable>:<replaceable>username</replaceable>:<replaceable>password</replaceable> </synopsis> (You can add a reminder comment to the file by copying the line above and preceding it with <literal>#</literal>.) Each of the first four fields can be a literal value, or <literal>*</literal>, which matches anything. The password field from the first line that matches the current connection parameters will be used. (Therefore, put more-specific entries first when you are using wildcards.) If an entry needs to contain <literal>:</literal> or <literal>\</literal>, escape this character with <literal>\</literal>. A host name of <literal>localhost</literal> matches both TCP (host name <literal>localhost</literal>) and Unix domain socket (<literal>pghost</literal> empty or the default socket directory) connections coming from the local machine. In a standby server, a database name of <literal>replication</literal> matches streaming replication connections made to the master server. The <literal>database</literal> field is of limited usefulness because users have the same password for all databases in the same cluster.
ru: Этот файл должен содержать строки следующего формата: <synopsis> <replaceable>сервер</replaceable>:<replaceable>порт</replaceable>:<replaceable>база_данных</replaceable>:<replaceable>имя_пользователя</replaceable>:<replaceable>пароль</replaceable> </synopsis> (Вы можете вставить в этот файл комментарий-памятку, скопировав показанную строку в него и добавив в начало <literal>#</literal>.) Первые четыре поля могут содержать строковые значения, либо знак <literal>*</literal>, соответствующий всему. Применяться будет пароль, указанный в первой из строк, значения полей в которой соответствуют текущему соединению. (Поэтому, если вы используете звёздочки, поместите более конкретные записи первыми.) Если запись должна содержать символ <literal>:</literal> или <literal>\</literal>, добавьте перед ним <literal>\</literal>. Имени сервера <literal>localhost</literal> соответствуют локальные соединения и по TCP (по имени компьютера <literal>localhost</literal>), и через доменный сокет Unix (заданный в <literal>pghost</literal>, либо каталог сокетов по умолчанию). На резервном сервере имя базы данных <literal>replication</literal> соответствует подключениям потоковой репликации, которые устанавливает ведущий. Поле <replaceable>база_данных</replaceable> имеет ограниченную ценность, так как пользователи используют один пароль для всех баз данных в кластере.

source: On Unix systems, the permissions on <filename>.pgpass</filename> must disallow any access to world or group; achieve this by the command <command>chmod 0600 ~/.pgpass</command>. If the permissions are less strict than this, the file will be ignored. On Microsoft Windows, it is assumed that the file is stored in a directory that is secure, so no special permissions check is made.
ru: В системах Unix разрешения <filename>.pgpass</filename> должны запрещать чтение его всеми или группой; этого можно добиться командой <command>chmod 0600 ~/.pgpass</command>. Если разрешения будут менее строгими, этот файл не будет прочитан. В Microsoft Windows предполагается, что файл хранится в безопасном месте, и никакие дополнительные проверки не производятся.

source: The Connection Service File
ru: Файл соединений служб

source: <primary>connection service file</primary>
ru: <primary>файл соединений служб</primary>

source: The connection service file allows libpq connection parameters to be associated with a single service name. That service name can then be specified by a libpq connection, and the associated settings will be used. This allows connection parameters to be modified without requiring a recompile of the libpq application. The service name can also be specified using the <envar>PGSERVICE</envar> environment variable.
ru: Файл соединений служб позволяет связать параметры соединений libpq с одним именем службы. Затем это имя службы можно задать при подключении через libpq и будут применены все связанные с ним параметры. Это позволяет модифицировать параметры соединений, обходясь без перекомпиляции приложения libpq. Имя службы можно также задать в переменной окружения <envar>PGSERVICE</envar>.

source: The connection service file can be a per-user service file at <filename>~/.pg_service.conf</filename> or the location specified by the environment variable <envar>PGSERVICEFILE</envar>, or it can be a system-wide file at <filename>`pg_config --sysconfdir`/pg_service.conf</filename> or in the directory specified by the environment variable <envar>PGSYSCONFDIR</envar>. If service definitions with the same name exist in the user and the system file, the user file takes precedence.
ru: Файл соединений служб может быть личным файлом пользователя с путём <filename>~/.pg_service.conf</filename> или задаваться переменной окружения <envar>PGSERVICEFILE</envar>, либо это может быть системный файл с путём <filename>`pg_config --sysconfdir`/pg_service.conf</filename> или в каталоге, задаваемом переменной окружения <envar>PGSYSCONFDIR</envar>. Если для одного имени службы существует определение и в системном файле, и в файле пользователя, определение пользователя имеет приоритет.

source: # comment [mydb] host=somehost port=5433 user=admin
ru: # комментарий [mydb] host=somehost port=5433 user=admin

source: The file uses an <quote>INI file</quote> format where the section name is the service name and the parameters are connection parameters; see <xref linkend="libpq-paramkeywords"/> for a list. For example: <placeholder-1/> An example file is provided at <filename>share/pg_service.conf.sample</filename>.
ru: В этом файле используется формат <quote>INI-файлов</quote>, в котором имя раздела задаёт имя службы, а параметры внутри — параметры соединения; их список приведён в <xref remap="6" linkend="libpq-paramkeywords"/>. Например: <placeholder-1/> Пример такого файла можно найти в <filename>share/pg_service.conf.sample</filename>.

source: LDAP Lookup of Connection Parameters
ru: Получение параметров соединения через LDAP

source: <primary>LDAP connection parameter lookup</primary>
ru: <primary>получение параметров соединения через LDAP</primary>

source: If <application>libpq</application> has been compiled with LDAP support (option <literal><option>--with-ldap</option></literal> for <command>configure</command>) it is possible to retrieve connection options like <literal>host</literal> or <literal>dbname</literal> via LDAP from a central server. The advantage is that if the connection parameters for a database change, the connection information doesn't have to be updated on all client machines.
ru: Если библиотека <application>libpq</application> была собрана с поддержка LDAP (<command>configure</command> передавался ключ <literal><option>--with-ldap</option></literal>), такие параметры соединения, как <literal>host</literal> и <literal>dbname</literal>, можно получить через LDAP с центрального сервера. Преимущество такого подхода в том, что при изменении параметров подключения к базе данных свойства соединения не придётся изменять на всех клиентских компьютерах.

source: LDAP connection parameter lookup uses the connection service file <filename>pg_service.conf</filename> (see <xref linkend="libpq-pgservice"/>). A line in a <filename>pg_service.conf</filename> stanza that starts with <literal>ldap://</literal> will be recognized as an LDAP URL and an LDAP query will be performed. The result must be a list of <literal>keyword = value</literal> pairs which will be used to set connection options. The URL must conform to RFC 1959 and be of the form <synopsis> ldap://[<replaceable>hostname</replaceable>[:<replaceable>port</replaceable>]]/<replaceable>search_base</replaceable>?<replaceable>attribute</replaceable>?<replaceable>search_scope</replaceable>?<replaceable>filter</replaceable> </synopsis> where <replaceable>hostname</replaceable> defaults to <literal>localhost</literal> and <replaceable>port</replaceable> defaults to 389.
ru: Для получения параметров соединений через LDAP используется файл соединений служб <filename>pg_service.conf</filename> (см. <xref remap="4" linkend="libpq-pgservice"/>). Строка в <filename>pg_service.conf</filename>, начинающаяся с указания протокола <literal>ldap://</literal>, будет воспринята как URL в LDAP и выполнится как запрос к LDAP. Результатом запроса должен быть список пар <literal>keyword = value</literal>, которые и будут задавать параметры соединений. Заданный URL должен соответствовать RFC 1959 и иметь следующий вид: <synopsis> ldap://[<replaceable>имя_сервера</replaceable>[:<replaceable>порт</replaceable>]]/<replaceable>база_поиска</replaceable>?<replaceable>атрибут</replaceable>?<replaceable>область_поиска</replaceable>?<replaceable>фильтр</replaceable> </synopsis>; по умолчанию <replaceable>имя_сервера</replaceable> — <literal>localhost</literal>, а <replaceable>порт</replaceable> — 389.

source: Processing of <filename>pg_service.conf</filename> is terminated after a successful LDAP lookup, but is continued if the LDAP server cannot be contacted. This is to provide a fallback with further LDAP URL lines that point to different LDAP servers, classical <literal>keyword = value</literal> pairs, or default connection options. If you would rather get an error message in this case, add a syntactically incorrect line after the LDAP URL.
ru: Обработка <filename>pg_service.conf</filename> прекращается после удачного поиска в LDAP, но если с сервером LDAP связаться не удаётся, обрабатываются следующие строки этого файла. Так сделано для того, чтобы можно было реализовать запасные варианты, добавив дополнительные строки с URL LDAP, указывающими на другие серверы LDAP, или классические пары <literal>keyword = value</literal>, либо используя параметры соединений по умолчанию. Если же вы хотите получить ошибку в этой ситуации, добавьте после строки с URL-адресом LDAP синтаксически некорректную строку.
