Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: If your application initializes <literal>libssl</literal> and/or <literal>libcrypto</literal> libraries and <application>libpq</application> is built with <acronym>SSL</acronym> support, you should call <function>PQinitOpenSSL</function> to tell <application>libpq</application> that the <literal>libssl</literal> and/or <literal>libcrypto</literal> libraries have been initialized by your application, so that <application>libpq</application> will not also initialize those libraries. See <ulink url="http://h71000.www7.hp.com/doc/83final/ba554_90007/ch04.html"/> for details on the SSL API.
ru: Если ваше приложение инициализирует библиотеку <literal>libssl</literal> и/или <literal>libcrypto</literal>, и <application>libpq</application> собрана с поддержкой <acronym>SSL</acronym>, вы должны вызвать <function>PQinitOpenSSL</function>, чтобы сообщить <application>libpq</application>, что библиотека <literal>libssl</literal> и/или <literal>libcrypto</literal> уже инициализированы вашим приложением, чтобы <application>libpq</application> не пыталась ещё раз инициализировать их. Более подробно API SSL описано на странице <ulink url="http://h71000.www7.hp.com/doc/83final/ba554_90007/ch04.html"/>.

source: Allows applications to select which security libraries to initialize. <synopsis> void PQinitOpenSSL(int do_ssl, int do_crypto); </synopsis>
ru: Позволяет приложениям выбрать, какие библиотеки безопасности нужно инициализировать. <synopsis> void PQinitOpenSSL(int do_ssl, int do_crypto); </synopsis>

source: When <parameter>do_ssl</parameter> is non-zero, <application>libpq</application> will initialize the <application>OpenSSL</application> library before first opening a database connection. When <parameter>do_crypto</parameter> is non-zero, the <literal>libcrypto</literal> library will be initialized. By default (if <function>PQinitOpenSSL</function> is not called), both libraries are initialized. When SSL support is not compiled in, this function is present but does nothing.
ru: Когда параметр <parameter>do_ssl</parameter> отличен от нуля, <application>libpq</application> будет инициализировать библиотеку <application>OpenSSL</application> перед первым подключением к базе данных. Когда параметр <parameter>do_crypto</parameter> не равен нулю, будет инициализироваться библиотека <literal>libcrypto</literal>. По умолчанию (если функция <function>PQinitOpenSSL</function> не вызывается) инициализируются обе библиотеки. Если поддержка SSL не была скомпилирована, эта функция присутствует, но ничего не делает.

source: If your application uses and initializes either <application>OpenSSL</application> or its underlying <literal>libcrypto</literal> library, you <emphasis>must</emphasis> call this function with zeroes for the appropriate parameter(s) before first opening a database connection. Also be sure that you have done that initialization before opening a database connection.
ru: Если ваше приложение использует и инициализирует библиотеку <application>OpenSSL</application> или её нижележащую библиотеку <literal>libcrypto</literal>, вы <emphasis>должны</emphasis> вызвать эту функцию, передав нули в соответствующих параметрах, перед первым подключением к базе данных. Собственно инициализацию также важно произвести перед установлением подключения.

source: Allows applications to select which security libraries to initialize. <synopsis> void PQinitSSL(int do_ssl); </synopsis>
ru: Позволяет приложениям выбрать, какие библиотеки безопасности нужно инициализировать. <synopsis> void PQinitSSL(int do_ssl); </synopsis>

source: This function is equivalent to <literal>PQinitOpenSSL(do_ssl, do_ssl)</literal>. It is sufficient for applications that initialize both or neither of <application>OpenSSL</application> and <literal>libcrypto</literal>.
ru: Эта функция равнозначна вызову <literal>PQinitOpenSSL(do_ssl, do_ssl)</literal>. Приложениям достаточно инициализировать или не инициализировать обе библиотеки <application>OpenSSL</application> и <literal>libcrypto</literal> одновременно.

source: <function>PQinitSSL</function> has been present since <productname>PostgreSQL</productname> 8.0, while <function>PQinitOpenSSL</function> was added in <productname>PostgreSQL</productname> 8.4, so <function>PQinitSSL</function> might be preferable for applications that need to work with older versions of <application>libpq</application>.
ru: Функция <function>PQinitSSL</function> существует со времён <productname>PostgreSQL</productname> 8.0, тогда как <function>PQinitOpenSSL</function> появилась в <productname>PostgreSQL</productname> 8.4, так что <function>PQinitSSL</function> может быть предпочтительней для приложений, которым нужно работать с более старыми версиями <application>libpq</application>.

source: Behavior in Threaded Programs
ru: Поведение в многопоточных программах

source: <primary>threads</primary> <secondary>with libpq</secondary>
ru: <primary>потоки</primary> <secondary>с libpq</secondary>

source: <application>libpq</application> is reentrant and thread-safe by default. You might need to use special compiler command-line options when you compile your application code. Refer to your system's documentation for information about how to build thread-enabled applications, or look in <filename>src/Makefile.global</filename> for <literal>PTHREAD_CFLAGS</literal> and <literal>PTHREAD_LIBS</literal>. This function allows the querying of <application>libpq</application>'s thread-safe status:
ru: Библиотека <application>libpq</application> по умолчанию поддерживает повторные вызовы и многопоточность. Для соответствующего варианта сборки вашего приложения вам может понадобиться передать компилятору специальные параметры командной строки. Чтобы узнать, как собрать многопоточное приложение, обратитесь к документации вашей системы или поищите в файле <filename>src/Makefile.global</filename> значения <literal>PTHREAD_CFLAGS</literal> и <literal>PTHREAD_LIBS</literal>. Эта функция позволяет узнать, поддерживает ли <application>libpq</application> многопоточность:

source: Returns the thread safety status of the <application>libpq</application> library. <synopsis> int PQisthreadsafe(); </synopsis>
ru: Возвращает состояние потокобезопасности в библиотеке <application>libpq</application>. <synopsis> int PQisthreadsafe(); </synopsis>

source: Returns 1 if the <application>libpq</application> is thread-safe and 0 if it is not.
ru: Возвращает 1, если библиотека <application>libpq</application> потокобезопасная, или 0 в противном случае.

source: One thread restriction is that no two threads attempt to manipulate the same <structname>PGconn</structname> object at the same time. In particular, you cannot issue concurrent commands from different threads through the same connection object. (If you need to run concurrent commands, use multiple connections.)
ru: Реализация многопоточности не лишена ограничений: два потока не должны пытаться одновременно работать с одним объектом <structname>PGconn</structname>. В частности, не допускается параллельное выполнение команд из разных потоков через один объект соединения. (Если вам нужно выполнять команды одновременно, используйте несколько соединений.)

source: <structname>PGresult</structname> objects are normally read-only after creation, and so can be passed around freely between threads. However, if you use any of the <structname>PGresult</structname>-modifying functions described in <xref linkend="libpq-misc"/> or <xref linkend="libpq-events"/>, it's up to you to avoid concurrent operations on the same <structname>PGresult</structname>, too.
ru: Объекты <structname>PGresult</structname> после создания обычно доступны только для чтения, и поэтому их можно свободно передавать между потоками. Однако, если вы используете какую-либо из функций, изменяющих <structname>PGresult</structname>, описанных в <xref remap="6" linkend="libpq-misc"/> или <xref remap="6" linkend="libpq-events"/>, вы должны также избегать одновременных обращений к одному объекту <structname>PGresult</structname>.

source: The deprecated functions <function>PQrequestCancel</function> and <function>PQoidStatus</function> are not thread-safe and should not be used in multithread programs. <function>PQrequestCancel</function> can be replaced by <function>PQcancel</function>. <function>PQoidStatus</function> can be replaced by <function>PQoidValue</function>.
ru: Устаревшие функции <function>PQrequestCancel</function> и <function>PQoidStatus</function> не являются потокобезопасными и не должны применяться в многопоточных программах. Вместо <function>PQrequestCancel</function> можно использовать <function>PQcancel</function>, а вместо <function>PQoidStatus</function> — <function>PQoidValue</function>.

source: If you are using Kerberos inside your application (in addition to inside <application>libpq</application>), you will need to do locking around Kerberos calls because Kerberos functions are not thread-safe. See function <function>PQregisterThreadLock</function> in the <application>libpq</application> source code for a way to do cooperative locking between <application>libpq</application> and your application.
ru: Если вы применяете Kerberos в своём приложении (помимо возможного использования внутри <application>libpq</application>), вы должны обеспечить блокировку вокруг вызовов Kerberos, так как функции Kerberos не являются потокобезопасными. Обратите внимание на функцию <function>PQregisterThreadLock</function> в исходном коде <application>libpq</application>, позволяющую организовать совместные блокировки между <application>libpq</application> и вашим приложением.

source: If you experience problems with threaded applications, run the program in <filename>src/tools/thread</filename> to see if your platform has thread-unsafe functions. This program is run by <filename>configure</filename>, but for binary distributions your library might not match the library used to build the binaries.
ru: Если вы сталкиваетесь с проблемами многопоточности в приложениях, запустите программу <filename>src/tools/thread</filename>, чтобы понять, есть ли в вашей системе небезопасные при многопоточности функции. Эта программа запускается скриптом <filename>configure</filename>, но если вы устанавливаете двоичный пакет, ваши библиотеки могут не соответствовать тем, что использовались при сборке.

source: Building <application>libpq</application> Programs
ru: Сборка программ с <application>libpq</application>

source: <primary>compiling</primary> <secondary>libpq applications</secondary>
ru: <primary>компиляция</primary> <secondary>приложений с libpq</secondary>

source: Include the <filename>libpq-fe.h</filename> header file: <placeholder-1/> If you failed to do that then you will normally get error messages from your compiler similar to: <screen> foo.c: In function `main': foo.c:34: `PGconn' undeclared (first use in this function) foo.c:35: `PGresult' undeclared (first use in this function) foo.c:54: `CONNECTION_BAD' undeclared (first use in this function) foo.c:68: `PGRES_COMMAND_OK' undeclared (first use in this function) foo.c:95: `PGRES_TUPLES_OK' undeclared (first use in this function) </screen>
ru: Включите заголовочный файл <filename>libpq-fe.h</filename>: <placeholder-1/> Если вы не сделаете этого, обычно вас ждут примерно такие сообщения об ошибках от компилятора: <screen> foo.c: In function `main': foo.c:34: `PGconn' undeclared (first use in this function) foo.c:35: `PGresult' undeclared (first use in this function) foo.c:54: `CONNECTION_BAD' undeclared (first use in this function) foo.c:68: `PGRES_COMMAND_OK' undeclared (first use in this function) foo.c:95: `PGRES_TUPLES_OK' undeclared (first use in this function) </screen>

source: Point your compiler to the directory where the <productname>PostgreSQL</productname> header files were installed, by supplying the <literal>-I<replaceable>directory</replaceable></literal> option to your compiler. (In some cases the compiler will look into the directory in question by default, so you can omit this option.) For instance, your compile command line could look like: <placeholder-1/> If you are using makefiles then add the option to the <varname>CPPFLAGS</varname> variable: <placeholder-2/>
ru: Сообщите вашему компилятору каталог, в котором установлены заголовочные файлы <productname>PostgreSQL</productname>, передав ему параметр <literal>-I<replaceable>каталог</replaceable></literal>. (В некоторых случаях компилятор сам может обращаться к нужному каталогу, так что этот параметр можно опустить.) Например, ваша команда компиляции может быть такой: <placeholder-1/> Если вы используете скрипты сборки Makefile, добавьте этот параметр в переменную <varname>CPPFLAGS</varname>: <placeholder-2/>

source: <primary>pg_config</primary><secondary sortas="libpq">with libpq</secondary>
ru: <primary>pg_config</primary> <secondary sortas="libpq">с libpq</secondary>

source: If there is any chance that your program might be compiled by other users then you should not hardcode the directory location like that. Instead, you can run the utility <command>pg_config</command><placeholder-1/> to find out where the header files are on the local system: <screen> <prompt>$</prompt> pg_config --includedir <computeroutput>/usr/local/include</computeroutput> </screen>
ru: Если существует возможность, что вашу программу будут компилировать другие пользователи, то путь к каталогу не следует жёстко задавать таким образом. Вместо этого вы можете воспользоваться утилитой <command>pg_config</command><placeholder-1/> и узнать, где в локальной системе находятся заголовочные файлы, следующим образом: <screen> <prompt>$</prompt> pg_config --includedir <computeroutput>/usr/local/include</computeroutput> </screen>

source: <primary>pkg-config</primary><secondary sortas="libpq">with libpq</secondary>
ru: <primary>pkg-config</primary> <secondary sortas="libpq">с libpq</secondary>

source: If you have <command>pkg-config</command><placeholder-1/> installed, you can run instead: <screen> <prompt>$</prompt> pkg-config --cflags libpq <computeroutput>-I/usr/local/include</computeroutput> </screen> Note that this will already include the <option>-I</option> in front of the path.
ru: Если у вас установлена программа <command>pkg-config</command><placeholder-1/>, вместо этого вы можете выполнить: <screen> <prompt>$</prompt> pkg-config --cflags libpq <computeroutput>-I/usr/local/include</computeroutput> </screen> Заметьте, что при этом перед путём сразу будет добавлен ключ <option>-I</option>.

source: Failure to specify the correct option to the compiler will result in an error message such as: <screen> testlibpq.c:8:22: libpq-fe.h: No such file or directory </screen>
ru: Если требуемый параметр не будет передан компилятору, вы получите примерно такое сообщение об ошибке: <screen> testlibpq.c:8:22: libpq-fe.h: No such file or directory </screen>

source: When linking the final program, specify the option <literal>-lpq</literal> so that the <application>libpq</application> library gets pulled in, as well as the option <literal>-L<replaceable>directory</replaceable></literal> to point the compiler to the directory where the <application>libpq</application> library resides. (Again, the compiler will search some directories by default.) For maximum portability, put the <option>-L</option> option before the <option>-lpq</option> option. For example: <placeholder-1/>
ru: При компоновке окончательной программы добавьте параметр <literal>-lpq</literal>, чтобы была подключена библиотека <application>libpq</application>, а также параметр <literal>-L<replaceable>каталог</replaceable></literal>, указывающий на каталог, в котором находится <application>libpq</application>. (Опять же, компилятор будет просматривать определённые каталоги по умолчанию.) Для максимальной переносимости указывайте ключ <option>-L</option> перед параметром <option>-lpq</option>. Например: <placeholder-1/>

source: You can find out the library directory using <command>pg_config</command> as well: <screen> <prompt>$</prompt> pg_config --libdir <computeroutput>/usr/local/pgsql/lib</computeroutput> </screen>
ru: Каталог с библиотекой можно узнать, так же используя <command>pg_config</command>: <screen> <prompt>$</prompt> pg_config --libdir <computeroutput>/usr/local/pgsql/lib</computeroutput> </screen>

source: Or again use <command>pkg-config</command>: <screen> <prompt>$</prompt> pkg-config --libs libpq <computeroutput>-L/usr/local/pgsql/lib -lpq</computeroutput> </screen> Note again that this prints the full options, not only the path.
ru: Или с помощью той же программы <command>pkg-config</command>: <screen> <prompt>$</prompt> pkg-config --libs libpq <computeroutput>-L/usr/local/pgsql/lib -lpq</computeroutput> </screen> Заметьте, что и в этом случае выводится полностью сформированный параметр, а не только путь.

source: Error messages that point to problems in this area could look like the following: <screen> testlibpq.o: In function `main': testlibpq.o(.text+0x60): undefined reference to `PQsetdbLogin' testlibpq.o(.text+0x71): undefined reference to `PQstatus' testlibpq.o(.text+0xa4): undefined reference to `PQerrorMessage' </screen> This means you forgot <option>-lpq</option>. <screen> /usr/bin/ld: cannot find -lpq </screen> This means you forgot the <option>-L</option> option or did not specify the right directory.
ru: В случае проблем в этой области возможны примерно такие сообщения об ошибках: <screen> testlibpq.o: In function `main': testlibpq.o(.text+0x60): undefined reference to `PQsetdbLogin' testlibpq.o(.text+0x71): undefined reference to `PQstatus' testlibpq.o(.text+0xa4): undefined reference to `PQerrorMessage' </screen> Они означают, что вы забыли добавить параметр <option>-lpq</option>. <screen> /usr/bin/ld: cannot find -lpq </screen> Такая ошибка означает, что вы забыли добавить ключ <option>-L</option> или не указали правильный каталог.

source: To build (i.e., compile and link) a program using <application>libpq</application> you need to do all of the following things: <placeholder-1/>
ru: Чтобы собрать (то есть, скомпилировать и скомпоновать) программу, использующую <application>libpq</application>, вы должны проделать следующие действия: <placeholder-1/>

source: Example Programs
ru: Примеры программ

source: These examples and others can be found in the directory <filename>src/test/examples</filename> in the source code distribution.
ru: Эти и другие примеры можно найти в каталоге <filename>src/test/examples</filename> в дистрибутиве исходного кода.

source: <application>libpq</application> Example Program 1
ru: Первая программа, демонстрирующая использование <application>libpq</application>

source: <application>libpq</application> Example Program 2
ru: Вторая программа, демонстрирующая использование <application>libpq</application>

source: <application>libpq</application> Example Program 3
ru: Третья программа, демонстрирующая использование <application>libpq</application>
