Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: At any time during connection, the status of the connection can be checked by calling <function>PQstatus</function>. If this call returns <symbol>CONNECTION_BAD</symbol>, then the connection procedure has failed; if the call returns <function>CONNECTION_OK</function>, then the connection is ready. Both of these states are equally detectable from the return value of <function>PQconnectPoll</function>, described above. Other states might also occur during (and only during) an asynchronous connection procedure. These indicate the current stage of the connection procedure and might be useful to provide feedback to the user for example. These statuses are: <placeholder-1/> Note that, although these constants will remain (in order to maintain compatibility), an application should never rely upon these occurring in a particular order, or at all, or on the status always being one of these documented values. An application might do something like this: <placeholder-2/>
ru: В любое время в процессе подключения его состояние можно проверить, вызвав <function>PQstatus</function>. Если этот вызов возвратит <symbol>CONNECTION_BAD</symbol>, значит, процедура подключения завершилась сбоем; если вызов возвратит <function>CONNECTION_OK</function>, значит, соединение готово. Оба эти состояния можно определить на основе возвращаемого значения функции <function>PQconnectPoll</function>, описанной выше. Другие состояния могут также иметь место в течение (и только в течение) асинхронной процедуры подключения. Они показывают текущую стадию процедуры подключения и могут быть полезны, например, для предоставления обратной связи пользователю. Вот эти состояния: <placeholder-1/> Заметьте, что, хотя эти константы и сохранятся (для поддержания совместимости), приложение никогда не должно полагаться на то, что они появятся в каком-то конкретном порядке или вообще появятся, а также на то, что состояние всегда примет одно из этих документированных значений. Приложение может сделать что-то наподобие: <placeholder-2/>

source: The <literal>connect_timeout</literal> connection parameter is ignored when using <function>PQconnectPoll</function>; it is the application's responsibility to decide whether an excessive amount of time has elapsed. Otherwise, <function>PQconnectStart</function> followed by a <function>PQconnectPoll</function> loop is equivalent to <function>PQconnectdb</function>.
ru: Параметр подключения <literal>connect_timeout</literal> игнорируется, когда используется <function>PQconnectPoll</function>; именно приложение отвечает за принятие решения о том, является ли истекшее время чрезмерным. В противном случае вызов <function>PQconnectStart</function> с последующим вызовом <function>PQconnectPoll в цикле</function> будут эквивалентны вызову <function>PQconnectdb</function>.

source: Note that if <function>PQconnectStart</function> returns a non-null pointer, you must call <function>PQfinish</function> when you are finished with it, in order to dispose of the structure and any associated memory blocks. This must be done even if the connection attempt fails or is abandoned.
ru: Заметьте, что если <function>PQconnectStart</function> возвращает ненулевой указатель, вы должны вызвать <function>PQfinish</function> для завершения, чтобы ликвидировать структуру и любые связанные с ней блоки памяти. Это должно быть сделано, даже если попытка подключения не была успешной или была прекращена.

source: Returns the default connection options. <synopsis> PQconninfoOption *PQconndefaults(void); typedef struct { char *keyword; /* The keyword of the option */ char *envvar; /* Fallback environment variable name */ char *compiled; /* Fallback compiled in default value */ char *val; /* Option's current value, or NULL */ char *label; /* Label for field in connect dialog */ char *dispchar; /* Indicates how to display this field in a connect dialog. Values are: "" Display entered value as is "*" Password field - hide value "D" Debug option - don't show by default */ int dispsize; /* Field size in characters for dialog */ } PQconninfoOption; </synopsis>
ru: Возвращает значения по умолчанию для параметров подключения. <synopsis> PQconninfoOption *PQconndefaults(void); typedef struct { char *keyword; /* Ключевое слово для данного параметра */ char *envvar; /* Имя альтернативной переменной окружения */ char *compiled; /* Альтернативное значение по умолчанию, назначенное при компиляции */ char *val; /* Текущее значение параметра или NULL */ char *label; /* Обозначение этого поля в диалоге подключения */ char *dispchar; /* Показывает, как отображать это поле в диалоге подключения. Значения следующие: "" Отображать введённое значение "как есть" "*" Поле пароля — скрывать значение "D" Параметр отладки — не показывать по умолчанию */ int dispsize; /* Размер поля в символах для диалога */ } PQconninfoOption; </synopsis>

source: Returns a connection options array. This can be used to determine all possible <function>PQconnectdb</function> options and their current default values. The return value points to an array of <structname>PQconninfoOption</structname> structures, which ends with an entry having a null <structfield>keyword</structfield> pointer. The null pointer is returned if memory could not be allocated. Note that the current default values (<structfield>val</structfield> fields) will depend on environment variables and other context. A missing or invalid service file will be silently ignored. Callers must treat the connection options data as read-only.
ru: Возвращает массив параметров подключения. Он может использоваться для определения всех возможных параметров <function>PQconnectdb</function> и их текущих значений по умолчанию. Возвращаемое значение указывает на массив структур <structname>PQconninfoOption</structname>, который завершается элементом, имеющим нулевой указатель <structfield>keyword</structfield>. Если выделить память не удалось, то возвращается нулевой указатель. Обратите внимание, что текущие значения по умолчанию (поля <structfield>val</structfield>) будут зависеть от переменных среды и другого контекста. Отсутствующий или неверный сервисный файл будет молча проигнорирован. Вызывающие функции должны рассматривать данные параметров по умолчанию как "только для чтения".

source: After processing the options array, free it by passing it to <function>PQconninfoFree</function>. If this is not done, a small amount of memory is leaked for each call to <function>PQconndefaults</function>.
ru: После обработки массива параметров освободите память, передав его функции <function>PQconninfoFree</function>. Если этого не делать, то при каждом вызове функции <function>PQconndefaults</function> будут происходить небольшие "утечки" памяти.

source: Returns the connection options used by a live connection. <synopsis> PQconninfoOption *PQconninfo(PGconn *conn); </synopsis>
ru: Возвращает параметры подключения, используемые действующим соединением. <synopsis> PQconninfoOption *PQconninfo(PGconn *conn); </synopsis>

source: Returns a connection options array. This can be used to determine all possible <function>PQconnectdb</function> options and the values that were used to connect to the server. The return value points to an array of <structname>PQconninfoOption</structname> structures, which ends with an entry having a null <structfield>keyword</structfield> pointer. All notes above for <function>PQconndefaults</function> also apply to the result of <function>PQconninfo</function>.
ru: Возвращает массив параметров подключения. Он может использоваться для определения всех возможных параметров <function>PQconnectdb</function> и значений, которые были использованы для подключения к серверу. Возвращаемое значение указывает на массив структур <structname>PQconninfoOption</structname>, который завершается элементом, имеющим нулевой указатель <structfield>keyword</structfield>. Все замечания, приведённые выше для <function>PQconndefaults</function>, также справедливы и для результата <function>PQconninfo</function>.

source: Returns parsed connection options from the provided connection string. <synopsis> PQconninfoOption *PQconninfoParse(const char *conninfo, char **errmsg); </synopsis>
ru: Возвращает разобранные параметры подключения, переданные в строке подключения. <synopsis> PQconninfoOption *PQconninfoParse(const char *conninfo, char **errmsg); </synopsis>

source: Parses a connection string and returns the resulting options as an array; or returns <symbol>NULL</symbol> if there is a problem with the connection string. This function can be used to extract the <function>PQconnectdb</function> options in the provided connection string. The return value points to an array of <structname>PQconninfoOption</structname> structures, which ends with an entry having a null <structfield>keyword</structfield> pointer.
ru: Разбирает строку подключения и возвращает результирующие параметры в виде массива; возвращает <symbol>NULL</symbol>, если возникают проблемы при разборе строки подключения. Эту функцию можно использовать для извлечения параметров функции <function>PQconnectdb</function> из предоставленной строки подключения. Возвращаемое значение указывает на массив структур <structname>PQconninfoOption</structname>, который завершается элементом, имеющим нулевой указатель <structfield>keyword</structfield>.

source: All legal options will be present in the result array, but the <literal>PQconninfoOption</literal> for any option not present in the connection string will have <literal>val</literal> set to <literal>NULL</literal>; default values are not inserted.
ru: Все разрешённые параметры будут присутствовать в результирующем массиве, но <literal>PQconninfoOption</literal> для любого параметра, не присутствующего в строке подключения, будет иметь значение <literal>NULL</literal> в поле <literal>val</literal>; значения по умолчанию не подставляются.

source: If <literal>errmsg</literal> is not <symbol>NULL</symbol>, then <literal>*errmsg</literal> is set to <symbol>NULL</symbol> on success, else to a <function>malloc</function>'d error string explaining the problem. (It is also possible for <literal>*errmsg</literal> to be set to <symbol>NULL</symbol> and the function to return <symbol>NULL</symbol>; this indicates an out-of-memory condition.)
ru: Если <literal>errmsg</literal> не равно <symbol>NULL</symbol>, тогда в случае успеха <literal>*errmsg</literal> присваивается <symbol>NULL</symbol>, а в противном случае -- адрес строки сообщения об ошибке, объясняющего проблему. Память для этой строки выделяет функция <function>malloc</function>. (Также возможна ситуация, когда <literal>*errmsg</literal> будет установлено в <symbol>NULL</symbol>, и при этом функция возвращает <symbol>NULL</symbol>. Это указывает на нехватку памяти.)

source: After processing the options array, free it by passing it to <function>PQconninfoFree</function>. If this is not done, some memory is leaked for each call to <function>PQconninfoParse</function>. Conversely, if an error occurs and <literal>errmsg</literal> is not <symbol>NULL</symbol>, be sure to free the error string using <function>PQfreemem</function>.
ru: После обработки массива параметров освободите память, передав его функции <function>PQconninfoFree</function>. Если этого не делать, тогда некоторое количество памяти будет утекать при каждом вызове <function>PQconninfoParse</function>. И наоборот, если произошла ошибка и <literal>errmsg</literal> не равно <symbol>NULL</symbol>, обязательно освободите память, занимаемую строкой сообщения об ошибке, используя <function>PQfreemem</function>.

source: Closes the connection to the server. Also frees memory used by the <structname>PGconn</structname> object. <synopsis> void PQfinish(PGconn *conn); </synopsis>
ru: Закрывает соединение с сервером. Также освобождает память, используемую объектом <structname>PGconn</structname>. <synopsis> void PQfinish(PGconn *conn); </synopsis>

source: Note that even if the server connection attempt fails (as indicated by <function>PQstatus</function>), the application should call <function>PQfinish</function> to free the memory used by the <structname>PGconn</structname> object. The <structname>PGconn</structname> pointer must not be used again after <function>PQfinish</function> has been called.
ru: Обратите внимание, что даже если попытка подключения к серверу потерпела неудачу (как показывает <function>PQstatus</function>), приложение все равно должно вызвать <function>PQfinish</function>, чтобы освободить память, используемую объектом <structname>PGconn</structname>. Указатель <structname>PGconn</structname> не должен использоваться повторно после того, как была вызвана функция <function>PQfinish</function>.

source: Resets the communication channel to the server. <synopsis> void PQreset(PGconn *conn); </synopsis>
ru: Переустанавливает канал связи с сервером. <synopsis> void PQreset(PGconn *conn); </synopsis>

source: This function will close the connection to the server and attempt to reestablish a new connection to the same server, using all the same parameters previously used. This might be useful for error recovery if a working connection is lost.
ru: Эта функция закроет подключение к серверу, а потом попытается восстановить подключение к тому же серверу, используя все те же параметры, которые использовались прежде. Это может быть полезным для восстановления после ошибки, если работающее соединение оказалось потерянным.

source: Reset the communication channel to the server, in a nonblocking manner. <synopsis> int PQresetStart(PGconn *conn); PostgresPollingStatusType PQresetPoll(PGconn *conn); </synopsis>
ru: Переустанавливает канал связи с сервером неблокирующим способом. <synopsis> int PQresetStart(PGconn *conn); PostgresPollingStatusType PQresetPoll(PGconn *conn); </synopsis>

source: These functions will close the connection to the server and attempt to reestablish a new connection to the same server, using all the same parameters previously used. This can be useful for error recovery if a working connection is lost. They differ from <function>PQreset</function> (above) in that they act in a nonblocking manner. These functions suffer from the same restrictions as <function>PQconnectStartParams</function>, <function>PQconnectStart</function> and <function>PQconnectPoll</function>.
ru: Эти функции закроют подключение к серверу, а потом попытаются восстановить подключение к тому же серверу, используя все те же параметры, которые использовались прежде. Это может быть полезным для восстановления после ошибки, если работающее соединение оказалось потерянным. Они отличаются от <function>PQreset</function> (см. выше) тем, что действуют неблокирующим способом. На эти функции налагаются те же ограничения, что и на <function>PQconnectStartParams</function>, <function>PQconnectStart</function> и <function>PQconnectPoll</function>.

source: To initiate a connection reset, call <function>PQresetStart</function>. If it returns 0, the reset has failed. If it returns 1, poll the reset using <function>PQresetPoll</function> in exactly the same way as you would create the connection using <function>PQconnectPoll</function>.
ru: Чтобы приступить к переустановке подключения, вызовите <function>PQresetStart</function>. Если она возвратит 0, переустановка завершилась неудачно. Если она возвратит 1, опросите результат переустановки, используя <function>PQresetPoll</function>, точно таким же образом, как если бы вы создавали подключение, используя <function>PQconnectPoll</function>.

source: The server is running and appears to be accepting connections.
ru: Сервер работает и, по-видимому, принимает подключения.

source: The server is running but is in a state that disallows connections (startup, shutdown, or crash recovery).
ru: Сервер работает, но находится в состоянии, которое запрещает подключения (запуск, завершение работы или восстановление после аварийного отказа).

source: The server could not be contacted. This might indicate that the server is not running, or that there is something wrong with the given connection parameters (for example, wrong port number), or that there is a network connectivity problem (for example, a firewall blocking the connection request).
ru: Контакт с сервером не удался. Это может указывать на то, что сервер не запущен или что-то не в порядке с параметрами данного подключения (например, неверный номер порта), или имеет место проблема с возможностью соединения по сети (например, брандмауэр блокирует запрос на подключение).

source: No attempt was made to contact the server, because the supplied parameters were obviously incorrect or there was some client-side problem (for example, out of memory).
ru: Никакой попытки установить контакт с сервером сделано не было, поскольку предоставленные параметры были явно некорректными, или имела место какая-то проблема на стороне клиента (например, нехватка памяти).

source: <function>PQpingParams</function> reports the status of the server. It accepts connection parameters identical to those of <function>PQconnectdbParams</function>, described above. It is not necessary to supply correct user name, password, or database name values to obtain the server status; however, if incorrect values are provided, the server will log a failed connection attempt. <synopsis> PGPing PQpingParams(const char * const *keywords, const char * const *values, int expand_dbname); </synopsis> The function returns one of the following values: <placeholder-1/>
ru: <function>PQpingParams</function> сообщает состояние сервера. Она принимает параметры подключения, идентичные тем, что получает функция <function>PQconnectdbParams</function>, описанная выше. Нет необходимости предоставлять корректные имя пользователя, пароль или имя базы данных, чтобы получить состояние сервера. Однако, если предоставлены некорректные значения, сервер занесёт в журнал неудачную попытку подключения.<synopsis> PGPing PQpingParams(const char * const *keywords, const char * const *values, int expand_dbname); </synopsis> Функция возвращает одно из следующих значений: <placeholder-1/>

source: <function>PQping</function> reports the status of the server. It accepts connection parameters identical to those of <function>PQconnectdb</function>, described above. It is not necessary to supply correct user name, password, or database name values to obtain the server status; however, if incorrect values are provided, the server will log a failed connection attempt. <synopsis> PGPing PQping(const char *conninfo); </synopsis>
ru: <function>PQping</function> сообщает состояние сервера. Она принимает параметры подключения, идентичные тем, что получает функция <function>PQconnectdb</function>, описанная выше. Нет необходимости предоставлять корректные имя пользователя, пароль или имя базы данных, чтобы получить состояние сервера. Однако, если предоставлены некорректные значения, сервер занесёт в журнал неудачную попытку подключения. <synopsis> PGPing PQping(const char *conninfo); </synopsis>

source: The return values are the same as for <function>PQpingParams</function>.
ru: Возвращаемые значения такие же, как и для <function>PQpingParams</function>.

source: The following functions deal with making a connection to a <productname>PostgreSQL</productname> backend server. An application program can have several backend connections open at one time. (One reason to do that is to access more than one database.) Each connection is represented by a <structname>PGconn</structname><placeholder-1/> object, which is obtained from the function <function>PQconnectdb</function>, <function>PQconnectdbParams</function>, or <function>PQsetdbLogin</function>. Note that these functions will always return a non-null object pointer, unless perhaps there is too little memory even to allocate the <structname>PGconn</structname> object. The <function>PQstatus</function> function should be called to check the return value for a successful connection before queries are sent via the connection object. <placeholder-2/> <placeholder-3/> <placeholder-4/>
ru: Следующие функции имеют дело с созданием подключения к серверу <productname>PostgreSQL</productname>. Прикладная программа может иметь несколько подключений к серверу, открытых одновременно. (Одна из причин этого заключается в необходимости доступа к более чем одной базе данных.) Каждое соединение представляется объектом <structname>PGconn</structname><placeholder-1/>, который можно получить от функций <function>PQconnectdb</function>, <function>PQconnectdbParams</function> или <function>PQsetdbLogin</function>. Обратите внимание, что эти функции всегда возвратят ненулевой указатель на объект, если только, возможно, не осталось слишком мало памяти даже для того, чтобы выделить её для объекта <structname>PGconn</structname>. Прежде чем передавать запросы через объект подключения, следует вызвать функцию <function>PQstatus</function> для проверки возвращаемого значения в случае успешного подключения. <placeholder-2/> <placeholder-3/> <placeholder-4/>

source: Connection Strings
ru: Строки параметров подключения

source: Several <application>libpq</application> functions parse a user-specified string to obtain connection parameters. There are two accepted formats for these strings: plain <literal>keyword = value</literal> strings and <ulink url="http://www.ietf.org/rfc/rfc3986.txt">RFC 3986</ulink> URIs.
ru: Несколько функций <application>libpq</application> занимаются разбором строки, заданной пользователем, чтобы получить параметры подключения. Для этих строк существует два общепринятых формата: простые строки вида <literal>keyword = value</literal> и URI в соответствии с <ulink url="http://www.ietf.org/rfc/rfc3986.txt">RFC 3986</ulink>.

source: Keyword/Value Connection Strings
ru: Строки параметров подключения вида "ключ/значение"

source: In the first format, each parameter setting is in the form <literal>keyword = value</literal>. Spaces around the equal sign are optional. To write an empty value, or a value containing spaces, surround it with single quotes, e.g., <literal>keyword = 'a value'</literal>. Single quotes and backslashes within the value must be escaped with a backslash, i.e., <literal>\'</literal> and <literal>\\</literal>.
ru: Согласно первому формату, установка каждого параметра выполняется в форме <literal>keyword = value</literal>. Пробелы вокруг знака равенства не являются обязательными. Для записи пустого значения или значения, содержащего пробелы, заключите его в одинарные кавычки, например, <literal>keyword = 'a value'</literal>. Одинарные кавычки и символы обратной косой черты внутри значения нужно обязательно экранировать с помощью символа обратной косой черты, т. е., <literal>\'</literal> и <literal>\\</literal>.

source: Example: <placeholder-1/>
ru: Пример: <placeholder-1/>

source: The recognized parameter key words are listed in <xref linkend="libpq-paramkeywords"/>.
ru: Ключевые слова-параметры, распознаваемые в настоящее время, приведены в <xref remap="6" linkend="libpq-paramkeywords"/>.

source: Connection URIs
ru: URI для подключения

source: The general form for a connection <acronym>URI</acronym> is: <synopsis> postgresql://[user[:password]@][netloc][:port][/dbname][?param1=value1&amp;...] </synopsis>
ru: Общая форма <acronym>URI</acronym> для подключения такова: <synopsis> postgresql://[user[:password]@][netloc][:port][/dbname][?param1=value1&amp;...] </synopsis>
