Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: Each registered event handler is associated with two pieces of data, known to <application>libpq</application> only as opaque <literal>void *</literal> pointers. There is a <firstterm>passthrough</firstterm> pointer that is provided by the application when the event handler is registered with a <structname>PGconn</structname>. The passthrough pointer never changes for the life of the <structname>PGconn</structname> and all <structname>PGresult</structname>s generated from it; so if used, it must point to long-lived data. In addition there is an <firstterm>instance data</firstterm> pointer, which starts out <symbol>NULL</symbol> in every <structname>PGconn</structname> and <structname>PGresult</structname>. This pointer can be manipulated using the <function>PQinstanceData</function>, <function>PQsetInstanceData</function>, <function>PQresultInstanceData</function> and <function>PQsetResultInstanceData</function> functions. Note that unlike the passthrough pointer, instance data of a <structname>PGconn</structname> is not automatically inherited by <structname>PGresult</structname>s created from it. <application>libpq</application> does not know what passthrough and instance data pointers point to (if anything) and will never attempt to free them &mdash; that is the responsibility of the event handler.
ru: Каждый зарегистрированный обработчик событий связывается с двумя элементами данных, которые известны <application>libpq</application> только как скрытые указатели <literal>void *</literal>. Первый <firstterm>сквозной</firstterm> указатель передаётся приложением, когда обработчик событий регистрируется в <structname>PGconn</structname>. Этот указатель никогда не меняется на протяжении жизни <structname>PGconn</structname> и все объекты <structname>PGresult</structname> создаются с ним; поэтому, если он используется, он должен указывать на долгоживущие данные. В дополнение к нему имеется указатель <firstterm>данных экземпляра</firstterm>, который изначально равен <symbol>NULL</symbol> во всех объектах <structname>PGconn</structname> и <structname>PGresult</structname>. Этим указателем можно управлять с помощью функций <function>PQinstanceData</function>, <function>PQsetInstanceData</function>, <function>PQresultInstanceData</function> и <function>PQsetResultInstanceData</function>. Заметьте, что в отличие от сквозного указателя, данные экземпляра <structname>PGconn</structname> автоматически не наследуются объектами <structname>PGresult</structname>, создаваемыми из него. Библиотека <application>libpq</application> не знает, на что указывают сквозной указатель и указатель данных экземпляра (если они ненулевые) и никогда не будет пытаться освобождать их &mdash; за это отвечает обработчик событий.

source: Event Types
ru: Типы событий

source: The enum <literal>PGEventId</literal> names the types of events handled by the event system. All its values have names beginning with <literal>PGEVT</literal>. For each event type, there is a corresponding event info structure that carries the parameters passed to the event handlers. The event types are:
ru: Перечисление <literal>PGEventId</literal> описывает типы событий, обрабатываемых системой событий. Имена всех их значений начинаются с <literal>PGEVT</literal>. Для каждого типа событий имеется соответствующая структура информации о событии, содержащая параметры, передаваемые обработчикам событий. Определены следующие типы событий:

source: The register event occurs when <function>PQregisterEventProc</function> is called. It is the ideal time to initialize any <literal>instanceData</literal> an event procedure may need. Only one register event will be fired per event handler per connection. If the event procedure fails, the registration is aborted. <synopsis> typedef struct { PGconn *conn; } PGEventRegister; </synopsis> When a <literal>PGEVT_REGISTER</literal> event is received, the <parameter>evtInfo</parameter> pointer should be cast to a <structname>PGEventRegister *</structname>. This structure contains a <structname>PGconn</structname> that should be in the <literal>CONNECTION_OK</literal> status; guaranteed if one calls <function>PQregisterEventProc</function> right after obtaining a good <structname>PGconn</structname>. When returning a failure code, all cleanup must be performed as no <literal>PGEVT_CONNDESTROY</literal> event will be sent.
ru: Событие регистрации происходит, когда вызывается <function>PQregisterEventProc</function>. Это идеальное время для инициализации данных экземпляра (<literal>instanceData</literal>), которые могут понадобиться процедуре событий. Для каждого обработчика событий в рамках соединения будет выдаваться только одно событие регистрации. Если обработка события завершается ошибкой, регистрация прерывается. <synopsis> typedef struct { PGconn *conn; } PGEventRegister; </synopsis> При поступлении события <literal>PGEVT_REGISTER</literal> указатель <parameter>evtInfo</parameter> следует привести к <structname>PGEventRegister *</structname>. Эта структура содержит объект <structname>PGconn</structname>, который должен быть в состоянии <literal>CONNECTION_OK</literal>; это гарантируется, если <function>PQregisterEventProc</function> вызывается сразу после получения рабочего объекта <structname>PGconn</structname>. В случае выдачи кода ошибки всю очистку необходимо провести самостоятельно, так как событие <literal>PGEVT_CONNDESTROY</literal> не поступит.

source: The connection reset event is fired on completion of <function>PQreset</function> or <function>PQresetPoll</function>. In both cases, the event is only fired if the reset was successful. If the event procedure fails, the entire connection reset will fail; the <structname>PGconn</structname> is put into <literal>CONNECTION_BAD</literal> status and <function>PQresetPoll</function> will return <literal>PGRES_POLLING_FAILED</literal>. <synopsis> typedef struct { PGconn *conn; } PGEventConnReset; </synopsis> When a <literal>PGEVT_CONNRESET</literal> event is received, the <parameter>evtInfo</parameter> pointer should be cast to a <structname>PGEventConnReset *</structname>. Although the contained <structname>PGconn</structname> was just reset, all event data remains unchanged. This event should be used to reset/reload/requery any associated <literal>instanceData</literal>. Note that even if the event procedure fails to process <literal>PGEVT_CONNRESET</literal>, it will still receive a <literal>PGEVT_CONNDESTROY</literal> event when the connection is closed.
ru: Событие сброса соединения происходит при завершении <function>PQreset</function> или <function>PQresetPoll</function>. В обоих случаях это событие вызывается, только если сброс был успешным. Если обработка события завершается ошибкой, происходит сбой всей операции сброса соединения; объект <structname>PGconn</structname> переходит в состояние <literal>CONNECTION_BAD</literal> и <function>PQresetPoll</function> возвращает <literal>PGRES_POLLING_FAILED</literal>. <synopsis> typedef struct { PGconn *conn; } PGEventConnReset; </synopsis> При поступлении события <literal>PGEVT_CONNRESET</literal> указатель <parameter>evtInfo</parameter> следует привести к <structname>PGEventConnReset *</structname>. Хотя переданный объект <structname>PGconn</structname> был только что сброшен, все данные события остаются неизменными. При поступлении этого события должны быть сброшены/перезагружены/вновь запрошены все сопутствующие данные <literal>instanceData</literal>. Заметьте, что даже если обработчик события выдаст ошибку при обработке <literal>PGEVT_CONNRESET</literal>, событие <literal>PGEVT_CONNDESTROY</literal> всё равно поступит при закрытии соединения.

source: The connection destroy event is fired in response to <function>PQfinish</function>. It is the event procedure's responsibility to properly clean up its event data as libpq has no ability to manage this memory. Failure to clean up will lead to memory leaks. <synopsis> typedef struct { PGconn *conn; } PGEventConnDestroy; </synopsis> When a <literal>PGEVT_CONNDESTROY</literal> event is received, the <parameter>evtInfo</parameter> pointer should be cast to a <structname>PGEventConnDestroy *</structname>. This event is fired prior to <function>PQfinish</function> performing any other cleanup. The return value of the event procedure is ignored since there is no way of indicating a failure from <function>PQfinish</function>. Also, an event procedure failure should not abort the process of cleaning up unwanted memory.
ru: Событие уничтожения соединения вызывается в ответ на вызов <function>PQfinish</function>. Обработчик этого события отвечает за корректную очистку своих данных событий, так как libpq не может управлять его памятью. Невыполнение очистки должным образом приведёт к утечкам памяти. <synopsis> typedef struct { PGconn *conn; } PGEventConnDestroy; </synopsis> При поступлении события <literal>PGEVT_CONNDESTROY</literal> указатель <parameter>evtInfo</parameter> следует привести к <structname>PGEventConnDestroy *</structname>. Это событие происходит перед тем, как <function>PQfinish</function> производит всю остальную очистку. Значение, возвращаемое обработчиком событий, игнорируется, так как из <function>PQfinish</function> никак нельзя сообщить об ошибке. Кроме того, ошибка в обработчике событий не должна прерывать процесс очистки ставшей ненужной памяти.

source: The result creation event is fired in response to any query execution function that generates a result, including <function>PQgetResult</function>. This event will only be fired after the result has been created successfully. <synopsis> typedef struct { PGconn *conn; PGresult *result; } PGEventResultCreate; </synopsis> When a <literal>PGEVT_RESULTCREATE</literal> event is received, the <parameter>evtInfo</parameter> pointer should be cast to a <structname>PGEventResultCreate *</structname>. The <parameter>conn</parameter> is the connection used to generate the result. This is the ideal place to initialize any <literal>instanceData</literal> that needs to be associated with the result. If the event procedure fails, the result will be cleared and the failure will be propagated. The event procedure must not try to <function>PQclear</function> the result object for itself. When returning a failure code, all cleanup must be performed as no <literal>PGEVT_RESULTDESTROY</literal> event will be sent.
ru: Событие создания объекта результата происходит при завершении любой функции, выполняющей запрос и получающей результат, включая <function>PQgetResult</function>. Это событие происходит только после того, как результат был успешно получен. <synopsis> typedef struct { PGconn *conn; PGresult *result; } PGEventResultCreate; </synopsis> При поступлении события <literal>PGEVT_RESULTCREATE</literal> указатель <parameter>evtInfo</parameter> следует привести к <structname>PGEventResultCreate *</structname>. В <parameter>conn</parameter> передаётся соединение, для которого сформирован результат. Это идеальное место для инициализации любых данных <literal>instanceData</literal>, которые нужно связать с результатом. В случае сбоя обработчика объект результата очищается и ошибка распространяется дальше. Обработчик события не должен пытаться выполнять <function>PQclear</function> для объекта результата самостоятельно. Возвращая ошибку, необходимо выполнить очистку данных, так как событие <literal>PGEVT_RESULTDESTROY</literal> для этого объекта не поступит.

source: The result copy event is fired in response to <function>PQcopyResult</function>. This event will only be fired after the copy is complete. Only event procedures that have successfully handled the <literal>PGEVT_RESULTCREATE</literal> or <literal>PGEVT_RESULTCOPY</literal> event for the source result will receive <literal>PGEVT_RESULTCOPY</literal> events. <synopsis> typedef struct { const PGresult *src; PGresult *dest; } PGEventResultCopy; </synopsis> When a <literal>PGEVT_RESULTCOPY</literal> event is received, the <parameter>evtInfo</parameter> pointer should be cast to a <structname>PGEventResultCopy *</structname>. The <parameter>src</parameter> result is what was copied while the <parameter>dest</parameter> result is the copy destination. This event can be used to provide a deep copy of <literal>instanceData</literal>, since <literal>PQcopyResult</literal> cannot do that. If the event procedure fails, the entire copy operation will fail and the <parameter>dest</parameter> result will be cleared. When returning a failure code, all cleanup must be performed as no <literal>PGEVT_RESULTDESTROY</literal> event will be sent for the destination result.
ru: Событие копирования объекта результата происходит при выполнении функции <function>PQcopyResult</function>. Это событие происходит только после того, как копирование будет завершено. Только те обработчики событий, которые успешно обработали событие <literal>PGEVT_RESULTCREATE</literal> или <literal>PGEVT_RESULTCOPY</literal> для исходного объекта, получат событие <literal>PGEVT_RESULTCOPY</literal>. <synopsis> typedef struct { const PGresult *src; PGresult *dest; } PGEventResultCopy; </synopsis> При поступлении события <literal>PGEVT_RESULTCOPY</literal> указатель <parameter>evtInfo</parameter> следует привести к <structname>PGEventResultCopy *</structname>. Поле <parameter>src</parameter> указывает на объект результата, который копируется, а <parameter>dest</parameter> — на целевой объект. Это событие может применяться для реализации внутреннего копирования <literal>instanceData</literal>, так как сама функция <literal>PQcopyResult</literal> не может это сделать. В случае сбоя обработчика вся операция копирования прерывается и объект результата в <parameter>dest</parameter> очищается. Возвращая ошибку, необходимо выполнить очистку данных целевого объекта, так как событие <literal>PGEVT_RESULTDESTROY</literal> для него не поступит.

source: The result destroy event is fired in response to a <function>PQclear</function>. It is the event procedure's responsibility to properly clean up its event data as libpq has no ability to manage this memory. Failure to clean up will lead to memory leaks. <synopsis> typedef struct { PGresult *result; } PGEventResultDestroy; </synopsis> When a <literal>PGEVT_RESULTDESTROY</literal> event is received, the <parameter>evtInfo</parameter> pointer should be cast to a <structname>PGEventResultDestroy *</structname>. This event is fired prior to <function>PQclear</function> performing any other cleanup. The return value of the event procedure is ignored since there is no way of indicating a failure from <function>PQclear</function>. Also, an event procedure failure should not abort the process of cleaning up unwanted memory.
ru: Событие уничтожения объекта результата происходит при выполнении <function>PQclear</function>. Обработчик этого события отвечает за корректную очистку своих данных событий, так как libpq не может управлять его памятью. Невыполнение очистки должным образом приведёт к утечкам памяти. <synopsis> typedef struct { PGresult *result; } PGEventResultDestroy; </synopsis> При поступлении события <literal>PGEVT_RESULTDESTROY</literal> указатель <parameter>evtInfo</parameter> следует привести к <structname>PGEventResultDestroy *</structname>. Это событие происходит перед тем, как <function>PQclear</function> производит всю остальную очистку. Значение, возвращаемое обработчиком событий, игнорируется, так как из <function>PQclear</function> никак нельзя сообщить об ошибке. Кроме того, ошибка в обработчике событий не должна прерывать процесс очистки ставшей ненужной памяти.

source: Event Callback Procedure
ru: Процедура обработки событий

source: <literal>PGEventProc</literal> is a typedef for a pointer to an event procedure, that is, the user callback function that receives events from libpq. The signature of an event procedure must be <synopsis> int eventproc(PGEventId evtId, void *evtInfo, void *passThrough) </synopsis> The <parameter>evtId</parameter> parameter indicates which <literal>PGEVT</literal> event occurred. The <parameter>evtInfo</parameter> pointer must be cast to the appropriate structure type to obtain further information about the event. The <parameter>passThrough</parameter> parameter is the pointer provided to <function>PQregisterEventProc</function> when the event procedure was registered. The function should return a non-zero value if it succeeds and zero if it fails.
ru: <literal>PGEventProc</literal> — это определение типа для указателя на обработчик событий, то есть функцию обратного вызова, получающую события от libpq. Обработчик событий должен иметь такую сигнатуру: <synopsis> int eventproc(PGEventId evtId, void *evtInfo, void *passThrough) </synopsis> Параметр <parameter>evtId</parameter> говорит, какое событие <literal>PGEVT</literal> произошло. Указатель <parameter>evtInfo</parameter> должен приводиться к типу определённой структуры для получения дополнительной информации о событии. В параметре <parameter>passThrough</parameter> передаётся сквозной указатель, поступивший в <function>PQregisterEventProc</function> при регистрации обработчика события. Эта функция должна вернуть ненулевое значение в случае успеха или ноль в противном случае.

source: A particular event procedure can be registered only once in any <structname>PGconn</structname>. This is because the address of the procedure is used as a lookup key to identify the associated instance data.
ru: Обработчик определённого события может быть зарегистрирован в любом <structname>PGconn</structname> только раз. Это связано с тем, что адрес обработчика используется как ключ для выбора связанных данных экземпляра.

source: On Windows, functions can have two different addresses: one visible from outside a DLL and another visible from inside the DLL. One should be careful that only one of these addresses is used with <application>libpq</application>'s event-procedure functions, else confusion will result. The simplest rule for writing code that will work is to ensure that event procedures are declared <literal>static</literal>. If the procedure's address must be available outside its own source file, expose a separate function to return the address.
ru: В Windows функции могут иметь два разных адреса: один, видимый снаружи DLL, и второй, видимый внутри DLL. Учитывая это, надо позаботиться о том, чтобы только один из адресов использовался с функциями обработки событий <application>libpq</application>, иначе возникнет путаница. Самый простой способ написать код, который будет работать — всегда помечать обработчик событий как <literal>static</literal>. Если адрес обработчика нужно получить вне его исходного файла, экспортируйте отдельную функцию, которая будет возвращать этот адрес.

source: Event Support Functions
ru: Функции поддержки событий

source: Registers an event callback procedure with libpq. <synopsis> int PQregisterEventProc(PGconn *conn, PGEventProc proc, const char *name, void *passThrough); </synopsis>
ru: Регистрирует обработчик событий в libpq. <synopsis> int PQregisterEventProc(PGconn *conn, PGEventProc proc, const char *name, void *passThrough); </synopsis>

source: An event procedure must be registered once on each <structname>PGconn</structname> you want to receive events about. There is no limit, other than memory, on the number of event procedures that can be registered with a connection. The function returns a non-zero value if it succeeds and zero if it fails.
ru: Обработчик событий должен быть зарегистрирован один раз для каждого соединения <structname>PGconn</structname>, события которого представляют интерес. Число обработчиков событий, которые можно зарегистрировать для соединения, не ограничивается ничем, кроме объёма памяти. Эта функция возвращает ненулевое значение в случае успеха или ноль в противном случае.

source: The <parameter>proc</parameter> argument will be called when a libpq event is fired. Its memory address is also used to lookup <literal>instanceData</literal>. The <parameter>name</parameter> argument is used to refer to the event procedure in error messages. This value cannot be <symbol>NULL</symbol> or a zero-length string. The name string is copied into the <structname>PGconn</structname>, so what is passed need not be long-lived. The <parameter>passThrough</parameter> pointer is passed to the <parameter>proc</parameter> whenever an event occurs. This argument can be <symbol>NULL</symbol>.
ru: Процедура, переданная в аргументе <parameter>proc</parameter>, будет вызываться, когда произойдёт событие libpq. Её адрес в памяти также применяется для поиска данных <literal>instanceData</literal>. Аргумент <parameter>name</parameter> используется при упоминании обработчика событий в сообщениях об ошибках. Это значение не может быть равно <symbol>NULL</symbol> или указывать на строку нулевой длины. Эта строка имени копируется в <structname>PGconn</structname>, так что переданная строка может быть временной. Сквозной указатель (<parameter>passThrough</parameter>) будет передаваться обработчику <parameter>proc</parameter> при каждом вызове события. Этот аргумент может равняться <symbol>NULL</symbol>.

source: Sets the connection <parameter>conn</parameter>'s <literal>instanceData</literal> for procedure <parameter>proc</parameter> to <parameter>data</parameter>. This returns non-zero for success and zero for failure. (Failure is only possible if <parameter>proc</parameter> has not been properly registered in <parameter>conn</parameter>.) <synopsis> int PQsetInstanceData(PGconn *conn, PGEventProc proc, void *data); </synopsis>
ru: Устанавливает для подключения <parameter>conn</parameter> указатель <literal>instanceData</literal> для обработчика <parameter>proc</parameter> равным <parameter>data</parameter>. Эта функция возвращает ненулевое значение в случае успеха или ноль в противном случае. (Ошибка возможна, только если обработчик <parameter>proc</parameter> не был корректно зарегистрирован для соединения <parameter>conn</parameter>.) <synopsis> int PQsetInstanceData(PGconn *conn, PGEventProc proc, void *data); </synopsis>

source: Returns the connection <parameter>conn</parameter>'s <literal>instanceData</literal> associated with procedure <parameter>proc</parameter>, or <symbol>NULL</symbol> if there is none. <synopsis> void *PQinstanceData(const PGconn *conn, PGEventProc proc); </synopsis>
ru: Возвращает для соединения <parameter>conn</parameter> указатель на <literal>instanceData</literal>, связанный с обработчиком <parameter>proc</parameter>, либо <symbol>NULL</symbol>, если такого обработчика нет. <synopsis> void *PQinstanceData(const PGconn *conn, PGEventProc proc); </synopsis>

source: Sets the result's <literal>instanceData</literal> for <parameter>proc</parameter> to <parameter>data</parameter>. This returns non-zero for success and zero for failure. (Failure is only possible if <parameter>proc</parameter> has not been properly registered in the result.) <synopsis> int PQresultSetInstanceData(PGresult *res, PGEventProc proc, void *data); </synopsis>
ru: Устанавливает для объекта результата (<parameter>res</parameter>) указатель <literal>instanceData</literal> для обработчика <parameter>proc</parameter> равным <parameter>data</parameter>. Эта функция возвращает ненулевое значение в случае успеха или ноль в противном случае. (Ошибка возможна, только если обработчик <parameter>proc</parameter> не был корректно зарегистрирован для объекта результата.) <synopsis> int PQresultSetInstanceData(PGresult *res, PGEventProc proc, void *data); </synopsis>
