Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: The severity; the field contents are <literal>ERROR</literal>, <literal>FATAL</literal>, or <literal>PANIC</literal> (in an error message), or <literal>WARNING</literal>, <literal>NOTICE</literal>, <literal>DEBUG</literal>, <literal>INFO</literal>, or <literal>LOG</literal> (in a notice message). This is identical to the <symbol>PG_DIAG_SEVERITY</symbol> field except that the contents are never localized. This is present only in reports generated by <productname>PostgreSQL</productname> versions 9.6 and later.
ru: Серьёзность; поле может содержать <literal>ERROR</literal>, <literal>FATAL</literal> или <literal>PANIC</literal> (в сообщении об ошибке) либо <literal>WARNING</literal>, <literal>NOTICE</literal>, <literal>DEBUG</literal>, <literal>INFO</literal> или <literal>LOG</literal> (в сообщении-уведомлении). Это поле подобно <symbol>PG_DIAG_SEVERITY</symbol>, но его содержимое никогда не переводится. Присутствует только в отчётах, выдаваемых <productname>PostgreSQL</productname> версии 9.6 и новее.

source: <primary>error codes</primary> <secondary>libpq</secondary>
ru: <primary>коды ошибок</primary> <secondary>libpq</secondary>

source: The SQLSTATE code for the error. The SQLSTATE code identifies the type of error that has occurred; it can be used by front-end applications to perform specific operations (such as error handling) in response to a particular database error. For a list of the possible SQLSTATE codes, see <xref linkend="errcodes-appendix"/>. This field is not localizable, and is always present.
ru: Код ошибки в соответствии с соглашением о кодах SQLSTATE. Код SQLSTATE идентифицирует тип случившейся ошибки; он может использоваться клиентскими приложениями, чтобы выполнять конкретные операции (такие, как обработка ошибок) в ответ на конкретную ошибку базы данных. Список возможных кодов SQLSTATE приведён в <xref remap="6" linkend="errcodes-appendix"/>. Это поле не подлежит локализации. Оно всегда присутствует.

source: The primary human-readable error message (typically one line). Always present.
ru: Главное сообщение об ошибке, предназначенное для прочтения пользователем. Как правило составляет всего одну строку. Это поле всегда присутствует.

source: Detail: an optional secondary error message carrying more detail about the problem. Might run to multiple lines.
ru: Необязательное дополнительное сообщение об ошибке, передающее более детальную информацию о проблеме. Может занимать несколько строк.

source: Hint: an optional suggestion what to do about the problem. This is intended to differ from detail in that it offers advice (potentially inappropriate) rather than hard facts. Might run to multiple lines.
ru: Подсказка: необязательное предположение о том, что можно сделать в данной проблемной ситуации. Оно должно отличаться от детальной информации в том смысле, что оно предлагает совет (возможно, и неподходящий), а не просто факты. Может занимать несколько строк.

source: A string containing a decimal integer indicating an error cursor position as an index into the original statement string. The first character has index 1, and positions are measured in characters not bytes.
ru: Строка, содержащая десятичное целое число, указывающее позицию расположения ошибки в качестве индекса в оригинальной строке оператора. Первый символ имеет позицию 1, при этом позиции измеряются в символах а не в байтах.

source: This is defined the same as the <symbol>PG_DIAG_STATEMENT_POSITION</symbol> field, but it is used when the cursor position refers to an internally generated command rather than the one submitted by the client. The <symbol>PG_DIAG_INTERNAL_QUERY</symbol> field will always appear when this field appears.
ru: Это поле определяется точно так же, как и поле <symbol>PG_DIAG_STATEMENT_POSITION</symbol>, но оно используется, когда позиция местонахождения ошибки относится к команде, сгенерированной внутренними модулями, а не к команде, представленной клиентом. Когда появляется это поле, то всегда появляется и поле <symbol>PG_DIAG_INTERNAL_QUERY</symbol>.

source: The text of a failed internally-generated command. This could be, for example, a SQL query issued by a PL/pgSQL function.
ru: Текст команды, сгенерированной внутренними модулями, завершившейся сбоем. Это мог бы быть, например, SQL-запрос, выданный функцией на языке PL/pgSQL.

source: An indication of the context in which the error occurred. Presently this includes a call stack traceback of active procedural language functions and internally-generated queries. The trace is one entry per line, most recent first.
ru: Характеристика контекста, в котором произошла ошибка. В настоящее время она включает вывод стека вызовов активных функций процедурного языка и запросов, сгенерированных внутренними модулями. Стек выводится по одному элементу в строке, при этом первым идет самый последний из элементов (самый недавний вызов).

source: If the error was associated with a specific database object, the name of the schema containing that object, if any.
ru: Если ошибка была связана с конкретным объектом базы данных, то в это поле будет записано имя схемы, содержащей данный объект.

source: If the error was associated with a specific table, the name of the table. (Refer to the schema name field for the name of the table's schema.)
ru: Если ошибка была связана с конкретной таблицей, то в это поле будет записано имя таблицы. (Для получения имени схемы для данной таблицы обратитесь к полю, содержащему имя схемы.)

source: If the error was associated with a specific table column, the name of the column. (Refer to the schema and table name fields to identify the table.)
ru: Если ошибка была связана с конкретным столбцом таблицы, то в это поле будет записано имя столбца. (Чтобы идентифицировать таблицу, обратитесь к полям, содержащим имена схемы и таблицы.)

source: If the error was associated with a specific data type, the name of the data type. (Refer to the schema name field for the name of the data type's schema.)
ru: Если ошибка была связана с конкретным типом данных, то в это поле будет записано имя типа данных. (Чтобы получить имя схемы, которой принадлежит этот тип данных, обратитесь к полю, содержащему имя схемы.)

source: If the error was associated with a specific constraint, the name of the constraint. Refer to fields listed above for the associated table or domain. (For this purpose, indexes are treated as constraints, even if they weren't created with constraint syntax.)
ru: Если ошибка была связана с конкретным ограничением, то в это поле будет записано имя ограничения. Чтобы получить имя таблицы или домена, связанных с этим ограничением, обратитесь к полям, перечисленным выше. (С этой целью индексы рассматриваются как ограничения, даже если они и не были созданы с помощью синтаксиса для создания ограничений.)

source: The file name of the source-code location where the error was reported.
ru: Имя файла, содержащего позицию в исходном коде, для которой было выдано сообщение об ошибка.

source: The line number of the source-code location where the error was reported.
ru: Номер строки той позиции в исходном коде, для которой было выдано сообщение об ошибке.

source: The name of the source-code function reporting the error.
ru: Имя функции в исходном коде, сообщающей об ошибке.

source: The following field codes are available: <placeholder-1/>
ru: Доступны следующие коды полей: <placeholder-1/>

source: The fields for schema name, table name, column name, data type name, and constraint name are supplied only for a limited number of error types; see <xref linkend="errcodes-appendix"/>. Do not assume that the presence of any of these fields guarantees the presence of another field. Core error sources observe the interrelationships noted above, but user-defined functions may use these fields in other ways. In the same vein, do not assume that these fields denote contemporary objects in the current database.
ru: Поля для имени схемы, имени таблицы, имени столбца, имени типа данных и имени ограничения предоставляются лишь для ограниченного числа типов ошибок; см. <xref remap="4" linkend="errcodes-appendix"/>. Не рассчитывайте на то, что присутствие любого из этих полей гарантирует и присутствие какого-то другого поля. Базовые источники ошибок придерживаются взаимосвязей, описанных выше, но функции, определённые пользователем, могут использовать эти поля другими способами. Аналогично, не рассчитывайте на то, что эти поля обозначают объекты, существующие в текущей базе данных в настоящий момент.

source: The client is responsible for formatting displayed information to meet its needs; in particular it should break long lines as needed. Newline characters appearing in the error message fields should be treated as paragraph breaks, not line breaks.
ru: Клиент отвечает за форматирование отображаемой информации в соответствии с его нуждами; в частности, он должен разбивать длинные строки, как требуется. Символы новой строки, встречающиеся в полях сообщения об ошибке, должны обрабатываться, как разрывы абзацев, а не строк.

source: Errors generated internally by <application>libpq</application> will have severity and primary message, but typically no other fields. Errors returned by a pre-3.0-protocol server will include severity and primary message, and sometimes a detail message, but no other fields.
ru: Ошибки, сгенерированные внутренними модулями <application>libpq</application>, будут иметь поля серьёзности ошибки и основного сообщения, но, как правило, никаких других полей. Ошибки, возвращаемые сервером, работающим по протоколу версии ниже 3.0, будут включать поля серьёзности ошибки и основного сообщения, а также иногда детальное сообщение, но больше никаких полей.

source: Note that error fields are only available from <structname>PGresult</structname> objects, not <structname>PGconn</structname> objects; there is no <function>PQerrorField</function> function.
ru: Заметьте, что поля ошибки доступны только из объектов <structname>PGresult</structname>, а не из объектов <structname>PGconn</structname>. Не существует функции <function>PQerrorField</function>.

source: Frees the storage associated with a <structname>PGresult</structname>. Every command result should be freed via <function>PQclear</function> when it is no longer needed. <synopsis> void PQclear(PGresult *res); </synopsis>
ru: Освобождает область памяти, связанную с <structname>PGresult</structname>. Результат выполнения каждой команды должен быть освобождён с помощью <function>PQclear</function>, когда он больше не нужен. <synopsis> void PQclear(PGresult *res); </synopsis>

source: You can keep a <structname>PGresult</structname> object around for as long as you need it; it does not go away when you issue a new command, nor even if you close the connection. To get rid of it, you must call <function>PQclear</function>. Failure to do this will result in memory leaks in your application.
ru: Вы можете держать объект <structname>PGresult</structname> под рукой до тех пор, пока он вам нужен; он не исчезает, ни когда вы выдаёте новую команду, ни даже если вы закрываете соединение. Чтобы от него избавиться, вы должны вызвать <function>PQclear</function>. Если этого не делать, то в результате будут иметь место утечки памяти в вашем приложении.

source: The <structname>PGresult</structname><placeholder-1/> structure encapsulates the result returned by the server. <application>libpq</application> application programmers should be careful to maintain the <structname>PGresult</structname> abstraction. Use the accessor functions below to get at the contents of <structname>PGresult</structname>. Avoid directly referencing the fields of the <structname>PGresult</structname> structure because they are subject to change in the future. <placeholder-2/>
ru: Структура <structname>PGresult</structname><placeholder-1/> содержит результат, возвращённый сервером. Разработчики приложений <application>libpq</application> должны тщательно поддерживать абстракцию <structname>PGresult</structname>. Для получения доступа к содержимому <structname>PGresult</structname> используйте функции доступа, описанные ниже. Избегайте непосредственного обращения к полям структуры <structname>PGresult</structname>, поскольку они могут измениться в будущем. <placeholder-2/>

source: Retrieving Query Result Information
ru: Извлечение информации, связанной с результатом запроса

source: These functions are used to extract information from a <structname>PGresult</structname> object that represents a successful query result (that is, one that has status <literal>PGRES_TUPLES_OK</literal> or <literal>PGRES_SINGLE_TUPLE</literal>). They can also be used to extract information from a successful Describe operation: a Describe's result has all the same column information that actual execution of the query would provide, but it has zero rows. For objects with other status values, these functions will act as though the result has zero rows and zero columns.
ru: Эти функции служат для извлечения информации из объекта <structname>PGresult</structname>, который представляет результат успешного запроса (то есть такого, который имеет статус <literal>PGRES_TUPLES_OK</literal> или <literal>PGRES_SINGLE_TUPLE</literal>). Их также можно использовать для извлечения информации об успешной операции DESCRIBE: результат этой операции содержит всю ту же самую информацию о столбцах, которая была бы получена при реальном исполнении запроса, но не содержит ни одной строки. Для объектов, имеющих другие значения статуса, эти функции будут действовать таким образом, как будто результат не содержит ни одной строки и ни одного столбца.

source: Returns the number of rows (tuples) in the query result. Because it returns an integer result, large result sets might overflow the return value on 32-bit operating systems. <synopsis> int PQntuples(const PGresult *res); </synopsis>
ru: Возвращает число строк (кортежей) в полученной выборке. Поскольку она возвращает целое число, большие выборки могут привести к переполнению возвращаемого значения в 32-разрядных операционных системах. <synopsis> int PQntuples(const PGresult *res); </synopsis>

source: Returns the number of columns (fields) in each row of the query result. <synopsis> int PQnfields(const PGresult *res); </synopsis>
ru: Возвращает число столбцов (полей) в каждой строке полученной выборки. <synopsis> int PQnfields(const PGresult *res); </synopsis>

source: Returns the column name associated with the given column number. Column numbers start at 0. The caller should not free the result directly. It will be freed when the associated <structname>PGresult</structname> handle is passed to <function>PQclear</function>. <synopsis> char *PQfname(const PGresult *res, int column_number); </synopsis>
ru: Возвращает имя столбца, соответствующего данному номеру столбца. Номера столбцов начинаются с 0. Вызывающая функция не должна напрямую освобождать память, на которую указывает возвращаемый указатель. Она будет освобождена, когда соответствующий указатель на <structname>PGresult</structname> будет передан функции <function>PQclear</function>. <synopsis> char *PQfname(const PGresult *res, int column_number); </synopsis>

source: <symbol>NULL</symbol> is returned if the column number is out of range.
ru: Если номер столбца выходит за пределы допустимого диапазона, то возвращается <symbol>NULL</symbol>.

source: Returns the column number associated with the given column name. <synopsis> int PQfnumber(const PGresult *res, const char *column_name); </synopsis>
ru: Возвращает номер столбца, соответствующий данному имени столбца. <synopsis> int PQfnumber(const PGresult *res, const char *column_name); </synopsis>

source: -1 is returned if the given name does not match any column.
ru: Если данное имя не совпадает с именем ни одного из столбцов, то возвращается -1.

source: The given name is treated like an identifier in an SQL command, that is, it is downcased unless double-quoted. For example, given a query result generated from the SQL command: <placeholder-1/> we would have the results: <placeholder-2/>
ru: Данное имя интерпретируется, как идентификатор в SQL-команде. Это означает, что оно переводится в нижний регистр, если только оно не заключено в двойные кавычки. Например, для выборки, сгенерированной с помощью такой SQL-команды: <placeholder-1/> мы получили бы следующие результаты: <placeholder-2/>

source: Returns the OID of the table from which the given column was fetched. Column numbers start at 0. <synopsis> Oid PQftable(const PGresult *res, int column_number); </synopsis>
ru: Возвращает OID таблицы, из которой был получен данный столбец. Номера столбцов начинаются с 0. <synopsis> Oid PQftable(const PGresult *res, int column_number); </synopsis>

source: <literal>InvalidOid</literal> is returned if the column number is out of range, or if the specified column is not a simple reference to a table column, or when using pre-3.0 protocol. You can query the system table <literal>pg_class</literal> to determine exactly which table is referenced.
ru: В следующих случаях возвращается <literal>InvalidOid</literal>: если номер столбца выходит за пределы допустимого диапазона; если указанный столбец не является простой ссылкой на столбец таблицы; когда используется протокол версии более ранней, чем 3.0. Вы можете сделать запрос к системной таблице <literal>pg_class</literal>, чтобы точно определить, к какой таблице было произведено обращение.

source: The type <type>Oid</type> and the constant <literal>InvalidOid</literal> will be defined when you include the <application>libpq</application> header file. They will both be some integer type.
ru: Тип данных <type>Oid</type> и константа <literal>InvalidOid</literal> будут определены, когда вы включите заголовочный файл для <application>libpq</application>. Они будут принадлежать к одному из целочисленных типов.

source: Returns the column number (within its table) of the column making up the specified query result column. Query-result column numbers start at 0, but table columns have nonzero numbers. <synopsis> int PQftablecol(const PGresult *res, int column_number); </synopsis>
ru: Возвращает номер столбца (в пределах его таблицы) для указанного столбца в полученной выборке. Номера столбцов в полученной выборке начинаются с 0, но столбцы в таблице имеют ненулевые номера. <synopsis> int PQftablecol(const PGresult *res, int column_number); </synopsis>

source: Zero is returned if the column number is out of range, or if the specified column is not a simple reference to a table column, or when using pre-3.0 protocol.
ru: В следующих случаях возвращается ноль: если номер столбца выходит за пределы допустимого диапазона; если указанный столбец не является простой ссылкой на столбец таблицы; когда используется протокол версии более ранней, чем 3.0.

source: Returns the format code indicating the format of the given column. Column numbers start at 0. <synopsis> int PQfformat(const PGresult *res, int column_number); </synopsis>
ru: Возвращает код формата, показывающий формат данного столбца. Номера столбцов начинаются с 0. <synopsis> int PQfformat(const PGresult *res, int column_number); </synopsis>

source: Format code zero indicates textual data representation, while format code one indicates binary representation. (Other codes are reserved for future definition.)
ru: Значение кода формата, равное нулю, указывает на текстовое представление данных, в то время, как значение, равное единице, означает двоичное представление. (Другие значения кодов зарезервированы для определения в будущем.)

source: Returns the data type associated with the given column number. The integer returned is the internal OID number of the type. Column numbers start at 0. <synopsis> Oid PQftype(const PGresult *res, int column_number); </synopsis>
ru: Возвращает тип данных, соответствующий данному номеру столбца. Возвращаемое целое значение является внутренним номером OID для этого типа. Номера столбцов начинаются с 0. <synopsis> Oid PQftype(const PGresult *res, int column_number); </synopsis>

source: You can query the system table <literal>pg_type</literal> to obtain the names and properties of the various data types. The <acronym>OID</acronym>s of the built-in data types are defined in the file <filename>src/include/catalog/pg_type.h</filename> in the source tree.
ru: Вы может сделать запрос к системной таблице <literal>pg_type</literal>, чтобы получить имена и свойства различных типов данных. Значения <acronym>OID</acronym> для встроенных типов данных определены в файле <filename>src/include/catalog/pg_type.h</filename> в дереве исходных кодов.

source: Returns the type modifier of the column associated with the given column number. Column numbers start at 0. <synopsis> int PQfmod(const PGresult *res, int column_number); </synopsis>
ru: Возвращает модификатор типа для столбца, соответствующего данному номеру. Номера столбцов начинаются с 0. <synopsis> int PQfmod(const PGresult *res, int column_number); </synopsis>

source: The interpretation of modifier values is type-specific; they typically indicate precision or size limits. The value -1 is used to indicate <quote>no information available</quote>. Most data types do not use modifiers, in which case the value is always -1.
ru: Интерпретация значений модификатора зависит от типа; они обычно показывают точность или предельные размеры. Значение -1 используется, чтобы показать <quote>нет доступной информации</quote>. Большинство типов данных не используют модификаторов, в таком случае значение всегда будет -1.

source: Returns the size in bytes of the column associated with the given column number. Column numbers start at 0. <synopsis> int PQfsize(const PGresult *res, int column_number); </synopsis>
ru: Возвращает размер в байтах для столбца, соответствующего данному номеру. Номера столбцов начинаются с 0. <synopsis> int PQfsize(const PGresult *res, int column_number); </synopsis>

source: <function>PQfsize</function> returns the space allocated for this column in a database row, in other words the size of the server's internal representation of the data type. (Accordingly, it is not really very useful to clients.) A negative value indicates the data type is variable-length.
ru: <function>PQfsize</function> возвращает размер пространства, выделенного для этого столбца в строке базы данных, другими словами, это размер внутреннего представления этого типа данных на сервере. (Следовательно, эта информация не является по-настоящему полезной для клиентов.) Отрицательное значение говорит о том, что тип данных имеет переменную длину.

source: Returns 1 if the <structname>PGresult</structname> contains binary data and 0 if it contains text data. <synopsis> int PQbinaryTuples(const PGresult *res); </synopsis>
ru: Возвращает 1, если <structname>PGresult</structname> содержит двоичные данные, или 0, если данные текстовые. <synopsis> int PQbinaryTuples(const PGresult *res); </synopsis>

source: This function is deprecated (except for its use in connection with <command>COPY</command>), because it is possible for a single <structname>PGresult</structname> to contain text data in some columns and binary data in others. <function>PQfformat</function> is preferred. <function>PQbinaryTuples</function> returns 1 only if all columns of the result are binary (format 1).
ru: Эта функция не рекомендуется к использованию (за исключением применения в связи с командой <command>COPY</command>), поскольку один и тот же <structname>PGresult</structname> может содержать в некоторых столбцах текстовые данные, а в остальных &mdash; двоичные. Предпочтительнее использовать <function>PQfformat</function>. <function>PQbinaryTuples</function> возвращает 1, только если все столбцы в выборке являются двоичными (код формата 1).
