Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: <function>PQnotifies</function> does not actually read data from the server; it just returns messages previously absorbed by another <application>libpq</application> function. In prior releases of <application>libpq</application>, the only way to ensure timely receipt of <command>NOTIFY</command> messages was to constantly submit commands, even empty ones, and then check <function>PQnotifies</function> after each <function>PQexec</function>. While this still works, it is deprecated as a waste of processing power.
ru: Функция <function>PQnotifies</function> в действительности не читает данные с сервера; она просто возвращает сообщения, предварительно собранные другой функцией библиотеки <application>libpq</application>. В предшествующих выпусках <application>libpq</application> единственным способом обеспечения своевременного получения сообщений от команды <command>NOTIFY</command> была постоянная отправка команд, даже пустых, а затем проверка <function>PQnotifies</function> после каждого вызова <function>PQexec</function>. Хотя этот метод всё ещё работает, он не рекомендуется, поскольку растрачивает впустую процессорное время.

source: A better way to check for <command>NOTIFY</command> messages when you have no useful commands to execute is to call <function>PQconsumeInput</function>, then check <function>PQnotifies</function>. You can use <function>select()</function> to wait for data to arrive from the server, thereby using no <acronym>CPU</acronym> power unless there is something to do. (See <function>PQsocket</function> to obtain the file descriptor number to use with <function>select()</function>.) Note that this will work OK whether you submit commands with <function>PQsendQuery</function>/<function>PQgetResult</function> or simply use <function>PQexec</function>. You should, however, remember to check <function>PQnotifies</function> after each <function>PQgetResult</function> or <function>PQexec</function>, to see if any notifications came in during the processing of the command.
ru: Более хорошим способом проверки наличия сообщений от команды <command>NOTIFY</command>, когда у вас нет полезных команд для выполнения, является вызов функции <function>PQconsumeInput</function> с последующей проверкой <function>PQnotifies</function>. Вы можете использовать <function>select()</function>, чтобы подождать прибытия данных с сервера, тем самым не используя мощности <acronym>CPU</acronym>, если нет полезной работы. (См. <function>PQsocket</function> насчёт получения номера файлового дескриптора для использования его с <function>select()</function>.) Обратите внимание, что это будет хорошо работать, независимо от того, отправляете ли вы команды с помощью <function>PQsendQuery</function>/<function>PQgetResult</function> или просто используете <function>PQexec</function>. Следует, однако, не забывать проверять <function>PQnotifies</function> после каждого вызова <function>PQgetResult</function> или <function>PQexec</function>, чтобы увидеть, не прибыли ли какие-либо уведомления в процессе обработки команды.

source: Functions Associated with the <command>COPY</command> Command
ru: Функции, связанные с командой <command>COPY</command>

source: <primary>COPY</primary> <secondary>with libpq</secondary>
ru: <primary>COPY</primary> <secondary>с libpq</secondary>

source: The <command>COPY</command> command in <productname>PostgreSQL</productname> has options to read from or write to the network connection used by <application>libpq</application>. The functions described in this section allow applications to take advantage of this capability by supplying or consuming copied data.
ru: Команда <command>COPY</command> в <productname>PostgreSQL</productname> имеет возможность читать и записывать данные через сетевое подключение, установленное <application>libpq</application>. Описанные в этом разделе функции позволяют приложениям воспользоваться этой возможностью для передачи или приёма копируемых данных.

source: The overall process is that the application first issues the SQL <command>COPY</command> command via <function>PQexec</function> or one of the equivalent functions. The response to this (if there is no error in the command) will be a <structname>PGresult</structname> object bearing a status code of <literal>PGRES_COPY_OUT</literal> or <literal>PGRES_COPY_IN</literal> (depending on the specified copy direction). The application should then use the functions of this section to receive or transmit data rows. When the data transfer is complete, another <structname>PGresult</structname> object is returned to indicate success or failure of the transfer. Its status will be <literal>PGRES_COMMAND_OK</literal> for success or <literal>PGRES_FATAL_ERROR</literal> if some problem was encountered. At this point further SQL commands can be issued via <function>PQexec</function>. (It is not possible to execute other SQL commands using the same connection while the <command>COPY</command> operation is in progress.)
ru: Общая процедура такова: сначала приложение выдаёт SQL-команду <command>COPY</command>, вызывая <function>PQexec</function> или одну из подобных функций. В ответ оно должно получить (если не возникла ошибка) объект <structname>PGresult</structname> с кодом состояния <literal>PGRES_COPY_OUT</literal> или <literal>PGRES_COPY_IN</literal> (в зависимости от направления копирования). Затем приложение должно использовать функции, описанные в этом разделе, и принимать или передавать строки данных. По завершении передачи возвращается ещё один объект <structname>PGresult</structname>, сообщающий о состоянии завершения передачи. В случае успеха он содержит код состояния <literal>PGRES_COMMAND_OK</literal>, а если возникает какая-то проблема — <literal>PGRES_FATAL_ERROR</literal>. После этого можно продолжать выполнять SQL-команды через <function>PQexec</function>. (Пока операция <command>COPY</command> не завершена, выполнять другие SQL-команды через то же подключение нельзя.)

source: If a <command>COPY</command> command is issued via <function>PQexec</function> in a string that could contain additional commands, the application must continue fetching results via <function>PQgetResult</function> after completing the <command>COPY</command> sequence. Only when <function>PQgetResult</function> returns <symbol>NULL</symbol> is it certain that the <function>PQexec</function> command string is done and it is safe to issue more commands.
ru: Если команда <command>COPY</command> была выполнена через <function>PQexec</function> в строке, содержащей дополнительные команды, приложение должно продолжить получать результаты через <function>PQgetResult</function> после завершения последовательности <command>COPY</command>. Только когда <function>PQgetResult</function> возвращает <symbol>NULL</symbol>, можно с уверенностью считать, что командная строка <function>PQexec</function> выполнена полностью, и безопасно передавать другие команды.

source: The functions of this section should be executed only after obtaining a result status of <literal>PGRES_COPY_OUT</literal> or <literal>PGRES_COPY_IN</literal> from <function>PQexec</function> or <function>PQgetResult</function>.
ru: Функции, описанные в этом разделе, должны выполняться только после получения кода состояния <literal>PGRES_COPY_OUT</literal> или <literal>PGRES_COPY_IN</literal> от функции <function>PQexec</function> или <function>PQgetResult</function>.

source: <primary>PQnfields</primary> <secondary>with COPY</secondary>
ru: <primary>PQnfields</primary> <secondary>с COPY</secondary>

source: Returns the number of columns (fields) to be copied.
ru: Возвращает число копируемых столбцов (полей).

source: <primary>PQbinaryTuples</primary> <secondary>with COPY</secondary>
ru: <primary>PQbinaryTuples</primary> <secondary>с COPY</secondary>

source: 0 indicates the overall copy format is textual (rows separated by newlines, columns separated by separator characters, etc). 1 indicates the overall copy format is binary. See <xref linkend="sql-copy"/> for more information.
ru: Значение 0 указывает, что для всей операции копирования применяется текстовый формат (строки разделяются символами новой строки, столбцы разделяются символами-разделителями и т. д.). Значение 1 указывает, что для всей операции копирования применяется двоичный формат. За дополнительными сведениями обратитесь к <xref remap="3" linkend="sql-copy"/>.

source: <primary>PQfformat</primary> <secondary>with COPY</secondary>
ru: <primary>PQfformat</primary> <secondary>с COPY</secondary>

source: Returns the format code (0 for text, 1 for binary) associated with each column of the copy operation. The per-column format codes will always be zero when the overall copy format is textual, but the binary format can support both text and binary columns. (However, as of the current implementation of <command>COPY</command>, only binary columns appear in a binary copy; so the per-column formats always match the overall format at present.)
ru: Возвращает код формата (0 — текстовый, 1 — двоичный), связанный с каждым копируемым столбцом. Коды форматов столбцов всегда будут нулевыми, если общий формат копирования — текстовый, но с двоичным форматом поддерживаются и текстовые, и двоичные столбцы. (Однако в текущей реализации <command>COPY</command> при двоичном копировании столбцы могут быть только двоичными, так что форматы столбцов должны всегда соответствовать общему формату.)

source: A <structname>PGresult</structname> object bearing one of these status values carries some additional data about the <command>COPY</command> operation that is starting. This additional data is available using functions that are also used in connection with query results: <placeholder-1/>
ru: Объект <structname>PGresult</structname> с таким кодом состояния содержит дополнительные данные о начавшейся операции <command>COPY</command>. Эти данные можно получить функциями, также применяющимися при обработке результатов запроса: <placeholder-1/>

source: These additional data values are only available when using protocol 3.0. When using protocol 2.0, all these functions will return 0.
ru: Эти дополнительные значения данных доступны только при использовании протокола 3.0. С протоколом 2.0 все эти функции возвращают 0.

source: Functions for Sending <command>COPY</command> Data
ru: Функции для передачи данных <command>COPY</command>

source: These functions are used to send data during <literal>COPY FROM STDIN</literal>. They will fail if called when the connection is not in <literal>COPY_IN</literal> state.
ru: Эти функции применяются для передачи данных при операции <literal>COPY FROM STDIN</literal>. Они не будут работать, если подключение находится не в состоянии <literal>COPY_IN</literal>.

source: Sends data to the server during <literal>COPY_IN</literal> state. <synopsis> int PQputCopyData(PGconn *conn, const char *buffer, int nbytes); </synopsis>
ru: Отправляет данные на сервер, когда активно состояние <literal>COPY_IN</literal>. <synopsis> int PQputCopyData(PGconn *conn, const char *buffer, int nbytes); </synopsis>

source: Transmits the <command>COPY</command> data in the specified <parameter>buffer</parameter>, of length <parameter>nbytes</parameter>, to the server. The result is 1 if the data was queued, zero if it was not queued because of full buffers (this will only happen in nonblocking mode), or -1 if an error occurred. (Use <function>PQerrorMessage</function> to retrieve details if the return value is -1. If the value is zero, wait for write-ready and try again.)
ru: Передаёт серверу данные <command>COPY</command> из указанного буфера (<parameter>buffer</parameter>), длиной <parameter>nbytes</parameter> байт. Она возвращает 1, если данные были переданы, 0, если они не попали в очередь, так как буферы были заполнены (это возможно только в неблокирующем режиме), или -1, если произошла ошибка. (Если возвращено -1, подробности ошибки можно узнать, вызвав <function>PQerrorMessage</function>. Если получен 0, дождитесь состояния готовности к записи и повторите попытку.)

source: The application can divide the <command>COPY</command> data stream into buffer loads of any convenient size. Buffer-load boundaries have no semantic significance when sending. The contents of the data stream must match the data format expected by the <command>COPY</command> command; see <xref linkend="sql-copy"/> for details.
ru: Приложение может разделять поток данных <command>COPY</command> на буферизуемые блоки любого удобного размера. Границы буфера не имеют семантического значения при передаче. Содержимое потока данных должно соответствовать формату данных, ожидаемому командой <command>COPY</command>; за подробностями обратитесь к <xref remap="3" linkend="sql-copy"/>.

source: Sends end-of-data indication to the server during <literal>COPY_IN</literal> state. <synopsis> int PQputCopyEnd(PGconn *conn, const char *errormsg); </synopsis>
ru: Отправляет признак конца данных на сервер, когда активно состояние <literal>COPY_IN</literal>. <synopsis> int PQputCopyEnd(PGconn *conn, const char *errormsg); </synopsis>

source: Ends the <literal>COPY_IN</literal> operation successfully if <parameter>errormsg</parameter> is <symbol>NULL</symbol>. If <parameter>errormsg</parameter> is not <symbol>NULL</symbol> then the <command>COPY</command> is forced to fail, with the string pointed to by <parameter>errormsg</parameter> used as the error message. (One should not assume that this exact error message will come back from the server, however, as the server might have already failed the <command>COPY</command> for its own reasons. Also note that the option to force failure does not work when using pre-3.0-protocol connections.)
ru: Завершает операцию <literal>COPY_IN</literal> с успешным результатом, если в <parameter>errormsg</parameter> передаётся <symbol>NULL</symbol>. Если <parameter>errormsg</parameter> не <symbol>NULL</symbol>, команда <command>COPY</command> будет завершена с ошибкой, а сообщением об ошибке будет строка, переданная в <parameter>errormsg</parameter>. (Однако не следует полагать, что именно это сообщение будет получено от сервера назад, так как сервер мог уже прервать операцию <command>COPY</command> по своим причинам. Также заметьте, что принудительный вызов ошибки не работает с соединениями по протоколу версии до 3.0.)

source: The result is 1 if the termination message was sent; or in nonblocking mode, this may only indicate that the termination message was successfully queued. (In nonblocking mode, to be certain that the data has been sent, you should next wait for write-ready and call <function>PQflush</function>, repeating until it returns zero.) Zero indicates that the function could not queue the termination message because of full buffers; this will only happen in nonblocking mode. (In this case, wait for write-ready and try the <function>PQputCopyEnd</function> call again.) If a hard error occurs, -1 is returned; you can use <function>PQerrorMessage</function> to retrieve details.
ru: Эта функция возвращает 1, если сообщение завершения было передано; в неблокирующем режиме это означает только, что сообщение завершения успешно поставлено в очередь. (Чтобы удостовериться, что данные были успешно отправлены в неблокирующем режиме, следует дождаться готовности к записи и вызывать <function>PQflush</function> в цикле, пока она не вернёт ноль.) Нулевой результат означает, что функция не смогла поставить сообщение завершения в очередь по причине заполнения буферов; это возможно только в неблокирующем режиме. (В этом случае нужно дождаться готовности к записи и попытаться вызвать <function>PQputCopyEnd</function> снова.) Если действительно происходит ошибка, возвращается -1; получить её подробности можно, вызвав <function>PQerrorMessage</function>.

source: After successfully calling <function>PQputCopyEnd</function>, call <function>PQgetResult</function> to obtain the final result status of the <command>COPY</command> command. One can wait for this result to be available in the usual way. Then return to normal operation.
ru: После успешного вызова <function>PQputCopyEnd</function> вызовите <function>PQgetResult</function>, чтобы узнать окончательный результат команды <command>COPY</command>. Ожидать появления этого результата можно обычным образом. Затем вернитесь к обычным операциям.

source: Functions for Receiving <command>COPY</command> Data
ru: Функции для приёма данных <command>COPY</command>

source: These functions are used to receive data during <literal>COPY TO STDOUT</literal>. They will fail if called when the connection is not in <literal>COPY_OUT</literal> state.
ru: Эти функции применяются для получения данных при операции <literal>COPY TO STDOUT</literal>. Они не будут работать, если подключение находится не в состоянии <literal>COPY_OUT</literal>.

source: Receives data from the server during <literal>COPY_OUT</literal> state. <synopsis> int PQgetCopyData(PGconn *conn, char **buffer, int async); </synopsis>
ru: Принимает данные от сервера, когда активно состояние <literal>COPY_OUT</literal>. <synopsis> int PQgetCopyData(PGconn *conn, char **buffer, int async); </synopsis>

source: Attempts to obtain another row of data from the server during a <command>COPY</command>. Data is always returned one data row at a time; if only a partial row is available, it is not returned. Successful return of a data row involves allocating a chunk of memory to hold the data. The <parameter>buffer</parameter> parameter must be non-<symbol>NULL</symbol>. <parameter>*buffer</parameter> is set to point to the allocated memory, or to <symbol>NULL</symbol> in cases where no buffer is returned. A non-<symbol>NULL</symbol> result buffer should be freed using <function>PQfreemem</function> when no longer needed.
ru: Запрашивает следующую строку данных с сервера в процессе операции <command>COPY</command>. Данные всегда возвращаются строка за строкой; если поступила только часть строки, она не возвращается. Успешное получение строки данных подразумевает выделение блока памяти для этих данных. В параметре <parameter>buffer</parameter> ей передаётся указатель, отличный от <symbol>NULL</symbol>. По адресу <parameter>*buffer</parameter> записывается указатель на выделенную память, либо <symbol>NULL</symbol>, когда буфер не возвращается. Если буфер результата отличен от <symbol>NULL</symbol>, его следует освободить, когда он станет не нужен, вызвав <function>PQfreemem</function>.

source: When a row is successfully returned, the return value is the number of data bytes in the row (this will always be greater than zero). The returned string is always null-terminated, though this is probably only useful for textual <command>COPY</command>. A result of zero indicates that the <command>COPY</command> is still in progress, but no row is yet available (this is only possible when <parameter>async</parameter> is true). A result of -1 indicates that the <command>COPY</command> is done. A result of -2 indicates that an error occurred (consult <function>PQerrorMessage</function> for the reason).
ru: Когда строка получена успешно, возвращается число байт данных в этой строке (это число всегда больше нуля). Возвращаемое строковое значение всегда завершается нулём, хотя это полезно, вероятно, только для текстовой <command>COPY</command>. Нулевой результат означает, что операция <command>COPY</command> продолжает выполняться, но строка ещё не готова (это возможно, только когда параметр <parameter>async</parameter> равен true). Возвращённое значение -1 означает, что команда <command>COPY</command> завершена, а -2 показывает, что произошла ошибка (её причину можно узнать с помощью <function>PQerrorMessage</function>).

source: When <parameter>async</parameter> is true (not zero), <function>PQgetCopyData</function> will not block waiting for input; it will return zero if the <command>COPY</command> is still in progress but no complete row is available. (In this case wait for read-ready and then call <function>PQconsumeInput</function> before calling <function>PQgetCopyData</function> again.) When <parameter>async</parameter> is false (zero), <function>PQgetCopyData</function> will block until data is available or the operation completes.
ru: Когда параметр <parameter>async</parameter> равен true (отличен от нуля), функция <function>PQgetCopyData</function> не будет блокироваться, ожидая данных; она возвратит ноль, если выполнение <command>COPY</command> продолжается, но полная строка ещё не получена. (В этом случае нужно дождаться готовности к чтению и затем вызвать <function>PQconsumeInput</function>, прежде чем вызывать <function>PQgetCopyData</function> ещё раз.) Когда <parameter>async</parameter> равен false (нулю), <function>PQgetCopyData</function> будет заблокирована до поступления данных или окончания операции.

source: After <function>PQgetCopyData</function> returns -1, call <function>PQgetResult</function> to obtain the final result status of the <command>COPY</command> command. One can wait for this result to be available in the usual way. Then return to normal operation.
ru: Когда <function>PQgetCopyData</function> возвращает -1, вызовите <function>PQgetResult</function>, чтобы узнать окончательный результат команды <command>COPY</command>. Ожидать появления этого результата можно обычным образом. Затем вернитесь к обычным операциям.

source: Obsolete Functions for <command>COPY</command>
ru: Устаревшие функции для <command>COPY</command>

source: These functions represent older methods of handling <command>COPY</command>. Although they still work, they are deprecated due to poor error handling, inconvenient methods of detecting end-of-data, and lack of support for binary or nonblocking transfers.
ru: Эти функции представляют старые методы выполнения операции <command>COPY</command>. Хотя они продолжают работать, они признаны устаревшими из-за плохой обработки ошибок, неудобных способов обнаружения конца данных и отсутствия поддержки двоичных или неблокирующих передач.

source: Reads a newline-terminated line of characters (transmitted by the server) into a buffer string of size <parameter>length</parameter>. <synopsis> int PQgetline(PGconn *conn, char *buffer, int length); </synopsis>
ru: Читает передаваемую сервером строку символов, завершающуюся символом новой строки, в буфер (buffer) размера <parameter>length</parameter>. <synopsis> int PQgetline(PGconn *conn, char *buffer, int length); </synopsis>

source: This function copies up to <parameter>length</parameter>-1 characters into the buffer and converts the terminating newline into a zero byte. <function>PQgetline</function> returns <symbol>EOF</symbol> at the end of input, 0 if the entire line has been read, and 1 if the buffer is full but the terminating newline has not yet been read.
ru: Эта функция копирует <parameter>length</parameter>-1 символов в буфер и преобразует символ конца строки в нулевой байт. <function>PQgetline</function> возвращает <symbol>EOF</symbol> в конце ввода, 0, если была прочитана вся строка, и 1, если буфер заполнен, но завершающий символ конца строки ещё не прочитан.
