Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: To enter single-row mode, call <function>PQsetSingleRowMode</function> immediately after a successful call of <function>PQsendQuery</function> (or a sibling function). This mode selection is effective only for the currently executing query. Then call <function>PQgetResult</function> repeatedly, until it returns null, as documented in <xref linkend="libpq-async"/>. If the query returns any rows, they are returned as individual <structname>PGresult</structname> objects, which look like normal query results except for having status code <literal>PGRES_SINGLE_TUPLE</literal> instead of <literal>PGRES_TUPLES_OK</literal>. After the last row, or immediately if the query returns zero rows, a zero-row object with status <literal>PGRES_TUPLES_OK</literal> is returned; this is the signal that no more rows will arrive. (But note that it is still necessary to continue calling <function>PQgetResult</function> until it returns null.) All of these <structname>PGresult</structname> objects will contain the same row description data (column names, types, etc) that an ordinary <structname>PGresult</structname> object for the query would have. Each object should be freed with <function>PQclear</function> as usual.
ru: Для того чтобы войти в однострочный режим, вызовите <function>PQsetSingleRowMode</function> сразу же после успешного вызова функции <function>PQsendQuery</function> (или родственной функции). Выбор этого режима действителен только для текущего исполняющегося запроса. Затем повторно вызывайте функцию <function>PQgetResult</function> до тех пор, пока она не возвратит null, как описано в <xref linkend="libpq-async"/>. Если запрос возвращает какое-то число строк, то они возвращаются в виде индивидуальных объектов <structname>PGresult</structname>, которые выглядят, как обычные выборки, за исключением того, что их код статуса будет <literal>PGRES_SINGLE_TUPLE</literal> вместо <literal>PGRES_TUPLES_OK</literal>. После последней строки (или сразу же, если запрос не возвращает ни одной строки) будет возвращён объект, не содержащий ни одной строки и имеющий статус <literal>PGRES_TUPLES_OK</literal>; это сигнал о том, что строк больше не будет. (Но обратите внимание, что всё же необходимо продолжать вызывать функцию <function>PQgetResult</function>, пока она не возвратит значение null.) Все эти объекты <structname>PGresult</structname> будут содержать те же самые описательные данные (имена столбцов, типы и т. д.), которые имел бы обычный объект <structname>PGresult</structname>. Память, занимаемую каждым объектом, нужно освобождать с помощью <function>PQclear</function>, как обычно.

source: Select single-row mode for the currently-executing query. <synopsis> int PQsetSingleRowMode(PGconn *conn); </synopsis>
ru: Выбирает однострочный режим для текущего выполняющегося запроса. <synopsis> int PQsetSingleRowMode(PGconn *conn); </synopsis>

source: This function can only be called immediately after <function>PQsendQuery</function> or one of its sibling functions, before any other operation on the connection such as <function>PQconsumeInput</function> or <function>PQgetResult</function>. If called at the correct time, the function activates single-row mode for the current query and returns 1. Otherwise the mode stays unchanged and the function returns 0. In any case, the mode reverts to normal after completion of the current query.
ru: Эту функцию можно вызывать только непосредственно после функции <function>PQsendQuery</function> или одной из её родственных функций, до выполнения любой другой операции на этом подключении, такой, как <function>PQconsumeInput</function> или <function>PQgetResult</function>. Будучи вызванной своевременно, функция активирует однострочный режим для текущего запроса и возвращает 1. В противном случае режим остаётся не изменённым, а функция возвращает 0. В любом случае режим возвращается в нормальное состояние после завершения текущего запроса.

source: While processing a query, the server may return some rows and then encounter an error, causing the query to be aborted. Ordinarily, <application>libpq</application> discards any such rows and reports only the error. But in single-row mode, those rows will have already been returned to the application. Hence, the application will see some <literal>PGRES_SINGLE_TUPLE</literal> <structname>PGresult</structname> objects followed by a <literal>PGRES_FATAL_ERROR</literal> object. For proper transactional behavior, the application must be designed to discard or undo whatever has been done with the previously-processed rows, if the query ultimately fails.
ru: В процессе обработки запроса сервер может возвратить некоторое количество строк, а затем столкнуться с ошибкой, вынуждающей его аварийно завершить запрос. Обычно <application>libpq</application> отбрасывает такие строки и сообщает только об ошибке. Но в однострочном режиме эти строки уже будут возвращены приложению. Следовательно, приложение увидит ряд объектов <structname>PGresult</structname>, имеющих статус <literal>PGRES_SINGLE_TUPLE</literal>, за которыми последует объект со статусом <literal>PGRES_FATAL_ERROR</literal>. Для обеспечения надлежащего поведения транзакций приложение должно быть спроектировано таким образом, чтобы отбрасывать или отменять все операции, проведённые с уже обработанными строками, если запрос в конечном итоге завершается сбоем.

source: Canceling Queries in Progress
ru: Отмена запросов в процессе выполнения

source: <primary>canceling</primary> <secondary>SQL command</secondary>
ru: <primary>отмена</primary> <secondary>SQL-команд</secondary>

source: Creates a data structure containing the information needed to cancel a command issued through a particular database connection. <synopsis> PGcancel *PQgetCancel(PGconn *conn); </synopsis>
ru: Создаёт структуру данных, содержащую информацию, необходимую для отмены команды, запущенной через конкретное подключение к базе данных.<synopsis> PGcancel *PQgetCancel(PGconn *conn); </synopsis>

source: <function>PQgetCancel</function> creates a <structname>PGcancel</structname><placeholder-1/> object given a <structname>PGconn</structname> connection object. It will return <symbol>NULL</symbol> if the given <parameter>conn</parameter> is <symbol>NULL</symbol> or an invalid connection. The <structname>PGcancel</structname> object is an opaque structure that is not meant to be accessed directly by the application; it can only be passed to <function>PQcancel</function> or <function>PQfreeCancel</function>.
ru: Функция <function>PQgetCancel</function> создаёт объект <structname>PGcancel</structname><placeholder-1/>, получив объект <structname>PGconn</structname>, описывающий подключение. Она возвратит <symbol>NULL</symbol>, если данный параметр <parameter>conn</parameter> равен <symbol>NULL</symbol> или представляет собой недействительное подключения. Объект <structname>PGcancel</structname> является непрозрачной структурой, которая не предназначена для того, чтобы приложение обращалось к ней напрямую; её можно только передавать функции <function>PQcancel</function> или <function>PQfreeCancel</function>.

source: Frees a data structure created by <function>PQgetCancel</function>. <synopsis> void PQfreeCancel(PGcancel *cancel); </synopsis>
ru: Освобождает память, занимаемую структурой данных, созданной функцией <function>PQgetCancel</function>. <synopsis> void PQfreeCancel(PGcancel *cancel); </synopsis>

source: <function>PQfreeCancel</function> frees a data object previously created by <function>PQgetCancel</function>.
ru: <function>PQfreeCancel</function> освобождает память, занимаемую объектом, предварительно созданным функцией <function>PQgetCancel</function>.

source: Requests that the server abandon processing of the current command. <synopsis> int PQcancel(PGcancel *cancel, char *errbuf, int errbufsize); </synopsis>
ru: Требует, чтобы сервер прекратил обработку текущей команды. <synopsis> int PQcancel(PGcancel *cancel, char *errbuf, int errbufsize); </synopsis>

source: The return value is 1 if the cancel request was successfully dispatched and 0 if not. If not, <parameter>errbuf</parameter> is filled with an explanatory error message. <parameter>errbuf</parameter> must be a char array of size <parameter>errbufsize</parameter> (the recommended size is 256 bytes).
ru: Возвращаемое значение равно 1, если запрос на отмену был успешно отправлен, и 0 в противном случае. В случае неудачной отправки <parameter>errbuf</parameter> заполняется пояснительным сообщением об ошибке. <parameter>errbuf</parameter> должен быть массивом символов, имеющим размер <parameter>errbufsize</parameter> (рекомендуемый размер составляет 256 байтов).

source: Successful dispatch is no guarantee that the request will have any effect, however. If the cancellation is effective, the current command will terminate early and return an error result. If the cancellation fails (say, because the server was already done processing the command), then there will be no visible result at all.
ru: Успешная отправка ещё не является гарантией того, что запрос будет иметь какой-то эффект. Если отмена сработала, текущая команда завершится досрочно и возвратит в качестве результата ошибку. Если же отмена не получится (например, потому, что сервер уже завершил обработку команды), тогда вообще не будет видимого результата.

source: <function>PQcancel</function> can safely be invoked from a signal handler, if the <parameter>errbuf</parameter> is a local variable in the signal handler. The <structname>PGcancel</structname> object is read-only as far as <function>PQcancel</function> is concerned, so it can also be invoked from a thread that is separate from the one manipulating the <structname>PGconn</structname> object.
ru: <function>PQcancel</function> можно безопасно вызывать из обработчика сигнала, если <parameter>errbuf</parameter> является локальной переменной в обработчике сигнала. Объект <structname>PGcancel</structname> доступен только в режиме чтения, пока речь идёт о функции <function>PQcancel</function>, поэтому её можно также вызывать из потока, отдельного от того, который управляет объектом <structname>PGconn</structname>.

source: <function>PQrequestCancel</function> is a deprecated variant of <function>PQcancel</function>. <synopsis> int PQrequestCancel(PGconn *conn); </synopsis>
ru: <function>PQrequestCancel</function> является нерекомендуемым вариантом функции <function>PQcancel</function>. <synopsis> int PQrequestCancel(PGconn *conn); </synopsis>

source: Requests that the server abandon processing of the current command. It operates directly on the <structname>PGconn</structname> object, and in case of failure stores the error message in the <structname>PGconn</structname> object (whence it can be retrieved by <function>PQerrorMessage</function>). Although the functionality is the same, this approach creates hazards for multiple-thread programs and signal handlers, since it is possible that overwriting the <structname>PGconn</structname>'s error message will mess up the operation currently in progress on the connection.
ru: Выдаёт запрос на то, чтобы сервер прекратил обработку текущей команды. Функция работает напрямую с объектом <structname>PGconn</structname> и в случае сбоя сохраняет сообщение об ошибке в объекте <structname>PGconn</structname> (откуда его можно извлечь с помощью <function>PQerrorMessage</function>). Хотя функциональность та же самая, этот подход создаёт риски для многопоточных программ и обработчиков сигналов, поскольку возможно, что перезапись сообщения об ошибке, хранящегося в объекте <structname>PGconn</structname>, внесёт путаницу в текущую операцию, выполняемую на данном подключении.

source: A client application can request cancellation of a command that is still being processed by the server, using the functions described in this section. <placeholder-1/> <placeholder-2/>
ru: Клиентское приложение может запросить отмену команды, которая ещё обрабатывается сервером, используя функции, описанные в этом разделе. <placeholder-1/> <placeholder-2/>

source: The Fast-Path Interface
ru: Интерфейс быстрого пути

source: <primary>fast path</primary>
ru: <primary>быстрый путь</primary>

source: <productname>PostgreSQL</productname> provides a fast-path interface to send simple function calls to the server.
ru: <productname>PostgreSQL</productname> предоставляет интерфейс для передачи серверу простых вызовов функций по быстрому пути.

source: This interface is somewhat obsolete, as one can achieve similar performance and greater functionality by setting up a prepared statement to define the function call. Then, executing the statement with binary transmission of parameters and results substitutes for a fast-path function call.
ru: Этот интерфейс несколько устарел, поскольку можно достичь подобной производительности и большей функциональности путём создания подготовленного оператора, определяющего вызов функции. Последующее выполнение этого оператора с передачей параметров и результатов в двоичном виде можно считать заменой вызову по быстрому пути.

source: The function <function>PQfn</function><placeholder-1/> requests execution of a server function via the fast-path interface: <synopsis> PGresult *PQfn(PGconn *conn, int fnid, int *result_buf, int *result_len, int result_is_int, const PQArgBlock *args, int nargs); typedef struct { int len; int isint; union { int *ptr; int integer; } u; } PQArgBlock; </synopsis>
ru: Функция <function>PQfn</function><placeholder-1/> запрашивает выполнение серверной функции посредством интерфейса быстрого доступа: <synopsis> PGresult *PQfn(PGconn *conn, int fnid, int *result_buf, int *result_len, int result_is_int, const PQArgBlock *args, int nargs); typedef struct { int len; int isint; union { int *ptr; int integer; } u; } PQArgBlock; </synopsis>

source: The <parameter>fnid</parameter> argument is the OID of the function to be executed. <parameter>args</parameter> and <parameter>nargs</parameter> define the parameters to be passed to the function; they must match the declared function argument list. When the <parameter>isint</parameter> field of a parameter structure is true, the <parameter>u.integer</parameter> value is sent to the server as an integer of the indicated length (this must be 2 or 4 bytes); proper byte-swapping occurs. When <parameter>isint</parameter> is false, the indicated number of bytes at <parameter>*u.ptr</parameter> are sent with no processing; the data must be in the format expected by the server for binary transmission of the function's argument data type. (The declaration of <parameter>u.ptr</parameter> as being of type <type>int *</type> is historical; it would be better to consider it <type>void *</type>.) <parameter>result_buf</parameter> points to the buffer in which to place the function's return value. The caller must have allocated sufficient space to store the return value. (There is no check!) The actual result length in bytes will be returned in the integer pointed to by <parameter>result_len</parameter>. If a 2- or 4-byte integer result is expected, set <parameter>result_is_int</parameter> to 1, otherwise set it to 0. Setting <parameter>result_is_int</parameter> to 1 causes <application>libpq</application> to byte-swap the value if necessary, so that it is delivered as a proper <type>int</type> value for the client machine; note that a 4-byte integer is delivered into <parameter>*result_buf</parameter> for either allowed result size. When <parameter>result_is_int</parameter> is 0, the binary-format byte string sent by the server is returned unmodified. (In this case it's better to consider <parameter>result_buf</parameter> as being of type <type>void *</type>.)
ru: Аргумент <parameter>fnid</parameter> представляет собой OID функции, которая подлежит выполнению. <parameter>args</parameter> и <parameter>nargs</parameter> определяют параметры, которые должны быть переданы этой функции; они должны соответствовать списку аргументов объявленной функции. Когда поле <parameter>isint</parameter> структуры, передаваемой в качестве параметра, имеет значение "истина", тогда значение <parameter>u.integer</parameter> передаётся серверу в виде целого числа указанной длины (это должно быть 2 или 4 байта); при этом устанавливается нужный порядок байтов. Когда <parameter>isint</parameter> имеет значение "ложь", тогда указанное число байтов по адресу <parameter>*u.ptr</parameter> отправляется без какой-либо обработки; данные должны быть представлены в формате, которого ожидает сервер для передачи в двоичном виде данных того типа, что и аргументы функции. (Объявление поля <parameter>u.ptr</parameter>, как имеющего тип <type>int *</type>, является историческим; было бы лучше рассматривать его как тип <type>void *</type>.) <parameter>result_buf</parameter> указывает на буфер, в который должно быть помещено возвращаемое значение функции. Вызывающий код должен выделить достаточное место для сохранения возвращаемого значения. (Это никак не проверяется!) Фактическая длина результирующего значения в байтах будет возвращена в переменной целого типа, на которую указывает <parameter>result_len</parameter>. Если ожидается получение двух- или четырёхбайтового целочисленного результата, то присвойте параметру <parameter>result_is_int</parameter> значение 1, в противном случае назначьте ему 0. Когда параметр <parameter>result_is_int</parameter> равен 1, <application>libpq</application> переставляет байты в передаваемом значении, если это необходимо, так, чтобы оно было доставлено на клиентскую машину в виде правильного значения типа <type>int</type>; обратите внимание, что по адресу <parameter>*result_buf</parameter> доставляется четырёхбайтовое целое для любого допустимого размера результата. Когда <parameter>result_is_int</parameter> равен 0, тогда строка байтов в двоичном формате, отправленная сервером, будет возвращена немодифицированной. (В этом случае лучше рассматривать <parameter>result_buf</parameter> как имеющий тип <type>void *</type>.)

source: <function>PQfn</function> always returns a valid <structname>PGresult</structname> pointer. The result status should be checked before the result is used. The caller is responsible for freeing the <structname>PGresult</structname> with <function>PQclear</function> when it is no longer needed.
ru: <function>PQfn</function> всегда возвращает действительный указатель на объект <structname>PGresult</structname>. Перед использованием результата нужно сначала проверить его статус. Вызывающая функция отвечает за освобождение памяти, занимаемой объектом <structname>PGresult</structname>, когда он больше не нужен, с помощью <function>PQclear</function>.

source: Note that it is not possible to handle null arguments, null results, nor set-valued results when using this interface.
ru: Обратите внимание, что при использовании этого интерфейса невозможно обработать NULL в аргументах и результате, а также множества значений в результате.

source: Asynchronous Notification
ru: Асинхронное уведомление

source: <primary>NOTIFY</primary> <secondary>in libpq</secondary>
ru: <primary>NOTIFY</primary> <secondary>в libpq</secondary>

source: <productname>PostgreSQL</productname> offers asynchronous notification via the <command>LISTEN</command> and <command>NOTIFY</command> commands. A client session registers its interest in a particular notification channel with the <command>LISTEN</command> command (and can stop listening with the <command>UNLISTEN</command> command). All sessions listening on a particular channel will be notified asynchronously when a <command>NOTIFY</command> command with that channel name is executed by any session. A <quote>payload</quote> string can be passed to communicate additional data to the listeners.
ru: <productname>PostgreSQL</productname> предлагает асинхронное уведомление посредством команд <command>LISTEN</command> и <command>NOTIFY</command>. Клиентский сеанс работы регистрирует свою заинтересованность в конкретном канале уведомлений с помощью команды <command>LISTEN</command> (и может остановить прослушивание с помощью команды <command>UNLISTEN</command>). Все сеансы, прослушивающие конкретный канал, будут уведомляться в асинхронном режиме, когда в рамках любого сеанса команда <command>NOTIFY</command> выполняется с параметром, указывающим имя этого канала. Для передачи дополнительных данных прослушивающим сеансам может использоваться строка <quote>payload</quote>.

source: <application>libpq</application> applications submit <command>LISTEN</command>, <command>UNLISTEN</command>, and <command>NOTIFY</command> commands as ordinary SQL commands. The arrival of <command>NOTIFY</command> messages can subsequently be detected by calling <function>PQnotifies</function>.<placeholder-1/>
ru: Приложения, использующие <application>libpq</application>, отправляют серверу команды <command>LISTEN</command>, <command>UNLISTEN</command> и <command>NOTIFY</command>, как обычные SQL-команды. Прибытие сообщений от команды <command>NOTIFY</command> можно впоследствии обнаружить с помощью вызова функции <function>PQnotifies</function>.<placeholder-1/>

source: The function <function>PQnotifies</function> returns the next notification from a list of unhandled notification messages received from the server. It returns a null pointer if there are no pending notifications. Once a notification is returned from <function>PQnotifies</function>, it is considered handled and will be removed from the list of notifications. <synopsis> PGnotify *PQnotifies(PGconn *conn); typedef struct pgNotify { char *relname; /* notification channel name */ int be_pid; /* process ID of notifying server process */ char *extra; /* notification payload string */ } PGnotify; </synopsis> After processing a <structname>PGnotify</structname> object returned by <function>PQnotifies</function>, be sure to free it with <function>PQfreemem</function>. It is sufficient to free the <structname>PGnotify</structname> pointer; the <structfield>relname</structfield> and <structfield>extra</structfield> fields do not represent separate allocations. (The names of these fields are historical; in particular, channel names need not have anything to do with relation names.)
ru: Функция <function>PQnotifies</function> возвращает следующее уведомление из списка необработанных уведомительных сообщений, полученных от сервера. Она возвращает нулевой указатель, если нет уведомлений, ожидающих обработки. Как только уведомление возвращено из функции <function>PQnotifies</function>, оно считается обработанным и будет удалено из списка уведомлений. <synopsis> PGnotify *PQnotifies(PGconn *conn); typedef struct pgNotify { char *relname; /* имя канала уведомлений */ int be_pid; /* ID серверного процесса, посылающего уведомление */ char *extra; /* строка сообщения в уведомлении */ } PGnotify; </synopsis> После обработки объекта <structname>PGnotify</structname>, возвращённого функцией <function>PQnotifies</function>, обязательно освободите память, занимаемую им, с помощью функции <function>PQfreemem</function>. Достаточно освободить указатель на <structname>PGnotify</structname>; поля <structfield>relname</structfield> и <structfield>extra</structfield> не представляют отдельных областей памяти. (Имена этих полей являются таковыми по историческим причинам; в частности, имена каналов не обязаны иметь ничего общего с именами реляционных отношений.)

source: <xref linkend="libpq-example-2"/> gives a sample program that illustrates the use of asynchronous notification.
ru: <xref linkend="libpq-example-2"/> представляет пример программы, иллюстрирующей использование асинхронного уведомления.
