Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: The function creates a prepared statement named <parameter>stmtName</parameter> from the <parameter>query</parameter> string, which must contain a single SQL command. <parameter>stmtName</parameter> can be <literal>""</literal> to create an unnamed statement, in which case any pre-existing unnamed statement is automatically replaced; otherwise it is an error if the statement name is already defined in the current session. If any parameters are used, they are referred to in the query as <literal>$1</literal>, <literal>$2</literal>, etc. <parameter>nParams</parameter> is the number of parameters for which types are pre-specified in the array <parameter>paramTypes[]</parameter>. (The array pointer can be <symbol>NULL</symbol> when <parameter>nParams</parameter> is zero.) <parameter>paramTypes[]</parameter> specifies, by OID, the data types to be assigned to the parameter symbols. If <parameter>paramTypes</parameter> is <symbol>NULL</symbol>, or any particular element in the array is zero, the server assigns a data type to the parameter symbol in the same way it would do for an untyped literal string. Also, the query can use parameter symbols with numbers higher than <parameter>nParams</parameter>; data types will be inferred for these symbols as well. (See <function>PQdescribePrepared</function> for a means to find out what data types were inferred.)
ru: Функция создаёт подготовленный оператор с именем <parameter>stmtName</parameter> из строки <parameter>query</parameter>, которая должна содержать единственную SQL-команду. <parameter>stmtName</parameter> может быть пустой строкой <literal>""</literal>, тогда будет создан неименованный оператор (в таком случае любой уже существующий неименованный оператор будет автоматически заменён), в противном случае, если имя оператора уже определено в текущем сеансе работы, будет ошибка. Если используются параметры, то в запросе к ним обращаются таким образом: <literal>$1</literal>, <literal>$2</literal> и т. д. <parameter>nParams</parameter> представляет число параметров, типы данных для которых указаны в массиве <parameter>paramTypes[]</parameter>. (Указатель на массив может быть равен <symbol>NULL</symbol>, когда значение <parameter>nParams</parameter> равно нулю.) <parameter>paramTypes[]</parameter> указывает, посредством OID, типы данных, которые будут назначены параметрам. Если <parameter>paramTypes</parameter> равен <symbol>NULL</symbol> или какой-либо элемент в этом массиве равен нулю, то сервер назначает тип данных соответствующему параметру точно таким же способом, как он сделал бы для литеральной строки, не имеющей типа. Также в запросе можно использовать параметры с номерами, большими, чем <parameter>nParams</parameter>; типы данных для них сервер также сможет подобрать. (См. описание <function>PQdescribePrepared</function>, где сказано, какие существуют средства, чтобы определить, какие типы данных были подобраны).

source: As with <function>PQexec</function>, the result is normally a <structname>PGresult</structname> object whose contents indicate server-side success or failure. A null result indicates out-of-memory or inability to send the command at all. Use <function>PQerrorMessage</function> to get more information about such errors.
ru: Как и при вызове <function>PQexec</function>, результатом является объект <structname>PGresult</structname>, содержимое которого показывает успех или сбой на стороне сервера. Нулевой указатель означает нехватку памяти или невозможность вообще отправить команду. Для получения дополнительной информации о таких ошибках используйте <function>PQerrorMessage</function>.

source: <placeholder-1/> Prepared statements for use with <function>PQexecPrepared</function> can also be created by executing SQL <xref linkend="sql-prepare"/> statements. Also, although there is no <application>libpq</application> function for deleting a prepared statement, the SQL <xref linkend="sql-deallocate"/> statement can be used for that purpose.
ru: <placeholder-1/> Подготовленные операторы для использования с <function>PQexecPrepared</function> можно также создать путём исполнения SQL-команд <xref linkend="sql-prepare"/>. Также, хотя никакой функции <application>libpq</application> для удаления подготовленного оператора не предусмотрено, для этой цели можно воспользоваться SQL-командой <xref linkend="sql-deallocate"/>.

source: Sends a request to execute a prepared statement with given parameters, and waits for the result. <synopsis> PGresult *PQexecPrepared(PGconn *conn, const char *stmtName, int nParams, const char * const *paramValues, const int *paramLengths, const int *paramFormats, int resultFormat); </synopsis>
ru: Отправляет запрос на исполнение подготовленного оператора с данными параметрами и ожидает результата. <synopsis> PGresult *PQexecPrepared(PGconn *conn, const char *stmtName, int nParams, const char * const *paramValues, const int *paramLengths, const int *paramFormats, int resultFormat); </synopsis>

source: <function>PQexecPrepared</function> is like <function>PQexecParams</function>, but the command to be executed is specified by naming a previously-prepared statement, instead of giving a query string. This feature allows commands that will be used repeatedly to be parsed and planned just once, rather than each time they are executed. The statement must have been prepared previously in the current session. <function>PQexecPrepared</function> is supported only in protocol 3.0 and later connections; it will fail when using protocol 2.0.
ru: <function>PQexecPrepared</function> подобна <function>PQexecParams</function>, но команда, подлежащая исполнению, указывается путём передачи имени предварительно подготовленного оператора вместо передачи строки запроса. Эта возможность позволяет командам, которые вызываются многократно, подвергаться разбору и планированию только один раз, а не при каждом их исполнении. Оператор должен быть подготовлен предварительно в рамках текущего сеанса работы. <function>PQexecPrepared</function> поддерживается только в соединениях по протоколу версии 3.0 или более поздних версий. При использовании протокола версии 2.0 функция завершится сбоем.

source: The parameters are identical to <function>PQexecParams</function>, except that the name of a prepared statement is given instead of a query string, and the <parameter>paramTypes[]</parameter> parameter is not present (it is not needed since the prepared statement's parameter types were determined when it was created).
ru: Параметры идентичны <function>PQexecParams</function>, за исключением того, что вместо строки запроса передаётся имя подготовленного оператора, и отсутствует параметр <parameter>paramTypes[]</parameter> (он не нужен, поскольку типы данных для параметров подготовленного оператора были определены при его создании).

source: Submits a request to obtain information about the specified prepared statement, and waits for completion. <synopsis> PGresult *PQdescribePrepared(PGconn *conn, const char *stmtName); </synopsis>
ru: Передаёт запрос на получение информации об указанном подготовленном операторе и ожидает завершения. <synopsis> PGresult *PQdescribePrepared(PGconn *conn, const char *stmtName); </synopsis>

source: <function>PQdescribePrepared</function> allows an application to obtain information about a previously prepared statement. <function>PQdescribePrepared</function> is supported only in protocol 3.0 and later connections; it will fail when using protocol 2.0.
ru: <function>PQdescribePrepared</function> позволяет приложению получить информацию о предварительно подготовленном операторе. <function>PQdescribePrepared</function> поддерживается только в соединениях по протоколу версии 3.0 или более поздних версий. При использовании протокола версии 2.0 функция завершится сбоем.

source: <parameter>stmtName</parameter> can be <literal>""</literal> or <symbol>NULL</symbol> to reference the unnamed statement, otherwise it must be the name of an existing prepared statement. On success, a <structname>PGresult</structname> with status <literal>PGRES_COMMAND_OK</literal> is returned. The functions <function>PQnparams</function> and <function>PQparamtype</function> can be applied to this <structname>PGresult</structname> to obtain information about the parameters of the prepared statement, and the functions <function>PQnfields</function>, <function>PQfname</function>, <function>PQftype</function>, etc provide information about the result columns (if any) of the statement.
ru: Для ссылки на неименованный оператор значение <parameter>stmtName</parameter> может быть пустой строкой <literal>""</literal> или <symbol>NULL</symbol>, в противном случае оно должно быть именем существующего подготовленного оператора. В случае успешного выполнения возвращается <structname>PGresult</structname> со статусом <literal>PGRES_COMMAND_OK</literal>. Функции <function>PQnparams</function> и <function>PQparamtype</function> позволяют извлечь из <structname>PGresult</structname> информацию о параметрах подготовленного оператора, а функции <function>PQnfields</function>, <function>PQfname</function>, <function>PQftype</function> и т. п. предоставляют информацию о результирующих столбцах (если они есть) данного оператора.

source: Submits a request to obtain information about the specified portal, and waits for completion. <synopsis> PGresult *PQdescribePortal(PGconn *conn, const char *portalName); </synopsis>
ru: Передаёт запрос на получение информации об указанном портале и ожидает завершения. <synopsis> PGresult *PQdescribePortal(PGconn *conn, const char *portalName); </synopsis>

source: <function>PQdescribePortal</function> allows an application to obtain information about a previously created portal. (<application>libpq</application> does not provide any direct access to portals, but you can use this function to inspect the properties of a cursor created with a <command>DECLARE CURSOR</command> SQL command.) <function>PQdescribePortal</function> is supported only in protocol 3.0 and later connections; it will fail when using protocol 2.0.
ru: <function>PQdescribePortal</function> позволяет приложению получить информацию о предварительно созданном портале. (<application>libpq</application> не предоставляет прямого доступа к порталам, но вы можете использовать эту функцию для ознакомления со свойствами курсора, созданного с помощью SQL-команды <command>DECLARE CURSOR</command>.) <function>PQdescribePortal</function> поддерживается только в соединениях по протоколу версии 3.0 или более поздних версий. При использовании протокола версии 2.0 функция завершится сбоем.

source: <parameter>portalName</parameter> can be <literal>""</literal> or <symbol>NULL</symbol> to reference the unnamed portal, otherwise it must be the name of an existing portal. On success, a <structname>PGresult</structname> with status <literal>PGRES_COMMAND_OK</literal> is returned. The functions <function>PQnfields</function>, <function>PQfname</function>, <function>PQftype</function>, etc can be applied to the <structname>PGresult</structname> to obtain information about the result columns (if any) of the portal.
ru: Для ссылки на неименованный портал значение <parameter>portalName</parameter> может быть пустой строкой <literal>""</literal> или <symbol>NULL</symbol>, в противном случае оно должно быть именем существующего портала. В случае успешного завершения возвращается <structname>PGresult</structname> со статусом <literal>PGRES_COMMAND_OK</literal>. С помощью функций <function>PQnfields</function>, <function>PQfname</function>, <function>PQftype</function> и т. д. можно извлечь из <structname>PGresult</structname> информацию о результирующих столбцах (если они есть) данного портала.

source: Returns the result status of the command. <synopsis> ExecStatusType PQresultStatus(const PGresult *res); </synopsis>
ru: Возвращает статус результата выполнения команды. <synopsis> ExecStatusType PQresultStatus(const PGresult *res); </synopsis>

source: The string sent to the server was empty.
ru: Строка, отправленная серверу, была пустой.

source: Successful completion of a command returning no data.
ru: Успешное завершение команды, не возвращающей никаких данных.

source: Successful completion of a command returning data (such as a <command>SELECT</command> or <command>SHOW</command>).
ru: Успешное завершение команды, возвращающей данные (такой, как <command>SELECT</command> или <command>SHOW</command>).

source: Copy Out (from server) data transfer started.
ru: Начат перенос данных Copy Out (с сервера).

source: Copy In (to server) data transfer started.
ru: Начат перенос данных Copy In (на сервер).

source: The server's response was not understood.
ru: Ответ сервера не был распознан.

source: A nonfatal error (a notice or warning) occurred.
ru: Произошла не фатальная ошибка (уведомление или предупреждение).

source: A fatal error occurred.
ru: Произошла фатальная ошибка.

source: Copy In/Out (to and from server) data transfer started. This feature is currently used only for streaming replication, so this status should not occur in ordinary applications.
ru: Начат перенос данных Copy In/Out (на сервер и с сервера). Эта функция в настоящее время используется только для потоковой репликации, поэтому такой статус не должен иметь место в обычных приложениях.

source: The <structname>PGresult</structname> contains a single result tuple from the current command. This status occurs only when single-row mode has been selected for the query (see <xref linkend="libpq-single-row-mode"/>).
ru: Структура <structname>PGresult</structname> содержит только одну результирующую строку, возвращённую текущей командой. Этот статус имеет место только тогда, когда для данного запроса был выбран режим построчного вывода (см. <xref remap="4" linkend="libpq-single-row-mode"/>).

source: <function>PQresultStatus</function> can return one of the following values: <placeholder-1/> If the result status is <literal>PGRES_TUPLES_OK</literal> or <literal>PGRES_SINGLE_TUPLE</literal>, then the functions described below can be used to retrieve the rows returned by the query. Note that a <command>SELECT</command> command that happens to retrieve zero rows still shows <literal>PGRES_TUPLES_OK</literal>. <literal>PGRES_COMMAND_OK</literal> is for commands that can never return rows (<command>INSERT</command> or <command>UPDATE</command> without a <literal>RETURNING</literal> clause, etc.). A response of <literal>PGRES_EMPTY_QUERY</literal> might indicate a bug in the client software.
ru: <function>PQresultStatus</function> может возвращать одно из следующих значений: <placeholder-1/> Если статус результата <literal>PGRES_TUPLES_OK</literal> или <literal>PGRES_SINGLE_TUPLE</literal>, тогда для извлечения строк, возвращённых запросом, можно использовать функции, описанные ниже. Обратите внимание, что команда <command>SELECT</command>, даже когда она не извлекает ни одной строки, всё же показывает <literal>PGRES_TUPLES_OK</literal>. <literal>PGRES_COMMAND_OK</literal> предназначен для команд, которые никогда не возвращают строки (<command>INSERT</command> или <command>UPDATE</command> без использования предложения <literal>RETURNING</literal> и др.). Ответ <literal>PGRES_EMPTY_QUERY</literal> может указывать на наличие ошибки в клиентском программном обеспечении.

source: A result of status <symbol>PGRES_NONFATAL_ERROR</symbol> will never be returned directly by <function>PQexec</function> or other query execution functions; results of this kind are instead passed to the notice processor (see <xref linkend="libpq-notice-processing"/>).
ru: Результат со статусом <symbol>PGRES_NONFATAL_ERROR</symbol> никогда не будет возвращён напрямую функцией <function>PQexec</function> или другими функциями исполнения запросов; вместо этого результаты такого вида передаются обработчику уведомлений (см. <xref remap="4" linkend="libpq-notice-processing"/>).

source: Converts the enumerated type returned by <function>PQresultStatus</function> into a string constant describing the status code. The caller should not free the result. <synopsis> char *PQresStatus(ExecStatusType status); </synopsis>
ru: Преобразует значение перечислимого типа, возвращённое функцией <function>PQresultStatus</function>, в строковую константу, описывающую код статуса. Вызывающая функция не должна освобождать память, на которую указывает возвращаемый указатель. <synopsis> char *PQresStatus(ExecStatusType status); </synopsis>

source: Returns the error message associated with the command, or an empty string if there was no error. <synopsis> char *PQresultErrorMessage(const PGresult *res); </synopsis> If there was an error, the returned string will include a trailing newline. The caller should not free the result directly. It will be freed when the associated <structname>PGresult</structname> handle is passed to <function>PQclear</function>.
ru: Возвращает сообщение об ошибке, связанное с командой, или пустую строку, если ошибки не произошло. <synopsis> char *PQresultErrorMessage(const PGresult *res); </synopsis> Если произошла ошибка, то возвращённая строка будет включать завершающий символ новой строки. Вызывающая функция не должна напрямую освобождать память, на которую указывает возвращаемый указатель. Она будет освобождена, когда соответствующий указатель <structname>PGresult</structname> будет передан функции <function>PQclear</function>.

source: Immediately following a <function>PQexec</function> or <function>PQgetResult</function> call, <function>PQerrorMessage</function> (on the connection) will return the same string as <function>PQresultErrorMessage</function> (on the result). However, a <structname>PGresult</structname> will retain its error message until destroyed, whereas the connection's error message will change when subsequent operations are done. Use <function>PQresultErrorMessage</function> when you want to know the status associated with a particular <structname>PGresult</structname>; use <function>PQerrorMessage</function> when you want to know the status from the latest operation on the connection.
ru: Если непосредственно после вызова <function>PQexec</function> или <function>PQgetResult</function> вызвать функцию <function>PQerrorMessage</function> (для данного подключения), то она возвратит ту же самую строку, что и <function>PQresultErrorMessage</function> (для данного результата). Однако, <structname>PGresult</structname> сохранит своё сообщение об ошибке до тех пор, пока не будет уничтожен, в то время, как сообщение об ошибке, связанное с данным подключением, будет изменяться при выполнении последующих операций. Воспользуйтесь функцией <function>PQresultErrorMessage</function>, когда вы хотите узнать статус, связанный с конкретной структурой <structname>PGresult</structname>; используйте функцию <function>PQerrorMessage</function>, когда вы хотите узнать статус выполнения самой последней операции на данном соединении.

source: Returns a reformatted version of the error message associated with a <structname>PGresult</structname> object. <synopsis> char *PQresultVerboseErrorMessage(const PGresult *res, PGVerbosity verbosity, PGContextVisibility show_context); </synopsis> In some situations a client might wish to obtain a more detailed version of a previously-reported error. <function>PQresultVerboseErrorMessage</function> addresses this need by computing the message that would have been produced by <function>PQresultErrorMessage</function> if the specified verbosity settings had been in effect for the connection when the given <structname>PGresult</structname> was generated. If the <structname>PGresult</structname> is not an error result, <quote>PGresult is not an error result</quote> is reported instead. The returned string includes a trailing newline.
ru: Возвращает переформатированную версию сообщения об ошибке, связанного с объектом <structname>PGresult</structname>. <synopsis> char *PQresultVerboseErrorMessage(const PGresult *res, PGVerbosity verbosity, PGContextVisibility show_context); </synopsis> В некоторых ситуациях клиент может захотеть получить более подробную версию ранее выданного сообщения об ошибке. Эту потребность удовлетворяет функция <function>PQresultVerboseErrorMessage</function>, формируя сообщение, которое было бы выдано функцией <function>PQresultErrorMessage</function>, если бы заданный уровень детализации был текущим для соединения в момент заполнения <structname>PGresult</structname>. Если же в <structname>PGresult</structname> не содержится ошибка, вместо этого выдаётся сообщение <quote>PGresult is not an error result</quote> (PGresult — не результат с ошибкой). Возвращаемое этой функцией сообщение завершается переводом строки.

source: Unlike most other functions for extracting data from a <structname>PGresult</structname>, the result of this function is a freshly allocated string. The caller must free it using <function>PQfreemem()</function> when the string is no longer needed.
ru: В отличие от многих других функций, извлекающих данные из <structname>PGresult</structname>, результат этой функции — новая размещённая в памяти строка. Когда эта строка будет не нужна, вызывающий код должен освободить её место, вызвав <function>PQfreemem()</function>.

source: A NULL return is possible if there is insufficient memory.
ru: При нехватке памяти может быть возвращёно NULL.

source: Returns an individual field of an error report. <synopsis> char *PQresultErrorField(const PGresult *res, int fieldcode); </synopsis> <parameter>fieldcode</parameter> is an error field identifier; see the symbols listed below. <symbol>NULL</symbol> is returned if the <structname>PGresult</structname> is not an error or warning result, or does not include the specified field. Field values will normally not include a trailing newline. The caller should not free the result directly. It will be freed when the associated <structname>PGresult</structname> handle is passed to <function>PQclear</function>.
ru: Возвращает индивидуальное поле из отчёта об ошибке. <synopsis> char *PQresultErrorField(const PGresult *res, int fieldcode); </synopsis> <parameter>fieldcode</parameter> это идентификатор поля ошибки; см. символические константы, перечисленные ниже. Если <structname>PGresult</structname> не содержит ошибки или предупреждения или не включает указанное поле, то возвращается <symbol>NULL</symbol>. Значения полей обычно не включают завершающий символ новой строки. Вызывающая функция не должна напрямую освобождать память, на которую указывает возвращаемый указатель. Она будет освобождена, когда соответствующий указатель <structname>PGresult</structname> будет передан функции <function>PQclear</function>.

source: The severity; the field contents are <literal>ERROR</literal>, <literal>FATAL</literal>, or <literal>PANIC</literal> (in an error message), or <literal>WARNING</literal>, <literal>NOTICE</literal>, <literal>DEBUG</literal>, <literal>INFO</literal>, or <literal>LOG</literal> (in a notice message), or a localized translation of one of these. Always present.
ru: Серьёзность; поле может содержать <literal>ERROR</literal>, <literal>FATAL</literal> или <literal>PANIC</literal> (в сообщении об ошибке) либо <literal>WARNING</literal>, <literal>NOTICE</literal>, <literal>DEBUG</literal>, <literal>INFO</literal> или <literal>LOG</literal> (в сообщении-уведомлении) либо локализованный перевод одного из этих значений. Присутствует всегда.
