Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: Note that the application must check to see if a new line consists of the two characters <literal>\.</literal>, which indicates that the server has finished sending the results of the <command>COPY</command> command. If the application might receive lines that are more than <parameter>length</parameter>-1 characters long, care is needed to be sure it recognizes the <literal>\.</literal> line correctly (and does not, for example, mistake the end of a long data line for a terminator line).
ru: Заметьте, что приложение должно проверить, не состоит ли новая строка в точности из двух символов <literal>\.</literal>, что будет означать, что сервер завершил передачу результатов команды <command>COPY</command>. Если приложение может принимать строки длиннее <parameter>length</parameter>-1 символов, необходимо позаботиться о том, чтобы оно корректно распознавало строку <literal>\.</literal> (а не воспринимало, например, конец длинной строки данных как завершающую строку).

source: Reads a row of <command>COPY</command> data (transmitted by the server) into a buffer without blocking. <synopsis> int PQgetlineAsync(PGconn *conn, char *buffer, int bufsize); </synopsis>
ru: Читает передаваемую сервером строку данных <command>COPY</command> в буфер без блокировки. <synopsis> int PQgetlineAsync(PGconn *conn, char *buffer, int bufsize); </synopsis>

source: This function is similar to <function>PQgetline</function>, but it can be used by applications that must read <command>COPY</command> data asynchronously, that is, without blocking. Having issued the <command>COPY</command> command and gotten a <literal>PGRES_COPY_OUT</literal> response, the application should call <function>PQconsumeInput</function> and <function>PQgetlineAsync</function> until the end-of-data signal is detected.
ru: Эта функция похожа на <function>PQgetline</function>, но может применяться в приложениях, которые должны читать данные <command>COPY</command> асинхронно, то есть, без блокировки. Запустив команду <command>COPY</command> и получив ответ <literal>PGRES_COPY_OUT</literal>, приложение должно вызывать <function>PQconsumeInput</function> и <function>PQgetlineAsync</function>, пока не будет получен сигнал конца данных.

source: Unlike <function>PQgetline</function>, this function takes responsibility for detecting end-of-data.
ru: В отличие от <function>PQgetline</function>, эта функция сама отвечает за обнаружение конца данных.

source: On each call, <function>PQgetlineAsync</function> will return data if a complete data row is available in <application>libpq</application>'s input buffer. Otherwise, no data is returned until the rest of the row arrives. The function returns -1 if the end-of-copy-data marker has been recognized, or 0 if no data is available, or a positive number giving the number of bytes of data returned. If -1 is returned, the caller must next call <function>PQendcopy</function>, and then return to normal processing.
ru: При каждом вызове <function>PQgetlineAsync</function> будет возвращать данные, если во входном буфере <application>libpq</application> оказывается полная строка данных. В противном случае никакие данные не возвращаются до поступления остального содержимого строки. Эта функция возвращает -1, если обнаруживается признак завершения копирования, или 0, если данные не получены, или положительное количество возвращённых байт данных. Если возвращается -1, вызывающий код должен затем вызвать <function>PQendcopy</function> и после этого перейти в обычный режим работы.

source: The data returned will not extend beyond a data-row boundary. If possible a whole row will be returned at one time. But if the buffer offered by the caller is too small to hold a row sent by the server, then a partial data row will be returned. With textual data this can be detected by testing whether the last returned byte is <literal>\n</literal> or not. (In a binary <command>COPY</command>, actual parsing of the <command>COPY</command> data format will be needed to make the equivalent determination.) The returned string is not null-terminated. (If you want to add a terminating null, be sure to pass a <parameter>bufsize</parameter> one smaller than the room actually available.)
ru: Возвращаемые данные не будут пересекать границы строк данных. При этом может быть возвращена одна строка целиком. Но если буфер, выделенный вызывающим кодом, оказывается слишком мал для строки, передаваемой сервером, возвращена будет часть строки. Когда передаются текстовые данные, это можно выявить, проверив, содержит ли последний возвращаемый байт символ <literal>\n</literal>. (Для <command>COPY</command> в двоичном формате потребуется собственно разобрать формат данных <command>COPY</command>, чтобы выявить подобную ситуацию.) Возвращаемая строка не завершается нулём. (Если вы хотите получить строку с нулём в конце, передайте в <parameter>bufsize</parameter> число на единицу меньше фактического размера блока.)

source: Sends a null-terminated string to the server. Returns 0 if OK and <symbol>EOF</symbol> if unable to send the string. <synopsis> int PQputline(PGconn *conn, const char *string); </synopsis>
ru: Передаёт серверу строку, завершённую нулём. Возвращает 0 в случае успеха, либо <symbol>EOF</symbol>, если передать строку не удаётся. <synopsis> int PQputline(PGconn *conn, const char *string); </synopsis>

source: The <command>COPY</command> data stream sent by a series of calls to <function>PQputline</function> has the same format as that returned by <function>PQgetlineAsync</function>, except that applications are not obliged to send exactly one data row per <function>PQputline</function> call; it is okay to send a partial line or multiple lines per call.
ru: Поток данных <command>COPY</command>, передаваемых последовательностью вызовов <function>PQputline</function>, имеет тот же формат, что возвращает <function>PQgetlineAsync</function>, за исключением того, что приложения не обязательно должны передавать по одной строке данных за вызов <function>PQputline</function>; они могут посылать части строк или сразу несколько строк.

source: Before <productname>PostgreSQL</productname> protocol 3.0, it was necessary for the application to explicitly send the two characters <literal>\.</literal> as a final line to indicate to the server that it had finished sending <command>COPY</command> data. While this still works, it is deprecated and the special meaning of <literal>\.</literal> can be expected to be removed in a future release. It is sufficient to call <function>PQendcopy</function> after having sent the actual data.
ru: До версии 3.0 протокола <productname>PostgreSQL</productname> приложение должно было явно отправлять два символа <literal>\.</literal> последней строкой, чтобы сообщить серверу, что оно закончило передачу данных <command>COPY</command>. Хотя это по-прежнему работает, такое поведение считается устаревшим и ожидается, что особое значение <literal>\.</literal> будет исключено в будущих версиях. Передав собственно данные, сейчас достаточно вызвать <function>PQendcopy</function>.

source: Sends a non-null-terminated string to the server. Returns 0 if OK and <symbol>EOF</symbol> if unable to send the string. <synopsis> int PQputnbytes(PGconn *conn, const char *buffer, int nbytes); </synopsis>
ru: Передаёт серверу строку, не завершённую нулём. Возвращает 0 в случае успеха, либо <symbol>EOF</symbol>, если передать строку не удаётся. <synopsis> int PQputnbytes(PGconn *conn, const char *buffer, int nbytes); </synopsis>

source: This is exactly like <function>PQputline</function>, except that the data buffer need not be null-terminated since the number of bytes to send is specified directly. Use this procedure when sending binary data.
ru: Поведение этой функции не отличается от <function>PQputline</function>, но её буфер данных не должен содержать завершающий ноль, так как для неё число передаваемых байт задаётся непосредственно. Используйте эту функцию для передачи двоичных данных.

source: Synchronizes with the server. <synopsis> int PQendcopy(PGconn *conn); </synopsis> This function waits until the server has finished the copying. It should either be issued when the last string has been sent to the server using <function>PQputline</function> or when the last string has been received from the server using <function>PGgetline</function>. It must be issued or the server will get <quote>out of sync</quote> with the client. Upon return from this function, the server is ready to receive the next SQL command. The return value is 0 on successful completion, nonzero otherwise. (Use <function>PQerrorMessage</function> to retrieve details if the return value is nonzero.)
ru: Производит синхронизацию с сервером. <synopsis> int PQendcopy(PGconn *conn); </synopsis> Эта функция ожидает завершения копирования сервером. Её следует вызывать, либо когда серверу была передана последняя строка функцией <function>PQputline</function>, либо когда от сервера была получена последняя строка функцией <function>PGgetline</function>. Если её не вызвать, сервер <quote>потеряет синхронизацию</quote> с клиентом. После завершения этой функции сервер готов принимать следующую команду SQL. В случае успешного завершения возвращается 0, в противном случае — ненулевое значение. (Чтобы получить подробности ошибки при ненулевом значении, вызовите <function>PQerrorMessage</function>.)

source: When using <function>PQgetResult</function>, the application should respond to a <literal>PGRES_COPY_OUT</literal> result by executing <function>PQgetline</function> repeatedly, followed by <function>PQendcopy</function> after the terminator line is seen. It should then return to the <function>PQgetResult</function> loop until <function>PQgetResult</function> returns a null pointer. Similarly a <literal>PGRES_COPY_IN</literal> result is processed by a series of <function>PQputline</function> calls followed by <function>PQendcopy</function>, then return to the <function>PQgetResult</function> loop. This arrangement will ensure that a <command>COPY</command> command embedded in a series of <acronym>SQL</acronym> commands will be executed correctly.
ru: Вызывая <function>PQgetResult</function>, приложение должно обрабатывать результат <literal>PGRES_COPY_OUT</literal>, в цикле выполняя <function>PQgetline</function>, а обнаружив завершающую строку, вызвать <function>PQendcopy</function>. Затем оно должно вернуться к циклу <function>PQgetResult</function>, и выйти из него, когда <function>PQgetResult</function> возвратит нулевой указатель. Подобным образом, получив результат <literal>PGRES_COPY_IN</literal>, приложение должно выполнить серию вызовов <function>PQputline</function>, завершить её, вызвав <function>PQendcopy</function>, а затем вернуться к циклу <function>PQgetResult</function>. При такой организации обработки команда <command>COPY</command> будет корректно выполняться и в составе последовательности команд <acronym>SQL</acronym>.

source: Older applications are likely to submit a <command>COPY</command> via <function>PQexec</function> and assume that the transaction is done after <function>PQendcopy</function>. This will work correctly only if the <command>COPY</command> is the only <acronym>SQL</acronym> command in the command string.
ru: Старые приложения обычно передают команду <command>COPY</command> через <function>PQexec</function> и рассчитывают, что транзакция будет завершена после <function>PQendcopy</function>. Это будет работать, только если команда <command>COPY</command> является единственной <acronym>SQL</acronym>-командой в строке команд.

source: Control Functions
ru: Функции управления

source: These functions control miscellaneous details of <application>libpq</application>'s behavior.
ru: Эти функции управляют различными аспектами поведения <application>libpq</application>.

source: Returns the client encoding. <synopsis> int PQclientEncoding(const PGconn *<replaceable>conn</replaceable>); </synopsis> Note that it returns the encoding ID, not a symbolic string such as <literal>EUC_JP</literal>. If unsuccessful, it returns -1. To convert an encoding ID to an encoding name, you can use: <synopsis> char *pg_encoding_to_char(int <replaceable>encoding_id</replaceable>); </synopsis>
ru: Возвращает кодировку клиента. <synopsis> int PQclientEncoding(const PGconn *<replaceable>conn</replaceable>); </synopsis> Заметьте, что она возвращает идентификатор кодировки, а не символьную строку вида <literal>EUC_JP</literal>. В случае ошибки она возвращает -1. Преобразовать идентификатор кодировки в имя можно, воспользовавшись следующей функцией: <synopsis> char *pg_encoding_to_char(int <replaceable>encoding_id</replaceable>); </synopsis>

source: Sets the client encoding. <synopsis> int PQsetClientEncoding(PGconn *<replaceable>conn</replaceable>, const char *<replaceable>encoding</replaceable>); </synopsis> <replaceable>conn</replaceable> is a connection to the server, and <replaceable>encoding</replaceable> is the encoding you want to use. If the function successfully sets the encoding, it returns 0, otherwise -1. The current encoding for this connection can be determined by using <function>PQclientEncoding</function>.
ru: Устанавливает кодировку клиента. <synopsis> int PQsetClientEncoding(PGconn *<replaceable>conn</replaceable>, const char *<replaceable>encoding</replaceable>); </synopsis> В <replaceable>conn</replaceable> передаётся соединение с сервером, а в <replaceable>encoding</replaceable> — имя требуемой кодировки. Если функция устанавливает кодировку успешно, она возвращает 0, или -1 в противном случае. Определить текущую кодировку для соединения можно, воспользовавшись функцией <function>PQclientEncoding</function>.

source: Determines the verbosity of messages returned by <function>PQerrorMessage</function> and <function>PQresultErrorMessage</function>. <synopsis> typedef enum { PQERRORS_TERSE, PQERRORS_DEFAULT, PQERRORS_VERBOSE } PGVerbosity; PGVerbosity PQsetErrorVerbosity(PGconn *conn, PGVerbosity verbosity); </synopsis> <function>PQsetErrorVerbosity</function> sets the verbosity mode, returning the connection's previous setting. In <firstterm>TERSE</firstterm> mode, returned messages include severity, primary text, and position only; this will normally fit on a single line. The default mode produces messages that include the above plus any detail, hint, or context fields (these might span multiple lines). The <firstterm>VERBOSE</firstterm> mode includes all available fields. Changing the verbosity does not affect the messages available from already-existing <structname>PGresult</structname> objects, only subsequently-created ones. (But see <function>PQresultVerboseErrorMessage</function> if you want to print a previous error with a different verbosity.)
ru: Определяет уровень детализации сообщений, возвращаемых функциями <function>PQerrorMessage</function> и <function>PQresultErrorMessage</function>. <synopsis> typedef enum { PQERRORS_TERSE, PQERRORS_DEFAULT, PQERRORS_VERBOSE } PGVerbosity; PGVerbosity PQsetErrorVerbosity(PGconn *conn, PGVerbosity verbosity); </synopsis> <function>PQsetErrorVerbosity</function> устанавливает уровень детализации и возвращает предыдущее значение для соединения. В &laquo;лаконичном&raquo; режиме (<firstterm>TERSE</firstterm>) возвращаемые сообщения содержат только уровень серьёзности, основной текст и позицию; всё это обычно умещается в одной строке. В режиме по умолчанию выдаваемые сообщения дополнительно содержат поля подробного описания, подсказки или контекста (они могут занимать несколько строк). В &laquo;многословном&raquo; режиме (<firstterm>VERBOSE</firstterm>) передаются все доступные поля сообщения. Изменение уровня детализации не влияет на сообщения, уже сформированные в существующих объектах <structname>PGresult</structname>, а затрагивает только последующие сообщения. (Но можно воспользоваться <function>PQresultVerboseErrorMessage</function>, чтобы получить предыдущую ошибку с другим уровнем детализации.)

source: Determines the handling of <literal>CONTEXT</literal> fields in messages returned by <function>PQerrorMessage</function> and <function>PQresultErrorMessage</function>. <synopsis> typedef enum { PQSHOW_CONTEXT_NEVER, PQSHOW_CONTEXT_ERRORS, PQSHOW_CONTEXT_ALWAYS } PGContextVisibility; PGContextVisibility PQsetErrorContextVisibility(PGconn *conn, PGContextVisibility show_context); </synopsis> <function>PQsetErrorContextVisibility</function> sets the context display mode, returning the connection's previous setting. This mode controls whether the <literal>CONTEXT</literal> field is included in messages (unless the verbosity setting is <firstterm>TERSE</firstterm>, in which case <literal>CONTEXT</literal> is never shown). The <firstterm>NEVER</firstterm> mode never includes <literal>CONTEXT</literal>, while <firstterm>ALWAYS</firstterm> always includes it if available. In <firstterm>ERRORS</firstterm> mode (the default), <literal>CONTEXT</literal> fields are included only for error messages, not for notices and warnings. Changing this mode does not affect the messages available from already-existing <structname>PGresult</structname> objects, only subsequently-created ones. (But see <function>PQresultVerboseErrorMessage</function> if you want to print a previous error with a different display mode.)
ru: Определяет вариант обработки полей <literal>КОНТЕКСТ</literal> в сообщениях, возвращаемых функциями <function>PQerrorMessage</function> и <function>PQresultErrorMessage</function>. <synopsis> typedef enum { PQSHOW_CONTEXT_NEVER, PQSHOW_CONTEXT_ERRORS, PQSHOW_CONTEXT_ALWAYS } PGContextVisibility; PGContextVisibility PQsetErrorContextVisibility(PGconn *conn, PGContextVisibility show_context); </synopsis> <function>PQsetErrorContextVisibility</function> устанавливает режим вывода контекста сообщений и возвращает предыдущее значение. В зависимости от этого режима, поле <literal>КОНТЕКСТ</literal> может включаться в сообщения или нет (если только не выбран уровень детализации <firstterm>TERSE</firstterm>, при котором <literal>КОНТЕКСТ</literal> не выводится никогда). В режиме <firstterm>NEVER</firstterm> поле <literal>КОНТЕКСТ</literal> не выводится никогда, а в режиме <firstterm>ALWAYS</firstterm>, выводится всегда (если оно имеется). В режиме <firstterm>ERRORS</firstterm> (по умолчанию), поля <literal>CONTEXT</literal> включаются только в сообщения об ошибках, но не в уведомления или предупреждения. Изменение этого уровня не влияет на сообщения, уже сформированные в существующих объектах <structname>PGresult</structname>, а затрагивает только последующие сообщения. (Но можно воспользоваться <function>PQresultVerboseErrorMessage</function>, чтобы получить предыдущую ошибку с другим режимом вывода контекста.)

source: Enables tracing of the client/server communication to a debugging file stream. <synopsis> void PQtrace(PGconn *conn, FILE *stream); </synopsis>
ru: Включает трассировку клиент-серверного взаимодействия с выводом в поток отладочных сообщений. <synopsis> void PQtrace(PGconn *conn, FILE *stream); </synopsis>

source: On Windows, if the <application>libpq</application> library and an application are compiled with different flags, this function call will crash the application because the internal representation of the <literal>FILE</literal> pointers differ. Specifically, multithreaded/single-threaded, release/debug, and static/dynamic flags should be the same for the library and all applications using that library.
ru: В Windows, если библиотека <application>libpq</application> и приложение скомпилированы с разными флагами, эта функция может вызвать крах приложения из-за различий внутреннего представления указателей <literal>FILE</literal>. В частности, флаги многопоточной/однопоточной, выпускаемой/отладочной или статической/динамической сборки должны быть одинаковыми для библиотеки и всех использующих её приложений.

source: Disables tracing started by <function>PQtrace</function>. <synopsis> void PQuntrace(PGconn *conn); </synopsis>
ru: Выключает трассировку, запущенную функцией <function>PQtrace</function>. <synopsis> void PQuntrace(PGconn *conn); </synopsis>

source: Miscellaneous Functions
ru: Функции разного назначения

source: As always, there are some functions that just don't fit anywhere.
ru: Как всегда, находятся функции, которые не попадают ни в одну из категорий.

source: Frees memory allocated by <application>libpq</application>. <synopsis> void PQfreemem(void *ptr); </synopsis>
ru: Освобождает память, которую выделила <application>libpq</application>. <synopsis> void PQfreemem(void *ptr); </synopsis>

source: Frees memory allocated by <application>libpq</application>, particularly <function>PQescapeByteaConn</function>, <function>PQescapeBytea</function>, <function>PQunescapeBytea</function>, and <function>PQnotifies</function>. It is particularly important that this function, rather than <function>free()</function>, be used on Microsoft Windows. This is because allocating memory in a DLL and releasing it in the application works only if multithreaded/single-threaded, release/debug, and static/dynamic flags are the same for the DLL and the application. On non-Microsoft Windows platforms, this function is the same as the standard library function <function>free()</function>.
ru: Освобождает память, выделенную библиотекой <application>libpq</application>, а именно функциями <function>PQescapeByteaConn</function>, <function>PQescapeBytea</function>, <function>PQunescapeBytea</function> и <function>PQnotifies</function>. Особенно важно использовать именно эту функцию, а не <function>free()</function>, в Microsoft Windows. Это связано с тем, что выделение памяти в DLL и освобождение её в приложении будет работать, только если флаги многопоточной/однопоточной, выпускаемой/отладочной или статической/динамической сборки для DLL и приложения полностью совпадают. На других платформах эта функция действует так же, как стандартная библиотечная функция <function>free()</function>.

source: Frees the data structures allocated by <function>PQconndefaults</function> or <function>PQconninfoParse</function>. <synopsis> void PQconninfoFree(PQconninfoOption *connOptions); </synopsis>
ru: Освобождает структуры данных, выделенные функциями <function>PQconndefaults</function> и <function>PQconninfoParse</function>. <synopsis> void PQconninfoFree(PQconninfoOption *connOptions); </synopsis>

source: A simple <function>PQfreemem</function> will not do for this, since the array contains references to subsidiary strings.
ru: Простая функция <function>PQfreemem</function> не подойдёт для этого, так как эти структуры содержат ссылки на подчинённые строки.
