Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: Returns a single field value of one row of a <structname>PGresult</structname>. Row and column numbers start at 0. The caller should not free the result directly. It will be freed when the associated <structname>PGresult</structname> handle is passed to <function>PQclear</function>. <synopsis> char *PQgetvalue(const PGresult *res, int row_number, int column_number); </synopsis>
ru: Возвращает значение одного поля из одной строки, содержащейся в <structname>PGresult</structname>. Номера строк и столбцов начинаются с 0. Вызывающая функция не должна напрямую освобождать память, на которую указывает возвращаемый указатель. Она будет освобождена, когда соответствующий указатель на <structname>PGresult</structname> будет передан функции <function>PQclear</function>. <synopsis> char *PQgetvalue(const PGresult *res, int row_number, int column_number); </synopsis>

source: For data in text format, the value returned by <function>PQgetvalue</function> is a null-terminated character string representation of the field value. For data in binary format, the value is in the binary representation determined by the data type's <function>typsend</function> and <function>typreceive</function> functions. (The value is actually followed by a zero byte in this case too, but that is not ordinarily useful, since the value is likely to contain embedded nulls.)
ru: Для данных в текстовом формате значение, возвращаемое функцией <function>PQgetvalue</function>, является значением поля, представленным в виде символьной строки с завершающим нулевым символом. Для данных в двоичном формате используется двоичное представление значения. Оно определяется функциями <function>typsend</function> и <function>typreceive</function> для конкретного типа данных. (В этом случае к значению также добавляется нулевой байт, но обычно это не приносит пользы, поскольку вероятно, что значение уже содержит нулевые байты.)

source: An empty string is returned if the field value is null. See <function>PQgetisnull</function> to distinguish null values from empty-string values.
ru: Пустая строка возвращается в том случае, когда значение поля отсутствует (null). См. <function>PQgetisnull</function>, чтобы отличать отсутствие значения (null) от значения, равного пустой строке.

source: The pointer returned by <function>PQgetvalue</function> points to storage that is part of the <structname>PGresult</structname> structure. One should not modify the data it points to, and one must explicitly copy the data into other storage if it is to be used past the lifetime of the <structname>PGresult</structname> structure itself.
ru: Указатель, возвращаемый функцией <function>PQgetvalue</function>, указывает на область хранения, которая является частью структуры <structname>PGresult</structname>. Не следует модифицировать данные, на которые указывает этот указатель, а нужно явно скопировать данные в другую область хранения, если предполагается их использовать за пределами времени жизни самой структуры <structname>PGresult</structname>.

source: <primary>null value</primary> <secondary sortas="libpq">in libpq</secondary>
ru: <primary>значение NULL</primary> <secondary sortas="libpq">в libpq</secondary>

source: Tests a field for a null value. Row and column numbers start at 0. <synopsis> int PQgetisnull(const PGresult *res, int row_number, int column_number); </synopsis>
ru: Проверяет поле на предмет отсутствия значения (null). Номера строк и столбцов начинаются с 0. <synopsis> int PQgetisnull(const PGresult *res, int row_number, int column_number); </synopsis>

source: This function returns 1 if the field is null and 0 if it contains a non-null value. (Note that <function>PQgetvalue</function> will return an empty string, not a null pointer, for a null field.)
ru: Эта функция возвращает 1, если значение в поле отсутствует (null), и 0, если поле содержит непустое (non-null) значение. (Обратите внимание, что <function>PQgetvalue</function> возвратит пустую строку, а не нулевой указатель, если значение в поле отсутствует.)

source: Returns the actual length of a field value in bytes. Row and column numbers start at 0. <synopsis> int PQgetlength(const PGresult *res, int row_number, int column_number); </synopsis>
ru: Возвращает фактическую длину значения поля в байтах. Номера строк и столбцов начинаются с 0. <synopsis> int PQgetlength(const PGresult *res, int row_number, int column_number); </synopsis>

source: This is the actual data length for the particular data value, that is, the size of the object pointed to by <function>PQgetvalue</function>. For text data format this is the same as <function>strlen()</function>. For binary format this is essential information. Note that one should <emphasis>not</emphasis> rely on <function>PQfsize</function> to obtain the actual data length.
ru: Это фактическая длина данных для конкретного значения данных, то есть размер объекта, на который указывает <function>PQgetvalue</function>. Для текстового формата данных это то же самое, что <function>strlen()</function>. Для двоичного же формата это существенная информация. Обратите внимание, что <emphasis>не</emphasis> следует полагаться на <function>PQfsize</function>, чтобы получить фактическую длину данных.

source: Returns the number of parameters of a prepared statement. <synopsis> int PQnparams(const PGresult *res); </synopsis>
ru: Возвращает число параметров подготовленного оператора. <synopsis> int PQnparams(const PGresult *res); </synopsis>

source: This function is only useful when inspecting the result of <function>PQdescribePrepared</function>. For other types of queries it will return zero.
ru: Эта функция полезна только при исследовании результата работы функции <function>PQdescribePrepared</function>. Для других типов запросов она возвратит ноль.

source: Returns the data type of the indicated statement parameter. Parameter numbers start at 0. <synopsis> Oid PQparamtype(const PGresult *res, int param_number); </synopsis>
ru: Возвращает тип данных для указанного параметра оператора. Номера параметров начинаются с 0. <synopsis> Oid PQparamtype(const PGresult *res, int param_number); </synopsis>

source: Prints out all the rows and, optionally, the column names to the specified output stream. <synopsis> void PQprint(FILE *fout, /* output stream */ const PGresult *res, const PQprintOpt *po); typedef struct { pqbool header; /* print output field headings and row count */ pqbool align; /* fill align the fields */ pqbool standard; /* old brain dead format */ pqbool html3; /* output HTML tables */ pqbool expanded; /* expand tables */ pqbool pager; /* use pager for output if needed */ char *fieldSep; /* field separator */ char *tableOpt; /* attributes for HTML table element */ char *caption; /* HTML table caption */ char **fieldName; /* null-terminated array of replacement field names */ } PQprintOpt; </synopsis>
ru: Выводит все строки и, по выбору, имена столбцов в указанный поток вывода. <synopsis> void PQprint(FILE *fout, /* поток вывода */ const PGresult *res, const PQprintOpt *po); typedef struct { pqbool header; /* печатать заголовки полей и счётчик строк */ pqbool align; /* выравнивать поля */ pqbool standard; /* старый формат */ pqbool html3; /* выводить HTML-таблицы */ pqbool expanded; /* расширять таблицы */ pqbool pager; /* использовать программу для постраничного просмотра, если нужно */ char *fieldSep; /* разделитель полей */ char *tableOpt; /* атрибуты для HTML-таблицы */ char *caption; /* заголовок HTML-таблицы */ char **fieldName; /* массив заменителей для имён полей, завершающийся нулевым символом */ } PQprintOpt; </synopsis>

source: This function was formerly used by <application>psql</application> to print query results, but this is no longer the case. Note that it assumes all the data is in text format.
ru: Эту функцию прежде использовала утилита <application>psql</application> для вывода результатов запроса, но больше она её не использует. Обратите внимание, предполагается, что все данные представлены в текстовом формате.

source: Retrieving Other Result Information
ru: Получение другой информации о результате

source: These functions are used to extract other information from <structname>PGresult</structname> objects.
ru: Эти функции используются для получения остальной информации из объектов <structname>PGresult</structname>.

source: Returns the command status tag from the SQL command that generated the <structname>PGresult</structname>. <synopsis> char *PQcmdStatus(PGresult *res); </synopsis>
ru: Возвращает дескриптор статуса для SQL-команды, которая сгенерировала <structname>PGresult</structname>. <synopsis> char *PQcmdStatus(PGresult *res); </synopsis>

source: Commonly this is just the name of the command, but it might include additional data such as the number of rows processed. The caller should not free the result directly. It will be freed when the associated <structname>PGresult</structname> handle is passed to <function>PQclear</function>.
ru: Как правило, это просто имя команды, но могут быть включены и дополнительные сведения, такие, как число обработанных строк. Вызывающая функция не должна напрямую освобождать память, на которую указывает возвращаемый указатель. Она будет освобождена, когда соответствующий указатель на <structname>PGresult</structname> будет передан функции <function>PQclear</function>.

source: Returns the number of rows affected by the SQL command. <synopsis> char *PQcmdTuples(PGresult *res); </synopsis>
ru: Возвращает число строк, которые затронула SQL-команда. <synopsis> char *PQcmdTuples(PGresult *res); </synopsis>

source: This function returns a string containing the number of rows affected by the <acronym>SQL</acronym> statement that generated the <structname>PGresult</structname>. This function can only be used following the execution of a <command>SELECT</command>, <command>CREATE TABLE AS</command>, <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>, <command>MOVE</command>, <command>FETCH</command>, or <command>COPY</command> statement, or an <command>EXECUTE</command> of a prepared query that contains an <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command> statement. If the command that generated the <structname>PGresult</structname> was anything else, <function>PQcmdTuples</function> returns an empty string. The caller should not free the return value directly. It will be freed when the associated <structname>PGresult</structname> handle is passed to <function>PQclear</function>.
ru: Эта функция возвращает строковое значение, содержащее число строк, которые затронул <acronym>SQL</acronym>-оператор, сгенерировавший данный <structname>PGresult</structname>. Эту функцию можно использовать только сразу после выполнения команд <command>SELECT</command>, <command>CREATE TABLE AS</command>, <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>, <command>MOVE</command>, <command>FETCH</command> или <command>COPY</command>, а также после оператора <command>EXECUTE</command>, выполнившего подготовленный запрос, содержащий команды <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>. Если команда, которая сгенерировала <structname>PGresult</structname>, была какой-то иной, то <function>PQcmdTuples</function> возвращает пустую строку. Вызывающая функция не должна напрямую освобождать память, на которую указывает возвращаемый указатель. Она будет освобождена, когда соответствующий указатель на <structname>PGresult</structname> будет передан функции <function>PQclear</function>.

source: <primary>OID</primary><secondary>in libpq</secondary>
ru: <primary>OID</primary> <secondary>в libpq</secondary>

source: Returns the OID<placeholder-1/> of the inserted row, if the <acronym>SQL</acronym> command was an <command>INSERT</command> that inserted exactly one row into a table that has OIDs, or a <command>EXECUTE</command> of a prepared query containing a suitable <command>INSERT</command> statement. Otherwise, this function returns <literal>InvalidOid</literal>. This function will also return <literal>InvalidOid</literal> if the table affected by the <command>INSERT</command> statement does not contain OIDs. <synopsis> Oid PQoidValue(const PGresult *res); </synopsis>
ru: Возвращает OID<placeholder-1/> вставленной строки, если <acronym>SQL</acronym>-команда была командой <command>INSERT</command>, которая вставила ровно одну строку в таблицу, имеющую идентификаторы OID, или командой <command>EXECUTE</command>, которая выполнила подготовленный запрос, содержащий соответствующий оператор <command>INSERT</command>. В противном случае эта функция возвращает <literal>InvalidOid</literal>. Эта функция также возвратит <literal>InvalidOid</literal>, если таблица, затронутая командой <command>INSERT</command>, не содержит идентификаторов OID. <synopsis> Oid PQoidValue(const PGresult *res); </synopsis>

source: This function is deprecated in favor of <function>PQoidValue</function> and is not thread-safe. It returns a string with the OID of the inserted row, while <function>PQoidValue</function> returns the OID value. <synopsis> char *PQoidStatus(const PGresult *res); </synopsis>
ru: Эта функция считается не рекомендуемой к использованию (в качестве замены служит <function>PQoidValue</function>), а также она не отвечает требованиям потоковой безопасности. Она возвращает строковое значение, содержащее OID вставленной строки, в то время как <function>PQoidValue</function> возвращает значение OID. <synopsis> char *PQoidStatus(const PGresult *res); </synopsis>

source: Escaping Strings for Inclusion in SQL Commands
ru: Экранирование строковых значений для включения в SQL-команды

source: <primary>escaping strings</primary> <secondary>in libpq</secondary>
ru: <primary>экранированные строки</primary> <secondary>в libpq</secondary>

source: <function>PQescapeLiteral</function> escapes a string for use within an SQL command. This is useful when inserting data values as literal constants in SQL commands. Certain characters (such as quotes and backslashes) must be escaped to prevent them from being interpreted specially by the SQL parser. <function>PQescapeLiteral</function> performs this operation.
ru: <function>PQescapeLiteral</function> экранирует строковое значение для использования внутри SQL-команды. Это полезно при вставке в SQL-команды значений данных в виде литеральных констант. Определённые символы (такие, как кавычки и символы обратной косой черты) должны экранироваться, чтобы предотвратить их специальную интерпретацию синтаксическим анализатором языка SQL. <function>PQescapeLiteral</function> выполняет эту операцию.

source: <function>PQescapeLiteral</function> returns an escaped version of the <parameter>str</parameter> parameter in memory allocated with <function>malloc()</function>. This memory should be freed using <function>PQfreemem()</function> when the result is no longer needed. A terminating zero byte is not required, and should not be counted in <parameter>length</parameter>. (If a terminating zero byte is found before <parameter>length</parameter> bytes are processed, <function>PQescapeLiteral</function> stops at the zero; the behavior is thus rather like <function>strncpy</function>.) The return string has all special characters replaced so that they can be properly processed by the <productname>PostgreSQL</productname> string literal parser. A terminating zero byte is also added. The single quotes that must surround <productname>PostgreSQL</productname> string literals are included in the result string.
ru: <function>PQescapeLiteral</function> возвращает экранированную версию параметра <parameter>str</parameter>, размещённую в области памяти, распределённой с помощью функции <function>malloc()</function>. Эту память нужно освобождать с помощью функции <function>PQfreemem()</function>, когда возвращённое значение больше не требуется. Завершающий нулевой байт не нужен и не должен учитываться в параметре <parameter>length</parameter>. (Если завершающий нулевой байт был найден до того, как были обработаны <parameter>length</parameter> байтов, то <function>PQescapeLiteral</function> останавливает работу на нулевом байте; таким образом, поведение функции напоминает <function>strncpy</function>.) В возвращённой строке все специальные символы заменены таким образом, что синтаксический анализатор строковых литералов <productname>PostgreSQL</productname> может обработать их должным образом. Завершающий нулевой байт также будет добавлен. Одинарные кавычки, которые должны окружать строковые литералы <productname>PostgreSQL</productname>, включаются в результирующую строку.

source: On error, <function>PQescapeLiteral</function> returns <symbol>NULL</symbol> and a suitable message is stored in the <parameter>conn</parameter> object.
ru: В случае ошибки <function>PQescapeLiteral</function> возвращает <symbol>NULL</symbol>, и в объект <parameter>conn</parameter> помещается соответствующее сообщение.

source: It is especially important to do proper escaping when handling strings that were received from an untrustworthy source. Otherwise there is a security risk: you are vulnerable to <quote>SQL injection</quote> attacks wherein unwanted SQL commands are fed to your database.
ru: Особенно важно выполнять надлежащее экранирование при обработке строк, полученных из ненадёжных источников. В противном случае ваша безопасность подвергается риску из-за уязвимости в отношении атак с использованием <quote>SQL-инъекций</quote>, с помощью которых нежелательные SQL-команды направляются в вашу базу данных.

source: Note that it is not necessary nor correct to do escaping when a data value is passed as a separate parameter in <function>PQexecParams</function> or its sibling routines.
ru: Обратите внимание, что нет необходимости (и это будет даже некорректно) экранировать значения данных, передаваемых в виде отдельных параметров в функцию <function>PQexecParams</function> или родственные ей функции.

source: <function>PQescapeIdentifier</function> escapes a string for use as an SQL identifier, such as a table, column, or function name. This is useful when a user-supplied identifier might contain special characters that would otherwise not be interpreted as part of the identifier by the SQL parser, or when the identifier might contain upper case characters whose case should be preserved.
ru: <function>PQescapeIdentifier</function> экранирует строку, предназначенную для использования в качестве идентификатора SQL, такого, как таблица, столбец или имя функции. Это полезно, когда идентификатор, выбранный пользователем, может содержать специальные символы, которые в противном случае не интерпретировались бы синтаксическим анализатором SQL, как часть идентификатора, или когда идентификатор может содержать символы верхнего регистра, и этот регистр требуется сохранить.

source: <function>PQescapeIdentifier</function> returns a version of the <parameter>str</parameter> parameter escaped as an SQL identifier in memory allocated with <function>malloc()</function>. This memory must be freed using <function>PQfreemem()</function> when the result is no longer needed. A terminating zero byte is not required, and should not be counted in <parameter>length</parameter>. (If a terminating zero byte is found before <parameter>length</parameter> bytes are processed, <function>PQescapeIdentifier</function> stops at the zero; the behavior is thus rather like <function>strncpy</function>.) The return string has all special characters replaced so that it will be properly processed as an SQL identifier. A terminating zero byte is also added. The return string will also be surrounded by double quotes.
ru: <function>PQescapeIdentifier</function> возвращает версию параметра <parameter>str</parameter>, экранированную как SQL-идентификатор, и размещённую в области памяти, распределённой с помощью функции <function>malloc()</function>. Эту память нужно освобождать с помощью функции <function>PQfreemem()</function>, когда возвращённое значение больше не требуется. Завершающий нулевой байт не нужен и не должен учитываться в параметре <parameter>length</parameter>. (Если завершающий нулевой байт был найден до того, как были обработаны <parameter>length</parameter> байтов, то <function>PQescapeIdentifier</function> останавливает работу на нулевом байте; таким образом, поведение функции напоминает <function>strncpy</function>.) В возвращённой строке все специальные символы заменены таким образом, что она будет надлежащим образом обработана, как SQL-идентификатор. Завершающий нулевой байт также будет добавлен. Возвращённая строка также будет заключена в двойные кавычки.

source: On error, <function>PQescapeIdentifier</function> returns <symbol>NULL</symbol> and a suitable message is stored in the <parameter>conn</parameter> object.
ru: В случае ошибки <function>PQescapeIdentifier</function> возвращает <symbol>NULL</symbol>, и в объект <parameter>conn</parameter> помещается соответствующее сообщение.

source: As with string literals, to prevent SQL injection attacks, SQL identifiers must be escaped when they are received from an untrustworthy source.
ru: Как и в случае со строковыми литералами, для того чтобы предотвратить атаки с помощью SQL-инъекций, SQL-идентификаторы должны экранироваться, когда они получены из ненадёжного источника.
