Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/libpq.po
Languages: ru

source: This parameter specifies the operating-system user name of the server, for example <literal>requirepeer=postgres</literal>. When making a Unix-domain socket connection, if this parameter is set, the client checks at the beginning of the connection that the server process is running under the specified user name; if it is not, the connection is aborted with an error. This parameter can be used to provide server authentication similar to that available with SSL certificates on TCP/IP connections. (Note that if the Unix-domain socket is in <filename>/tmp</filename> or another publicly writable location, any user could start a server listening there. Use this parameter to ensure that you are connected to a server run by a trusted user.) This option is only supported on platforms for which the <literal>peer</literal> authentication method is implemented; see <xref linkend="auth-peer"/>.
ru: Этот параметр указывает имя пользователя операционной системы, предназначенное для сервера, например, <literal>requirepeer=postgres</literal>. При создании подключения через сокет домена Unix, если этот параметр установлен, клиент проверяет в самом начале процедуры подключения, что серверный процесс запущен от имени указанного пользователя; если это не так, соединение аварийно прерывается с ошибкой. Этот параметр можно использовать, чтобы обеспечить аутентификацию сервера, подобную той, которая доступна с помощью SSL-сертификатов при соединениях по протоколу TCP/IP. (Заметьте, что если сокет домена Unix находится в каталоге <filename>/tmp</filename> или в другом каталоге, запись в который разрешена всем пользователям, тогда любой пользователь сможет запустить сервер, прослушивающий сокет в том каталоге. Используйте этот параметр, чтобы гарантировать, что вы подключены к серверу, запущенному доверенным пользователем.) Он поддерживается только на платформах, для которых реализован метод аутентификации <literal>peer</literal>; см. <xref remap="4" linkend="auth-peer"/>.

source: Kerberos service name to use when authenticating with GSSAPI. This must match the service name specified in the server configuration for Kerberos authentication to succeed. (See also <xref linkend="gssapi-auth"/>.)
ru: Имя сервиса Kerberos, предназначенное для использования при аутентификации на основе GSSAPI. Оно должно соответствовать имени сервиса, указанному в конфигурации сервера, чтобы аутентификация на основе Kerberos прошла успешно. (См. также <xref remap="4" linkend="gssapi-auth"/>.)

source: GSS library to use for GSSAPI authentication. Only used on Windows. Set to <literal>gssapi</literal> to force libpq to use the GSSAPI library for authentication instead of the default SSPI.
ru: Библиотека GSS, предназначенная для использования при аутентификации на основе GSSAPI. Используется только в системе Windows. Назначьте значение <literal>gssapi</literal>, чтобы заставить libpq использовать для аутентификации библиотеку GSSAPI вместо SSPI, применяемого по умолчанию.

source: Service name to use for additional parameters. It specifies a service name in <filename>pg_service.conf</filename> that holds additional connection parameters. This allows applications to specify only a service name so connection parameters can be centrally maintained. See <xref linkend="libpq-pgservice"/>.
ru: Имя сервиса, используемое для задания дополнительных параметров. Оно указывает имя сервиса в файле <filename>pg_service.conf</filename>, который содержит дополнительные параметры подключения. Это позволяет приложениям указывать только имя сервиса, поскольку параметры подключения могут поддерживаться централизованно. См. <xref remap="4" linkend="libpq-pgservice"/>.

source: The currently recognized parameter key words are: <placeholder-1/>
ru: Ключевые слова-параметры, распознаваемые в настоящее время, следующие: <placeholder-1/>

source: Connection Status Functions
ru: Функции, описывающие текущее состояние подключения

source: These functions can be used to interrogate the status of an existing database connection object.
ru: Эти функции могут использоваться для опроса состояния объекта, описывающего существующее подключение к базе данных.

source: <placeholder-1/> <placeholder-2/> <application>libpq</application> application programmers should be careful to maintain the <structname>PGconn</structname> abstraction. Use the accessor functions described below to get at the contents of <structname>PGconn</structname>. Reference to internal <structname>PGconn</structname> fields using <filename>libpq-int.h</filename> is not recommended because they are subject to change in the future.
ru: <placeholder-1/> <placeholder-2/> Разработчики приложений на основе <application>libpq</application> должны тщательно поддерживать абстракцию <structname>PGconn</structname>. Следует использовать функции доступа, описанные ниже, для получения содержимого <structname>PGconn</structname>. Обращение напрямую к внутренним полям <structname>PGconn</structname>, используя сведения из <filename>libpq-int.h</filename>, не рекомендуется, поскольку они могут измениться в будущем.

source: Returns the database name of the connection. <synopsis> char *PQdb(const PGconn *conn); </synopsis>
ru: Возвращает имя базы данных, с которой установлено соединение. <synopsis> char *PQdb(const PGconn *conn); </synopsis>

source: Returns the user name of the connection. <synopsis> char *PQuser(const PGconn *conn); </synopsis>
ru: Возвращает имя пользователя, который установил соединение.<synopsis> char *PQuser(const PGconn *conn); </synopsis>

source: Returns the password of the connection. <synopsis> char *PQpass(const PGconn *conn); </synopsis>
ru: Возвращает пароль, использованный для подключения.<synopsis> char *PQpass(const PGconn *conn); </synopsis>

source: Returns the server host name of the connection. This can be a host name, an IP address, or a directory path if the connection is via Unix socket. (The path case can be distinguished because it will always be an absolute path, beginning with <literal>/</literal>.) <synopsis> char *PQhost(const PGconn *conn); </synopsis>
ru: Возвращает имя сервера для текущего соединения. Это может быть имя компьютера, IP-адрес или путь к каталогу, если подключение установлено через сокет Unix. (Подключение к сокету можно распознать, потому что путь всегда абсолютный и начинается с <literal>/</literal>.) <synopsis> char *PQhost(const PGconn *conn); </synopsis>

source: Returns the port of the connection. <synopsis> char *PQport(const PGconn *conn); </synopsis>
ru: Возвращает номер порта, на котором установлено соединение.<synopsis> char *PQport(const PGconn *conn); </synopsis>

source: Returns the debug <acronym>TTY</acronym> of the connection. (This is obsolete, since the server no longer pays attention to the <acronym>TTY</acronym> setting, but the function remains for backward compatibility.) <synopsis> char *PQtty(const PGconn *conn); </synopsis>
ru: Возвращает имя отладочного терминала (<acronym>TTY</acronym>), связанного с данным соединением. (Это устаревшая функция, поскольку сервер более не обращает внимания на установку <acronym>TTY</acronym>, но она остаётся для обеспечения обратной совместимости.) <synopsis> char *PQtty(const PGconn *conn); </synopsis>

source: Returns the command-line options passed in the connection request. <synopsis> char *PQoptions(const PGconn *conn); </synopsis>
ru: Возвращает параметры командной строки, переданные в запросе на подключение.<synopsis> char *PQoptions(const PGconn *conn); </synopsis>

source: The following functions return parameter values established at connection. These values are fixed for the life of the <structname>PGconn</structname> object. <placeholder-1/>
ru: Следующие функции возвращают значения параметров, установленные при подключении. Эти значения фиксированы на время жизни объекта <structname>PGconn</structname>. <placeholder-1/>

source: Returns the status of the connection. <synopsis> ConnStatusType PQstatus(const PGconn *conn); </synopsis>
ru: Возвращает состояние подключения.<synopsis> ConnStatusType PQstatus(const PGconn *conn); </synopsis>

source: The status can be one of a number of values. However, only two of these are seen outside of an asynchronous connection procedure: <literal>CONNECTION_OK</literal> and <literal>CONNECTION_BAD</literal>. A good connection to the database has the status <literal>CONNECTION_OK</literal>. A failed connection attempt is signaled by status <literal>CONNECTION_BAD</literal>. Ordinarily, an OK status will remain so until <function>PQfinish</function>, but a communications failure might result in the status changing to <literal>CONNECTION_BAD</literal> prematurely. In that case the application could try to recover by calling <function>PQreset</function>.
ru: Статус может принимать одно из ряда значений. Однако, только два из них видны извне процедуры асинхронного подключения: <literal>CONNECTION_OK</literal> и <literal>CONNECTION_BAD</literal>. Успешное подключение к базе данных имеет статус <literal>CONNECTION_OK</literal>. О неудачной попытке подключения сигнализирует статус <literal>CONNECTION_BAD</literal>. Обычно статус OK остаётся таковым до вызова <function>PQfinish</function>, но сбой в коммуникации может привести к тому, что статус изменится на <literal>CONNECTION_BAD</literal> преждевременно. В таком случае приложение может попытаться восстановиться, вызвав <function>PQreset</function>.

source: See the entry for <function>PQconnectStartParams</function>, <function>PQconnectStart</function> and <function>PQconnectPoll</function> with regards to other status codes that might be returned.
ru: См. статьи, посвященные <function>PQconnectStartParams</function>, <function>PQconnectStart</function> и <function>PQconnectPoll</function>, относительно других кодов статуса, которые могут быть возвращены этими функциями.

source: Returns the current in-transaction status of the server. <synopsis> PGTransactionStatusType PQtransactionStatus(const PGconn *conn); </synopsis> The status can be <literal>PQTRANS_IDLE</literal> (currently idle), <literal>PQTRANS_ACTIVE</literal> (a command is in progress), <literal>PQTRANS_INTRANS</literal> (idle, in a valid transaction block), or <literal>PQTRANS_INERROR</literal> (idle, in a failed transaction block). <literal>PQTRANS_UNKNOWN</literal> is reported if the connection is bad. <literal>PQTRANS_ACTIVE</literal> is reported only when a query has been sent to the server and not yet completed.
ru: Возвращает текущий статус сервера, отражающий процесс выполнения транзакций. <synopsis> PGTransactionStatusType PQtransactionStatus(const PGconn *conn); </synopsis> Статус может быть одним из <literal>PQTRANS_IDLE</literal> (в настоящее время не занят обработкой транзакции), <literal>PQTRANS_ACTIVE</literal> (команда в процессе обработки), <literal>PQTRANS_INTRANS</literal> (не выполняет работу, но находится в рамках действительной транзакции) или <literal>PQTRANS_INERROR</literal> (не выполняет работу, но находится в рамках транзакции, завершившейся сбоем). Статус принимает значение <literal>PQTRANS_UNKNOWN</literal>, если соединение не работает. Статус принимает значение <literal>PQTRANS_ACTIVE</literal> только тогда, когда запрос был отправлен серверу, но ещё не завершён.

source: Looks up a current parameter setting of the server. <synopsis> const char *PQparameterStatus(const PGconn *conn, const char *paramName); </synopsis> Certain parameter values are reported by the server automatically at connection startup or whenever their values change. <function>PQparameterStatus</function> can be used to interrogate these settings. It returns the current value of a parameter if known, or <symbol>NULL</symbol> if the parameter is not known.
ru: Отыскивает текущее значение параметра сервера. <synopsis> const char *PQparameterStatus(const PGconn *conn, const char *paramName); </synopsis> Значения определённых параметров сервер сообщает автоматически в начале процедуры подключения или тогда, когда их значения изменяются. <function>PQparameterStatus</function> можно использовать, чтобы запросить эти значения. Функция возвращает текущее значение параметра, если оно известно, или <symbol>NULL</symbol>, если параметр неизвестен.

source: Parameters reported as of the current release include <varname>server_version</varname>, <varname>server_encoding</varname>, <varname>client_encoding</varname>, <varname>application_name</varname>, <varname>is_superuser</varname>, <varname>session_authorization</varname>, <varname>DateStyle</varname>, <varname>IntervalStyle</varname>, <varname>TimeZone</varname>, <varname>integer_datetimes</varname>, and <varname>standard_conforming_strings</varname>. (<varname>server_encoding</varname>, <varname>TimeZone</varname>, and <varname>integer_datetimes</varname> were not reported by releases before 8.0; <varname>standard_conforming_strings</varname> was not reported by releases before 8.1; <varname>IntervalStyle</varname> was not reported by releases before 8.4; <varname>application_name</varname> was not reported by releases before 9.0.) Note that <varname>server_version</varname>, <varname>server_encoding</varname> and <varname>integer_datetimes</varname> cannot change after startup.
ru: Параметры, значения которых сообщает сервер, в текущей версии включают <varname>server_version</varname>, <varname>server_encoding</varname>, <varname>client_encoding</varname>, <varname>application_name</varname>, <varname>is_superuser</varname>, <varname>session_authorization</varname>, <varname>DateStyle</varname>, <varname>IntervalStyle</varname>, <varname>TimeZone</varname>, <varname>integer_datetimes</varname> и <varname>standard_conforming_strings</varname>. (Значения параметров <varname>server_encoding</varname>, <varname>TimeZone</varname> и <varname>integer_datetimes</varname> сервер до версии 8.0 не сообщал; <varname>standard_conforming_strings</varname> сервер до версии 8.1 не сообщал; <varname>IntervalStyle</varname> сервер до версии 8.4 не сообщал; <varname>application_name</varname> сервер до версии 9.0 не сообщал.) Учтите, что <varname>server_version</varname>, <varname>server_encoding</varname> и <varname>integer_datetimes</varname> нельзя изменить после запуска.

source: Pre-3.0-protocol servers do not report parameter settings, but <application>libpq</application> includes logic to obtain values for <varname>server_version</varname> and <varname>client_encoding</varname> anyway. Applications are encouraged to use <function>PQparameterStatus</function> rather than <foreignphrase>ad hoc</foreignphrase> code to determine these values. (Beware however that on a pre-3.0 connection, changing <varname>client_encoding</varname> via <command>SET</command> after connection startup will not be reflected by <function>PQparameterStatus</function>.) For <varname>server_version</varname>, see also <function>PQserverVersion</function>, which returns the information in a numeric form that is much easier to compare against.
ru: Серверы, поддерживающие протокол только до версии 3.0, не могут сообщать установки параметров, но <application>libpq</application> включает средства, чтобы получить значения для <varname>server_version</varname> и <varname>client_encoding</varname> в любом случае. Поощряется использование в приложениях <function>PQparameterStatus</function>, а не специально написанного (<foreignphrase>ad hoc</foreignphrase>) кода, для определения этих значений. (Примите к сведению, однако, что в соединениях, основанных на протоколе версии до 3.0, изменение <varname>client_encoding</varname> посредством команды <command>SET</command> после начала процедуры подключения не будет отражаться функцией <function>PQparameterStatus</function>.) Сведения о <varname>server_version</varname> приведены также в описании функции <function>PQserverVersion</function>, возвращающей информацию в числовой форме, в которой гораздо легче выполнять сравнение.

source: If no value for <varname>standard_conforming_strings</varname> is reported, applications can assume it is <literal>off</literal>, that is, backslashes are treated as escapes in string literals. Also, the presence of this parameter can be taken as an indication that the escape string syntax (<literal>E'...'</literal>) is accepted.
ru: Если для <varname>standard_conforming_strings</varname> не передано никакого значения, то приложения могут принять его равным <literal>off</literal>. Это означает, что символы обратной косой черты в строковых литералах интерпретируются в качестве спецсимволов. Также, наличие этого параметра может рассматриваться как указание на то, что синтаксис escape-строк (<literal>E'...'</literal>) является приемлемым.

source: Although the returned pointer is declared <literal>const</literal>, it in fact points to mutable storage associated with the <literal>PGconn</literal> structure. It is unwise to assume the pointer will remain valid across queries.
ru: Хотя возвращаемый указатель объявлен со спецификатором <literal>const</literal>, фактически он указывает на изменяемое хранилище, связанное со структурой <literal>PGconn</literal>. Не стоит рассчитывать на то, что указатель останется действительным при последующих запросах.

source: Interrogates the frontend/backend protocol being used. <synopsis> int PQprotocolVersion(const PGconn *conn); </synopsis> Applications might wish to use this function to determine whether certain features are supported. Currently, the possible values are 2 (2.0 protocol), 3 (3.0 protocol), or zero (connection bad). The protocol version will not change after connection startup is complete, but it could theoretically change during a connection reset. The 3.0 protocol will normally be used when communicating with <productname>PostgreSQL</productname> 7.4 or later servers; pre-7.4 servers support only protocol 2.0. (Protocol 1.0 is obsolete and not supported by <application>libpq</application>.)
ru: Запрашивает протокол, используемый между клиентом и сервером. <synopsis> int PQprotocolVersion(const PGconn *conn); </synopsis> Приложения могут использовать эту функцию, чтобы определить, поддерживаются ли опредёленные функциональные возможности. В настоящее время возможными значениями являются 2 (протокол версии 2.0), 3 (протокол версии 3.0) или ноль (проблемы в подключении). Версия протокола не будет изменяться после завершения процедуры подключения, но теоретически она могла бы измениться в процессе переподключения. Версия протокола 3.0 обычно используется при взаимодействии с серверами <productname>PostgreSQL</productname> версии 7.4 или более поздними; серверы до версии 7.4 поддерживают только протокол версии 2.0. (Протокол версии 1.0 является устаревшим и не поддерживается библиотекой <application>libpq</application>.)

source: Returns an integer representing the backend version. <synopsis> int PQserverVersion(const PGconn *conn); </synopsis> Applications might use this function to determine the version of the database server they are connected to. The number is formed by converting the major, minor, and revision numbers into two-decimal-digit numbers and appending them together. For example, version 8.1.5 will be returned as 80105, and version 8.2 will be returned as 80200 (leading zeroes are not shown). Zero is returned if the connection is bad.
ru: Возвращает целое число, представляющее версию сервера. <synopsis> int PQserverVersion(const PGconn *conn); </synopsis> Приложения могут использовать эту функцию, чтобы определить версию сервера баз данных, к которому они подключены. Число формируется путём преобразования номеров старшей, младшей и корректирующей версий в двузначные десятичные числа и соединения их вместе. Например, для версии 8.1.5 будет возвращено число 80105, а для версии 8.2 будет возвращено число 80200 (ведущие нули не показаны). Если соединение не работает, то возвращается ноль.

source: <primary>error message</primary>
ru: <primary>сообщение об ошибке</primary>

source: <placeholder-1/> Returns the error message most recently generated by an operation on the connection. <synopsis> char *PQerrorMessage(const PGconn *conn); </synopsis>
ru: <placeholder-1/> Возвращает сообщение об ошибке, наиболее недавно сгенерированное операцией, выполненной в рамках текущего подключения. <synopsis> char *PQerrorMessage(const PGconn *conn); </synopsis>

source: Nearly all <application>libpq</application> functions will set a message for <function>PQerrorMessage</function> if they fail. Note that by <application>libpq</application> convention, a nonempty <function>PQerrorMessage</function> result can consist of multiple lines, and will include a trailing newline. The caller should not free the result directly. It will be freed when the associated <structname>PGconn</structname> handle is passed to <function>PQfinish</function>. The result string should not be expected to remain the same across operations on the <literal>PGconn</literal> structure.
ru: Почти все функции библиотеки <application>libpq</application> в случае сбоя сформируют сообщение для <function>PQerrorMessage</function>. Обратите внимание, что по соглашениям, принятым в <application>libpq</application>, непустой результат функции <function>PQerrorMessage</function> может состоять из нескольких строк и будет включать завершающий символ новой строки. Вызывающая функция не должна освобождать память, на которую указывает возвращаемое значение, напрямую. Она будет освобождена, когда связанный с ней дескриптор <structname>PGconn</structname> будет передан функции <function>PQfinish</function>. Не стоит ожидать, что результирующая строка останется той же самой при выполнении нескольких операций со структурой <literal>PGconn</literal>.

source: Obtains the file descriptor number of the connection socket to the server. A valid descriptor will be greater than or equal to 0; a result of -1 indicates that no server connection is currently open. (This will not change during normal operation, but could change during connection setup or reset.) <synopsis> int PQsocket(const PGconn *conn); </synopsis>
ru: Получает номер файлового дескриптора для сокета соединения с сервером. Действительный дескриптор будет больше или равен 0; значение -1 показывает, что в данный момент не открыто ни одного соединения с сервером. (Значение не изменится во время обычной работы, но может измениться во время установки или переустановки подключения.) <synopsis> int PQsocket(const PGconn *conn); </synopsis>

source: <primary>PID</primary> <secondary>determining PID of server process</secondary> <tertiary>in libpq</tertiary>
ru: <primary>PID</primary> <secondary>определение PID серверного процесса</secondary> <tertiary>в libpq</tertiary>

source: Returns the process <acronym>ID</acronym> (PID)<placeholder-1/> of the backend process handling this connection. <synopsis> int PQbackendPID(const PGconn *conn); </synopsis>
ru: Возвращает <acronym>ID</acronym> (PID)<placeholder-1/> серверного процесса, обрабатывающего это подключение. <synopsis> int PQbackendPID(const PGconn *conn); </synopsis>

source: The backend <acronym>PID</acronym> is useful for debugging purposes and for comparison to <command>NOTIFY</command> messages (which include the <acronym>PID</acronym> of the notifying backend process). Note that the <acronym>PID</acronym> belongs to a process executing on the database server host, not the local host!
ru: <acronym>PID</acronym> серверного процесса полезен для отладочных целей и для сопоставления с сообщениями команды <command>NOTIFY</command> (которые включают <acronym>PID</acronym> уведомляющего серверного процесса). Примите к сведению, что <acronym>PID</acronym> принадлежит процессу, выполняющемуся на компьютере сервера баз данных, а не на локальном компьютере.
