Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/logicaldecoding.po
Languages: ru

source: Logical Decoding
ru: Логическое декодирование

source: <primary>Logical Decoding</primary>
ru: <primary>Логическое декодирование</primary>

source: PostgreSQL provides infrastructure to stream the modifications performed via SQL to external consumers. This functionality can be used for a variety of purposes, including replication solutions and auditing.
ru: PostgreSQL обеспечивает инфраструктуру для потоковой передачи изменений, выполняемых через SQL, внешним потребителям. Эта функциональность может быть полезна для самых разных целей, включая аудит и реализацию репликации.

source: Changes are sent out in streams identified by logical replication slots.
ru: Изменения передаются в потоках, связываемых со слотами логической репликации.

source: The format in which those changes are streamed is determined by the output plugin used. An example plugin is provided in the PostgreSQL distribution. Additional plugins can be written to extend the choice of available formats without modifying any core code. Every output plugin has access to each individual new row produced by <command>INSERT</command> and the new row version created by <command>UPDATE</command>. Availability of old row versions for <command>UPDATE</command> and <command>DELETE</command> depends on the configured replica identity (see <xref linkend="sql-createtable-replica-identity"/>).
ru: Формат, в котором передаются изменения, определяет используемый модуль вывода. Пример модуля вывода включён в дистрибутив PostgreSQL. Также возможно разработать и другие модули, расширяющие выбор доступных форматов, не затрагивая код ядра самого сервера. Любой модуль вывода получает на вход отдельные строки, создаваемые командой <command>INSERT</command>, и новые версии строк, которые создаёт <command>UPDATE</command>. Доступность старых версий строк для <command>UPDATE</command> и <command>DELETE</command> зависит от выбора варианта идентификации реплики (см. описание <xref linkend="sql-createtable-replica-identity"/>).

source: Changes can be consumed either using the streaming replication protocol (see <xref linkend="protocol-replication"/> and <xref linkend="logicaldecoding-walsender"/>), or by calling functions via SQL (see <xref linkend="logicaldecoding-sql"/>). It is also possible to write additional methods of consuming the output of a replication slot without modifying core code (see <xref linkend="logicaldecoding-writer"/>).
ru: Изменения могут быть получены либо по протоколу потоковой репликации (см. <xref remap="4" linkend="protocol-replication"/> и <xref remap="4" linkend="logicaldecoding-walsender"/>), либо через функции, вызываемые в SQL (см. <xref remap="4" linkend="logicaldecoding-sql"/>). Также возможно разработать дополнительные методы для обработки данных, поступающих через слот репликации, не модифицируя код ядра сервера (см. <xref remap="4" linkend="logicaldecoding-writer"/>).

source: Logical Decoding Examples
ru: Примеры логического декодирования

source: The following example demonstrates controlling logical decoding using the SQL interface.
ru: Следующий пример демонстрирует управление логическим декодированием на уровне SQL.

source: Before you can use logical decoding, you must set <xref linkend="guc-wal-level"/> to <literal>logical</literal> and <xref linkend="guc-max-replication-slots"/> to at least 1. Then, you should connect to the target database (in the example below, <literal>postgres</literal>) as a superuser.
ru: Прежде чем вы сможете использовать логическое декодирование, вы должны установить в <xref linkend="guc-wal-level"/> значение <literal>logical</literal>, а в <xref linkend="guc-max-replication-slots"/> значение, не меньшее 1. После этого вы должны подключиться к целевой базе данных (в следующем примере, это <literal>postgres</literal>) как суперпользователь.

source: postgres=# -- Create a slot named 'regression_slot' using the output plugin 'test_decoding' postgres=# SELECT * FROM pg_create_logical_replication_slot('regression_slot', 'test_decoding'); slot_name | xlog_position -----------------+--------------- regression_slot | 0/16B1970 (1 row) postgres=# SELECT slot_name, plugin, slot_type, database, active, restart_lsn, confirmed_flush_lsn FROM pg_replication_slots; slot_name | plugin | slot_type | database | active | restart_lsn | confirmed_flush_lsn -----------------+---------------+-----------+----------+--------+-------------+----------------- regression_slot | test_decoding | logical | postgres | f | 0/16A4408 | 0/16A4440 (1 row) postgres=# -- There are no changes to see yet postgres=# SELECT * FROM pg_logical_slot_get_changes('regression_slot', NULL, NULL); location | xid | data ----------+-----+------ (0 rows) postgres=# CREATE TABLE data(id serial primary key, data text); CREATE TABLE postgres=# -- DDL isn't replicated, so all you'll see is the transaction postgres=# SELECT * FROM pg_logical_slot_get_changes('regression_slot', NULL, NULL); location | xid | data -----------+-----+------------ 0/16D5D48 | 688 | BEGIN 688 0/16E0380 | 688 | COMMIT 688 (2 rows) postgres=# -- Once changes are read, they're consumed and not emitted postgres=# -- in a subsequent call: postgres=# SELECT * FROM pg_logical_slot_get_changes('regression_slot', NULL, NULL); location | xid | data ----------+-----+------ (0 rows) postgres=# BEGIN; postgres=# INSERT INTO data(data) VALUES('1'); postgres=# INSERT INTO data(data) VALUES('2'); postgres=# COMMIT; postgres=# SELECT * FROM pg_logical_slot_get_changes('regression_slot', NULL, NULL); location | xid | data -----------+-----+----------------------------------------------- 0/16E0478 | 689 | BEGIN 689 0/16E0478 | 689 | table public.data: INSERT: id[integer]:1 data[text]:'1' 0/16E0580 | 689 | table public.data: INSERT: id[integer]:2 data[text]:'2' 0/16E0650 | 689 | COMMIT 689 (4 rows) postgres=# INSERT INTO data(data) VALUES('3'); postgres=# -- You can also peek ahead in the change stream without consuming changes postgres=# SELECT * FROM pg_logical_slot_peek_changes('regression_slot', NULL, NULL); location | xid | data -----------+-----+----------------------------------------------- 0/16E09C0 | 690 | BEGIN 690 0/16E09C0 | 690 | table public.data: INSERT: id[integer]:3 data[text]:'3' 0/16E0B90 | 690 | COMMIT 690 (3 rows) postgres=# -- The next call to pg_logical_slot_peek_changes() returns the same changes again postgres=# SELECT * FROM pg_logical_slot_peek_changes('regression_slot', NULL, NULL); location | xid | data -----------+-----+----------------------------------------------- 0/16E09C0 | 690 | BEGIN 690 0/16E09C0 | 690 | table public.data: INSERT: id[integer]:3 data[text]:'3' 0/16E0B90 | 690 | COMMIT 690 (3 rows) postgres=# -- options can be passed to output plugin, to influence the formatting postgres=# SELECT * FROM pg_logical_slot_peek_changes('regression_slot', NULL, NULL, 'include-timestamp', 'on'); location | xid | data -----------+-----+----------------------------------------------- 0/16E09C0 | 690 | BEGIN 690 0/16E09C0 | 690 | table public.data: INSERT: id[integer]:3 data[text]:'3' 0/16E0B90 | 690 | COMMIT 690 (at 2014-02-27 16:41:51.863092+01) (3 rows) postgres=# -- Remember to destroy a slot you no longer need to stop it consuming postgres=# -- server resources: postgres=# SELECT pg_drop_replication_slot('regression_slot'); pg_drop_replication_slot ----------------------- (1 row)
ru: postgres=# -- Создать слот с именем 'regression_slot', использующий модуль вывода 'test_decoding' postgres=# SELECT * FROM pg_create_logical_replication_slot('regression_slot', 'test_decoding'); slot_name | xlog_position -----------------+--------------- regression_slot | 0/16B1970 (1 row) postgres=# SELECT slot_name, plugin, slot_type, database, active, restart_lsn, confirmed_flush_lsn FROM pg_replication_slots; slot_name | plugin | slot_type | database | active | restart_lsn | confirmed_flush_lsn -----------------+---------------+-----------+----------+--------+-------------+----------------- regression_slot | test_decoding | logical | postgres | f | 0/16A4408 | 0/16A4440 (1 row) postgres=# -- Пока никакие изменения не видны postgres=# SELECT * FROM pg_logical_slot_get_changes('regression_slot', NULL, NULL); location | xid | data ----------+-----+------ (0 rows) postgres=# CREATE TABLE data(id serial primary key, data text); CREATE TABLE postgres=# -- DDL не реплицируется, поэтому видна только транзакция postgres=# SELECT * FROM pg_logical_slot_get_changes('regression_slot', NULL, NULL); location | xid | data -----------+-----+------------ 0/16D5D48 | 688 | BEGIN 688 0/16E0380 | 688 | COMMIT 688 (2 rows) postgres=# -- Когда изменения прочитаны, они считаются обработанными и уже не выдаются postgres=# -- в последующем вызове: postgres=# SELECT * FROM pg_logical_slot_get_changes('regression_slot', NULL, NULL); location | xid | data ----------+-----+------ (0 rows) postgres=# BEGIN; postgres=# INSERT INTO data(data) VALUES('1'); postgres=# INSERT INTO data(data) VALUES('2'); postgres=# COMMIT; postgres=# SELECT * FROM pg_logical_slot_get_changes('regression_slot', NULL, NULL); location | xid | data -----------+-----+----------------------------------------------- 0/16E0478 | 689 | BEGIN 689 0/16E0478 | 689 | table public.data: INSERT: id[integer]:1 data[text]:'1' 0/16E0580 | 689 | table public.data: INSERT: id[integer]:2 data[text]:'2' 0/16E0650 | 689 | COMMIT 689 (4 rows) postgres=# INSERT INTO data(data) VALUES('3'); postgres=# -- Также можно заглянуть вперёд в потоке изменений, не считывая эти изменения postgres=# SELECT * FROM pg_logical_slot_peek_changes('regression_slot', NULL, NULL); location | xid | data -----------+-----+----------------------------------------------- 0/16E09C0 | 690 | BEGIN 690 0/16E09C0 | 690 | table public.data: INSERT: id[integer]:3 data[text]:'3' 0/16E0B90 | 690 | COMMIT 690 (3 rows) postgres=# -- Следующий вызов pg_logical_slot_peek_changes() снова возвращает те же изменения postgres=# SELECT * FROM pg_logical_slot_peek_changes('regression_slot', NULL, NULL); location | xid | data -----------+-----+----------------------------------------------- 0/16E09C0 | 690 | BEGIN 690 0/16E09C0 | 690 | table public.data: INSERT: id[integer]:3 data[text]:'3' 0/16E0B90 | 690 | COMMIT 690 (3 rows) postgres=# -- Модулю вывода можно передать параметры, влияющие на форматирование postgres=# SELECT * FROM pg_logical_slot_peek_changes('regression_slot', NULL, NULL, 'include-timestamp', 'on'); location | xid | data -----------+-----+----------------------------------------------- 0/16E09C0 | 690 | BEGIN 690 0/16E09C0 | 690 | table public.data: INSERT: id[integer]:3 data[text]:'3' 0/16E0B90 | 690 | COMMIT 690 (at 2014-02-27 16:41:51.863092+01) (3 rows) postgres=# -- Не забудьте удалить слот, который вам больше не нужен, чтобы он postgres=# -- не потреблял ресурсы сервера: postgres=# SELECT pg_drop_replication_slot('regression_slot'); pg_drop_replication_slot ----------------------- (1 row)

source: The following example shows how logical decoding is controlled over the streaming replication protocol, using the program <xref linkend="app-pgrecvlogical"/> included in the PostgreSQL distribution. This requires that client authentication is set up to allow replication connections (see <xref linkend="streaming-replication-authentication"/>) and that <varname>max_wal_senders</varname> is set sufficiently high to allow an additional connection.
ru: Следующий пример показывает, как можно управлять логическим декодированием средствами протокола потоковой репликации, используя программу <xref linkend="app-pgrecvlogical"/>, включённую в дистрибутив PostgreSQL. Для этого нужно, чтобы конфигурация аутентификации клиентов допускала подключения для репликации (см. <xref remap="4" linkend="streaming-replication-authentication"/>) и чтобы значение <varname>max_wal_senders</varname> было достаточно большим и позволило установить дополнительное подключение.

source: Logical Decoding Concepts
ru: Концепции логического декодирования

source: Logical decoding is the process of extracting all persistent changes to a database's tables into a coherent, easy to understand format which can be interpreted without detailed knowledge of the database's internal state.
ru: Логическое декодирование — это процедура извлечения всех постоянных изменений, происходящих в таблицах базы данных, в согласованном и понятном формате, который можно интерпретировать, не имея полного представления о внутреннем состоянии базы данных.

source: In <productname>PostgreSQL</productname>, logical decoding is implemented by decoding the contents of the <link linkend="wal">write-ahead log</link>, which describe changes on a storage level, into an application-specific form such as a stream of tuples or SQL statements.
ru: В <productname>PostgreSQL</productname> логическое декодирование реализуется путём перевода содержимого <link linkend="wal">журнала упреждающей записи</link>, описывающего изменения на уровне хранения, в специальную форму уровня приложения, например, в поток кортежей или операторов SQL.

source: Replication Slots
ru: Слоты репликации

source: <primary>replication slot</primary> <secondary>logical replication</secondary>
ru: <primary>слот репликации</primary> <secondary>логическая репликация</secondary>

source: In the context of logical replication, a slot represents a stream of changes that can be replayed to a client in the order they were made on the origin server. Each slot streams a sequence of changes from a single database.
ru: В контексте логической репликации слот представляет поток изменений, которые могут быть воспроизведены клиентом в том порядке, в каком они происходили на исходном сервере. Через каждый слот передаётся последовательность изменений в одной базе данных.

source: <productname>PostgreSQL</productname> also has streaming replication slots (see <xref linkend="streaming-replication"/>), but they are used somewhat differently there.
ru: В <productname>PostgreSQL</productname> также есть слоты потоковой репликации (см. <xref remap="4" linkend="streaming-replication"/>), но они используются несколько по-другому.

source: A replication slot has an identifier that is unique across all databases in a <productname>PostgreSQL</productname> cluster. Slots persist independently of the connection using them and are crash-safe.
ru: Слоту репликации назначается идентификатор, уникальный для всех баз данных в кластере <productname>PostgreSQL</productname>. Слоты сохраняются независимо от подключений, использующих их, и защищены от сбоев сервера.

source: A logical slot will emit each change just once in normal operation. The current position of each slot is persisted only at checkpoint, so in the case of a crash the slot may return to an earlier LSN, which will then cause recent changes to be resent when the server restarts. Logical decoding clients are responsible for avoiding ill effects from handling the same message more than once. Clients may wish to record the last LSN they saw when decoding and skip over any repeated data or (when using the replication protocol) request that decoding start from that LSN rather than letting the server determine the start point. The Replication Progress Tracking feature is designed for this purpose, refer to <link linkend="replication-origins">replication origins</link>.
ru: При обычных условиях через логический слот каждое изменение передаётся только один раз. Текущая позиция в каждом слоте сохраняется только в контрольной точке, так что в случае сбоя слот может вернуться к предыдущему LSN, вследствие чего последние изменения могут быть переданы повторно при перезапуске сервера. За исключение нежелательных эффектов от повторной обработки одного и того же сообщения отвечают клиенты логического декодирования. Клиенты могут запоминать при декодировании, какой последний LSN они уже получали, и пропускать повторяющиеся данные или (при использовании протокола репликации) запрашивать, чтобы декодирование начиналось с этого LSN, а не с позиции, выбираемой сервером. Для этого разработан механизм отслеживания репликации, о котором можно узнать подробнее в описании <link linkend="replication-origins">источников репликации</link>.

source: Multiple independent slots may exist for a single database. Each slot has its own state, allowing different consumers to receive changes from different points in the database change stream. For most applications, a separate slot will be required for each consumer.
ru: Для одной базы данных могут существовать несколько независимых слотов. Каждый слот имеет собственное состояние, что позволяет различным потребителям получать изменения с разных позиций в потоке изменений базы данных. Для большинства приложений каждому потребителю требуется отдельный слот.

source: A logical replication slot knows nothing about the state of the receiver(s). It's even possible to have multiple different receivers using the same slot at different times; they'll just get the changes following on from when the last receiver stopped consuming them. Only one receiver may consume changes from a slot at any given time.
ru: Слот логической репликации ничего не знает о состоянии получателя(ей). Возможно даже иметь несколько различных потребителей одного слота в разные моменты времени; они просто будут получать изменения с момента, когда их перестал получать предыдущий потребитель. Но в любой определённый момент получать изменения может только один потребитель.

source: Replication slots persist across crashes and know nothing about the state of their consumer(s). They will prevent removal of required resources even when there is no connection using them. This consumes storage because neither required WAL nor required rows from the system catalogs can be removed by <command>VACUUM</command> as long as they are required by a replication slot. So if a slot is no longer required it should be dropped.
ru: Слоты репликации сохраняются при сбоях сервера и ничего не знают о состоянии их потребителя(ей). Они не дают удалять требуемые ресурсы, даже когда не используются никаким подключением. На это уходит место в хранилище, так как ни сегменты WAL, ни требуемые строки из системных каталогов нельзя будет удалить в результате <command>VACUUM</command>, пока они нужны этому слоту репликации. Поэтому, если слот больше не требуется, его следует удалять.

source: Output Plugins
ru: Модули вывода

source: Output plugins transform the data from the write-ahead log's internal representation into the format the consumer of a replication slot desires.
ru: Модули вывода переводят данные из внутреннего представления в журнале упреждающей записи в формат, устраивающий потребителя слота репликации.

source: Exported Snapshots
ru: Экспортированные снимки

source: When a new replication slot is created using the streaming replication interface, a snapshot is exported (see <xref linkend="functions-snapshot-synchronization"/>), which will show exactly the state of the database after which all changes will be included in the change stream. This can be used to create a new replica by using <link linkend="sql-set-transaction"><literal>SET TRANSACTION SNAPSHOT</literal></link> to read the state of the database at the moment the slot was created. This transaction can then be used to dump the database's state at that point in time, which afterwards can be updated using the slot's contents without losing any changes.
ru: Когда новый слот репликации создаётся через интерфейс потоковой репликации, экспортируется снимок (см. <xref remap="4" linkend="functions-snapshot-synchronization"/>), который будет показывать ровно то состояние базы данных, изменения после которого будут включаться в поток изменений. Используя его, можно создать новую реплику, воспользовавшись командой <link linkend="sql-set-transaction"><literal>SET TRANSACTION SNAPSHOT</literal></link>, чтобы получить состояние базы в момент создания слота. После этого данную транзакцию можно использовать для выгрузки состояния базы на момент экспорт снимка, а затем изменять это состояние, применяя содержимое слота, так что никакие изменения не будут потеряны.

source: Streaming Replication Protocol Interface
ru: Интерфейс протокола потоковой репликации

source: slot_name
ru: имя_слота

source: output_plugin
ru: модуль_вывода

source: The commands <placeholder-1/> are used to create, drop, and stream changes from a replication slot, respectively. These commands are only available over a replication connection; they cannot be used via SQL. See <xref linkend="protocol-replication"/> for details on these commands.
ru: Команды <placeholder-1/> применяются для создания, удаления и передачи изменений из слота репликации, соответственно. Эти команды доступны только для соединения репликации; их нельзя использовать в обычном SQL. Подробнее они описаны в <xref remap="6" linkend="protocol-replication"/>.

source: The command <xref linkend="app-pgrecvlogical"/> can be used to control logical decoding over a streaming replication connection. (It uses these commands internally.)
ru: Для управления логическим декодированием по соединению потоковой репликации можно применять программу <xref linkend="app-pgrecvlogical"/>. (Внутри неё используются эти команды.)

source: Logical Decoding <acronym>SQL</acronym> Interface
ru: Интерфейс логического декодирования на уровне <acronym>SQL</acronym>

source: See <xref linkend="functions-replication"/> for detailed documentation on the SQL-level API for interacting with logical decoding.
ru: Подробнее API уровня SQL для взаимодействия с механизмом логическим декодированием описан в <xref remap="6" linkend="functions-replication"/>.

source: Synchronous replication (see <xref linkend="synchronous-replication"/>) is only supported on replication slots used over the streaming replication interface. The function interface and additional, non-core interfaces do not support synchronous replication.
ru: Синхронная репликация (см. <xref remap="4" linkend="synchronous-replication"/>) поддерживается только для слотов репликации, которые используются через интерфейс потоковой репликации. Интерфейс функций и дополнительные, не системные интерфейсы не поддерживают синхронную репликацию.

source: System Catalogs Related to Logical Decoding
ru: Системные каталоги, связанные с логическим декодированием

source: The <link linkend="view-pg-replication-slots"><structname>pg_replication_slots</structname></link> view and the <link linkend="monitoring-stats-views-table"><structname>pg_stat_replication</structname></link> view provide information about the current state of replication slots and streaming replication connections respectively. These views apply to both physical and logical replication.
ru: Информацию о текущем состоянии слотов репликации и соединений потоковой репликации отображают представления <link linkend="view-pg-replication-slots"><structname>pg_replication_slots</structname></link> и <link linkend="monitoring-stats-views-table"><structname>pg_stat_replication</structname></link>, соответственно. Эти представления относятся и к физической, и к логической репликации.

source: Logical Decoding Output Plugins
ru: Модули вывода логического декодирования

source: An example output plugin can be found in the <link linkend="test-decoding"><filename>contrib/test_decoding</filename></link> subdirectory of the PostgreSQL source tree.
ru: Пример модуля вывода можно найти в подкаталоге <link linkend="test-decoding"><filename>contrib/test_decoding</filename></link> в дереве исходного кода PostgreSQL.

source: Initialization Function
ru: Функция инициализации
