Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/logicaldecoding.po
Languages: ru

source: An output plugin is loaded by dynamically loading a shared library with the output plugin's name as the library base name. The normal library search path is used to locate the library. To provide the required output plugin callbacks and to indicate that the library is actually an output plugin it needs to provide a function named <function>_PG_output_plugin_init</function>. This function is passed a struct that needs to be filled with the callback function pointers for individual actions. <placeholder-1/> The <function>begin_cb</function>, <function>change_cb</function> and <function>commit_cb</function> callbacks are required, while <function>startup_cb</function>, <function>filter_by_origin_cb</function> and <function>shutdown_cb</function> are optional.
ru: Модуль вывода загружается в результате динамической загрузки разделяемой библиотеки (при этом в качестве имени библиотеки задаётся имя модуля). Для нахождения библиотеки применяется обычный путь поиска библиотек. В этой библиотеке должна быть функция <function>_PG_output_plugin_init</function>, которая показывает, что библиотека на самом деле представляет собой модуль вывода, и устанавливает требуемые обработчики модуля вывода. Этой функции передаётся структура, в которой должны быть заполнены указатели на функции-обработчики отдельных действий. <placeholder-1/> Обработчики <function>begin_cb</function>, <function>change_cb</function> и <function>commit_cb</function> должны устанавливаться обязательно, а <function>startup_cb</function>, <function>filter_by_origin_cb</function> и <function>shutdown_cb</function> могут отсутствовать.

source: Capabilities
ru: Возможности

source: To decode, format and output changes, output plugins can use most of the backend's normal infrastructure, including calling output functions. Read only access to relations is permitted as long as only relations are accessed that either have been created by <command>initdb</command> in the <literal>pg_catalog</literal> schema, or have been marked as user provided catalog tables using <placeholder-1/> Any actions leading to transaction ID assignment are prohibited. That, among others, includes writing to tables, performing DDL changes, and calling <literal>txid_current()</literal>.
ru: Для декодирования, форматирования и вывода изменений модули вывода могут использовать практически всю обычную инфраструктуру сервера, включая вызов функций вывода типов. К отношениям разрешается доступ только на чтение, если только эти отношения были созданы программой <command>initdb</command> в схеме <literal>pg_catalog</literal>, либо помечены как пользовательские таблицы каталогов командами <placeholder-1/> Любые действия, которые требует присвоения идентификатора транзакции, запрещаются. В частности, к этим действиям относятся операции записи в таблицы, изменения DDL и вызов <literal>txid_current()</literal>.

source: Output Modes
ru: Режимы вывода

source: Output Plugin Callbacks
ru: Обработчики в модуле вывода

source: An output plugin gets notified about changes that are happening via various callbacks it needs to provide.
ru: Модуль вывода уведомляется о происходящих изменениях через различные обработчики, которые он должен установить.

source: Concurrent transactions are decoded in commit order, and only changes belonging to a specific transaction are decoded between the <literal>begin</literal> and <literal>commit</literal> callbacks. Transactions that were rolled back explicitly or implicitly never get decoded. Successful savepoints are folded into the transaction containing them in the order they were executed within that transaction.
ru: Параллельные транзакции декодируются в порядке фиксирования, при этом только изменения, относящиеся к определённой транзакции, декодируются между вызовами обработчиков <literal>begin</literal> и <literal>commit</literal>. Транзакции, отменённые явно или неявно, никогда не декодируются. Успешные точки сохранения заворачиваются в транзакцию, содержащую их, в том порядке, в како они выполнялись в этой транзакции.

source: Only transactions that have already safely been flushed to disk will be decoded. That can lead to a <command>COMMIT</command> not immediately being decoded in a directly following <literal>pg_logical_slot_get_changes()</literal> when <varname>synchronous_commit</varname> is set to <literal>off</literal>.
ru: Декодироваться будут только те транзакции, которые уже успешно сброшены на диск. Вследствие этого, <command>COMMIT</command> может не декодироваться в следующем сразу за ним вызове <literal>pg_logical_slot_get_changes()</literal>, когда <varname>synchronous_commit</varname> имеет значение <literal>off</literal>.

source: Startup Callback
ru: Обработчик запуска

source: The optional <function>startup_cb</function> callback is called whenever a replication slot is created or asked to stream changes, independent of the number of changes that are ready to be put out. <placeholder-1/> The <literal>is_init</literal> parameter will be true when the replication slot is being created and false otherwise. <parameter>options</parameter> points to a struct of options that output plugins can set: <placeholder-2/> <literal>output_type</literal> has to either be set to <literal>OUTPUT_PLUGIN_TEXTUAL_OUTPUT</literal> or <literal>OUTPUT_PLUGIN_BINARY_OUTPUT</literal>. See also <xref linkend="logicaldecoding-output-mode"/>.
ru: Необязательный обработчик <function>startup_cb</function> вызывается, когда слот репликации создаётся или через него запрашивается передача изменений, независимо от того, в каком количестве изменения готовы к передаче. <placeholder-1/> Параметр <literal>is_init</literal> будет равен true, когда слот репликации создаётся, и false в противном случае. Параметр <parameter>options</parameter> указывает на структуру параметров, которые могут устанавливать модули вывода: <placeholder-2/> В поле <literal>output_type</literal> должно быть значение <literal>OUTPUT_PLUGIN_TEXTUAL_OUTPUT</literal> или <literal>OUTPUT_PLUGIN_BINARY_OUTPUT</literal>. См. также <xref remap="4" linkend="logicaldecoding-output-mode"/>.

source: The startup callback should validate the options present in <literal>ctx-&gt;output_plugin_options</literal>. If the output plugin needs to have a state, it can use <literal>ctx-&gt;output_plugin_private</literal> to store it.
ru: Обработчик запуска должен проверить параметры, представленные в <literal>ctx-&gt;output_plugin_options</literal>. Если модулю вывода требуется поддерживать состояние, он может сохранить его в <literal>ctx-&gt;output_plugin_private</literal>.

source: Shutdown Callback
ru: Обработчик выключения

source: The optional <function>shutdown_cb</function> callback is called whenever a formerly active replication slot is not used anymore and can be used to deallocate resources private to the output plugin. The slot isn't necessarily being dropped, streaming is just being stopped. <placeholder-1/>
ru: Необязательный обработчик <function>shutdown_cb</function> вызывается, когда ранее активный слот репликации перестаёт использоваться, так что ресурсы, занятые модулем вывода, можно освободить. При этом слот не обязательно удаляется, прекращается только потоковая передача через него. <placeholder-1/>

source: Transaction Begin Callback
ru: Обработчик начала транзакции

source: The required <function>begin_cb</function> callback is called whenever a start of a committed transaction has been decoded. Aborted transactions and their contents never get decoded. <placeholder-1/> The <parameter>txn</parameter> parameter contains meta information about the transaction, like the time stamp at which it has been committed and its XID.
ru: Обязательный обработчик <function>begin_cb</function> вызывается, когда декодируется начало зафиксированной транзакции. Прерванные транзакции и их содержимое никогда не декодируется. <placeholder-1/> Параметр <parameter>txn</parameter> содержит метаинформацию о транзакции, в частности её идентификатор и время её фиксирования.

source: Transaction End Callback
ru: Обработчик завершения транзакции

source: The required <function>commit_cb</function> callback is called whenever a transaction commit has been decoded. The <function>change_cb</function> callbacks for all modified rows will have been called before this, if there have been any modified rows. <placeholder-1/>
ru: Обязательный обработчик <function>commit_cb</function> вызывается, когда декодируется фиксирование транзакции. Перед этим обработчиком будет вызываться обработчик <function>change_cb</function> для всех изменённых строк (если строки были изменены). <placeholder-1/>

source: Change Callback
ru: Обработчик изменения

source: The required <function>change_cb</function> callback is called for every individual row modification inside a transaction, may it be an <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command>. Even if the original command modified several rows at once the callback will be called individually for each row. <placeholder-1/> The <parameter>ctx</parameter> and <parameter>txn</parameter> parameters have the same contents as for the <function>begin_cb</function> and <function>commit_cb</function> callbacks, but additionally the relation descriptor <parameter>relation</parameter> points to the relation the row belongs to and a struct <parameter>change</parameter> describing the row modification are passed in.
ru: Обязательный обработчик <function>change_cb</function> вызывается для каждого отдельного изменения строки в транзакции, производимого командами <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>. Даже если команда изменила несколько строк сразу, этот обработчик будет вызываться для каждой отдельной строки. <placeholder-1/> Параметры <parameter>ctx</parameter> и <parameter>txn</parameter> имеют то же содержимое, что и для обработчиков <function>begin_cb</function> и <function>commit_cb</function>; дополнительный дескриптор отношения <parameter>relation</parameter> указывает на отношение, к которому принадлежит строка, а структура <parameter>change</parameter> описывает передаваемое изменение строки.

source: Only changes in user defined tables that are not unlogged (see <xref linkend="sql-createtable-unlogged"/>) and not temporary (see <xref linkend="sql-createtable-temporary"/>) can be extracted using logical decoding.
ru: В процессе логического декодирования могут быть обработаны изменения только в таблицах, не являющихся нежурналируемыми (см. описание <xref linkend="sql-createtable-unlogged"/>) или временными (см. описание <xref remap="4" linkend="sql-createtable-temporary"/>).

source: Origin Filter Callback
ru: Обработчик фильтрации источника

source: The optional <function>filter_by_origin_cb</function> callback is called to determine whether data that has been replayed from <parameter>origin_id</parameter> is of interest to the output plugin. <placeholder-1/> The <parameter>ctx</parameter> parameter has the same contents as for the other callbacks. No information but the origin is available. To signal that changes originating on the passed in node are irrelevant, return true, causing them to be filtered away; false otherwise. The other callbacks will not be called for transactions and changes that have been filtered away.
ru: Необязательный обработчик <function>filter_by_origin_cb</function> вызывается, чтобы отметить, интересуют ли модуль вывода изменения, воспроизводимые из указанного источника (<parameter>origin_id</parameter>). <placeholder-1/> В параметре <parameter>ctx</parameter> передаётся та же информация, что и для других обработчиков. Чтобы отметить, что изменения, поступающие из переданного узла, не представляют интереса, модуль должен вернуть true, вследствие чего эти изменения будут фильтроваться; в противном случае он должен вернуть false. Другие обработчики для фильтруемых транзакций и изменений вызываться не будут.

source: This is useful when implementing cascading or multidirectional replication solutions. Filtering by the origin allows to prevent replicating the same changes back and forth in such setups. While transactions and changes also carry information about the origin, filtering via this callback is noticeably more efficient.
ru: Это полезно при реализации каскадной или разнонаправленной репликации. Фильтрация по источнику в таких конфигурациях позволяет предотвратить передачу взад-вперёд одних и тех же изменений. Хотя информацию об источнике можно также извлечь из транзакций и изменений, фильтрация с помощью этого обработчика гораздо более эффективна.

source: Generic Message Callback
ru: Обработчик произвольных сообщений

source: The optional <function>message_cb</function> callback is called whenever a logical decoding message has been decoded. <placeholder-1/> The <parameter>txn</parameter> parameter contains meta information about the transaction, like the time stamp at which it has been committed and its XID. Note however that it can be NULL when the message is non-transactional and the XID was not assigned yet in the transaction which logged the message. The <parameter>lsn</parameter> has WAL position of the message. The <parameter>transactional</parameter> says if the message was sent as transactional or not. The <parameter>prefix</parameter> is arbitrary null-terminated prefix which can be used for identifying interesting messages for the current plugin. And finally the <parameter>message</parameter> parameter holds the actual message of <parameter>message_size</parameter> size.
ru: Необязательный обработчик <function>message_cb</function> вызывается при получении сообщения логического декодирования. <placeholder-1/> Параметр <parameter>txn</parameter> содержит метаинформацию о транзакции, включая время её фиксации и её XID. Заметьте, однако, что в нём может передаваться NULL, когда сообщение нетранзакционное и транзакции, в которой было выдано сообщение, ещё не назначен XID. В параметре <parameter>lsn</parameter> отмечается позиция сообщения в WAL. Параметр <parameter>transactional</parameter> показывает, было ли сообщение передано как транзакционное. В параметре <parameter>prefix</parameter> передаётся некоторый префикс (завершающийся нулём), по которому текущий модуль может выделять интересующие его сообщения. И наконец, параметр <parameter>message</parameter> содержит само сообщение размером <parameter>message_size</parameter> байт.

source: Extra care should be taken to ensure that the prefix the output plugin considers interesting is unique. Using name of the extension or the output plugin itself is often a good choice.
ru: Необходимо дополнительно позаботиться о том, чтобы префикс, определяющий интересующие модуль вывода сообщения, был уникальным. Удачным выбором обычно будет имя расширения или самого модуля вывода.

source: Functions for Producing Output
ru: Функции для формирования вывода

source: To actually produce output, output plugins can write data to the <literal>StringInfo</literal> output buffer in <literal>ctx-&gt;out</literal> when inside the <function>begin_cb</function>, <function>commit_cb</function>, or <function>change_cb</function> callbacks. Before writing to the output buffer, <function>OutputPluginPrepareWrite(ctx, last_write)</function> has to be called, and after finishing writing to the buffer, <function>OutputPluginWrite(ctx, last_write)</function> has to be called to perform the write. The <parameter>last_write</parameter> indicates whether a particular write was the callback's last write.
ru: Чтобы действительно вывести данные, модули вывода могут записывать их в буфер <literal>StringInfo</literal> через <literal>ctx-&gt;out</literal>, внутри обработчиков <function>begin_cb</function>, <function>commit_cb</function> или <function>change_cb</function>. Прежде чем записывать данные в этот буфер, необходимо вызвать <function>OutputPluginPrepareWrite(ctx, last_write)</function>, а завершив запись в буфер, нужно вызвать <function>OutputPluginWrite(ctx, last_write)</function>, чтобы собственно произвести запись. Параметр <parameter>last_write</parameter> указывает, была ли эта определённая операция записи последней в данном обработчике.

source: The following example shows how to output data to the consumer of an output plugin: <placeholder-1/>
ru: Следующий пример показывает, как вывести данные для потребителя модуля вывода: <placeholder-1/>

source: Logical Decoding Output Writers
ru: Запись вывода логического декодирования

source: It is possible to add more output methods for logical decoding. For details, see <filename>src/backend/replication/logical/logicalfuncs.c</filename>. Essentially, three functions need to be provided: one to read WAL, one to prepare writing output, and one to write the output (see <xref linkend="logicaldecoding-output-plugin-output"/>).
ru: Архитектура сервера позволяет добавлять другие методы вывода для логического декодирования. За подробностями обратитесь к коду <filename>src/backend/replication/logical/logicalfuncs.c</filename>. По сути, необходимо реализовать три функции: одну для чтения WAL, другую для подготовки к записи, и третью для записи вывода (см. <xref remap="4" linkend="logicaldecoding-output-plugin-output"/>).

source: Synchronous Replication Support for Logical Decoding
ru: Поддержка синхронной репликации для логического декодирования

source: Logical decoding can be used to build <link linkend="synchronous-replication">synchronous replication</link> solutions with the same user interface as synchronous replication for <link linkend="streaming-replication">streaming replication</link>. To do this, the streaming replication interface (see <xref linkend="logicaldecoding-walsender"/>) must be used to stream out data. Clients have to send <literal>Standby status update (F)</literal> (see <xref linkend="protocol-replication"/>) messages, just like streaming replication clients do.
ru: Логическое декодирование может использоваться для реализации <link linkend="synchronous-replication">синхронной репликации</link> с тем же внешним интерфейсом, что и синхронная репликация поверх <link linkend="streaming-replication">потоковой репликации</link>. Для этого потоковая передача данных должна происходить через интерфейс потоковой репликации (см. <xref remap="4" linkend="logicaldecoding-walsender"/>). Клиенты такой репликации должны посылать сообщения <literal>Обновление состояния резервного сервера (F)</literal> (см. <xref remap="4" linkend="protocol-replication"/>), как и клиенты потоковой репликации.

source: A synchronous replica receiving changes via logical decoding will work in the scope of a single database. Since, in contrast to that, <parameter>synchronous_standby_names</parameter> currently is server wide, this means this technique will not work properly if more than one database is actively used.
ru: Синхронная реплика, получающая изменения через логическое декодирование, будет работать в рамках одной базы данных. Так как <parameter>synchronous_standby_names</parameter> в настоящее время, напротив, устанавливается на уровне сервера, это означает, что этот подход не будет работать корректно при использовании нескольких баз данных.
