Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/mvcc.po
Languages: ru

source: Consistent use of Serializable transactions can simplify development. The guarantee that any set of successfully committed concurrent Serializable transactions will have the same effect as if they were run one at a time means that if you can demonstrate that a single transaction, as written, will do the right thing when run by itself, you can have confidence that it will do the right thing in any mix of Serializable transactions, even without any information about what those other transactions might do, or it will not successfully commit. It is important that an environment which uses this technique have a generalized way of handling serialization failures (which always return with a SQLSTATE value of '40001'), because it will be very hard to predict exactly which transactions might contribute to the read/write dependencies and need to be rolled back to prevent serialization anomalies. The monitoring of read/write dependencies has a cost, as does the restart of transactions which are terminated with a serialization failure, but balanced against the cost and blocking involved in use of explicit locks and <literal>SELECT FOR UPDATE</literal> or <literal>SELECT FOR SHARE</literal>, Serializable transactions are the best performance choice for some environments.
ru: При правильном использовании сериализуемые транзакции могут значительно упростить разработку приложений. Гарантия того, что любое сочетание успешно зафиксированных параллельных сериализуемых транзакций даст тот же результат, что и последовательность этих транзакций, выполненных по очереди, означает, что если вы уверены, что единственная транзакция определённого содержания работает правильно, когда она запускается отдельно, вы можете быть уверены, что она будет работать так же правильно в любом сочетании сериализуемых транзакций, вне зависимости от того, что они делают, либо же она не будет зафиксирована успешно. При этом важно, чтобы в среде, где применяется этот подход, была реализована общая обработка сбоев сериализации (которые можно определить по значению SQLSTATE '40001'), так как заведомо определить, какие именно транзакции могут стать жертвами зависимостей чтения/записи и не будут зафиксированы для предотвращения аномалий сериализации, обычно очень сложно. Отслеживание зависимостей чтения-записи неизбежно создаёт дополнительную нагрузку, как и перезапуск транзакций, не зафиксированных из-за сбоев сериализации, но если на другую чашу весов положить нагрузку и блокирование, связанные с применением явных блокировок и <literal>SELECT FOR UPDATE</literal> или <literal>SELECT FOR SHARE</literal>, использовать сериализуемые транзакции в ряде случаев окажется выгоднее.

source: While <productname>PostgreSQL</productname>'s Serializable transaction isolation level only allows concurrent transactions to commit if it can prove there is a serial order of execution that would produce the same effect, it doesn't always prevent errors from being raised that would not occur in true serial execution. In particular, it is possible to see unique constraint violations caused by conflicts with overlapping Serializable transactions even after explicitly checking that the key isn't present before attempting to insert it. This can be avoided by making sure that <emphasis>all</emphasis> Serializable transactions that insert potentially conflicting keys explicitly check if they can do so first. For example, imagine an application that asks the user for a new key and then checks that it doesn't exist already by trying to select it first, or generates a new key by selecting the maximum existing key and adding one. If some Serializable transactions insert new keys directly without following this protocol, unique constraints violations might be reported even in cases where they could not occur in a serial execution of the concurrent transactions.
ru: Тогда как уровень изоляции транзакций Serializable в <productname>PostgreSQL</productname> позволяет фиксировать параллельные транзакции, только если есть уверенность, что тот же результат будет получен при последовательном их выполнении, он не всегда предотвращает ошибки, которые не возникли бы при действительно последовательном выполнении. В частности, можно столкнуться с нарушениями ограничений уникальности, вызванными наложением сериализуемых транзакций, даже после явной проверки отсутствия ключа перед добавлением его. Этого можно избежать, если <emphasis>все</emphasis> сериализуемые транзакции, добавляющие потенциально конфликтующие ключи, будут предварительно явно проверять, можно ли вставить ключ. Например, приложение, добавляющее новый ключ, может запрашивать его у пользователя и затем проверять, существует ли он, сначала пытаясь найти его, либо генерировать новый ключ, выбирая максимальное существующее значение и увеличивая его на один. Если некоторые сериализуемые транзакции добавляют новые ключи сразу, не следуя этому протоколу, возможны нарушения ограничений уникальности, даже когда они не наблюдались бы при последовательном выполнении этих транзакций.

source: Declare transactions as <literal>READ ONLY</literal> when possible.
ru: Объявляйте транзакции как <literal>READ ONLY</literal>, если это отражает их суть.

source: Control the number of active connections, using a connection pool if needed. This is always an important performance consideration, but it can be particularly important in a busy system using Serializable transactions.
ru: Управляйте числом активных подключений, при необходимости используя пул соединений. Это всегда полезно для увеличения производительности, но особенно важно это в загруженной системе с сериализуемыми транзакциями.

source: Don't put more into a single transaction than needed for integrity purposes.
ru: Заключайте в одну транзакцию не больше команд, чем необходимо для обеспечения целостности.

source: Don't leave connections dangling <quote>idle in transaction</quote> longer than necessary. The configuration parameter <xref linkend="guc-idle-in-transaction-session-timeout"/> may be used to automatically disconnect lingering sessions.
ru: Не оставляйте соединения <quote>простаивающими в транзакции</quote> дольше, чем необходимо. Для автоматического отключения затянувшихся транзакций можно применить параметр конфигурации <xref linkend="guc-idle-in-transaction-session-timeout"/>.

source: Eliminate explicit locks, <literal>SELECT FOR UPDATE</literal>, and <literal>SELECT FOR SHARE</literal> where no longer needed due to the protections automatically provided by Serializable transactions.
ru: Исключите явные блокировки, <literal>SELECT FOR UPDATE</literal> и <literal>SELECT FOR SHARE</literal> там, где они не нужны благодаря защите, автоматически предоставляемой сериализуемыми транзакциями.

source: When the system is forced to combine multiple page-level predicate locks into a single relation-level predicate lock because the predicate lock table is short of memory, an increase in the rate of serialization failures may occur. You can avoid this by increasing <xref linkend="guc-max-pred-locks-per-transaction"/>.
ru: Когда система вынуждена объединять предикатные блокировки уровня страницы в одну предикатную блокировку уровня таблицы из-за нехватки памяти, может возрасти частота сбоев сериализации. Избежать этого можно, увеличив параметр <xref linkend="guc-max-pred-locks-per-transaction"/>.

source: A sequential scan will always necessitate a relation-level predicate lock. This can result in an increased rate of serialization failures. It may be helpful to encourage the use of index scans by reducing <xref linkend="guc-random-page-cost"/> and/or increasing <xref linkend="guc-cpu-tuple-cost"/>. Be sure to weigh any decrease in transaction rollbacks and restarts against any overall change in query execution time.
ru: Последовательное сканирование всегда влечёт за собой предикатную блокировку на уровне таблицы. Это приводит к увеличению сбоев сериализации. В таких ситуациях бывает полезно склонить систему к использованию индексов, уменьшая <xref linkend="guc-random-page-cost"/> и/или увеличивая <xref linkend="guc-cpu-tuple-cost"/>. Однако тут важно сопоставить выигрыш от уменьшения числа откатов и перезапусков транзакций с проигрышем от возможного менее эффективного выполнения запросов.

source: For optimal performance when relying on Serializable transactions for concurrency control, these issues should be considered: <placeholder-1/>
ru: Применяя сериализуемые транзакции для управления конкурентным доступом, примите к сведению следующие рекомендации: <placeholder-1/>

source: Explicit Locking
ru: Явные блокировки

source: <productname>PostgreSQL</productname> provides various lock modes to control concurrent access to data in tables. These modes can be used for application-controlled locking in situations where <acronym>MVCC</acronym> does not give the desired behavior. Also, most <productname>PostgreSQL</productname> commands automatically acquire locks of appropriate modes to ensure that referenced tables are not dropped or modified in incompatible ways while the command executes. (For example, <command>TRUNCATE</command> cannot safely be executed concurrently with other operations on the same table, so it obtains an exclusive lock on the table to enforce that.)
ru: Для управления параллельным доступом к данным в таблицах <productname>PostgreSQL</productname> предоставляет несколько режимов явных блокировок. Эти режимы могут применяться для блокировки данных со стороны приложения в ситуациях, когда <acronym>MVCC</acronym> не даёт желаемый результат. Кроме того, большинство команд <productname>PostgreSQL</productname> автоматически получают блокировки соответствующих режимов, защищающие от удаления или изменения задействованных таблиц, несовместимого с характером выполняемой команды. (Например, <command>TRUNCATE</command> не может безопасно выполняться одновременно с другими операциями с этой таблицей, так что во избежание конфликта эта команда получает исключительную блокировку для данной таблицы.)

source: To examine a list of the currently outstanding locks in a database server, use the <link linkend="view-pg-locks"><structname>pg_locks</structname></link> system view. For more information on monitoring the status of the lock manager subsystem, refer to <xref linkend="monitoring"/>.
ru: Список текущих активных блокировок на сервере можно получить, прочитав системное представление <link linkend="view-pg-locks"><structname>pg_locks</structname></link>. За дополнительными сведениями о наблюдении за состоянием менеджера блокировок обратитесь к <xref remap="3" linkend="monitoring"/>.

source: Table-level Locks
ru: Блокировки на уровне таблицы

source: The list below shows the available lock modes and the contexts in which they are used automatically by <productname>PostgreSQL</productname>. You can also acquire any of these locks explicitly with the command <xref linkend="sql-lock"/>. Remember that all of these lock modes are table-level locks, even if the name contains the word <quote>row</quote>; the names of the lock modes are historical. To some extent the names reflect the typical usage of each lock mode &mdash; but the semantics are all the same. The only real difference between one lock mode and another is the set of lock modes with which each conflicts (see <xref linkend="table-lock-compatibility"/>). Two transactions cannot hold locks of conflicting modes on the same table at the same time. (However, a transaction never conflicts with itself. For example, it might acquire <literal>ACCESS EXCLUSIVE</literal> lock and later acquire <literal>ACCESS SHARE</literal> lock on the same table.) Non-conflicting lock modes can be held concurrently by many transactions. Notice in particular that some lock modes are self-conflicting (for example, an <literal>ACCESS EXCLUSIVE</literal> lock cannot be held by more than one transaction at a time) while others are not self-conflicting (for example, an <literal>ACCESS SHARE</literal> lock can be held by multiple transactions).
ru: В приведённом ниже списке перечислены имеющиеся режимы блокировок и контексты, где их автоматически применяет <productname>PostgreSQL</productname>. Вы можете также явно запросить любую из этих блокировок с помощью команды <xref linkend="sql-lock"/>. Помните, что все эти режимы работают на уровне таблицы, даже если имя режима содержит слово <quote>row</quote>; такие имена сложились исторически. В некоторой степени эти имена отражают типичное применение каждого режима блокировки, но смысл у всех один. Единственное, что действительно отличает один режим блокировки от другого, это набор режимов, с которыми конфликтует каждый из них (см. <xref remap="4" linkend="table-lock-compatibility"/>). Две транзакции не могут одновременно владеть блокировками конфликтующих режимов для одной и той же таблицы. (Однако учтите, что транзакция никогда не конфликтует с собой. Например, она может запросить блокировку <literal>ACCESS EXCLUSIVE</literal>, а затем <literal>ACCESS SHARE</literal> для той же таблицы.) При этом разные транзакции свободно могут одновременно владеть блокировками неконфликтующих режимов. Заметьте, что некоторые режимы блокировки конфликтуют сами с собой (например, блокировкой <literal>ACCESS EXCLUSIVE</literal> в один момент времени может владеть только одна транзакция), а некоторые &mdash; нет (например, блокировку <literal>ACCESS SHARE</literal> могут получить сразу несколько транзакций).

source: Table-level Lock Modes
ru: Режимы блокировок на уровне таблицы

source: Conflicts with the <literal>ACCESS EXCLUSIVE</literal> lock mode only.
ru: Конфликтует только с режимом блокировки <literal>ACCESS EXCLUSIVE</literal>.

source: The <command>SELECT</command> command acquires a lock of this mode on referenced tables. In general, any query that only <emphasis>reads</emphasis> a table and does not modify it will acquire this lock mode.
ru: Команда <command>SELECT</command> получает такую блокировку для таблиц, на которые она ссылается. Вообще говоря, блокировку в этом режиме получает любой запрос, который только <emphasis>читает</emphasis> таблицу, но не меняет её данные.

source: Conflicts with the <literal>EXCLUSIVE</literal> and <literal>ACCESS EXCLUSIVE</literal> lock modes.
ru: Конфликтует с режимами блокировки <literal>EXCLUSIVE</literal> и <literal>ACCESS EXCLUSIVE</literal>.

source: The <command>SELECT FOR UPDATE</command> and <command>SELECT FOR SHARE</command> commands acquire a lock of this mode on the target table(s) (in addition to <literal>ACCESS SHARE</literal> locks on any other tables that are referenced but not selected <option>FOR UPDATE/FOR SHARE</option>).
ru: Команды <command>SELECT FOR UPDATE</command> и <command>SELECT FOR SHARE</command> получают такую блокировку для своих целевых таблиц (помимо блокировок <literal>ACCESS SHARE</literal> для любых таблиц, которые используется в этих запросов, но не в предложении <option>FOR UPDATE/FOR SHARE</option>).

source: Conflicts with the <literal>SHARE</literal>, <literal>SHARE ROW EXCLUSIVE</literal>, <literal>EXCLUSIVE</literal>, and <literal>ACCESS EXCLUSIVE</literal> lock modes.
ru: Конфликтует с режимами блокировки <literal>SHARE</literal>, <literal>SHARE ROW EXCLUSIVE</literal>, <literal>EXCLUSIVE</literal> и <literal>ACCESS EXCLUSIVE</literal>.

source: The commands <command>UPDATE</command>, <command>DELETE</command>, and <command>INSERT</command> acquire this lock mode on the target table (in addition to <literal>ACCESS SHARE</literal> locks on any other referenced tables). In general, this lock mode will be acquired by any command that <emphasis>modifies data</emphasis> in a table.
ru: Команды <command>UPDATE</command>, <command>DELETE</command> и <command>INSERT</command> получают такую блокировку для целевой таблицы (в дополнение к блокировкам <literal>ACCESS SHARE</literal> для всех других задействованных таблиц). Вообще говоря, блокировку в этом режиме получает любая команда, которая <emphasis>изменяет данные</emphasis> в таблице.

source: Conflicts with the <literal>SHARE UPDATE EXCLUSIVE</literal>, <literal>SHARE</literal>, <literal>SHARE ROW EXCLUSIVE</literal>, <literal>EXCLUSIVE</literal>, and <literal>ACCESS EXCLUSIVE</literal> lock modes. This mode protects a table against concurrent schema changes and <command>VACUUM</command> runs.
ru: Конфликтует с режимами блокировки <literal>SHARE UPDATE EXCLUSIVE</literal>, <literal>SHARE</literal>, <literal>SHARE ROW EXCLUSIVE</literal>, <literal>EXCLUSIVE</literal> и <literal>ACCESS EXCLUSIVE</literal>. Этот режим защищает таблицу от параллельного изменения схемы и запуска процесса <command>VACUUM</command>.

source: Acquired by <command>VACUUM</command> (without <option>FULL</option>), <command>ANALYZE</command>, <command>CREATE INDEX CONCURRENTLY</command>, and <command>ALTER TABLE VALIDATE</command> and other <command>ALTER TABLE</command> variants (for full details see <xref linkend="sql-altertable"/>).
ru: Запрашивается командами <command>VACUUM</command> (без <option>FULL</option>), <command>ANALYZE</command>, <command>CREATE INDEX CONCURRENTLY</command>, <command>ALTER TABLE VALIDATE</command> и другими видами <command>ALTER TABLE</command> (за подробностями обратитесь к <xref remap="3" linkend="sql-altertable"/>).

source: Conflicts with the <literal>ROW EXCLUSIVE</literal>, <literal>SHARE UPDATE EXCLUSIVE</literal>, <literal>SHARE ROW EXCLUSIVE</literal>, <literal>EXCLUSIVE</literal>, and <literal>ACCESS EXCLUSIVE</literal> lock modes. This mode protects a table against concurrent data changes.
ru: Конфликтует с режимами блокировки <literal>ROW EXCLUSIVE</literal>, <literal>SHARE UPDATE EXCLUSIVE</literal>, <literal>SHARE ROW EXCLUSIVE</literal>, <literal>EXCLUSIVE</literal> и <literal>ACCESS EXCLUSIVE</literal>. Этот режим защищает таблицу от параллельного изменения данных.

source: Acquired by <command>CREATE INDEX</command> (without <option>CONCURRENTLY</option>).
ru: Запрашивается командой <command>CREATE INDEX</command> (без параметра <option>CONCURRENTLY</option>).

source: Conflicts with the <literal>ROW EXCLUSIVE</literal>, <literal>SHARE UPDATE EXCLUSIVE</literal>, <literal>SHARE</literal>, <literal>SHARE ROW EXCLUSIVE</literal>, <literal>EXCLUSIVE</literal>, and <literal>ACCESS EXCLUSIVE</literal> lock modes. This mode protects a table against concurrent data changes, and is self-exclusive so that only one session can hold it at a time.
ru: Конфликтует с режимами блокировки <literal>ROW EXCLUSIVE</literal>, <literal>SHARE UPDATE EXCLUSIVE</literal>, <literal>SHARE</literal>, <literal>SHARE ROW EXCLUSIVE</literal>, <literal>EXCLUSIVE</literal> и <literal>ACCESS EXCLUSIVE</literal>. Этот режим защищает таблицу от параллельных изменений данных и при этом он является самоисключающим, так что такую блокировку может получить только один сеанс.

source: Acquired by <command>CREATE TRIGGER</command> and many forms of <command>ALTER TABLE</command> (see <xref linkend="sql-altertable"/>).
ru: Запрашивается командой <command>CREATE TRIGGER</command> и многими формами <command>ALTER TABLE</command> (см. <xref remap="4" linkend="sql-altertable"/>).

source: Conflicts with the <literal>ROW SHARE</literal>, <literal>ROW EXCLUSIVE</literal>, <literal>SHARE UPDATE EXCLUSIVE</literal>, <literal>SHARE</literal>, <literal>SHARE ROW EXCLUSIVE</literal>, <literal>EXCLUSIVE</literal>, and <literal>ACCESS EXCLUSIVE</literal> lock modes. This mode allows only concurrent <literal>ACCESS SHARE</literal> locks, i.e., only reads from the table can proceed in parallel with a transaction holding this lock mode.
ru: Конфликтует с режимами блокировки <literal>ROW SHARE</literal>, <literal>ROW EXCLUSIVE</literal>, <literal>SHARE UPDATE EXCLUSIVE</literal>, <literal>SHARE</literal>, <literal>SHARE ROW EXCLUSIVE</literal>, <literal>EXCLUSIVE</literal> и <literal>ACCESS EXCLUSIVE</literal>. Этот режим совместим только с блокировкой <literal>ACCESS SHARE</literal>, то есть параллельно с транзакцией, получившей блокировку в этой режиме, допускается только чтение таблицы.

source: Acquired by <command>REFRESH MATERIALIZED VIEW CONCURRENTLY</command>.
ru: Запрашивается командой <command>REFRESH MATERIALIZED VIEW CONCURRENTLY</command>.

source: Conflicts with locks of all modes (<literal>ACCESS SHARE</literal>, <literal>ROW SHARE</literal>, <literal>ROW EXCLUSIVE</literal>, <literal>SHARE UPDATE EXCLUSIVE</literal>, <literal>SHARE</literal>, <literal>SHARE ROW EXCLUSIVE</literal>, <literal>EXCLUSIVE</literal>, and <literal>ACCESS EXCLUSIVE</literal>). This mode guarantees that the holder is the only transaction accessing the table in any way.
ru: Конфликтует со всеми режимами блокировки (<literal>ACCESS SHARE</literal>, <literal>ROW SHARE</literal>, <literal>ROW EXCLUSIVE</literal>, <literal>SHARE UPDATE EXCLUSIVE</literal>, <literal>SHARE</literal>, <literal>SHARE ROW EXCLUSIVE</literal>, <literal>EXCLUSIVE</literal> и <literal>ACCESS EXCLUSIVE</literal>). Этот режим гарантирует, что кроме транзакции, получившей эту блокировку, никакая другая транзакция не может обращаться к таблице каким-либо способом.

source: Acquired by the <command>DROP TABLE</command>, <command>TRUNCATE</command>, <command>REINDEX</command>, <command>CLUSTER</command>, <command>VACUUM FULL</command>, and <command>REFRESH MATERIALIZED VIEW</command> (without <option>CONCURRENTLY</option>) commands. Many forms of <command>ALTER TABLE</command> also acquire a lock at this level. This is also the default lock mode for <command>LOCK TABLE</command> statements that do not specify a mode explicitly.
ru: Запрашивается командами <command>DROP TABLE</command>, <command>TRUNCATE</command>, <command>REINDEX</command>, <command>CLUSTER</command>, <command>VACUUM FULL</command> и <command>REFRESH MATERIALIZED VIEW</command> (без <option>CONCURRENTLY</option>). Блокировку на этом уровне запрашивают также многие виды <command>ALTER TABLE</command>. В этом режиме по умолчанию запрашивают блокировку и операторы <command>LOCK TABLE</command>, если явно не выбран другой режим.

source: Only an <literal>ACCESS EXCLUSIVE</literal> lock blocks a <command>SELECT</command> (without <option>FOR UPDATE/SHARE</option>) statement.
ru: Только блокировка <literal>ACCESS EXCLUSIVE</literal> блокирует оператор <command>SELECT</command> (без <option>FOR UPDATE/SHARE</option>).

source: Once acquired, a lock is normally held till end of transaction. But if a lock is acquired after establishing a savepoint, the lock is released immediately if the savepoint is rolled back to. This is consistent with the principle that <command>ROLLBACK</command> cancels all effects of the commands since the savepoint. The same holds for locks acquired within a <application>PL/pgSQL</application> exception block: an error escape from the block releases locks acquired within it.
ru: Полученная транзакцией блокировка обычно сохраняется до конца транзакции. Но если блокировка получена после установки точки сохранения, она освобождается немедленно в случае отката к этой точке. Это согласуется с принципом действия <command>ROLLBACK</command> &mdash; эта команда отменяет эффекты всех команд после точки сохранения. То же справедливо и для блокировок, полученных в блоке исключений <application>PL/pgSQL</application>: при выходе из блока с ошибкой такие блокировки освобождаются.

source: Conflicting Lock Modes
ru: Конфликтующие режимы блокировки

source: Requested Lock Mode
ru: Запраши&zwsp;ваемый режим блоки&zwsp;ровки

source: Current Lock Mode
ru: Текущий режим блокировки

# entry
source: EXCLUSIVE
ru: EXCLU&zwsp;SIVE

source: Row-level Locks
ru: Блокировки на уровне строк
