Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/mvcc.po
Languages: ru

source: Because Read Committed mode starts each command with a new snapshot that includes all transactions committed up to that instant, subsequent commands in the same transaction will see the effects of the committed concurrent transaction in any case. The point at issue above is whether or not a <emphasis>single</emphasis> command sees an absolutely consistent view of the database.
ru: Так как в режиме Read Committed каждая команда начинается с нового снимка состояния, который включает результаты всех транзакций, зафиксированных к этому моменту, последующие команды в одной транзакции будут в любом случае видеть эффекты всех параллельных зафиксированных транзакций. Вопрос здесь состоит в том, видит ли <emphasis>одна</emphasis> команда абсолютно согласованное состояние базы данных.

source: The partial transaction isolation provided by Read Committed mode is adequate for many applications, and this mode is fast and simple to use; however, it is not sufficient for all cases. Applications that do complex queries and updates might require a more rigorously consistent view of the database than Read Committed mode provides.
ru: Частичная изоляция транзакция, обеспечиваемая в режиме Read Committed, приемлема для множества приложений. Этот режим быстр и прост в использовании, однако он подходит не для всех случаев. Приложениям, выполняющим сложные запросы и изменения, могут потребоваться более строго согласованное представление данных, чем то, что даёт Read Committed.

source: Repeatable Read Isolation Level
ru: Уровень изоляции Repeatable Read

source: <primary>transaction isolation level</primary> <secondary>repeatable read</secondary>
ru: <primary>уровень изоляции транзакций</primary> <secondary>repeatable read</secondary>

source: The <firstterm>Repeatable Read</firstterm> isolation level only sees data committed before the transaction began; it never sees either uncommitted data or changes committed during transaction execution by concurrent transactions. (However, the query does see the effects of previous updates executed within its own transaction, even though they are not yet committed.) This is a stronger guarantee than is required by the <acronym>SQL</acronym> standard for this isolation level, and prevents all of the phenomena described in <xref linkend="mvcc-isolevel-table"/> except for serialization anomalies. As mentioned above, this is specifically allowed by the standard, which only describes the <emphasis>minimum</emphasis> protections each isolation level must provide.
ru: В режиме <firstterm>Repeatable Read</firstterm> видны только те данные, которые были зафиксированы до начала транзакции, но не видны незафиксированные данные и изменения, произведённые другими транзакциями в процессе выполнения данной транзакции. (Однако запрос будет видеть эффекты предыдущих изменений в своей транзакции, несмотря на то, что они не зафиксированы.) Это самое строгое требование, которое стандарт <acronym>SQL</acronym> вводит для этого уровня изоляции, и при его выполнении предотвращаются все явления, описанные в <xref remap="6" linkend="mvcc-isolevel-table"/>, за исключением аномалий реализации. Как было сказано выше, это не противоречит стандарту, так как он определяет только <emphasis>минимальную</emphasis> защиту, которая должна обеспечиваться на каждом уровне изоляции.

source: This level is different from Read Committed in that a query in a repeatable read transaction sees a snapshot as of the start of the first non-transaction-control statement in the <emphasis>transaction</emphasis>, not as of the start of the current statement within the transaction. Thus, successive <command>SELECT</command> commands within a <emphasis>single</emphasis> transaction see the same data, i.e., they do not see changes made by other transactions that committed after their own transaction started.
ru: Этот уровень отличается от Read Committed тем, что запрос в транзакции данного уровня видит снимок данных на момент начала первого оператора в <emphasis>транзакции</emphasis> (не считая команд управления транзакциями), а не начала текущего оператора. Таким образом, последовательные команды <command>SELECT</command> в <emphasis>одной</emphasis> транзакции видят одни и те же данные; они не видят изменений, внесённых и зафиксированных другими транзакциями после начала их текущей транзакции.

source: Applications using this level must be prepared to retry transactions due to serialization failures.
ru: Приложения, использующие этот уровень, должны быть готовы повторить транзакции в случае сбоев сериализации.

source: <command>UPDATE</command>, <command>DELETE</command>, <command>SELECT FOR UPDATE</command>, and <command>SELECT FOR SHARE</command> commands behave the same as <command>SELECT</command> in terms of searching for target rows: they will only find target rows that were committed as of the transaction start time. However, such a target row might have already been updated (or deleted or locked) by another concurrent transaction by the time it is found. In this case, the repeatable read transaction will wait for the first updating transaction to commit or roll back (if it is still in progress). If the first updater rolls back, then its effects are negated and the repeatable read transaction can proceed with updating the originally found row. But if the first updater commits (and actually updated or deleted the row, not just locked it) then the repeatable read transaction will be rolled back with the message <screen> ERROR: could not serialize access due to concurrent update </screen> because a repeatable read transaction cannot modify or lock rows changed by other transactions after the repeatable read transaction began.
ru: Команды <command>UPDATE</command>, <command>DELETE</command>, <command>SELECT FOR UPDATE</command> и <command>SELECT FOR SHARE</command> ведут себя подобно <command>SELECT</command> при поиске целевых строк: они найдут только те целевые строки, которые были зафиксированы на момент начала транзакции. Однако к моменту, когда они будут найдены, эти целевые строки могут быть уже изменены (а также удалены или заблокированы) другой параллельной транзакцией. В этом случае транзакция в режиме Repeatable Read будет ожидать фиксирования или отката первой изменяющей данные транзакции (если она ещё выполняется). Если первая изменяющая транзакция откатывается, её результат отбрасывается и текущая транзакция может продолжить изменение изначально полученной строки. Если же первая транзакция зафиксировалась, и в результате изменила или удалила эту строку, а не просто заблокировала её, произойдёт откат текущей транзакции с сообщением <screen> ОШИБКА: не удалось сериализовать доступ из-за параллельного изменения </screen> так как транзакция уровня Repeatable Read не может изменять или блокировать строки, изменённые другими транзакциями с момента её начала.

source: When an application receives this error message, it should abort the current transaction and retry the whole transaction from the beginning. The second time through, the transaction will see the previously-committed change as part of its initial view of the database, so there is no logical conflict in using the new version of the row as the starting point for the new transaction's update.
ru: Когда приложение получает это сообщение об ошибке, оно должна прервать текущую транзакцию и попытаться повторить её с самого начала. Во второй раз транзакция увидит внесённое до этого изменение как часть начального снимка базы данных, так что новая версия строки вполне может использоваться в качестве отправной точки для изменения в повторной транзакции.

source: Note that only updating transactions might need to be retried; read-only transactions will never have serialization conflicts.
ru: Заметьте, что потребность в повторении транзакции может возникнуть, только если эта транзакция изменяет данные; в транзакциях, которые только читают данные, конфликтов сериализации не бывает.

source: The Repeatable Read mode provides a rigorous guarantee that each transaction sees a completely stable view of the database. However, this view will not necessarily always be consistent with some serial (one at a time) execution of concurrent transactions of the same level. For example, even a read only transaction at this level may see a control record updated to show that a batch has been completed but <emphasis>not</emphasis> see one of the detail records which is logically part of the batch because it read an earlier revision of the control record. Attempts to enforce business rules by transactions running at this isolation level are not likely to work correctly without careful use of explicit locks to block conflicting transactions.
ru: Режим Repeatable Read строго гарантирует, что каждая транзакция видит полностью стабильное представление базы данных. Однако это представление не обязательно будет согласовано с некоторым последовательным выполнением транзакций одного уровня. Например, даже транзакция, которая только читает данные, в этом режиме может видеть строку, показывающую, что некоторое задание завершено, но <emphasis>не</emphasis> видеть одну из строк логических частей задания, так как эта транзакция может прочитать более раннюю версию строки задания, чем ту, для которой параллельно добавлялась очередная логическая часть. Строго исполнить бизнес-правила в транзакциях, работающих на этом уровне изоляции, скорее всего не удастся без явных блокировок конфликтующих транзакций.

source: Prior to <productname>PostgreSQL</productname> version 9.1, a request for the Serializable transaction isolation level provided exactly the same behavior described here. To retain the legacy Serializable behavior, Repeatable Read should now be requested.
ru: До версии 9.1 в <productname>PostgreSQL</productname> при запросе режима Serializable поведение системы в точности соответствовало вышеописанному. Таким образом, чтобы сейчас получить старое поведение Serializable, нужно запрашивать режим Repeatable Read.

source: Serializable Isolation Level
ru: Уровень изоляции Serializable

source: <primary>transaction isolation level</primary> <secondary>serializable</secondary>
ru: <primary>уровень изоляции транзакций</primary> <secondary>serializable</secondary>

source: <primary>predicate locking</primary>
ru: <primary>предикатная блокировка</primary>

source: The <firstterm>Serializable</firstterm> isolation level provides the strictest transaction isolation. This level emulates serial transaction execution for all committed transactions; as if transactions had been executed one after another, serially, rather than concurrently. However, like the Repeatable Read level, applications using this level must be prepared to retry transactions due to serialization failures. In fact, this isolation level works exactly the same as Repeatable Read except that it monitors for conditions which could make execution of a concurrent set of serializable transactions behave in a manner inconsistent with all possible serial (one at a time) executions of those transactions. This monitoring does not introduce any blocking beyond that present in repeatable read, but there is some overhead to the monitoring, and detection of the conditions which could cause a <firstterm>serialization anomaly</firstterm> will trigger a <firstterm>serialization failure</firstterm>.
ru: Уровень <firstterm>Serializable</firstterm> обеспечивает самую строгую изоляцию транзакций. На этом уровне моделируется последовательное выполнение всех зафиксированных транзакций, как если бы транзакции выполнялись одна за другой, последовательно, а не параллельно. Однако, как и на уровне Repeatable Read, на этом уровне приложения должны быть готовы повторять транзакции из-за сбоев сериализации. Фактически этот режим изоляции работает так же, как и Repeatable Read, только он дополнительно отслеживает условия, при которых результат параллельно выполняемых сериализуемых транзакций может не согласовываться с результатом этих же транзакций, выполняемых по очереди. Это отслеживание не привносит дополнительных препятствий для выполнения, кроме тех, что присущи режиму Repeatable Read, но тем не менее создаёт некоторую добавочную нагрузку, а при выявлении исключительных условий регистрируется <firstterm>аномалия сериализации</firstterm> и происходит <firstterm>сбой сериализации</firstterm>.

source: As an example, consider a table <structname>mytab</structname>, initially containing: <screen> class | value -------+------- 1 | 10 1 | 20 2 | 100 2 | 200 </screen> Suppose that serializable transaction A computes: <screen> SELECT SUM(value) FROM mytab WHERE class = 1; </screen> and then inserts the result (30) as the <structfield>value</structfield> in a new row with <structfield>class</structfield><literal> = 2</literal>. Concurrently, serializable transaction B computes: <screen> SELECT SUM(value) FROM mytab WHERE class = 2; </screen> and obtains the result 300, which it inserts in a new row with <structfield>class</structfield><literal> = 1</literal>. Then both transactions try to commit. If either transaction were running at the Repeatable Read isolation level, both would be allowed to commit; but since there is no serial order of execution consistent with the result, using Serializable transactions will allow one transaction to commit and will roll the other back with this message: <screen> ERROR: could not serialize access due to read/write dependencies among transactions </screen> This is because if A had executed before B, B would have computed the sum 330, not 300, and similarly the other order would have resulted in a different sum computed by A.
ru: Например, рассмотрим таблицу <structname>mytab</structname>, изначально содержащую: <screen> class | value -------+------- 1 | 10 1 | 20 2 | 100 2 | 200 </screen> Предположим, что сериализуемая транзакция A вычисляет: <screen> SELECT SUM(value) FROM mytab WHERE class = 1; </screen> а затем вставляет результат (30) в поле <structfield>value</structfield> в новую строку со значением <structfield>class</structfield><literal> = 2</literal>. В это же время сериализуемая транзакция B вычисляет: <screen> SELECT SUM(value) FROM mytab WHERE class = 2; </screen> получает результат 300 и вставляет его в новую строку со значением <structfield>class</structfield><literal> = 1</literal>. Затем обе транзакции пытаются зафиксироваться. Если бы одна из этих транзакций работала в режиме Repeatable Read, зафиксироваться могли бы обе; но так как полученный результат не соответствовал бы последовательному порядку, в режиме Serializable будет зафиксирована только одна транзакция, а вторая закончится откатом с сообщением: <screen> ОШИБКА: не удалось сериализовать доступ из-за зависимостей чтения/записи между транзакциями </screen> Это объясняется тем, что при выполнении A перед B транзакция B вычислила бы сумму 330, а не 300, а при выполнении в обратном порядке A вычислила бы другую сумму.

source: When relying on Serializable transactions to prevent anomalies, it is important that any data read from a permanent user table not be considered valid until the transaction which read it has successfully committed. This is true even for read-only transactions, except that data read within a <firstterm>deferrable</firstterm> read-only transaction is known to be valid as soon as it is read, because such a transaction waits until it can acquire a snapshot guaranteed to be free from such problems before starting to read any data. In all other cases applications must not depend on results read during a transaction that later aborted; instead, they should retry the transaction until it succeeds.
ru: Рассчитывая, что сериализуемые транзакции предотвратят аномалии, важно понимать, что любые данные, полученные из постоянной таблицы пользователя, не должны считаться действительными, пока транзакция, прочитавшая их, не будет успешно зафиксирована. Это верно даже для транзакций, не модифицирующих данные, за исключением случая, когда данные считываются в <firstterm>откладываемой</firstterm> транзакции такого типа. В этом случае данные могут считаться действительными, так как такая транзакция ждёт, пока не сможет получить снимок, гарантированно предотвращающий подобные проблемы. Во всех остальных случаях приложения не должны полагаться на результаты чтения данных в транзакции, которая не была зафиксирована; в случае ошибки и отката приложения должны повторять транзакцию, пока она не будет завершена успешно.

source: To guarantee true serializability <productname>PostgreSQL</productname> uses <firstterm>predicate locking</firstterm>, which means that it keeps locks which allow it to determine when a write would have had an impact on the result of a previous read from a concurrent transaction, had it run first. In <productname>PostgreSQL</productname> these locks do not cause any blocking and therefore can <emphasis>not</emphasis> play any part in causing a deadlock. They are used to identify and flag dependencies among concurrent Serializable transactions which in certain combinations can lead to serialization anomalies. In contrast, a Read Committed or Repeatable Read transaction which wants to ensure data consistency may need to take out a lock on an entire table, which could block other users attempting to use that table, or it may use <literal>SELECT FOR UPDATE</literal> or <literal>SELECT FOR SHARE</literal> which not only can block other transactions but cause disk access.
ru: Для полной гарантии сериализуемости в <productname>PostgreSQL</productname> применяются <firstterm>предикатные блокировки</firstterm>, то есть блокировки, позволяющие определить, когда запись могла бы повлиять на результат предыдущего чтения параллельной транзакции, если бы эта запись выполнялась сначала. В <productname>PostgreSQL</productname> эти блокировки не приводят к фактическим блокировкам данным и следовательно никоим образом <emphasis>не</emphasis> могут повлечь взаимоблокировки транзакций. Они помогают выявить и отметить зависимости между параллельными транзакциями уровня Serializable, которые в определённых сочетаниях могут приводить к аномалиям сериализации. Транзакции Read Committed или Repeatable Read для обеспечения целостности данных, напротив, должны либо блокировать таблицы целиком, что помешает пользователям обращаться к этим таблицам, либо применять <literal>SELECT FOR UPDATE</literal> или <literal>SELECT FOR SHARE</literal>, что не только заблокирует другие транзакции, но и создаст дополнительную нагрузку на диск.

source: Predicate locks in <productname>PostgreSQL</productname>, like in most other database systems, are based on data actually accessed by a transaction. These will show up in the <link linkend="view-pg-locks"><structname>pg_locks</structname></link> system view with a <literal>mode</literal> of <literal>SIReadLock</literal>. The particular locks acquired during execution of a query will depend on the plan used by the query, and multiple finer-grained locks (e.g., tuple locks) may be combined into fewer coarser-grained locks (e.g., page locks) during the course of the transaction to prevent exhaustion of the memory used to track the locks. A <literal>READ ONLY</literal> transaction may be able to release its SIRead locks before completion, if it detects that no conflicts can still occur which could lead to a serialization anomaly. In fact, <literal>READ ONLY</literal> transactions will often be able to establish that fact at startup and avoid taking any predicate locks. If you explicitly request a <literal>SERIALIZABLE READ ONLY DEFERRABLE</literal> transaction, it will block until it can establish this fact. (This is the <emphasis>only</emphasis> case where Serializable transactions block but Repeatable Read transactions don't.) On the other hand, SIRead locks often need to be kept past transaction commit, until overlapping read write transactions complete.
ru: Предикатные блокировки в <productname>PostgreSQL</productname>, как и в большинстве других СУБД, устанавливаются для данных, фактически используемых в транзакции. Они отображаются в системном представлении <link linkend="view-pg-locks"><structname>pg_locks</structname></link> со значением <literal>mode</literal> равным <literal>SIReadLock</literal>. Какие именно блокировки будут затребованы при выполнении запроса, зависит от плана запроса, при этом детализированные блокировки (например, блокировки строк) могут объединяться в более общие (например, в блокировки страниц) в процессе транзакции для экономии памяти, расходуемой для отслеживания блокировок. Транзакция <literal>READ ONLY</literal> может даже освободить свои блокировки SIRead до завершения, если обнаруживается, что конфликты, которые могли бы привести к аномалии сериализации, исключены. На самом деле для транзакций <literal>READ ONLY</literal> этот факт чаще всего устанавливается в самом начале, так что они обходятся без предикатных блокировок. Если же вы явно запросите транзакцию <literal>SERIALIZABLE READ ONLY DEFERRABLE</literal>, она будет заблокирована до тех пор, пока не сможет установить этот факт. (Это <emphasis>единственный</emphasis> случай, когда транзакции уровня Serializable блокируются, а транзакции Repeatable Read &mdash; нет.) С другой стороны, блокировки SIRead часто должны сохраняться и после фиксирования транзакции, пока не будут завершены другие, наложившиеся на неё транзакции.
