Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/mvcc.po
Languages: ru

source: It is very difficult to enforce business rules regarding data integrity using Read Committed transactions because the view of the data is shifting with each statement, and even a single statement may not restrict itself to the statement's snapshot if a write conflict occurs.
ru: Используя транзакции Read Committed, очень сложно обеспечить целостность данных с точки зрения бизнес-логики, так как представление данных смещается с каждым оператором и даже один оператор может не ограничиваться своим снимком состояния в случае конфликта записи.

source: While a Repeatable Read transaction has a stable view of the data throughout its execution, there is a subtle issue with using <acronym>MVCC</acronym> snapshots for data consistency checks, involving something known as <firstterm>read/write conflicts</firstterm>. If one transaction writes data and a concurrent transaction attempts to read the same data (whether before or after the write), it cannot see the work of the other transaction. The reader then appears to have executed first regardless of which started first or which committed first. If that is as far as it goes, there is no problem, but if the reader also writes data which is read by a concurrent transaction there is now a transaction which appears to have run before either of the previously mentioned transactions. If the transaction which appears to have executed last actually commits first, it is very easy for a cycle to appear in a graph of the order of execution of the transactions. When such a cycle appears, integrity checks will not work correctly without some help.
ru: Хотя транзакция Repeatable Read получает стабильное представление данных в процессе выполнения, с использованием снимков <acronym>MVCC</acronym> для проверки целостности данных всё же связаны тонкие моменты, включая так называемые <firstterm>конфликты чтения/записи</firstterm>. Если одна транзакция записывает данные, а другая в это же время пытается их прочитать (до или после записи), она не может увидеть результат работы первой. В таком случае создаётся впечатление, что читающая транзакция выполняется первой вне зависимости от того, какая из них была начата или зафиксирована раньше. Если этим всё и ограничивается, нет никаких проблем, но если читающая транзакция также пишет данные, которые читает параллельная транзакция, получается, что теперь эта транзакция будет исполняться, как будто она запущена перед другими вышеупомянутыми. Если же транзакция, которая должна исполняться как последняя, на самом деле зафиксирована первой, в графе упорядоченных транзакций легко может возникнуть цикл. И когда он возникает, проверки целостности не будут работать правильно без дополнительных мер.

source: As mentioned in <xref linkend="xact-serializable"/>, Serializable transactions are just Repeatable Read transactions which add nonblocking monitoring for dangerous patterns of read/write conflicts. When a pattern is detected which could cause a cycle in the apparent order of execution, one of the transactions involved is rolled back to break the cycle.
ru: Как было сказано в <xref remap="6" linkend="xact-serializable"/>, сериализуемые транзакции представляют собой те же транзакции Repeatable Read, но дополненные неблокирующим механизмом отслеживания опасных условий конфликтов чтения/записи. Когда выявляется условие, приводящее к циклу в порядке транзакций, одна из этих транзакций откатывается и этот цикл таким образом разрывается.

source: Enforcing Consistency With Serializable Transactions
ru: Обеспечение согласованности в сериализуемых транзакциях

source: If the Serializable transaction isolation level is used for all writes and for all reads which need a consistent view of the data, no other effort is required to ensure consistency. Software from other environments which is written to use serializable transactions to ensure consistency should <quote>just work</quote> in this regard in <productname>PostgreSQL</productname>.
ru: Если для всех операций чтения и записи, нуждающихся в согласованном представлении данных, используются транзакции уровня изоляции Serializable, это обеспечивает необходимую согласованность без дополнительных усилий. Приложения из других окружений, применяющие сериализуемые транзакции для обеспечения целостности, в <productname>PostgreSQL</productname> в этом смысле будут <quote>просто работать</quote>.

source: When using this technique, it will avoid creating an unnecessary burden for application programmers if the application software goes through a framework which automatically retries transactions which are rolled back with a serialization failure. It may be a good idea to set <literal>default_transaction_isolation</literal> to <literal>serializable</literal>. It would also be wise to take some action to ensure that no other transaction isolation level is used, either inadvertently or to subvert integrity checks, through checks of the transaction isolation level in triggers.
ru: Применение этого подхода избавляет программистов приложений от лишних сложностей, если приложение использует инфраструктуру, которая автоматически повторяет транзакции в случае отката из-за сбоев сериализации. Возможно, <literal>serializable</literal> стоит даже установить в качестве уровня изоляции по умолчанию (<literal>default_transaction_isolation</literal>). Также имеет смысл принять меры для предотвращения использования других уровней изоляции, непреднамеренного или с целью обойти проверки целостности, например проверять уровень изоляции в триггерах.

source: See <xref linkend="xact-serializable"/> for performance suggestions.
ru: Рекомендации по увеличению быстродействия приведены в <xref remap="6" linkend="xact-serializable"/>.

source: This level of integrity protection using Serializable transactions does not yet extend to hot standby mode (<xref linkend="hot-standby"/>). Because of that, those using hot standby may want to use Repeatable Read and explicit locking on the master.
ru: Защита целостности с применением сериализуемых транзакций пока ещё не поддерживается в режиме горячего резерва (<xref linkend="hot-standby"/>). Поэтому там, где применяется горячий резерв, следует использовать уровень Repeatable Read и явные блокировки на главном сервере.

source: Enforcing Consistency With Explicit Blocking Locks
ru: Применение явных блокировок для обеспечения согласованности

source: When non-serializable writes are possible, to ensure the current validity of a row and protect it against concurrent updates one must use <command>SELECT FOR UPDATE</command>, <command>SELECT FOR SHARE</command>, or an appropriate <command>LOCK TABLE</command> statement. (<command>SELECT FOR UPDATE</command> and <command>SELECT FOR SHARE</command> lock just the returned rows against concurrent updates, while <command>LOCK TABLE</command> locks the whole table.) This should be taken into account when porting applications to <productname>PostgreSQL</productname> from other environments.
ru: Когда возможны несериализуемые операции записи, для обеспечения целостности строк и защиты от одновременных изменений, следует использовать <command>SELECT FOR UPDATE</command>, <command>SELECT FOR SHARE</command> или соответствующий оператор <command>LOCK TABLE</command>. (<command>SELECT FOR UPDATE</command> и <command>SELECT FOR SHARE</command> защищают от параллельных изменений только возвращаемые строки, тогда как <command>LOCK TABLE</command> блокирует всю таблицу.) Это следует учитывать, перенося в <productname>PostgreSQL</productname> приложения из других СУБД.

source: Also of note to those converting from other environments is the fact that <command>SELECT FOR UPDATE</command> does not ensure that a concurrent transaction will not update or delete a selected row. To do that in <productname>PostgreSQL</productname> you must actually update the row, even if no values need to be changed. <command>SELECT FOR UPDATE</command> <emphasis>temporarily blocks</emphasis> other transactions from acquiring the same lock or executing an <command>UPDATE</command> or <command>DELETE</command> which would affect the locked row, but once the transaction holding this lock commits or rolls back, a blocked transaction will proceed with the conflicting operation unless an actual <command>UPDATE</command> of the row was performed while the lock was held.
ru: Мигрируя в <productname>PostgreSQL</productname> из других СУБД также следует учитывать, что команда <command>SELECT FOR UPDATE</command> сама по себе не гарантирует, что параллельная транзакция не изменит или не удалит выбранную строку. Для получения такой гарантии в <productname>PostgreSQL</productname> нужно именно изменить эту строку, даже если никакие значения в ней менять не требуется. <command>SELECT FOR UPDATE</command> <emphasis>временно блокирует</emphasis> другие транзакции, не давая им получить ту же блокировку или выполнить команды <command>UPDATE</command> или <command>DELETE</command>, которые бы повлияли на заблокированную строку, но как только транзакция, владеющая этой блокировкой, фиксируется или откатывается, заблокированная транзакция сможет выполнить конфликтующую операцию, если только для данной строки действительно не был выполнен <command>UPDATE</command>, пока транзакция владела блокировкой.

source: Global validity checks require extra thought under non-serializable <acronym>MVCC</acronym>. For example, a banking application might wish to check that the sum of all credits in one table equals the sum of debits in another table, when both tables are being actively updated. Comparing the results of two successive <literal>SELECT sum(...)</literal> commands will not work reliably in Read Committed mode, since the second query will likely include the results of transactions not counted by the first. Doing the two sums in a single repeatable read transaction will give an accurate picture of only the effects of transactions that committed before the repeatable read transaction started &mdash; but one might legitimately wonder whether the answer is still relevant by the time it is delivered. If the repeatable read transaction itself applied some changes before trying to make the consistency check, the usefulness of the check becomes even more debatable, since now it includes some but not all post-transaction-start changes. In such cases a careful person might wish to lock all tables needed for the check, in order to get an indisputable picture of current reality. A <literal>SHARE</literal> mode (or higher) lock guarantees that there are no uncommitted changes in the locked table, other than those of the current transaction.
ru: Реализация глобальной целостности с использованием несериализуемых транзакций <acronym>MVCC</acronym> требует более вдумчивого подхода. Например, банковскому приложению может потребоваться проверить, равняется ли сумма всех расходов в одной таблице сумме приходов в другой, при том, что обе таблицы активно изменяются. Просто сравнивать результаты двух успешных последовательных команд <literal>SELECT sum(...)</literal> в режиме Read Committed нельзя, так как вторая команда может захватить результаты транзакций, пропущенных первой. Подсчитывая суммы в одной транзакции Repeatable Read, можно получить точную картину только для транзакций, которые были зафиксированы до начала данной, но при этом может возникнуть законный вопрос &mdash; будет ли этот результат актуален тогда, когда он будет выдан. Если транзакция Repeatable Read сама вносит какие-то изменения, прежде чем проверять равенство сумм, полезность этой проверки становится ещё более сомнительной, так как при проверке будут учитываться некоторые, но не все изменения, произошедшие после начала транзакции. В таких случаях предусмотрительный разработчик может заблокировать все таблицы, задействованные в проверке, чтобы получить картину действительности, не вызывающую сомнений. Для этого применяется блокировка <literal>SHARE</literal> (или более строгая), которая гарантирует, что в заблокированной таблице не будет незафиксированных изменений, за исключением тех, что внесла текущая транзакция.

source: Note also that if one is relying on explicit locking to prevent concurrent changes, one should either use Read Committed mode, or in Repeatable Read mode be careful to obtain locks before performing queries. A lock obtained by a repeatable read transaction guarantees that no other transactions modifying the table are still running, but if the snapshot seen by the transaction predates obtaining the lock, it might predate some now-committed changes in the table. A repeatable read transaction's snapshot is actually frozen at the start of its first query or data-modification command (<literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal>, or <literal>DELETE</literal>), so it is possible to obtain locks explicitly before the snapshot is frozen.
ru: Также заметьте, что, применяя явные блокировки для предотвращения параллельных операций записи, следует использовать либо режим Read Committed, либо в режиме Repeatable Read обязательно получать блокировки прежде, чем выполнять запросы. Блокировка, получаемая транзакцией Repeatable Read, гарантирует, что никакая другая транзакция, изменяющая таблицу, не выполняется, но если снимок состояния, полученный транзакцией, предшествует блокировке, он может не включать на данный момент уже зафиксированные изменения. Снимок состояния в транзакции Repeatable Read создаётся фактически на момент начала первой команды выборки или изменения данных (<literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal> или <literal>DELETE</literal>), так что получить явные блокировки можно до того, как он будет сформирован.

source: Caveats
ru: Ограничения

source: Some DDL commands, currently only <xref linkend="sql-truncate"/> and the table-rewriting forms of <xref linkend="sql-altertable"/>, are not MVCC-safe. This means that after the truncation or rewrite commits, the table will appear empty to concurrent transactions, if they are using a snapshot taken before the DDL command committed. This will only be an issue for a transaction that did not access the table in question before the DDL command started &mdash; any transaction that has done so would hold at least an <literal>ACCESS SHARE</literal> table lock, which would block the DDL command until that transaction completes. So these commands will not cause any apparent inconsistency in the table contents for successive queries on the target table, but they could cause visible inconsistency between the contents of the target table and other tables in the database.
ru: Некоторые команды DDL, в настоящее время это <xref linkend="sql-truncate"/> и формы <xref linkend="sql-altertable"/>, перезаписывающие таблицу, не являются безопасными с точки зрения MVCC. Это значит, что после фиксации усечения или перезаписи таблица окажется пустой для всех параллельных транзакций, если они работают со снимком, полученным перед фиксацией такой команды DDL. Это может проявиться только в транзакции, которая не обращалась к таблице до момента начала команды DDL &mdash; любая транзакция, которая обращалась к ней раньше, получила бы как минимум блокировку <literal>ACCESS SHARE</literal>, которая заблокировала бы эту команду DDL до завершения транзакции. Поэтому такие команды не приводят ни к каким видимым несоответствиям с содержимым таблицы при последовательных запросах к целевой таблице, хотя возможно видимое несоответствие между содержимым целевой таблицы и другими таблицами в базе данных.

source: Support for the Serializable transaction isolation level has not yet been added to Hot Standby replication targets (described in <xref linkend="hot-standby"/>). The strictest isolation level currently supported in hot standby mode is Repeatable Read. While performing all permanent database writes within Serializable transactions on the master will ensure that all standbys will eventually reach a consistent state, a Repeatable Read transaction run on the standby can sometimes see a transient state that is inconsistent with any serial execution of the transactions on the master.
ru: Поддержка уровня изоляции Serializable ещё не реализована для целевых серверов горячего резерва (они описываются в <xref remap="6" linkend="hot-standby"/>). На данный момент самый строгий уровень изоляции, поддерживаемый в режиме горячего резерва, это Repeatable Read. Хотя и тогда, когда главный сервер выполняет запись в транзакциях Serializable, все резервные серверы в итоге достигают согласованного состояния, но транзакция Repeatable Read на резервном сервере иногда может увидеть промежуточное состояние, не соответствующее результату последовательного выполнения транзакций на главном сервере.

source: Locking and Indexes
ru: Блокировки и индексы

source: <primary>index</primary> <secondary>locks</secondary>
ru: <primary>индексы</primary> <secondary>блокировки</secondary>

source: B-tree, <acronym>GiST</acronym> and <acronym>SP-GiST</acronym> indexes
ru: Индексы типа B-дерево, <acronym>GiST</acronym> и <acronym>SP-GiST</acronym>

source: Short-term share/exclusive page-level locks are used for read/write access. Locks are released immediately after each index row is fetched or inserted. These index types provide the highest concurrency without deadlock conditions.
ru: Для управления чтением/записью используются кратковременные блокировки на уровне страницы, исключительные и разделяемые. Блокировки освобождаются сразу после извлечения или добавления строки индекса. Эти типы индексов обеспечивают максимальное распараллеливание операций, не допуская взаимоблокировок.

source: Hash indexes
ru: Хеш-индексы

source: Share/exclusive hash-bucket-level locks are used for read/write access. Locks are released after the whole bucket is processed. Bucket-level locks provide better concurrency than index-level ones, but deadlock is possible since the locks are held longer than one index operation.
ru: Для управления чтением/записью используются блокировки на уровне групп хеша. Блокировки освобождаются после обработки всей группы. Такие блокировки с точки зрения распараллеливания лучше, чем блокировки на уровне индекса, но не исключают взаимоблокировок, так как они сохраняются дольше, чем выполняется одна операция с индексом.

source: <acronym>GIN</acronym> indexes
ru: Индексы <acronym>GIN</acronym>

source: Short-term share/exclusive page-level locks are used for read/write access. Locks are released immediately after each index row is fetched or inserted. But note that insertion of a GIN-indexed value usually produces several index key insertions per row, so GIN might do substantial work for a single value's insertion.
ru: Для управления чтением/записью используются кратковременные блокировки на уровне страницы, исключительные и разделяемые. Блокировки освобождаются сразу после извлечения или добавления строки индекса. Но заметьте, что добавление значения в поле с GIN-индексом обычно влечёт добавление нескольких ключей индекса, так что GIN может проделывать целый ряд операций для одного значения.

source: Though <productname>PostgreSQL</productname> provides nonblocking read/write access to table data, nonblocking read/write access is not currently offered for every index access method implemented in <productname>PostgreSQL</productname>. The various index types are handled as follows: <placeholder-1/>
ru: Хотя <productname>PostgreSQL</productname> обеспечивает неблокирующий доступ на чтение/запись к данным таблиц, для индексов в настоящий момент это поддерживается не в полной мере. <productname>PostgreSQL</productname> управляет доступом к различным типам индексов следующим образом: <placeholder-1/>

source: Currently, B-tree indexes offer the best performance for concurrent applications; since they also have more features than hash indexes, they are the recommended index type for concurrent applications that need to index scalar data. When dealing with non-scalar data, B-trees are not useful, and GiST, SP-GiST or GIN indexes should be used instead.
ru: В настоящее время в многопоточной среде наиболее производительны индексы-B-деревья; и так как они более функциональны, чем хеш-индексы, их рекомендуется использовать в такой среде для приложений, когда нужно индексировать скалярные данные. Если же нужно индексировать не скалярные данные, B-деревья не подходят, и вместо них следует использовать индексы GiST, SP-GiST или GIN.
