Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/mvcc.po
Languages: ru

source: In addition to table-level locks, there are row-level locks, which are listed as below with the contexts in which they are used automatically by <productname>PostgreSQL</productname>. See <xref linkend="row-lock-compatibility"/> for a complete table of row-level lock conflicts. Note that a transaction can hold conflicting locks on the same row, even in different subtransactions; but other than that, two transactions can never hold conflicting locks on the same row. Row-level locks do not affect data querying; they block only <emphasis>writers and lockers</emphasis> to the same row.
ru: В дополнение к блокировкам на уровне таблицы, существуют блокировки на уровне строк, перечисленные ниже с контекстами, где <productname>PostgreSQL</productname> применяет их по умолчанию. Полный перечень конфликтов блокировок на уровне строк приведён в <xref remap="6" linkend="row-lock-compatibility"/>. Заметьте, что одна транзакция может владеть несколькими конфликтующими блокировками одной строки, даже в разных подтранзакциях; но две разных транзакции никогда не получат конфликтующие блокировки одной и той же строки. Блокировки на уровне строк блокируют только <emphasis>запись в определённые строки</emphasis>, но никак не влияют на выборку.

source: Row-level Lock Modes
ru: Режимы блокировки на уровне строк

source: <literal>FOR UPDATE</literal> causes the rows retrieved by the <command>SELECT</command> statement to be locked as though for update. This prevents them from being locked, modified or deleted by other transactions until the current transaction ends. That is, other transactions that attempt <command>UPDATE</command>, <command>DELETE</command>, <command>SELECT FOR UPDATE</command>, <command>SELECT FOR NO KEY UPDATE</command>, <command>SELECT FOR SHARE</command> or <command>SELECT FOR KEY SHARE</command> of these rows will be blocked until the current transaction ends; conversely, <command>SELECT FOR UPDATE</command> will wait for a concurrent transaction that has run any of those commands on the same row, and will then lock and return the updated row (or no row, if the row was deleted). Within a <literal>REPEATABLE READ</literal> or <literal>SERIALIZABLE</literal> transaction, however, an error will be thrown if a row to be locked has changed since the transaction started. For further discussion see <xref linkend="applevel-consistency"/>.
ru: В режиме <literal>FOR UPDATE</literal> строки, выданные оператором <command>SELECT</command>, блокируются как для изменения. При этом они защищаются от блокировки, изменения и удаления другими транзакциями до завершения текущей. То есть другие транзакции, пытающиеся выполнить <command>UPDATE</command>, <command>DELETE</command>, <command>SELECT FOR UPDATE</command>, <command>SELECT FOR NO KEY UPDATE</command>, <command>SELECT FOR SHARE</command> или <command>SELECT FOR KEY SHARE</command> с этими строками, будут заблокированы до завершения текущей транзакции; и наоборот, команда <command>SELECT FOR UPDATE</command> будет ожидать окончания параллельной транзакции, в которой выполнилась одна из этих команд с той же строкой, а затем установит блокировку и вернёт изменённую строку (или не вернёт, если она была удалена). Однако в транзакции <literal>REPEATABLE READ</literal> или <literal>SERIALIZABLE</literal> возникнет ошибка, если блокируемая строка изменилась с момента начала транзакции. Подробнее это обсуждается в <xref remap="6" linkend="applevel-consistency"/>.

source: The <literal>FOR UPDATE</literal> lock mode is also acquired by any <command>DELETE</command> on a row, and also by an <command>UPDATE</command> that modifies the values on certain columns. Currently, the set of columns considered for the <command>UPDATE</command> case are those that have a unique index on them that can be used in a foreign key (so partial indexes and expressional indexes are not considered), but this may change in the future.
ru: Режим блокировки <literal>FOR UPDATE</literal> также запрашивается на уровне строки любой командой <command>DELETE</command> и командой <command>UPDATE</command>, изменяющей значения определённых столбцов. В настоящее время блокировка с <command>UPDATE</command> касается столбцов, по которым создан уникальный индекс, применимый в качестве внешнего ключа (так что на частичные индексы и индексы выражений это не распространяется), но в будущем это может поменяться.

source: Behaves similarly to <literal>FOR UPDATE</literal>, except that the lock acquired is weaker: this lock will not block <literal>SELECT FOR KEY SHARE</literal> commands that attempt to acquire a lock on the same rows. This lock mode is also acquired by any <command>UPDATE</command> that does not acquire a <literal>FOR UPDATE</literal> lock.
ru: Действует подобно <literal>FOR UPDATE</literal>, но запрашиваемая в этом режиме блокировка слабее: она не будет блокировать команды <literal>SELECT FOR KEY SHARE</literal>, пытающиеся получить блокировку тех же строк. Этот режим блокировки также запрашивается любой командой <command>UPDATE</command>, которая не требует блокировки <literal>FOR UPDATE</literal>.

source: Behaves similarly to <literal>FOR NO KEY UPDATE</literal>, except that it acquires a shared lock rather than exclusive lock on each retrieved row. A shared lock blocks other transactions from performing <command>UPDATE</command>, <command>DELETE</command>, <command>SELECT FOR UPDATE</command> or <command>SELECT FOR NO KEY UPDATE</command> on these rows, but it does not prevent them from performing <command>SELECT FOR SHARE</command> or <command>SELECT FOR KEY SHARE</command>.
ru: Действует подобно <literal>FOR NO KEY UPDATE</literal>, за исключением того, что для каждой из полученных строк запрашивается разделяемая, а не исключительная блокировка. Разделяемая блокировка не позволяет другим транзакциям выполнять с этими строками <command>UPDATE</command>, <command>DELETE</command>, <command>SELECT FOR UPDATE</command> или <command>SELECT FOR NO KEY UPDATE</command>, но допускает <command>SELECT FOR SHARE</command> и <command>SELECT FOR KEY SHARE</command>.

source: Behaves similarly to <literal>FOR SHARE</literal>, except that the lock is weaker: <literal>SELECT FOR UPDATE</literal> is blocked, but not <literal>SELECT FOR NO KEY UPDATE</literal>. A key-shared lock blocks other transactions from performing <command>DELETE</command> or any <command>UPDATE</command> that changes the key values, but not other <command>UPDATE</command>, and neither does it prevent <command>SELECT FOR NO KEY UPDATE</command>, <command>SELECT FOR SHARE</command>, or <command>SELECT FOR KEY SHARE</command>.
ru: Действует подобно <literal>FOR SHARE</literal>, но устанавливает более слабую блокировку: блокируется <literal>SELECT FOR UPDATE</literal>, но не <literal>SELECT FOR NO KEY UPDATE</literal>. Блокировка разделяемого ключа не позволяет другим транзакциям выполнять команды <command>DELETE</command> и <command>UPDATE</command>, только если они меняют значение ключа (но не другие <command>UPDATE</command>), и при этом допускает выполнение команд <command>SELECT FOR NO KEY UPDATE</command>, <command>SELECT FOR SHARE</command> и <command>SELECT FOR KEY SHARE</command>.

source: <productname>PostgreSQL</productname> doesn't remember any information about modified rows in memory, so there is no limit on the number of rows locked at one time. However, locking a row might cause a disk write, e.g., <command>SELECT FOR UPDATE</command> modifies selected rows to mark them locked, and so will result in disk writes.
ru: <productname>PostgreSQL</productname> не держит информацию об изменённых строках в памяти, так что никаких ограничений на число блокируемых строк нет. Однако блокировка строки может повлечь запись на диск, например, если <command>SELECT FOR UPDATE</command> изменяет выбранные строки, чтобы заблокировать их, при этом происходит запись на диск.

source: Conflicting Row-level Locks
ru: Конфликтующие блокировки на уровне строк

source: Page-level Locks
ru: Блокировки на уровне страниц

source: In addition to table and row locks, page-level share/exclusive locks are used to control read/write access to table pages in the shared buffer pool. These locks are released immediately after a row is fetched or updated. Application developers normally need not be concerned with page-level locks, but they are mentioned here for completeness.
ru: В дополнение к блокировкам на уровне таблицы и строк, для управления доступом к страницам таблиц в общих буферах используются блокировки на уровне страниц, исключительные и разделяемые. Эти блокировки освобождаются немедленно после выборки или изменения строк. Разработчикам приложений обычно можно не задумываться о блокировках страниц, здесь они упоминаются только для полноты картины.

source: Deadlocks
ru: Взаимоблокировки

source: <primary>deadlock</primary>
ru: <primary>взаимоблокировка</primary>

source: The use of explicit locking can increase the likelihood of <firstterm>deadlocks</firstterm>, wherein two (or more) transactions each hold locks that the other wants. For example, if transaction 1 acquires an exclusive lock on table A and then tries to acquire an exclusive lock on table B, while transaction 2 has already exclusive-locked table B and now wants an exclusive lock on table A, then neither one can proceed. <productname>PostgreSQL</productname> automatically detects deadlock situations and resolves them by aborting one of the transactions involved, allowing the other(s) to complete. (Exactly which transaction will be aborted is difficult to predict and should not be relied upon.)
ru: Частое применение явных блокировок может увеличить вероятность <firstterm>взаимоблокировок</firstterm>, то есть ситуаций, когда две (или более) транзакций держат блокировки так, что взаимно блокируют друг друга. Например, если транзакция 1 получает исключительную блокировку таблицы A, а затем пытается получить исключительную блокировку таблицы B, которую до этого получила транзакция 2, в данный момент требующая исключительную блокировку таблицы A, ни одна из транзакций не сможет продолжить работу. <productname>PostgreSQL</productname> автоматически выявляет такие ситуации и разрешает их, прерывая одну из сцепившихся транзакций и тем самым позволяя другой (другим) продолжить работу. (Какая именно транзакция будет прервана, обычно сложно предсказать, так что рассчитывать на определённое поведение не следует.)

source: Note that deadlocks can also occur as the result of row-level locks (and thus, they can occur even if explicit locking is not used). Consider the case in which two concurrent transactions modify a table. The first transaction executes: <screen> UPDATE accounts SET balance = balance + 100.00 WHERE acctnum = 11111; </screen> This acquires a row-level lock on the row with the specified account number. Then, the second transaction executes: <screen> UPDATE accounts SET balance = balance + 100.00 WHERE acctnum = 22222; UPDATE accounts SET balance = balance - 100.00 WHERE acctnum = 11111; </screen> The first <command>UPDATE</command> statement successfully acquires a row-level lock on the specified row, so it succeeds in updating that row. However, the second <command>UPDATE</command> statement finds that the row it is attempting to update has already been locked, so it waits for the transaction that acquired the lock to complete. Transaction two is now waiting on transaction one to complete before it continues execution. Now, transaction one executes: <screen> UPDATE accounts SET balance = balance - 100.00 WHERE acctnum = 22222; </screen> Transaction one attempts to acquire a row-level lock on the specified row, but it cannot: transaction two already holds such a lock. So it waits for transaction two to complete. Thus, transaction one is blocked on transaction two, and transaction two is blocked on transaction one: a deadlock condition. <productname>PostgreSQL</productname> will detect this situation and abort one of the transactions.
ru: Заметьте, что взаимоблокировки могут вызываться и блокировками на уровне строк (таким образом, они возможны, даже если не применяются явные блокировки). Рассмотрим случай, когда две параллельных транзакции изменяют таблицу. Первая транзакция выполняет: <screen> UPDATE accounts SET balance = balance + 100.00 WHERE acctnum = 11111; </screen> При этом она получает блокировку строки с указанным номером счёта. Затем вторая транзакция выполняет: <screen> UPDATE accounts SET balance = balance + 100.00 WHERE acctnum = 22222; UPDATE accounts SET balance = balance - 100.00 WHERE acctnum = 11111; </screen> Первый оператор <command>UPDATE</command> успешно получает блокировку указанной строки и изменяет данные в ней. Однако второй оператор <command>UPDATE</command> обнаруживает, что строка, которую он пытается изменить, уже заблокирована, так что он ждёт завершения транзакции, получившей блокировку. Таким образом, вторая транзакция сможет продолжиться только после завершения первой. Теперь первая транзакция выполняет: <screen> UPDATE accounts SET balance = balance - 100.00 WHERE acctnum = 22222; </screen> Первая транзакция пытается получить блокировку заданной строки, но ей это не удаётся: эта блокировка уже принадлежит второй транзакции. Поэтому первой транзакции остаётся только ждать завершения второй. В результате первая транзакция блокируется второй, а вторая &mdash; первой: происходит взаимоблокировка. <productname>PostgreSQL</productname> выявляет эту ситуацию и прерывает одну из транзакций.

source: The best defense against deadlocks is generally to avoid them by being certain that all applications using a database acquire locks on multiple objects in a consistent order. In the example above, if both transactions had updated the rows in the same order, no deadlock would have occurred. One should also ensure that the first lock acquired on an object in a transaction is the most restrictive mode that will be needed for that object. If it is not feasible to verify this in advance, then deadlocks can be handled on-the-fly by retrying transactions that abort due to deadlocks.
ru: Обычно лучший способ предотвращения взаимоблокировок &mdash; добиться, чтобы все приложения, обращающиеся к базе данных, запрашивали блокировки нескольких объектов единообразно. В данном примере, если бы обе транзакции изменяли строки в одном порядке, взаимоблокировка бы не произошла. Блокировки в транзакции следует упорядочивать так, чтобы первой для какого-либо объекта запрашивалась наиболее ограничивающая из тех, которые для него потребуются. Если заранее обеспечить такой порядок нельзя, взаимоблокировки можно обработать по факту, повторяя прерванные транзакции.

source: So long as no deadlock situation is detected, a transaction seeking either a table-level or row-level lock will wait indefinitely for conflicting locks to be released. This means it is a bad idea for applications to hold transactions open for long periods of time (e.g., while waiting for user input).
ru: Если ситуация взаимоблокировки не будет выявлена, транзакция, ожидающая блокировки на уровне таблицы или строки, будет ждать её освобождения неограниченное время. Это означает, что приложения не должны оставлять транзакции открытыми долгое время (например, ожидая ввода пользователя).

source: Advisory Locks
ru: Рекомендательные блокировки

source: <primary>advisory lock</primary>
ru: <primary>рекомендательная блокировка</primary>

source: <primary>lock</primary> <secondary>advisory</secondary>
ru: <primary>блокировка</primary> <secondary>рекомендательная</secondary>

source: <productname>PostgreSQL</productname> provides a means for creating locks that have application-defined meanings. These are called <firstterm>advisory locks</firstterm>, because the system does not enforce their use &mdash; it is up to the application to use them correctly. Advisory locks can be useful for locking strategies that are an awkward fit for the MVCC model. For example, a common use of advisory locks is to emulate pessimistic locking strategies typical of so-called <quote>flat file</quote> data management systems. While a flag stored in a table could be used for the same purpose, advisory locks are faster, avoid table bloat, and are automatically cleaned up by the server at the end of the session.
ru: <productname>PostgreSQL</productname> также имеет средства создания блокировок, смысл которых определяют сами приложения. Такие блокировки называются <firstterm>рекомендательными</firstterm>, так как система не форсирует их использование &mdash; правильно их использовать должно само приложение. Рекомендательные блокировки бывают полезны для реализаций стратегий блокирования, плохо вписывающихся в модель MVCC. Например, рекомендательные блокировки часто применяются для исполнения стратегии пессимистичной блокировки, типичной для систем управления данными <quote>плоский файл</quote>. Хотя для этого можно использовать и дополнительные флаги в таблицах, рекомендательные блокировки работают быстрее, не нагружают таблицы и автоматически ликвидируется сервером в конце сеанса.

source: There are two ways to acquire an advisory lock in <productname>PostgreSQL</productname>: at session level or at transaction level. Once acquired at session level, an advisory lock is held until explicitly released or the session ends. Unlike standard lock requests, session-level advisory lock requests do not honor transaction semantics: a lock acquired during a transaction that is later rolled back will still be held following the rollback, and likewise an unlock is effective even if the calling transaction fails later. A lock can be acquired multiple times by its owning process; for each completed lock request there must be a corresponding unlock request before the lock is actually released. Transaction-level lock requests, on the other hand, behave more like regular lock requests: they are automatically released at the end of the transaction, and there is no explicit unlock operation. This behavior is often more convenient than the session-level behavior for short-term usage of an advisory lock. Session-level and transaction-level lock requests for the same advisory lock identifier will block each other in the expected way. If a session already holds a given advisory lock, additional requests by it will always succeed, even if other sessions are awaiting the lock; this statement is true regardless of whether the existing lock hold and new request are at session level or transaction level.
ru: В <productname>PostgreSQL</productname> есть два варианта получить рекомендательные блокировки: на уровне сеанса и на уровне транзакции. Рекомендательная блокировка, полученная на уровне сеанса, удерживается, пока она не будет явно освобождена, или до конца сеанса. В отличие от стандартных рекомендательные блокировки уровня сеанса нарушают логику транзакций &mdash; блокировка, полученная в транзакции, даже если произойдёт откат этой транзакции, будет сохраняться в сеансе; аналогично, освобождение блокировки остаётся в силе, даже если транзакция, в которой оно было выполнено, позже прерывается. Вызывающий процесс может запросить блокировку несколько раз; при этом каждому запросу блокировки должен соответствовать запрос освобождения, чтобы она была действительно освобождена. Рекомендательные блокировки на уровне транзакций, напротив, во многом похожи на обычные блокировки: они автоматически освобождаются в конце транзакций и не требуют явного освобождения. Для кратковременного применения блокировок это поведение часто более уместно, чем поведение рекомендательных блокировок на уровне сеанса. Запросы рекомендательных блокировок одного идентификатора на уровне сеанса и на уровне транзакции будут блокировать друг друга вполне предсказуемым образом. Если сеанс уже владеет данной рекомендуемой блокировкой, дополнительные запросы её в том же сеансе будут всегда успешны, даже если её ожидают другие сеансы. Это утверждение справедливо вне зависимости от того, на каком уровне (сеанса или транзакции) установлены или запрашиваются новые блокировки.

source: Like all locks in <productname>PostgreSQL</productname>, a complete list of advisory locks currently held by any session can be found in the <link linkend="view-pg-locks"><structname>pg_locks</structname></link> system view.
ru: Как и остальные блокировки в <productname>PostgreSQL</productname>, все рекомендательные блокировки, связанные с любыми сеансами, можно просмотреть в системном представлении <link linkend="view-pg-locks"><structname>pg_locks</structname></link>.

source: Both advisory locks and regular locks are stored in a shared memory pool whose size is defined by the configuration variables <xref linkend="guc-max-locks-per-transaction"/> and <xref linkend="guc-max-connections"/>. Care must be taken not to exhaust this memory or the server will be unable to grant any locks at all. This imposes an upper limit on the number of advisory locks grantable by the server, typically in the tens to hundreds of thousands depending on how the server is configured.
ru: И рекомендательные, и обычные блокировки сохраняются в области общей памяти, размер которой определяется параметрами конфигурации <xref linkend="guc-max-locks-per-transaction"/> и <xref linkend="guc-max-connections"/>. Важно, чтобы этой памяти было достаточно, так как в противном случае сервер не сможет выдать никакую блокировку. Таким образом, число рекомендуемых блокировок, которые может выдать сервер, ограничивается обычно десятками или сотнями тысяч в зависимости от конфигурации сервера.

source: In certain cases using advisory locking methods, especially in queries involving explicit ordering and <literal>LIMIT</literal> clauses, care must be taken to control the locks acquired because of the order in which SQL expressions are evaluated. For example: <screen> SELECT pg_advisory_lock(id) FROM foo WHERE id = 12345; -- ok SELECT pg_advisory_lock(id) FROM foo WHERE id &gt; 12345 LIMIT 100; -- danger! SELECT pg_advisory_lock(q.id) FROM ( SELECT id FROM foo WHERE id &gt; 12345 LIMIT 100 ) q; -- ok </screen> In the above queries, the second form is dangerous because the <literal>LIMIT</literal> is not guaranteed to be applied before the locking function is executed. This might cause some locks to be acquired that the application was not expecting, and hence would fail to release (until it ends the session). From the point of view of the application, such locks would be dangling, although still viewable in <structname>pg_locks</structname>.
ru: В определённых случаях при использовании рекомендательных блокировок, особенно в запросах с явными указаниями <literal>ORDER BY</literal> и <literal>LIMIT</literal>, важно учитывать, что получаемые блокировки могут зависеть от порядка вычисления SQL-выражений. Например: <screen> SELECT pg_advisory_lock(id) FROM foo WHERE id = 12345; -- ok SELECT pg_advisory_lock(id) FROM foo WHERE id &gt; 12345 LIMIT 100; -- опасно! SELECT pg_advisory_lock(q.id) FROM ( SELECT id FROM foo WHERE id &gt; 12345 LIMIT 100 ) q; -- ok </screen> В этом примере второй вариант опасен, так как <literal>LIMIT</literal> не обязательно будет применяться перед вызовом функции блокировки. В результате приложение может получить блокировки, на которые оно не рассчитывает и которые оно не сможет освободить (до завершения сеанса). С точки зрения приложения такие блокировки окажутся в подвешенном состоянии, хотя они и будут отображаться в <structname>pg_locks</structname>.

source: The functions provided to manipulate advisory locks are described in <xref linkend="functions-advisory-locks"/>.
ru: Функции, предназначенные для работы с рекомендательными блокировками, описаны в <xref remap="6" linkend="functions-advisory-locks"/>.

source: Data Consistency Checks at the Application Level
ru: Проверки целостности данных на уровне приложения
