Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/mvcc.po
Languages: ru

source: Concurrency Control
ru: Управление конкурентным доступом

source: <primary>concurrency</primary>
ru: <primary>конкурентный доступ</primary>

source: This chapter describes the behavior of the <productname>PostgreSQL</productname> database system when two or more sessions try to access the same data at the same time. The goals in that situation are to allow efficient access for all sessions while maintaining strict data integrity. Every developer of database applications should be familiar with the topics covered in this chapter.
ru: В этой главе описывается поведение СУБД <productname>PostgreSQL</productname> в ситуациях, когда два или более сеансов пытаются одновременно обратиться к одним и тем же данным. В таких ситуациях важно, чтобы все сеансы могли эффективно работать с данными, и при этом сохранялась целостность данных. Обсуждаемые в этой главе темы заслуживают внимания всех разработчиков баз данных.

source: Introduction
ru: Введение

source: <primary>Multiversion Concurrency Control</primary>
ru: <primary>Многоверсионное управление конкурентным доступом</primary>

source: <primary>Serializable Snapshot Isolation</primary>
ru: <primary>Сериализуемая изоляция снимков</primary>

source: <productname>PostgreSQL</productname> provides a rich set of tools for developers to manage concurrent access to data. Internally, data consistency is maintained by using a multiversion model (Multiversion Concurrency Control, <acronym>MVCC</acronym>). This means that each SQL statement sees a snapshot of data (a <firstterm>database version</firstterm>) as it was some time ago, regardless of the current state of the underlying data. This prevents statements from viewing inconsistent data produced by concurrent transactions performing updates on the same data rows, providing <firstterm>transaction isolation</firstterm> for each database session. <acronym>MVCC</acronym>, by eschewing the locking methodologies of traditional database systems, minimizes lock contention in order to allow for reasonable performance in multiuser environments.
ru: <productname>PostgreSQL</productname> предоставляет разработчикам богатый набор средств для управления конкурентным доступом к данным. Внутри он поддерживает целостность данных, реализуя модель <acronym>MVCC</acronym> (Multiversion Concurrency Control, Многоверсионное управление конкурентным доступом). Это означает, что каждый SQL-оператор видит снимок данных (<firstterm>версию базы данных</firstterm>) на определённый момент времени, вне зависимости от текущего состояния данных. Это защищает операторы от несогласованности данных, возможной, если другие конкурирующие транзакции внесут изменения в те же строки данных, и обеспечивает тем самым <firstterm>изоляцию транзакций</firstterm> для каждого сеанса баз данных. <acronym>MVCC</acronym>, отходя от методик блокирования, принятых в традиционных СУБД, снижает уровень конфликтов блокировок и таким образом обеспечивает более высокую производительность в многопользовательской среде.

source: The main advantage of using the <acronym>MVCC</acronym> model of concurrency control rather than locking is that in <acronym>MVCC</acronym> locks acquired for querying (reading) data do not conflict with locks acquired for writing data, and so reading never blocks writing and writing never blocks reading. <productname>PostgreSQL</productname> maintains this guarantee even when providing the strictest level of transaction isolation through the use of an innovative <firstterm>Serializable Snapshot Isolation</firstterm> (<acronym>SSI</acronym>) level.
ru: Основное преимущество использования модели <acronym>MVCC</acronym> по сравнению с блокированием заключается в том, что блокировки <acronym>MVCC</acronym>, полученные для чтения данных, не конфликтуют с блокировками, полученными для записи, и поэтому чтение никогда не мешает записи, а запись чтению. <productname>PostgreSQL</productname> гарантирует это даже для самого строгого уровня изоляции транзакций, используя инновационный уровень изоляции <acronym>SSI</acronym> (<firstterm>Serializable Snapshot Isolation</firstterm>, Сериализуемая изоляция снимков).

source: Table- and row-level locking facilities are also available in <productname>PostgreSQL</productname> for applications which don't generally need full transaction isolation and prefer to explicitly manage particular points of conflict. However, proper use of <acronym>MVCC</acronym> will generally provide better performance than locks. In addition, application-defined advisory locks provide a mechanism for acquiring locks that are not tied to a single transaction.
ru: Для приложений, которым в принципе не нужна полная изоляция транзакций и которые предпочитают явно определять точки конфликтов, в <productname>PostgreSQL</productname> также есть средства блокировки на уровне таблиц и строк. Однако при правильном использовании <acronym>MVCC</acronym> обычно обеспечивает лучшую производительность, чем блокировки. Кроме этого, приложения могут использовать рекомендательные блокировки, не привязанные к какой-либо одной транзакции.

source: Transaction Isolation
ru: Изоляция транзакций

source: <primary>transaction isolation</primary>
ru: <primary>изоляция транзакций</primary>

source: The <acronym>SQL</acronym> standard defines four levels of transaction isolation. The most strict is Serializable, which is defined by the standard in a paragraph which says that any concurrent execution of a set of Serializable transactions is guaranteed to produce the same effect as running them one at a time in some order. The other three levels are defined in terms of phenomena, resulting from interaction between concurrent transactions, which must not occur at each level. The standard notes that due to the definition of Serializable, none of these phenomena are possible at that level. (This is hardly surprising -- if the effect of the transactions must be consistent with having been run one at a time, how could you see any phenomena caused by interactions?)
ru: Стандарт <acronym>SQL</acronym> определяет четыре уровня изоляции транзакций. Наиболее строгий из них &mdash; сериализуемый, определяется одним абзацем, говорящем, что при параллельном выполнении несколько сериализуемых транзакций должны гарантированно выдавать такой же результат, как если бы они запускались по очереди в некотором порядке. Остальные три уровня определяются через описания особых явлений, которые возможны при взаимодействии параллельных транзакций, но не допускаются на определённом уровне. Как отмечается в стандарте, из определения сериализуемого уровня вытекает, что на этом уровне ни одно из этих явлений не возможно. (В самом деле &mdash; если эффект транзакций должен быть тем же, что и при их выполнении по очереди, как можно было бы увидеть особые явления, связанные с другими транзакциями?)

source: <primary>dirty read</primary>
ru: <primary>&laquo;грязное&raquo; чтение</primary>

source: dirty read <placeholder-1/>
ru: &laquo;грязное&raquo; чтение<placeholder-1/>

source: A transaction reads data written by a concurrent uncommitted transaction.
ru: Транзакция читает данные, записанные параллельной незавершённой транзакцией.

source: <primary>nonrepeatable read</primary>
ru: <primary>неповторяемое чтение</primary>

source: nonrepeatable read <placeholder-1/>
ru: неповторяемое чтение<placeholder-1/>

source: A transaction re-reads data it has previously read and finds that data has been modified by another transaction (that committed since the initial read).
ru: Транзакция повторно читает те же данные, что и раньше, и обнаруживает, что они были изменены другой транзакцией (которая завершилась после первого чтения).

source: <primary>phantom read</primary>
ru: <primary>фантомное чтение</primary>

source: phantom read <placeholder-1/>
ru: фантомное чтение<placeholder-1/>

source: A transaction re-executes a query returning a set of rows that satisfy a search condition and finds that the set of rows satisfying the condition has changed due to another recently-committed transaction.
ru: Транзакция повторно выполняет запрос, возвращающий набор строк для некоторого условия, и обнаруживает, что набор строк, удовлетворяющих условию, изменился из-за транзакции, завершившейся за это время.

source: <primary>serialization anomaly</primary>
ru: <primary>аномалия сериализации</primary>

source: serialization anomaly <placeholder-1/>
ru: аномалия сериализации <placeholder-1/>

source: The result of successfully committing a group of transactions is inconsistent with all possible orderings of running those transactions one at a time.
ru: Результат успешной фиксации группы транзакций оказывается несогласованным при всевозможных вариантах исполнения этих транзакций по очереди.

source: The phenomena which are prohibited at various levels are: <placeholder-1/>
ru: Стандарт описывает следующие особые условия, недопустимые для различных уровней изоляции: <placeholder-1/>

source: <primary>transaction isolation level</primary>
ru: <primary>уровень изоляции транзакций</primary>

source: <placeholder-1/> The SQL standard and PostgreSQL-implemented transaction isolation levels are described in <xref linkend="mvcc-isolevel-table"/>.
ru: <placeholder-1/> Уровни изоляции транзакций, описанные в стандарте SQL и реализованные в PostgreSQL, описываются в <xref remap="6" linkend="mvcc-isolevel-table"/>.

source: Transaction Isolation Levels
ru: Уровни изоляции транзакций

source: Isolation Level
ru: Уровень изоляции

source: Dirty Read
ru: &laquo;Грязное&raquo; чтение

source: Nonrepeatable Read
ru: Неповторяемое чтение

source: Phantom Read
ru: Фантомное чтение

source: Serialization Anomaly
ru: Аномалия сериализации

source: Read uncommitted
ru: Read uncommited (Чтение незафиксированных данных)

source: Allowed, but not in PG
ru: Допускается, но не в PG

source: Possible
ru: Возможно

source: Read committed
ru: Read committed (Чтение зафиксированных данных)

source: Not possible
ru: Невозможно

source: Repeatable read
ru: Repeatable read (Повторяемое чтение)

source: Serializable
ru: Serializable (Сериализуемость)

source: In <productname>PostgreSQL</productname>, you can request any of the four standard transaction isolation levels, but internally only three distinct isolation levels are implemented, i.e. PostgreSQL's Read Uncommitted mode behaves like Read Committed. This is because it is the only sensible way to map the standard isolation levels to PostgreSQL's multiversion concurrency control architecture.
ru: В <productname>PostgreSQL</productname> вы можете запросить любой из четырёх уровней изоляции транзакций, однако внутри реализованы только три различных уровня, то есть режим Read Uncommitted в PostgreSQL действует как Read Committed. Причина этого в том, что только так можно сопоставить стандартные уровни изоляции с реализованной в PostgreSQL архитектурой многоверсионного управления конкурентным доступом.

source: The table also shows that PostgreSQL's Repeatable Read implementation does not allow phantom reads. Stricter behavior is permitted by the SQL standard: the four isolation levels only define which phenomena must not happen, not which phenomena <emphasis>must</emphasis> happen. The behavior of the available isolation levels is detailed in the following subsections.
ru: В этой таблице также показано, что реализация Repeatable Read в PostgreSQL не допускает фантомное чтение. Стандарт SQL допускает возможность более строгого поведения: четыре уровня изоляции определяют только, какие особые условия не должны наблюдаться, но не какие <emphasis>обязательно должны</emphasis>. Поведение имеющихся уровней изоляции подробно описывается в следующих подразделах.

source: To set the transaction isolation level of a transaction, use the command <xref linkend="sql-set-transaction"/>.
ru: Для выбора нужного уровня изоляции транзакций используется команда <xref linkend="sql-set-transaction"/>.

source: Some <productname>PostgreSQL</productname> data types and functions have special rules regarding transactional behavior. In particular, changes made to a sequence (and therefore the counter of a column declared using <type>serial</type>) are immediately visible to all other transactions and are not rolled back if the transaction that made the changes aborts. See <xref linkend="functions-sequence"/> and <xref linkend="datatype-serial"/>.
ru: Поведение некоторых функций и типов данных <productname>PostgreSQL</productname> в транзакциях подчиняется особым правилам. В частности, изменения последовательностей (и следовательно, счётчика в столбце, объявленному как <type>serial</type>) немедленно видны во всех остальных транзакциях и не откатываются назад, если выполнившая их транзакция прерывается. См. <xref remap="4" linkend="functions-sequence"/> и <xref remap="4" linkend="datatype-serial"/>.

source: Read Committed Isolation Level
ru: Уровень изоляции Read Committed

source: <primary>transaction isolation level</primary> <secondary>read committed</secondary>
ru: <primary>уровень изоляции транзакций</primary> <secondary>read committed</secondary>

source: <firstterm>Read Committed</firstterm> is the default isolation level in <productname>PostgreSQL</productname>. When a transaction uses this isolation level, a <command>SELECT</command> query (without a <literal>FOR UPDATE/SHARE</literal> clause) sees only data committed before the query began; it never sees either uncommitted data or changes committed during query execution by concurrent transactions. In effect, a <command>SELECT</command> query sees a snapshot of the database as of the instant the query begins to run. However, <command>SELECT</command> does see the effects of previous updates executed within its own transaction, even though they are not yet committed. Also note that two successive <command>SELECT</command> commands can see different data, even though they are within a single transaction, if other transactions commit changes after the first <command>SELECT</command> starts and before the second <command>SELECT</command> starts.
ru: <firstterm>Read Committed</firstterm> &mdash; уровень изоляции транзакции, выбираемый в <productname>PostgreSQL</productname> по умолчанию. В транзакции, работающей на этом уровне, запрос <command>SELECT</command> (без предложения <literal>FOR UPDATE/SHARE</literal>) видит только те данные, которые были зафиксированы до начала запроса; он никогда не увидит незафиксированных данных или изменений, внесённых в процессе выполнения запроса параллельными транзакциями. По сути запрос <command>SELECT</command> видит снимок базы данных в момент начала выполнения запроса. Однако <command>SELECT</command> видит результаты изменений, внесённых ранее в этой же транзакции, даже если они ещё не зафиксированы. Также заметьте, что два последовательных оператора <command>SELECT</command> могут видеть разные данные даже в рамках одной транзакции, если какие-то другие транзакции зафиксируют изменения после запуска первого <command>SELECT</command>, но до запуска второго.

source: <command>UPDATE</command>, <command>DELETE</command>, <command>SELECT FOR UPDATE</command>, and <command>SELECT FOR SHARE</command> commands behave the same as <command>SELECT</command> in terms of searching for target rows: they will only find target rows that were committed as of the command start time. However, such a target row might have already been updated (or deleted or locked) by another concurrent transaction by the time it is found. In this case, the would-be updater will wait for the first updating transaction to commit or roll back (if it is still in progress). If the first updater rolls back, then its effects are negated and the second updater can proceed with updating the originally found row. If the first updater commits, the second updater will ignore the row if the first updater deleted it, otherwise it will attempt to apply its operation to the updated version of the row. The search condition of the command (the <literal>WHERE</literal> clause) is re-evaluated to see if the updated version of the row still matches the search condition. If so, the second updater proceeds with its operation using the updated version of the row. In the case of <command>SELECT FOR UPDATE</command> and <command>SELECT FOR SHARE</command>, this means it is the updated version of the row that is locked and returned to the client.
ru: Команды <command>UPDATE</command>, <command>DELETE</command>, <command>SELECT FOR UPDATE</command> и <command>SELECT FOR SHARE</command> ведут себя подобно <command>SELECT</command> при поиске целевых строк: они найдут только те целевые строки, которые были зафиксированы на момент начала команды. Однако к моменту, когда они будут найдены, эти целевые строки могут быть уже изменены (а также удалены или заблокированы) другой параллельной транзакцией. В этом случае запланированное изменение будет отложено до фиксирования или отката первой изменяющей данные транзакции (если она ещё выполняется). Если первая изменяющая транзакция откатывается, её результат отбрасывается и вторая изменяющая транзакция может продолжить изменение изначально полученной строки. Если первая транзакция зафиксировалась, но в результате удалила эту строку, вторая будет игнорировать её, а в противном случае попытается выполнить свою операцию с изменённой версией строки. Условие поиска в команде (предложение <literal>WHERE</literal>) вычисляется повторно для выяснения, соответствует ли по-прежнему этому условию изменённая версия строки. Если да, вторая изменяющая транзакция продолжают свою работу с изменённой версией строки. Применительно к командам <command>SELECT FOR UPDATE</command> и <command>SELECT FOR SHARE</command> это означает, что изменённая версия строки блокируется и возвращается клиенту.

source: <command>INSERT</command> with an <literal>ON CONFLICT DO UPDATE</literal> clause behaves similarly. In Read Committed mode, each row proposed for insertion will either insert or update. Unless there are unrelated errors, one of those two outcomes is guaranteed. If a conflict originates in another transaction whose effects are not yet visible to the <command>INSERT </command>, the <command>UPDATE</command> clause will affect that row, even though possibly <emphasis>no</emphasis> version of that row is conventionally visible to the command.
ru: Похожим образом ведёт себя <command>INSERT</command> с предложением <literal>ON CONFLICT DO UPDATE</literal>. В режиме Read Committed каждая строка, предлагаемая для добавления, будет либо вставлена, либо изменена. Если не возникнет несвязанных ошибок, гарантируется один из этих двух исходов. Если конфликт будет вызван другой транзакцией, результат которой ещё не видим для <command>INSERT</command>, предложение <command>UPDATE</command> подействует на эту строку, даже несмотря на то, что эта команда обычным образом может не видеть <emphasis>никакую</emphasis> версию этой строки.

source: <command>INSERT</command> with an <literal>ON CONFLICT DO NOTHING</literal> clause may have insertion not proceed for a row due to the outcome of another transaction whose effects are not visible to the <command>INSERT</command> snapshot. Again, this is only the case in Read Committed mode.
ru: При выполнении <command>INSERT</command> с предложением <literal>ON CONFLICT DO NOTHING</literal> строка может не добавиться в результате действия другой транзакции, эффект которой не виден в снимке команды <command>INSERT</command>. Это опять же имеет место только в режиме Read Committed.

source: Because of the above rules, it is possible for an updating command to see an inconsistent snapshot: it can see the effects of concurrent updating commands on the same rows it is trying to update, but it does not see effects of those commands on other rows in the database. This behavior makes Read Committed mode unsuitable for commands that involve complex search conditions; however, it is just right for simpler cases. For example, consider updating bank balances with transactions like: <screen> BEGIN; UPDATE accounts SET balance = balance + 100.00 WHERE acctnum = 12345; UPDATE accounts SET balance = balance - 100.00 WHERE acctnum = 7534; COMMIT; </screen> If two such transactions concurrently try to change the balance of account 12345, we clearly want the second transaction to start with the updated version of the account's row. Because each command is affecting only a predetermined row, letting it see the updated version of the row does not create any troublesome inconsistency.
ru: Вследствие описанных выше правил, изменяющая команда может увидеть несогласованное состояние: она может видеть результаты параллельных команд, изменяющих те же строки, что пытается изменить она, но при этом она не видит результаты этих команд в других строках таблиц. Из-за этого поведения уровень Read Committed не подходит для команд со сложными условиями поиска; однако он вполне пригоден для простых случаев. Например, рассмотрим изменение баланса счёта в таких транзакциях: <screen> BEGIN; UPDATE accounts SET balance = balance + 100.00 WHERE acctnum = 12345; UPDATE accounts SET balance = balance - 100.00 WHERE acctnum = 7534; COMMIT; </screen> Если две такие транзакции пытаются параллельно изменить баланс счёта 12345, мы, естественно, хотим, чтобы вторая транзакция работала с изменённой версией строки счёта. Так как каждая команда влияет только на определённую строку, если она будет видеть изменённую версию строки, это не приведёт к проблемам несогласованности.

source: More complex usage can produce undesirable results in Read Committed mode. For example, consider a <command>DELETE</command> command operating on data that is being both added and removed from its restriction criteria by another command, e.g., assume <literal>website</literal> is a two-row table with <literal>website.hits</literal> equaling <literal>9</literal> and <literal>10</literal>: <screen> BEGIN; UPDATE website SET hits = hits + 1; -- run from another session: DELETE FROM website WHERE hits = 10; COMMIT; </screen> The <command>DELETE</command> will have no effect even though there is a <literal>website.hits = 10</literal> row before and after the <command>UPDATE</command>. This occurs because the pre-update row value <literal>9</literal> is skipped, and when the <command>UPDATE</command> completes and <command>DELETE</command> obtains a lock, the new row value is no longer <literal>10</literal> but <literal>11</literal>, which no longer matches the criteria.
ru: В более сложных ситуациях уровень Read Committed может приводить к нежелательным результатам. Например, рассмотрим команду <command>DELETE</command>, работающую со строками, которые параллельно добавляет и удаляет из множества, определённого её условием, другая команда. Например, предположим, что <literal>website</literal> &mdash; таблица из двух строк, в которых <literal>website.hits</literal> равны <literal>9</literal> и <literal>10</literal>: <screen> BEGIN; UPDATE website SET hits = hits + 1; -- выполняется параллельно: DELETE FROM website WHERE hits = 10; COMMIT; </screen> Команда <command>DELETE</command> не сделает ничего, даже несмотря на то, что строка с <literal>website.hits = 10</literal> была в таблице и до, и после выполнения <command>UPDATE</command>. Это происходит потому, что строка со значением <literal>9</literal> до изменения пропускается, а когда команда <command>UPDATE</command> завершается и <command>DELETE</command> получает освободившуюся блокировку, строка с <literal>10</literal> теперь содержит <literal>11</literal>, а это значение уже не соответствует условию.
