Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/postgres-fdw.po
Languages: ru

source: This option controls whether column <literal>DEFAULT</literal> expressions are included in the definitions of foreign tables imported from a foreign server. The default is <literal>false</literal>. If you enable this option, be wary of defaults that might get computed differently on the local server than they would be on the remote server; <function>nextval()</function> is a common source of problems. The <command>IMPORT</command> will fail altogether if an imported default expression uses a function or operator that does not exist locally.
ru: Этот параметр устанавливает, будут ли в определения сторонних таблиц, импортируемых с внешнего сервера, включаться заданные для столбцов выражения <literal>DEFAULT</literal>. По умолчанию они не включаются. Если вы включите этот параметр, остерегайтесь выражений по умолчанию, которые могут вычисляться на локальном сервере не так, как на удалённом; например, частый источник проблем — <function>nextval()</function>. Если в импортируемом выражении используются функции или операторы, несуществующие локально, команда <command>IMPORT</command> в целом выдаст сбой.

source: This option controls whether column <literal>NOT NULL</literal> constraints are included in the definitions of foreign tables imported from a foreign server. The default is <literal>true</literal>.
ru: Этот параметр устанавливает, будут ли в определения сторонних таблиц, импортируемых с внешнего сервера, включаться ограничения столбцов <literal>NOT NULL</literal>. По умолчанию они включаются.

source: Note that constraints other than <literal>NOT NULL</literal> will never be imported from the remote tables. Although <productname>PostgreSQL</productname> does support <literal>CHECK</literal> constraints on foreign tables, there is no provision for importing them automatically, because of the risk that a constraint expression could evaluate differently on the local and remote servers. Any such inconsistency in the behavior of a <literal>CHECK</literal> constraint could lead to hard-to-detect errors in query optimization. So if you wish to import <literal>CHECK</literal> constraints, you must do so manually, and you should verify the semantics of each one carefully. For more detail about the treatment of <literal>CHECK</literal> constraints on foreign tables, see <xref linkend="sql-createforeigntable"/>.
ru: Заметьте, что никакие другие ограничения, кроме <literal>NOT NULL</literal>, из удалённых таблиц импортироваться не будут. Хотя <productname>PostgreSQL</productname> поддерживает ограничения <literal>CHECK</literal> для сторонних таблиц, никаких средств для автоматического импорта их нет из-за риска различного вычисления выражения ограничения на локальном и удалённом серверах. Любая такая несогласованность в поведении ограничений <literal>CHECK</literal> могла бы привести к сложно выявляемым ошибкам в оптимизации запросов. Поэтому, если вы хотите импортировать ограничения <literal>CHECK</literal>, вы должны сделать это вручную и должны внимательно проверить семантику каждого. Более подробно интерпретация ограничений <literal>CHECK</literal> для сторонних таблиц описана в <xref remap="6" linkend="sql-createforeigntable"/>.

source: Connection Management
ru: Управление соединением

source: <filename>postgres_fdw</filename> establishes a connection to a foreign server during the first query that uses a foreign table associated with the foreign server. This connection is kept and re-used for subsequent queries in the same session. However, if multiple user identities (user mappings) are used to access the foreign server, a connection is established for each user mapping.
ru: Модуль <filename>postgres_fdw</filename> устанавливает соединение со сторонним сервером при первом запросе, в котором участвует сторонняя таблица, связанная со сторонним сервером. Это соединение сохраняется и повторно используется для последующих запросов в том же сеансе. Однако, если для обращения к стороннему серверу задействуются разные пользователи (сопоставления пользователей), отдельное соединение устанавливается для каждого сопоставления пользователей.

source: Transaction Management
ru: Управление транзакциями

source: During a query that references any remote tables on a foreign server, <filename>postgres_fdw</filename> opens a transaction on the remote server if one is not already open corresponding to the current local transaction. The remote transaction is committed or aborted when the local transaction commits or aborts. Savepoints are similarly managed by creating corresponding remote savepoints.
ru: В процессе выполнения запроса, в котором участвуют какие-либо удалённые таблицы на стороннем сервере, <filename>postgres_fdw</filename> открывает транзакцию на удалённом сервере, если такая транзакция ещё не была открыта для текущей локальной транзакции. Эта удалённая транзакция фиксируется или прерывается, когда фиксируется или прерывается локальная транзакция. Подобным образом реализуется и управление точками сохранения.

source: The remote transaction uses <literal>SERIALIZABLE</literal> isolation level when the local transaction has <literal>SERIALIZABLE</literal> isolation level; otherwise it uses <literal>REPEATABLE READ</literal> isolation level. This choice ensures that if a query performs multiple table scans on the remote server, it will get snapshot-consistent results for all the scans. A consequence is that successive queries within a single transaction will see the same data from the remote server, even if concurrent updates are occurring on the remote server due to other activities. That behavior would be expected anyway if the local transaction uses <literal>SERIALIZABLE</literal> or <literal>REPEATABLE READ</literal> isolation level, but it might be surprising for a <literal>READ COMMITTED</literal> local transaction. A future <productname>PostgreSQL</productname> release might modify these rules.
ru: Для удалённой транзакции выбирается режим изоляции <literal>SERIALIZABLE</literal>, когда локальная транзакция открыта в режиме <literal>SERIALIZABLE</literal>; в противном случае применяется режим <literal>REPEATABLE READ</literal>. Этот выбор гарантирует, что если запрос сканирует несколько таблиц на удалённом сервере, он будет получать согласованные данные одного снимка для всех сканирований. Как следствие, последовательные запросы в одной транзакции будут видеть одни данные удалённого сервера, даже если на нём параллельно происходят изменения, вызванные другими действиями. Это поведение ожидаемо для локальной транзакции в режимах <literal>SERIALIZABLE</literal> и <literal>REPEATABLE READ</literal>, но для локальной транзакции в режиме <literal>READ COMMITTED</literal> оно может быть неожиданным. В будущих выпусках <productname>PostgreSQL</productname> эти правила могут быть изменены.

source: Remote Query Optimization
ru: Оптимизация удалённых запросов

source: <filename>postgres_fdw</filename> attempts to optimize remote queries to reduce the amount of data transferred from foreign servers. This is done by sending query <literal>WHERE</literal> clauses to the remote server for execution, and by not retrieving table columns that are not needed for the current query. To reduce the risk of misexecution of queries, <literal>WHERE</literal> clauses are not sent to the remote server unless they use only data types, operators, and functions that are built-in or belong to an extension that's listed in the foreign server's <literal>extensions</literal> option. Operators and functions in such clauses must be <literal>IMMUTABLE</literal> as well. For an <command>UPDATE</command> or <command>DELETE</command> query, <filename>postgres_fdw</filename> attempts to optimize the query execution by sending the whole query to the remote server if there are no query <literal>WHERE</literal> clauses that cannot be sent to the remote server, no local joins for the query, no row-level local <literal>BEFORE</literal> or <literal>AFTER</literal> triggers on the target table, and no <literal>CHECK OPTION</literal> constraints from parent views. In <command>UPDATE</command>, expressions to assign to target columns must use only built-in data types, <literal>IMMUTABLE</literal> operators, or <literal>IMMUTABLE</literal> functions, to reduce the risk of misexecution of the query.
ru: Обёртка <filename>postgres_fdw</filename> пытается оптимизировать удалённые запросы, уменьшая объём обмена данными со сторонними серверами. Для этого она может передавать на выполнение удалённому серверу предложения <literal>WHERE</literal> и не получать столбцы таблицы, не требующиеся для текущего запроса. Чтобы уменьшить риск некорректного выполнения запросов, предложения <literal>WHERE</literal> передаются удалённому серверу, только если в них используются типы данных, операторы и функции, встроенные в ядро или относящиеся к расширениям, перечисленным в параметре <literal>extensions</literal>. Операторы и функции в таких предложениях также должны быть постоянными (<literal>IMMUTABLE</literal>). Для запросов <command>UPDATE</command> или <command>DELETE</command> обёртка <filename>postgres_fdw</filename> пытается оптимизировать выполнение, передавая весь запрос на удалённый сервер, если в запросе нет предложения <literal>WHERE</literal>, которое нельзя было бы передать, не выполняется локальное соединение, в целевой таблице отсутствуют локальные триггеры <literal>BEFORE</literal>/<literal>AFTER</literal> уровня строки и в родительских представлениях нет ограничения <literal>CHECK OPTION</literal>. Кроме того, в запросах <command>UPDATE</command> выражения, присваиваемые целевым столбцам, должны задействовать только встроенные типы данных и постоянные (<literal>IMMUTABLE</literal>) операторы и функции, чтобы уменьшить риск неверного выполнения запроса.

source: When <filename>postgres_fdw</filename> encounters a join between foreign tables on the same foreign server, it sends the entire join to the foreign server, unless for some reason it believes that it will be more efficient to fetch rows from each table individually, or unless the table references involved are subject to different user mappings. While sending the <literal>JOIN</literal> clauses, it takes the same precautions as mentioned above for the <literal>WHERE</literal> clauses.
ru: Когда обёртка <filename>postgres_fdw</filename> обнаруживает соединение сторонних таблиц на одном стороннем сервере, она передаёт всё соединение этому серверу, если только по какой-то причине не решит, что будет эффективнее выбирать строки из каждой таблицы по отдельности, или сопоставляемые при обращении к таблицам пользователи оказываются разными. При передаче предложений <literal>JOIN</literal> принимаются те же меры предосторожности, что были описаны выше для предложений <literal>WHERE</literal>.

source: The query that is actually sent to the remote server for execution can be examined using <command>EXPLAIN VERBOSE</command>.
ru: Запрос, фактически отправляемый удалённому серверу для выполнения, можно изучить с помощью команды <command>EXPLAIN VERBOSE</command>.

source: Remote Query Execution Environment
ru: Окружение удалённого выполнения запросов

source: In the remote sessions opened by <filename>postgres_fdw</filename>, the <xref linkend="guc-search-path"/> parameter is set to just <literal>pg_catalog</literal>, so that only built-in objects are visible without schema qualification. This is not an issue for queries generated by <filename>postgres_fdw</filename> itself, because it always supplies such qualification. However, this can pose a hazard for functions that are executed on the remote server via triggers or rules on remote tables. For example, if a remote table is actually a view, any functions used in that view will be executed with the restricted search path. It is recommended to schema-qualify all names in such functions, or else attach <literal>SET search_path</literal> options (see <xref linkend="sql-createfunction"/>) to such functions to establish their expected search path environment.
ru: В удалённых сеансах, установленных обёрткой <filename>postgres_fdw</filename>, в параметре <xref linkend="guc-search-path"/> задаётся только <literal>pg_catalog</literal>, так что без указания схемы видны только встроенные объекты. Это не проблема для запросов, которые генерирует сама <filename>postgres_fdw</filename>, так как она всегда добавляет такие указания. Однако это может быть опасно для функций, которые выполняются на удалённом сервере при срабатывании триггеров или правил для удалённых таблиц. Например, если удалённая таблица на самом деле представляет собой представление, любые функции, используемые в этом представлении, будут выполняться с таким ограниченным путём поиска. Поэтому рекомендуется в таких функциях дополнять схемой все имена либо добавлять параметры <literal>SET search_path</literal> (см. <xref remap="4" linkend="sql-createfunction"/>) в определения таких функций, чтобы установить ожидаемый ими путь поиска в окружении.

source: <filename>postgres_fdw</filename> likewise establishes remote session settings for the parameters <xref linkend="guc-timezone"/>, <xref linkend="guc-datestyle"/>, <xref linkend="guc-intervalstyle"/>, and <xref linkend="guc-extra-float-digits"/>. These are less likely to be problematic than <varname>search_path</varname>, but can be handled with function <literal>SET</literal> options if the need arises.
ru: Обёртка <filename>postgres_fdw</filename> подобным образом устанавливает для удалённого сеанса значения параметров <xref linkend="guc-timezone"/>, <xref linkend="guc-datestyle"/>, <xref linkend="guc-intervalstyle"/> и <xref linkend="guc-extra-float-digits"/>. С ними проблемы менее вероятны, чем с <varname>search_path</varname>, но если они возникнут, их можно урегулировать, установив нужные параметры с помощью <literal>SET</literal>.

source: It is <emphasis>not</emphasis> recommended that you override this behavior by changing the session-level settings of these parameters; that is likely to cause <filename>postgres_fdw</filename> to malfunction.
ru: Это поведение <emphasis>не</emphasis> рекомендуется переопределять, устанавливая значения этих параметров на уровне сеанса; это скорее всего приведёт к поломке <filename>postgres_fdw</filename>.

source: Cross-Version Compatibility
ru: Совместимость с разными версиями

source: <filename>postgres_fdw</filename> can be used with remote servers dating back to <productname>PostgreSQL</productname> 8.3. Read-only capability is available back to 8.1. A limitation however is that <filename>postgres_fdw</filename> generally assumes that immutable built-in functions and operators are safe to send to the remote server for execution, if they appear in a <literal>WHERE</literal> clause for a foreign table. Thus, a built-in function that was added since the remote server's release might be sent to it for execution, resulting in <quote>function does not exist</quote> or a similar error. This type of failure can be worked around by rewriting the query, for example by embedding the foreign table reference in a sub-<literal>SELECT</literal> with <literal>OFFSET 0</literal> as an optimization fence, and placing the problematic function or operator outside the sub-<literal>SELECT</literal>.
ru: Модуль <filename>postgres_fdw</filename> может применяться с удалёнными серверами версий, начиная с <productname>PostgreSQL</productname> 8.3. Способность только чтения данных доступна, начиная с 8.1. Однако, при этом есть ограничение, вызванное тем, что <filename>postgres_fdw</filename> полагает, что постоянные встроенные функции и операторы могут безопасно передаваться на удалённый сервер для выполнения, если они фигурируют в предложении <literal>WHERE</literal> для сторонней таблицы. Таким образом, встроенная функция, добавленная в более новой версии, чем на удалённом сервере, может быть отправлена на выполнение, что в результате приведёт к ошибке <quote>функция не существует</quote> или подобной. Отказы такого типа можно предотвратить, переписав запрос, например, поместив ссылку на стороннюю таблицу во вложенный <literal>SELECT</literal> с <literal>OFFSET 0</literal> в качестве защиты от оптимизации, и применив проблематичную функцию или оператор снаружи этого вложенного <literal>SELECT</literal>.

source: Examples
ru: Примеры

source: Here is an example of creating a foreign table with <literal>postgres_fdw</literal>. First install the extension:
ru: Ниже приведёт пример создания сторонней таблицы с применением <literal>postgres_fdw</literal>. Сначала установите расширение:

source: Then create a foreign server using <xref linkend="sql-createserver"/>. In this example we wish to connect to a <productname>PostgreSQL</productname> server on host <literal>192.83.123.89</literal> listening on port <literal>5432</literal>. The database to which the connection is made is named <literal>foreign_db</literal> on the remote server: <placeholder-1/>
ru: Затем создайте сторонний сервер с помощью команды <xref linkend="sql-createserver"/>. В данном примере мы хотим подключиться к серверу <productname>PostgreSQL</productname>, работающему по адресу <literal>192.83.123.89</literal>, порт <literal>5432</literal>. База данных, к которой устанавливается подключение, на удалённом сервере называется <literal>foreign_db</literal>: <placeholder-1/>

source: A user mapping, defined with <xref linkend="sql-createusermapping"/>, is needed as well to identify the role that will be used on the remote server: <placeholder-1/>
ru: Для определения роли, которая будет задействована на удалённом сервере, с помощью <xref linkend="sql-createusermapping"/> задаётся сопоставление пользователей: <placeholder-1/>

source: Now it is possible to create a foreign table with <xref linkend="sql-createforeigntable"/>. In this example we wish to access the table named <structname>some_schema.some_table</structname> on the remote server. The local name for it will be <structname>foreign_table</structname>: <placeholder-1/> It's essential that the data types and other properties of the columns declared in <command>CREATE FOREIGN TABLE</command> match the actual remote table. Column names must match as well, unless you attach <literal>column_name</literal> options to the individual columns to show how they are named in the remote table. In many cases, use of <xref linkend="sql-importforeignschema"/> is preferable to constructing foreign table definitions manually.
ru: Теперь можно создать стороннюю таблицу, применив команду <xref linkend="sql-createforeigntable"/>. В этом примере мы хотим обратиться к таблице <structname>some_schema.some_table</structname> на удалённом сервере. Локальным именем этой таблицы будет <structname>foreign_table</structname>: <placeholder-1/> Важно, чтобы типы данных и другие свойства столбцов, объявленных в <command>CREATE FOREIGN TABLE</command>, соответствовали фактической удалённой таблице. Также должны соответствовать имена столбцов, если только вы не добавите параметры <literal>column_name</literal> для отдельных столбцов, задающие их реальные имена в удалённой таблице. Во многих случаях использовать <xref linkend="sql-importforeignschema"/> предпочтительнее, чем конструировать определения сторонних таблиц вручную.

source: Author
ru: Автор

source: Shigeru Hanada <email>shigeru.hanada@gmail.com</email>
ru: Шигеру Ханада <email>shigeru.hanada@gmail.com</email>
