Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/postgres-fdw.po
Languages: ru

source: The <filename>postgres_fdw</filename> module provides the foreign-data wrapper <literal>postgres_fdw</literal>, which can be used to access data stored in external <productname>PostgreSQL</productname> servers.
ru: Модуль <filename>postgres_fdw</filename> предоставляет обёртку сторонних данных <literal>postgres_fdw</literal>, используя которую можно обращаться к данным, находящимся на внешних серверах <productname>PostgreSQL</productname>.

source: The functionality provided by this module overlaps substantially with the functionality of the older <xref linkend="dblink"/> module. But <filename>postgres_fdw</filename> provides more transparent and standards-compliant syntax for accessing remote tables, and can give better performance in many cases.
ru: Функциональность этого модуля во многом пересекается с функциональностью старого модуля <xref linkend="dblink"/>. Однако <filename>postgres_fdw</filename> предоставляет более прозрачный и стандартизированный синтаксис для обращения к удалённым таблицам и во многих случаях даёт лучшую производительность.

source: Install the <filename>postgres_fdw</filename> extension using <xref linkend="sql-createextension"/>.
ru: Установите расширение <filename>postgres_fdw</filename> с помощью команды <xref linkend="sql-createextension"/>.

source: Create a foreign server object, using <xref linkend="sql-createserver"/>, to represent each remote database you want to connect to. Specify connection information, except <literal>user</literal> and <literal>password</literal>, as options of the server object.
ru: Создайте объект стороннего сервера, используя <xref linkend="sql-createserver"/>, который будет представлять удалённую базу данных, к которой вы хотите подключаться. Укажите свойства подключения, кроме <literal>user</literal> и <literal>password</literal>, в параметрах объекта сервера.

source: Create a user mapping, using <xref linkend="sql-createusermapping"/>, for each database user you want to allow to access each foreign server. Specify the remote user name and password to use as <literal>user</literal> and <literal>password</literal> options of the user mapping.
ru: Создайте сопоставление пользователей, используя <xref linkend="sql-createusermapping"/>, для каждого пользователя базы, которому нужен доступ к удалённому серверу. Укажите имя и пароль удалённого пользователя в параметрах <literal>user</literal> и <literal>password</literal> сопоставления.

source: Create a foreign table, using <xref linkend="sql-createforeigntable"/> or <xref linkend="sql-importforeignschema"/>, for each remote table you want to access. The columns of the foreign table must match the referenced remote table. You can, however, use table and/or column names different from the remote table's, if you specify the correct remote names as options of the foreign table object.
ru: Создайте стороннюю таблицу, используя <xref linkend="sql-createforeigntable"/> или <xref linkend="sql-importforeignschema"/>, для каждой удалённой таблицы, к которой вы хотите обращаться. Столбцы сторонней таблицы должны соответствовать столбцам целевой удалённой таблицы. Однако вы можете использовать локально имена таблиц и/или столбцов, отличные от удалённых, если укажете корректные удалённые имена в параметрах объекта сторонней таблицы.

source: To prepare for remote access using <filename>postgres_fdw</filename>: <placeholder-1/>
ru: Чтобы подготовиться к обращению к удалённым данным через <filename>postgres_fdw</filename>: <placeholder-1/>

source: Now you need only <command>SELECT</command> from a foreign table to access the data stored in its underlying remote table. You can also modify the remote table using <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command>. (Of course, the remote user you have specified in your user mapping must have privileges to do these things.)
ru: После этого для обращения к данным, хранящимся в нижележащей удалённой таблице, вам нужно только выполнять <command>SELECT</command>. Вы также можете изменять данные в удалённой таблице, выполняя <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>. (Разумеется, удалённый пользователь, указанный в сопоставлении, должен иметь необходимые права для этого.)

source: Note that <filename>postgres_fdw</filename> currently lacks support for <command>INSERT</command> statements with an <literal>ON CONFLICT DO UPDATE</literal> clause. However, the <literal>ON CONFLICT DO NOTHING</literal> clause is supported, provided a unique index inference specification is omitted.
ru: Заметьте, что в настоящее время в <filename>postgres_fdw</filename> не поддерживаются операторы <command>INSERT</command> с предложением <literal>ON CONFLICT DO UPDATE</literal>. Однако предложение <literal>ON CONFLICT DO NOTHING</literal> поддерживается, при отсутствии указания для выбора уникального индекса.

source: It is generally recommended that the columns of a foreign table be declared with exactly the same data types, and collations if applicable, as the referenced columns of the remote table. Although <filename>postgres_fdw</filename> is currently rather forgiving about performing data type conversions at need, surprising semantic anomalies may arise when types or collations do not match, due to the remote server interpreting <literal>WHERE</literal> clauses slightly differently from the local server.
ru: Обычно рекомендуется объявлять столбцы сторонней таблицы точно с теми же типами данных и правилами сортировки, если они применимы, как у целевых столбцов удалённой таблицы. Хотя <filename>postgres_fdw</filename> в настоящее время довольно лоялен к преобразованиям типов данных при необходимости, но когда типы или правила сортировки не совпадают, возможны неожиданные семантические аномалии, вследствие того, что удалённый сервер будет обрабатывать предложения <literal>WHERE</literal> не совсем так, как локальный сервер.

source: Note that a foreign table can be declared with fewer columns, or with a different column order, than its underlying remote table has. Matching of columns to the remote table is by name, not position.
ru: Заметьте, что сторонняя таблица может быть объявлена с меньшим количеством или с другим порядком столбцов, чем в нижележащей удалённой таблице. Сопоставление столбцов удалённой таблицы осуществляется по имени, а не по позиции.

source: FDW Options of postgres_fdw
ru: Параметры обёртки для postgres_fdw

source: Connection Options
ru: Параметры подключения

source: <literal>user</literal> and <literal>password</literal> (specify these in a user mapping, instead)
ru: <literal>user</literal> и <literal>password</literal> (их следует задавать в сопоставлениях пользователей)

source: <literal>client_encoding</literal> (this is automatically set from the local server encoding)
ru: <literal>client_encoding</literal> (автоматически принимается равной локальной кодировке сервера)

source: <literal>fallback_application_name</literal> (always set to <literal>postgres_fdw</literal>)
ru: <literal>fallback_application_name</literal> (всегда <literal>postgres_fdw</literal>)

source: A foreign server using the <filename>postgres_fdw</filename> foreign data wrapper can have the same options that <application>libpq</application> accepts in connection strings, as described in <xref linkend="libpq-paramkeywords"/>, except that these options are not allowed: <placeholder-1/>
ru: Для стороннего сервера, настраиваемого с использованием обёртки сторонних данных <filename>postgres_fdw</filename>, можно задать те же параметры, что принимает <application>libpq</application> в строках подключения, как описано в <xref remap="6" linkend="libpq-paramkeywords"/>, за исключением следующих недопустимых параметров: <placeholder-1/>

source: Only superusers may connect to foreign servers without password authentication, so always specify the <literal>password</literal> option for user mappings belonging to non-superusers.
ru: Подключаться к сторонним серверам без аутентификации по паролю могут только суперпользователи, поэтому в сопоставлениях для обычных пользователей всегда нужно задавать пароль (<literal>password</literal>).

source: Object Name Options
ru: Параметры имени объекта

source: These options can be used to control the names used in SQL statements sent to the remote <productname>PostgreSQL</productname> server. These options are needed when a foreign table is created with names different from the underlying remote table's names.
ru: Эти параметры позволяют управлять тем, как на удалённый сервер <productname>PostgreSQL</productname> будут передаваться имена, фигурирующие в операторах SQL. Данные параметры нужны, когда сторонняя таблица создаётся с именами, отличными от имён удалённой таблицы.

source: This option, which can be specified for a foreign table, gives the schema name to use for the foreign table on the remote server. If this option is omitted, the name of the foreign table's schema is used.
ru: Этот параметр, который может задаваться для сторонней таблицы, указывает имя схемы для обращения к этой таблице на удалённом сервере. Если данный параметр опускается, применяется схема сторонней таблицы.

source: This option, which can be specified for a foreign table, gives the table name to use for the foreign table on the remote server. If this option is omitted, the foreign table's name is used.
ru: Этот параметр, который может задаваться для сторонней таблицы, указывает имя таблицы для обращения к этой таблице на удалённом сервере. Если данный параметр опускается, применяется имя сторонней таблицы.

source: This option, which can be specified for a column of a foreign table, gives the column name to use for the column on the remote server. If this option is omitted, the column's name is used.
ru: Этот параметр, который может задаваться для столбца сторонней таблицы, указывает имя столбца для обращения к этому столбцу на удалённом сервере. Если данный параметр опускается, применяется исходное имя столбца.

source: Cost Estimation Options
ru: Параметры оценки стоимости

source: <filename>postgres_fdw</filename> retrieves remote data by executing queries against remote servers, so ideally the estimated cost of scanning a foreign table should be whatever it costs to be done on the remote server, plus some overhead for communication. The most reliable way to get such an estimate is to ask the remote server and then add something for overhead &mdash; but for simple queries, it may not be worth the cost of an additional remote query to get a cost estimate. So <filename>postgres_fdw</filename> provides the following options to control how cost estimation is done:
ru: Модуль <filename>postgres_fdw</filename> получает удалённые данные, выполняя запросы на удалённых серверах, поэтому в идеале ожидаемая стоимость сканирования сторонней таблицы должна равняться стоимости выполнения на удалённом сервере плюс издержки сетевого взаимодействия. Самый надёжный способ получить такие оценки — узнать стоимость у удалённого сервера и добавить некоторую надбавку &mdash; но для простых запросов может быть невыгодно передавать дополнительный запрос, только чтобы получить оценку стоимости. Поэтому <filename>postgres_fdw</filename> предоставляет следующие параметры, позволяющие управлять вычислением оценки стоимости:

source: This option, which can be specified for a foreign table or a foreign server, controls whether <filename>postgres_fdw</filename> issues remote <command>EXPLAIN</command> commands to obtain cost estimates. A setting for a foreign table overrides any setting for its server, but only for that table. The default is <literal>false</literal>.
ru: Этот параметр, который может задаваться для сторонней таблицы или для стороннего сервера, определяет, будет ли <filename>postgres_fdw</filename> выполнять удалённо команды <command>EXPLAIN</command> для получения оценок стоимости. Параметр, заданный для сторонней таблицы, переопределяет параметр сервера, но только для данной таблицы. Значение по умолчанию — <literal>false</literal> (выкл.).

source: This option, which can be specified for a foreign server, is a numeric value that is added to the estimated startup cost of any foreign-table scan on that server. This represents the additional overhead of establishing a connection, parsing and planning the query on the remote side, etc. The default value is <literal>100</literal>.
ru: Этот параметр, который может задаваться для стороннего сервера, устанавливает числовое значение, добавляемое к оценке стоимости запуска для любого сканирования сторонней таблицы на этом сервере. Он выражает дополнительные издержки на установление подключения, разбор и планирование запроса на удалённой стороне и т. д. Значение по умолчанию — <literal>100</literal>.

source: This option, which can be specified for a foreign server, is a numeric value that is used as extra cost per-tuple for foreign-table scans on that server. This represents the additional overhead of data transfer between servers. You might increase or decrease this number to reflect higher or lower network delay to the remote server. The default value is <literal>0.01</literal>.
ru: Этот параметр, который может задаваться для стороннего сервера, устанавливает числовое значение, выражающее дополнительную цену чтения одного кортежа из сторонней таблицы на этом сервере. Это число можно увеличить или уменьшить, отражая меньшую или большую фактическую скорость сетевого взаимодействия с удалённым сервером. Значение по умолчанию — <literal>0.01</literal>.

source: When <literal>use_remote_estimate</literal> is true, <filename>postgres_fdw</filename> obtains row count and cost estimates from the remote server and then adds <literal>fdw_startup_cost</literal> and <literal>fdw_tuple_cost</literal> to the cost estimates. When <literal>use_remote_estimate</literal> is false, <filename>postgres_fdw</filename> performs local row count and cost estimation and then adds <literal>fdw_startup_cost</literal> and <literal>fdw_tuple_cost</literal> to the cost estimates. This local estimation is unlikely to be very accurate unless local copies of the remote table's statistics are available. Running <xref linkend="sql-analyze"/> on the foreign table is the way to update the local statistics; this will perform a scan of the remote table and then calculate and store statistics just as though the table were local. Keeping local statistics can be a useful way to reduce per-query planning overhead for a remote table &mdash; but if the remote table is frequently updated, the local statistics will soon be obsolete.
ru: Когда поведение <literal>use_remote_estimate</literal> включено, <filename>postgres_fdw</filename> получает количество строк и оценку стоимости с удалённого сервера, а затем добавляет к оценке стоимости <literal>fdw_startup_cost</literal> и <literal>fdw_tuple_cost</literal>. Когда поведение <literal>use_remote_estimate</literal> отключено, <filename>postgres_fdw</filename> рассчитывает число строк и оценку стоимости локально, а затем так же добавляет к этой оценке <literal>fdw_startup_cost</literal> и <literal>fdw_tuple_cost</literal>. Локальная оценка может быть точной только при условии наличия локальной копии статистики удалённых таблиц. Обновить эту статистику для сторонней таблицы можно с помощью команды <xref linkend="sql-analyze"/>; при этом удалённая таблица будет просканирована, и по её содержимому будут вычислена и сохранена статистика как для локальной таблицы. Локальное хранение статистики может быть полезно для сокращения издержек планирования для удалённой таблицы &mdash; но если удалённая таблица меняется часто, локальная статистика будет быстро устаревать.

source: Remote Execution Options
ru: Параметры удалённого выполнения

source: By default, only <literal>WHERE</literal> clauses using built-in operators and functions will be considered for execution on the remote server. Clauses involving non-built-in functions are checked locally after rows are fetched. If such functions are available on the remote server and can be relied on to produce the same results as they do locally, performance can be improved by sending such <literal>WHERE</literal> clauses for remote execution. This behavior can be controlled using the following option:
ru: По умолчанию ограничения <literal>WHERE</literal>, содержащие встроенные операторы и функции, обрабатываются на удалённом сервере, а ограничения, содержащие вызовы не встроенных функций, проверяются локально после получения строк. Если же расширенные функции доступны на удалённом сервере и можно рассчитывать, что они дадут те же результаты, что и локально, производительность можно увеличить, передавая и такие предложения <literal>WHERE</literal> для удалённого выполнения. Этим поведением позволяет управлять следующий параметр:

source: This option is a comma-separated list of names of <productname>PostgreSQL</productname> extensions that are installed, in compatible versions, on both the local and remote servers. Functions and operators that are immutable and belong to a listed extension will be considered shippable to the remote server. This option can only be specified for foreign servers, not per-table.
ru: В этом параметре задаётся список имён расширений <productname>PostgreSQL</productname> через запятую, которые установлены и имеют совместимые версии и на локальном, и на удалённом сервере. Относящиеся к перечисленным расширениям и при этом постоянные (immutable) функции и операторы могут передаваться на выполнение удалённому серверу. Этот параметр можно задать только для стороннего сервера, но не для таблицы.

source: When using the <literal>extensions</literal> option, <emphasis>it is the user's responsibility</emphasis> that the listed extensions exist and behave identically on both the local and remote servers. Otherwise, remote queries may fail or behave unexpectedly.
ru: При использовании параметра <literal>extensions</literal> <emphasis>пользователь сам отвечает</emphasis> за то, чтобы перечисленные расширения существовали и их поведение было одинаковым на локальном и удалённом сервере. В противном случае удалённые запросы могут выдавать ошибки или неожиданные результаты.

source: This option specifies the number of rows <filename>postgres_fdw</filename> should get in each fetch operation. It can be specified for a foreign table or a foreign server. The option specified on a table overrides an option specified for the server. The default is <literal>100</literal>.
ru: Этот параметр определяет, сколько строк должна получать <filename>postgres_fdw</filename> в одной операции выборки. Его можно задать для сторонней таблицы или стороннего сервера. Значение по умолчанию — <literal>100</literal> строк.

source: Updatability Options
ru: Параметры изменения данных

source: By default all foreign tables using <filename>postgres_fdw</filename> are assumed to be updatable. This may be overridden using the following option:
ru: По умолчанию все сторонние таблицы, доступные через <filename>postgres_fdw</filename>, считаются допускающими изменения. Это можно переопределить с помощью следующего параметра:

source: This option controls whether <filename>postgres_fdw</filename> allows foreign tables to be modified using <command>INSERT</command>, <command>UPDATE</command> and <command>DELETE</command> commands. It can be specified for a foreign table or a foreign server. A table-level option overrides a server-level option. The default is <literal>true</literal>.
ru: Этот параметр определяет, будет ли <filename>postgres_fdw</filename> допускать изменения в сторонних таблицах посредством команд <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command>. Его можно задать для сторонней таблицы или для стороннего сервера. Параметр, определённый на уровне таблицы, переопределяет параметр уровня сервера. Значение по умолчанию — <literal>true</literal> (изменения разрешены).

source: Of course, if the remote table is not in fact updatable, an error would occur anyway. Use of this option primarily allows the error to be thrown locally without querying the remote server. Note however that the <literal>information_schema</literal> views will report a <filename>postgres_fdw</filename> foreign table to be updatable (or not) according to the setting of this option, without any check of the remote server.
ru: Конечно, если удалённая таблица на самом деле не допускает изменения, всё равно произойдёт ошибка. Использование этого параметра прежде всего позволяет выдать ошибку локально, не обращаясь к удалённому серверу. Заметьте, однако, что представление <literal>information_schema</literal> будет показывать, что определённая сторонняя таблица <filename>postgres_fdw</filename> является изменяемой (или нет), согласно значению данного параметра, не проверяя это на удалённом сервере.

source: Importing Options
ru: Параметры импорта

source: <filename>postgres_fdw</filename> is able to import foreign table definitions using <xref linkend="sql-importforeignschema"/>. This command creates foreign table definitions on the local server that match tables or views present on the remote server. If the remote tables to be imported have columns of user-defined data types, the local server must have compatible types of the same names.
ru: Обёртка <filename>postgres_fdw</filename> позволяет импортировать определения сторонних таблиц с применением команды <xref linkend="sql-importforeignschema"/>. Эта команда создаёт на локальном сервере определения сторонних таблиц, соответствующие таблицам или представлениям, существующим на удалённом сервере. Если импортируемые удалённые таблицы содержат столбцы пользовательских типов данных, на локальном сервере должны быть совместимые типы с теми же именами.

source: Importing behavior can be customized with the following options (given in the <command>IMPORT FOREIGN SCHEMA</command> command):
ru: Поведение процедуры импорта можно настроить следующими параметрами (задаваемыми в команде <command>IMPORT FOREIGN SCHEMA</command>):

source: This option controls whether column <literal>COLLATE</literal> options are included in the definitions of foreign tables imported from a foreign server. The default is <literal>true</literal>. You might need to turn this off if the remote server has a different set of collation names than the local server does, which is likely to be the case if it's running on a different operating system.
ru: Этот параметр устанавливает, будут ли в определения сторонних таблиц, импортируемых с внешнего сервера, включаться характеристики столбцов <literal>COLLATE</literal>. По умолчанию они включаются. Вам может потребоваться отключить его, если на удалённом сервере набор имён правил сортировки отличается от локального, что скорее всего будет иметь место, если серверы работают в разных операционных системах.
