Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/queries.po
Languages: ru

source: A <literal>LATERAL</literal> item can appear at top level in the <literal>FROM</literal> list, or within a <literal>JOIN</literal> tree. In the latter case it can also refer to any items that are on the left-hand side of a <literal>JOIN</literal> that it is on the right-hand side of.
ru: Элемент <literal>LATERAL</literal> может находиться на верхнем уровне списка <literal>FROM</literal> или в дереве <literal>JOIN</literal>. В последнем случае он может также ссылаться на любые элементы в левой части <literal>JOIN</literal>, справа от которого он находится.

source: When a <literal>FROM</literal> item contains <literal>LATERAL</literal> cross-references, evaluation proceeds as follows: for each row of the <literal>FROM</literal> item providing the cross-referenced column(s), or set of rows of multiple <literal>FROM</literal> items providing the columns, the <literal>LATERAL</literal> item is evaluated using that row or row set's values of the columns. The resulting row(s) are joined as usual with the rows they were computed from. This is repeated for each row or set of rows from the column source table(s).
ru: Когда элемент <literal>FROM</literal> содержит ссылки <literal>LATERAL</literal>, запрос выполняется следующим образом: сначала для строки элемента <literal>FROM</literal> с целевыми столбцами, или набора строк из нескольких элементов <literal>FROM</literal>, содержащих целевые столбцы, вычисляется элемент <literal>LATERAL</literal> со значениями этих столбцов. Затем результирующие строки обычным образом соединяются со строками, из которых они были вычислены. Эта процедура повторяется для всех строк исходных таблиц.

source: A trivial example of <literal>LATERAL</literal> is <placeholder-1/> This is not especially useful since it has exactly the same result as the more conventional <placeholder-2/> <literal>LATERAL</literal> is primarily useful when the cross-referenced column is necessary for computing the row(s) to be joined. A common application is providing an argument value for a set-returning function. For example, supposing that <function>vertices(polygon)</function> returns the set of vertices of a polygon, we could identify close-together vertices of polygons stored in a table with: <placeholder-3/> This query could also be written <placeholder-4/> or in several other equivalent formulations. (As already mentioned, the <literal>LATERAL</literal> key word is unnecessary in this example, but we use it for clarity.)
ru: <literal>LATERAL</literal> можно использовать так: <placeholder-1/> Здесь это не очень полезно, так как тот же результат можно получить более простым и привычным способом: <placeholder-2/> Применять <literal>LATERAL</literal> имеет смысл в основном, когда для вычисления соединяемых строк необходимо обратиться к столбцам других таблиц. В частности, это полезно, когда нужно передать значение функции, возвращающей набор данных. Например, если предположить, что <function>vertices(polygon)</function> возвращает набор вершин многоугольника, близкие вершины многоугольников из таблицы polygons можно получить так: <placeholder-3/> Этот запрос можно записать и так: <placeholder-4/> или переформулировать другими способами. (Как уже упоминалось, в данном примере ключевое слово <literal>LATERAL</literal> не требуется, но мы добавили его для ясности.)

source: It is often particularly handy to <literal>LEFT JOIN</literal> to a <literal>LATERAL</literal> subquery, so that source rows will appear in the result even if the <literal>LATERAL</literal> subquery produces no rows for them. For example, if <function>get_product_names()</function> returns the names of products made by a manufacturer, but some manufacturers in our table currently produce no products, we could find out which ones those are like this: <placeholder-1/>
ru: Особенно полезно бывает использовать <literal>LEFT JOIN</literal> с подзапросом <literal>LATERAL</literal>, чтобы исходные строки оказывались в результате, даже если подзапрос <literal>LATERAL</literal> не возвращает строк. Например, если функция <function>get_product_names()</function> выдаёт названия продуктов, выпущенных определённым производителем, но о продукции некоторых производителей информации нет, мы можем найти, каких именно, примерно так: <placeholder-1/>

source: The <literal>WHERE</literal> Clause
ru: Предложение <literal>WHERE</literal>

source: The syntax of the <xref linkend="sql-where" endterm="sql-where-title"/> is <synopsis> WHERE <replaceable>search_condition</replaceable> </synopsis> where <replaceable>search_condition</replaceable> is any value expression (see <xref linkend="sql-expressions"/>) that returns a value of type <type>boolean</type>.
ru: <xref linkend="sql-where" endterm="sql-where-title"/> записывается так: <synopsis> WHERE <replaceable>условие_ограничения</replaceable> </synopsis> где <replaceable>условие_ограничения</replaceable> &mdash; любое выражение значения (см. <xref remap="4" linkend="sql-expressions"/>), выдающее результат типа <type>boolean</type>.

source: After the processing of the <literal>FROM</literal> clause is done, each row of the derived virtual table is checked against the search condition. If the result of the condition is true, the row is kept in the output table, otherwise (i.e., if the result is false or null) it is discarded. The search condition typically references at least one column of the table generated in the <literal>FROM</literal> clause; this is not required, but otherwise the <literal>WHERE</literal> clause will be fairly useless.
ru: После обработки предложения <literal>FROM</literal> каждая строка полученной виртуальной таблицы проходит проверку по условию ограничения. Если результат условия равен true, эта строка остаётся в выходной таблице, а иначе (если результат равен false или NULL) отбрасывается. В условии ограничения, как правило, задействуется минимум один столбец из таблицы, полученной на выходе <literal>FROM</literal>. Хотя строго говоря, это не требуется, но в противном случае предложение <literal>WHERE</literal> будет бессмысленным.

source: The join condition of an inner join can be written either in the <literal>WHERE</literal> clause or in the <literal>JOIN</literal> clause. For example, these table expressions are equivalent: <placeholder-1/> and: <placeholder-2/> or perhaps even: <placeholder-3/> Which one of these you use is mainly a matter of style. The <literal>JOIN</literal> syntax in the <literal>FROM</literal> clause is probably not as portable to other SQL database management systems, even though it is in the SQL standard. For outer joins there is no choice: they must be done in the <literal>FROM</literal> clause. The <literal>ON</literal> or <literal>USING</literal> clause of an outer join is <emphasis>not</emphasis> equivalent to a <literal>WHERE</literal> condition, because it results in the addition of rows (for unmatched input rows) as well as the removal of rows in the final result.
ru: Условие для внутреннего соединения можно записать как в предложении <literal>WHERE</literal>, так и в предложении <literal>JOIN</literal>. Например, это выражение: <placeholder-1/> равнозначно этому: <placeholder-2/> и возможно, даже этому: <placeholder-3/> Какой вариант выбрать, в основном дело вкуса и стиля. Вариант с <literal>JOIN</literal> внутри предложения <literal>FROM</literal>, возможно, не лучший с точки зрения совместимости с другими СУБД, хотя он и описан в стандарте SQL. Но для внешних соединений других вариантов нет: их можно записывать только во <literal>FROM</literal>. Предложения <literal>ON</literal> и <literal>USING</literal> во внешних соединениях <emphasis>не</emphasis> равнозначны условию <literal>WHERE</literal>, так как они могут добавлять строки (для входных строк без соответствия), а также удалять их из конечного результата.

source: Here are some examples of <literal>WHERE</literal> clauses: <placeholder-1/> <literal>fdt</literal> is the table derived in the <literal>FROM</literal> clause. Rows that do not meet the search condition of the <literal>WHERE</literal> clause are eliminated from <literal>fdt</literal>. Notice the use of scalar subqueries as value expressions. Just like any other query, the subqueries can employ complex table expressions. Notice also how <literal>fdt</literal> is referenced in the subqueries. Qualifying <literal>c1</literal> as <literal>fdt.c1</literal> is only necessary if <literal>c1</literal> is also the name of a column in the derived input table of the subquery. But qualifying the column name adds clarity even when it is not needed. This example shows how the column naming scope of an outer query extends into its inner queries.
ru: Несколько примеров запросов с <literal>WHERE</literal>: <placeholder-1/> <literal>fdt</literal> &mdash; название таблицы, порождённой в предложении <literal>FROM</literal>. Строки, которые не соответствуют условию <literal>WHERE</literal>, исключаются из <literal>fdt</literal>. Обратите внимание, как в качестве выражений значения используются скалярные подзапросы. Как и любые другие запросы, подзапросы могут содержать сложные табличные выражения. Заметьте также, что <literal>fdt</literal> используется в подзапросах. Дополнение имени <literal>c1</literal> в виде <literal>fdt.c1</literal> необходимо только, если в порождённой таблице в подзапросе также оказывается столбец <literal>c1</literal>. Полное имя придаёт ясность даже там, где без него можно обойтись. Этот пример показывает, как область именования столбцов внешнего запроса распространяется на все вложенные в него внутренние запросы.

source: The <literal>GROUP BY</literal> and <literal>HAVING</literal> Clauses
ru: Предложения <literal>GROUP BY</literal> и <literal>HAVING</literal>

source: <primary>grouping</primary>
ru: <primary>группировка</primary>

source: After passing the <literal>WHERE</literal> filter, the derived input table might be subject to grouping, using the <literal>GROUP BY</literal> clause, and elimination of group rows using the <literal>HAVING</literal> clause.
ru: Строки порождённой входной таблицы, прошедшие фильтр <literal>WHERE</literal>, можно сгруппировать с помощью предложения <literal>GROUP BY</literal>, а затем оставить в результате только нужные группы строк, используя предложение <literal>HAVING</literal>.

source: select_list
ru: список_выборки

source: grouping_column_reference
ru: группирующий_столбец

source: The <xref linkend="sql-groupby" endterm="sql-groupby-title"/> is used to group together those rows in a table that have the same values in all the columns listed. The order in which the columns are listed does not matter. The effect is to combine each set of rows having common values into one group row that represents all rows in the group. This is done to eliminate redundancy in the output and/or compute aggregates that apply to these groups. For instance: <screen> <prompt>=&gt;</prompt> <userinput>SELECT * FROM test1;</userinput> x | y ---+--- a | 3 c | 2 b | 5 a | 1 (4 rows) <prompt>=&gt;</prompt> <userinput>SELECT x FROM test1 GROUP BY x;</userinput> x --- a b c (3 rows) </screen>
ru: <xref linkend="sql-groupby" endterm="sql-groupby-title"/> группирует строки таблицы, объединяя их в одну группу при совпадении значений во всех перечисленных столбцах. Порядок, в котором указаны столбцы, не имеет значения. В результате наборы строк с одинаковыми значениями преобразуются в отдельные строки, представляющие все строки группы. Это может быть полезно для устранения избыточности выходных данных и/или для вычисления агрегатных функций, применённых к этим группам. Например: <screen> <prompt>=&gt;</prompt> <userinput>SELECT * FROM test1;</userinput> x | y ---+--- a | 3 c | 2 b | 5 a | 1 (4 rows) <prompt>=&gt;</prompt> <userinput>SELECT x FROM test1 GROUP BY x;</userinput> x --- a b c (3 rows) </screen>

source: In the second query, we could not have written <literal>SELECT * FROM test1 GROUP BY x</literal>, because there is no single value for the column <literal>y</literal> that could be associated with each group. The grouped-by columns can be referenced in the select list since they have a single value in each group.
ru: Во втором запросе мы не могли написать <literal>SELECT * FROM test1 GROUP BY x</literal>, так как для столбца <literal>y</literal> нет единого значения, связанного с каждой группой. Однако столбцы, по которым выполняется группировка, можно использовать в списке выборки, так как они имеют единственное значение в каждой группе.

source: In general, if a table is grouped, columns that are not listed in <literal>GROUP BY</literal> cannot be referenced except in aggregate expressions. An example with aggregate expressions is: <screen> <prompt>=&gt;</prompt> <userinput>SELECT x, sum(y) FROM test1 GROUP BY x;</userinput> x | sum ---+----- a | 4 b | 5 c | 2 (3 rows) </screen> Here <literal>sum</literal> is an aggregate function that computes a single value over the entire group. More information about the available aggregate functions can be found in <xref linkend="functions-aggregate"/>.
ru: Вообще говоря, в группированной таблице столбцы, не включённые в список <literal>GROUP BY</literal>, можно использовать только в агрегатных выражениях. Пример такого агрегатного выражения: <screen> <prompt>=&gt;</prompt> <userinput>SELECT x, sum(y) FROM test1 GROUP BY x;</userinput> x | sum ---+----- a | 4 b | 5 c | 2 (3 rows) </screen> Здесь <literal>sum</literal> &mdash; агрегатная функция, вычисляющая единственное значение для всей группы. Подробную информацию о существующих агрегатных функциях можно найти в <xref remap="6" linkend="functions-aggregate"/>.

source: Grouping without aggregate expressions effectively calculates the set of distinct values in a column. This can also be achieved using the <literal>DISTINCT</literal> clause (see <xref linkend="queries-distinct"/>).
ru: Группировка без агрегатных выражений по сути выдаёт набор различающихся значений столбцов. Этот же результат можно получить с помощью предложения <literal>DISTINCT</literal> (см. <xref remap="4" linkend="queries-distinct"/>).

source: Here is another example: it calculates the total sales for each product (rather than the total sales of all products): <placeholder-1/> In this example, the columns <literal>product_id</literal>, <literal>p.name</literal>, and <literal>p.price</literal> must be in the <literal>GROUP BY</literal> clause since they are referenced in the query select list (but see below). The column <literal>s.units</literal> does not have to be in the <literal>GROUP BY</literal> list since it is only used in an aggregate expression (<literal>sum(...)</literal>), which represents the sales of a product. For each product, the query returns a summary row about all sales of the product.
ru: Взгляните на следующий пример: в нём вычисляется общая сумма продаж по каждому продукту (а не общая сумма по всем продуктам): <placeholder-1/> В этом примере столбцы <literal>product_id</literal>, <literal>p.name</literal> и <literal>p.price</literal> должны присутствовать в списке <literal>GROUP BY</literal>, так как они используются в списке выборки. Столбец <literal>s.units</literal> может отсутствовать в списке <literal>GROUP BY</literal>, так как он используется только в агрегатном выражении (<literal>sum(...)</literal>), вычисляющем сумму продаж. Для каждого продукта этот запрос возвращает строку с итоговой суммой по всем продажам данного продукта.

source: <primary>functional dependency</primary>
ru: <primary>функциональная зависимость</primary>

source: If the products table is set up so that, say, <literal>product_id</literal> is the primary key, then it would be enough to group by <literal>product_id</literal> in the above example, since name and price would be <firstterm>functionally dependent</firstterm> on the product ID, and so there would be no ambiguity about which name and price value to return for each product ID group.
ru: Если бы в таблице products по столбцу <literal>product_id</literal> был создан первичный ключ, тогда в данном примере было бы достаточно сгруппировать строки по <literal>product_id</literal>, так как название и цена продукта <firstterm>функционально зависят</firstterm> от кода продукта и можно однозначно определить, какое название и цену возвращать для каждой группы по ID.

source: In strict SQL, <literal>GROUP BY</literal> can only group by columns of the source table but <productname>PostgreSQL</productname> extends this to also allow <literal>GROUP BY</literal> to group by columns in the select list. Grouping by value expressions instead of simple column names is also allowed.
ru: В стандарте SQL <literal>GROUP BY</literal> может группировать только по столбцам исходной таблицы, но расширение <productname>PostgreSQL</productname> позволяет использовать в <literal>GROUP BY</literal> столбцы из списка выборки. Также возможна группировка по выражениям, а не просто именам столбцов.

source: If a table has been grouped using <literal>GROUP BY</literal>, but only certain groups are of interest, the <literal>HAVING</literal> clause can be used, much like a <literal>WHERE</literal> clause, to eliminate groups from the result. The syntax is: <synopsis> SELECT <replaceable>select_list</replaceable> FROM ... <optional>WHERE ...</optional> GROUP BY ... HAVING <replaceable>boolean_expression</replaceable> </synopsis> Expressions in the <literal>HAVING</literal> clause can refer both to grouped expressions and to ungrouped expressions (which necessarily involve an aggregate function).
ru: Если таблица была сгруппирована с помощью <literal>GROUP BY</literal>, но интерес представляют только некоторые группы, отфильтровать их можно с помощью предложения <literal>HAVING</literal>, действующего подобно <literal>WHERE</literal>. Записывается это так: <synopsis> SELECT <replaceable>список_выборки</replaceable> FROM ... <optional>WHERE ...</optional> GROUP BY ... HAVING <replaceable>логическое_выражение</replaceable> </synopsis> В предложении <literal>HAVING</literal> могут использоваться и группирующие выражения, и выражения, не участвующие в группировке (в этом случае это должны быть агрегирующие функции).

source: Example: <screen> <prompt>=&gt;</prompt> <userinput>SELECT x, sum(y) FROM test1 GROUP BY x HAVING sum(y) &gt; 3;</userinput> x | sum ---+----- a | 4 b | 5 (2 rows) <prompt>=&gt;</prompt> <userinput>SELECT x, sum(y) FROM test1 GROUP BY x HAVING x &lt; 'c';</userinput> x | sum ---+----- a | 4 b | 5 (2 rows) </screen>
ru: Пример: <screen> <prompt>=&gt;</prompt> <userinput>SELECT x, sum(y) FROM test1 GROUP BY x HAVING sum(y) &gt; 3;</userinput> x | sum ---+----- a | 4 b | 5 (2 rows) <prompt>=&gt;</prompt> <userinput>SELECT x, sum(y) FROM test1 GROUP BY x HAVING x &lt; 'c';</userinput> x | sum ---+----- a | 4 b | 5 (2 rows) </screen>

source: Again, a more realistic example: <placeholder-1/> In the example above, the <literal>WHERE</literal> clause is selecting rows by a column that is not grouped (the expression is only true for sales during the last four weeks), while the <literal>HAVING</literal> clause restricts the output to groups with total gross sales over 5000. Note that the aggregate expressions do not necessarily need to be the same in all parts of the query.
ru: И ещё один более реалистичный пример: <placeholder-1/> В данном примере предложение <literal>WHERE</literal> выбирает строки по столбцу, не включённому в группировку (выражение истинно только для продаж за последние четыре недели), тогда как предложение <literal>HAVING</literal> отфильтровывает группы с общей суммой продаж больше 5000. Заметьте, что агрегатные выражения не обязательно должны быть одинаковыми во всех частях запроса.

source: If a query contains aggregate function calls, but no <literal>GROUP BY</literal> clause, grouping still occurs: the result is a single group row (or perhaps no rows at all, if the single row is then eliminated by <literal>HAVING</literal>). The same is true if it contains a <literal>HAVING</literal> clause, even without any aggregate function calls or <literal>GROUP BY</literal> clause.
ru: Если в запросе есть вызовы агрегатных функций, но нет предложения <literal>GROUP BY</literal>, строки всё равно будут группироваться: в результате окажется одна строка группы (или возможно, ни одной строки, если эта строка будет отброшена предложением <literal>HAVING</literal>). Это справедливо и для запросов, которые содержат только предложение <literal>HAVING</literal>, но не содержат вызовы агрегатных функций и предложение <literal>GROUP BY</literal>.

source: <literal>GROUPING SETS</literal>, <literal>CUBE</literal>, and <literal>ROLLUP</literal>
ru: <literal>GROUPING SETS</literal>, <literal>CUBE</literal> и <literal>ROLLUP</literal>

source: More complex grouping operations than those described above are possible using the concept of <firstterm>grouping sets</firstterm>. The data selected by the <literal>FROM</literal> and <literal>WHERE</literal> clauses is grouped separately by each specified grouping set, aggregates computed for each group just as for simple <literal>GROUP BY</literal> clauses, and then the results returned. For example: <screen> <prompt>=&gt;</prompt> <userinput>SELECT * FROM items_sold;</userinput> brand | size | sales -------+------+------- Foo | L | 10 Foo | M | 20 Bar | M | 15 Bar | L | 5 (4 rows) <prompt>=&gt;</prompt> <userinput>SELECT brand, size, sum(sales) FROM items_sold GROUP BY GROUPING SETS ((brand), (size), ());</userinput> brand | size | sum -------+------+----- Foo | | 30 Bar | | 20 | L | 15 | M | 35 | | 50 (5 rows) </screen>
ru: Более сложные, чем описанные выше, операции группировки возможны с концепцией <firstterm>наборов группирования</firstterm>. Данные, выбранные предложениями <literal>FROM</literal> и <literal>WHERE</literal>, группируются отдельно для каждого заданного набора группирования, затем для каждой группы вычисляются агрегатные функции как для простых предложений <literal>GROUP BY</literal>, и в конце возвращаются результаты. Например: <screen> <prompt>=&gt;</prompt> <userinput>SELECT * FROM items_sold;</userinput> brand | size | sales -------+------+------- Foo | L | 10 Foo | M | 20 Bar | M | 15 Bar | L | 5 (4 rows) <prompt>=&gt;</prompt> <userinput>SELECT brand, size, sum(sales) FROM items_sold GROUP BY GROUPING SETS ((brand), (size), ());</userinput> brand | size | sum -------+------+----- Foo | | 30 Bar | | 20 | L | 15 | M | 35 | | 50 (5 rows) </screen>

source: Each sublist of <literal>GROUPING SETS</literal> may specify zero or more columns or expressions and is interpreted the same way as though it were directly in the <literal>GROUP BY</literal> clause. An empty grouping set means that all rows are aggregated down to a single group (which is output even if no input rows were present), as described above for the case of aggregate functions with no <literal>GROUP BY</literal> clause.
ru: В каждом внутреннем списке <literal>GROUPING SETS</literal> могут задаваться ноль или более столбцов или выражений, которые воспринимаются так же, как если бы они были непосредственно записаны в предложении <literal>GROUP BY</literal>. Пустой набор группировки означает, что все строки сводятся к одной группе (которая выводится, даже если входных строк нет), как описано выше для агрегатных функций без предложения <literal>GROUP BY</literal>.
