Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/queries.po
Languages: ru

source: Queries
ru: Запросы

source: <primary>query</primary>
ru: <primary>запрос</primary>

source: The previous chapters explained how to create tables, how to fill them with data, and how to manipulate that data. Now we finally discuss how to retrieve the data from the database.
ru: В предыдущих главах рассказывалось, как создать таблицы, как заполнить их данными и как изменить эти данные. Теперь мы наконец обсудим, как получить данные из базы данных.

source: Overview
ru: Обзор

source: The process of retrieving or the command to retrieve data from a database is called a <firstterm>query</firstterm>. In SQL the <xref linkend="sql-select"/> command is used to specify queries. The general syntax of the <command>SELECT</command> command is <synopsis> <optional>WITH <replaceable>with_queries</replaceable></optional> SELECT <replaceable>select_list</replaceable> FROM <replaceable>table_expression</replaceable> <optional><replaceable>sort_specification</replaceable></optional> </synopsis> The following sections describe the details of the select list, the table expression, and the sort specification. <literal>WITH</literal> queries are treated last since they are an advanced feature.
ru: Процесс или команда получения данных из базы данных называется <firstterm>запросом</firstterm>. В SQL запросы формулируются с помощью команды <xref linkend="sql-select"/>. В общем виде команда <command>SELECT</command> записывается так: <synopsis> <optional>WITH <replaceable>запросы_with</replaceable></optional> SELECT <replaceable>список_выборки</replaceable> FROM <replaceable>табличное_выражение</replaceable> <optional><replaceable>определение_сортировки</replaceable></optional> </synopsis> В следующих разделах подробно описываются список выборки, табличное выражение и определение сортировки. Запросы <literal>WITH</literal> являются расширенной возможностью <productname>PostgreSQL</productname> и будут рассмотрены в последнюю очередь.

source: A simple kind of query has the form: <placeholder-1/> Assuming that there is a table called <literal>table1</literal>, this command would retrieve all rows and all user-defined columns from <literal>table1</literal>. (The method of retrieval depends on the client application. For example, the <application>psql</application> program will display an ASCII-art table on the screen, while client libraries will offer functions to extract individual values from the query result.) The select list specification <literal>*</literal> means all columns that the table expression happens to provide. A select list can also select a subset of the available columns or make calculations using the columns. For example, if <literal>table1</literal> has columns named <literal>a</literal>, <literal>b</literal>, and <literal>c</literal> (and perhaps others) you can make the following query: <placeholder-2/> (assuming that <literal>b</literal> and <literal>c</literal> are of a numerical data type). See <xref linkend="queries-select-lists"/> for more details.
ru: Простой запрос выглядит так: <placeholder-1/> Если предположить, что в базе данных есть таблица <literal>table1</literal>, эта команда получит все строки с содержимым всех столбцов из <literal>table1</literal>. (Метод выдачи результата определяет клиентское приложение. Например, программа <application>psql</application> выведет на экране ASCII-таблицу, хотя клиентские библиотеки позволяют извлекать отдельные значения из результата запроса.) Здесь список выборки задан как <literal>*</literal>, это означает, что запрос должен вернуть все столбцы табличного выражения. В списке выборки можно также указать подмножество доступных столбцов или составить выражения с этими столбцами. Например, если в <literal>table1</literal> есть столбцы <literal>a</literal>, <literal>b</literal> и <literal>c</literal> (и возможно, другие), вы можете выполнить следующий запрос: <placeholder-2/> (в предположении, что столбцы <literal>b</literal> и <literal>c</literal> имеют числовой тип данных). Подробнее это описано в <xref remap="6" linkend="queries-select-lists"/>.

source: <literal>FROM table1</literal> is a simple kind of table expression: it reads just one table. In general, table expressions can be complex constructs of base tables, joins, and subqueries. But you can also omit the table expression entirely and use the <command>SELECT</command> command as a calculator: <placeholder-1/> This is more useful if the expressions in the select list return varying results. For example, you could call a function this way: <placeholder-2/>
ru: <literal>FROM table1</literal> &mdash; это простейший тип табличного выражения, в котором просто читается одна таблица. Вообще табличные выражения могут быть сложными конструкциями из базовых таблиц, соединений и подзапросов. А можно и вовсе опустить табличное выражение и использовать команду <command>SELECT</command> как калькулятор: <placeholder-1/> В этом может быть больше смысла, когда выражения в списке выборки возвращают меняющиеся результаты. Например, можно вызвать функцию так: <placeholder-2/>

source: Table Expressions
ru: Табличные выражения

source: <primary>table expression</primary>
ru: <primary>табличное выражение</primary>

source: A <firstterm>table expression</firstterm> computes a table. The table expression contains a <literal>FROM</literal> clause that is optionally followed by <literal>WHERE</literal>, <literal>GROUP BY</literal>, and <literal>HAVING</literal> clauses. Trivial table expressions simply refer to a table on disk, a so-called base table, but more complex expressions can be used to modify or combine base tables in various ways.
ru: <firstterm>Табличное выражение</firstterm> вычисляет таблицу. Это выражение содержит предложение <literal>FROM</literal>, за которым могут следовать предложения <literal>WHERE</literal>, <literal>GROUP BY</literal> и <literal>HAVING</literal>. Тривиальные табличные выражения просто ссылаются на физическую таблицу, её называют также базовой, но в более сложных выражениях такие таблицы можно преобразовывать и комбинировать самыми разными способами.

source: The optional <literal>WHERE</literal>, <literal>GROUP BY</literal>, and <literal>HAVING</literal> clauses in the table expression specify a pipeline of successive transformations performed on the table derived in the <literal>FROM</literal> clause. All these transformations produce a virtual table that provides the rows that are passed to the select list to compute the output rows of the query.
ru: Необязательные предложения <literal>WHERE</literal>, <literal>GROUP BY</literal> и <literal>HAVING</literal> в табличном выражении определяют последовательность преобразований, осуществляемых с данными таблицы, полученной в предложении <literal>FROM</literal>. В результате этих преобразований образуется виртуальная таблица, строки которой передаются списку выборки, вычисляющему выходные строки запроса.

source: The <literal>FROM</literal> Clause
ru: Предложение <literal>FROM</literal>

source: The <xref linkend="sql-from" endterm="sql-from-title"/> derives a table from one or more other tables given in a comma-separated table reference list. <synopsis> FROM <replaceable>table_reference</replaceable> <optional>, <replaceable>table_reference</replaceable> <optional>, ...</optional></optional> </synopsis> A table reference can be a table name (possibly schema-qualified), or a derived table such as a subquery, a <literal>JOIN</literal> construct, or complex combinations of these. If more than one table reference is listed in the <literal>FROM</literal> clause, the tables are cross-joined (that is, the Cartesian product of their rows is formed; see below). The result of the <literal>FROM</literal> list is an intermediate virtual table that can then be subject to transformations by the <literal>WHERE</literal>, <literal>GROUP BY</literal>, and <literal>HAVING</literal> clauses and is finally the result of the overall table expression.
ru: <xref linkend="sql-from" endterm="sql-from-title"/> образует таблицу из одной или нескольких ссылок на таблицы, разделённых запятыми. <synopsis> FROM <replaceable>табличная_ссылка</replaceable> <optional>, <replaceable>табличная_ссылка</replaceable> <optional>, ...</optional></optional> </synopsis> Здесь табличной ссылкой может быть имя таблицы (возможно, с именем схемы), производная таблица, например подзапрос, соединение таблиц или сложная комбинация этих вариантов. Если в предложении <literal>FROM</literal> перечисляются несколько ссылок, для них применяется перекрёстное соединение (то есть декартово произведение их строк; см. ниже). Список <literal>FROM</literal> преобразуется в промежуточную виртуальную таблицу, которая может пройти через преобразования <literal>WHERE</literal>, <literal>GROUP BY</literal> и <literal>HAVING</literal>, и в итоге определит результат табличного выражения.

source: When a table reference names a table that is the parent of a table inheritance hierarchy, the table reference produces rows of not only that table but all of its descendant tables, unless the key word <literal>ONLY</literal> precedes the table name. However, the reference produces only the columns that appear in the named table &mdash; any columns added in subtables are ignored.
ru: Когда в табличной ссылке указывается таблица, являющаяся родительской в иерархии наследования, в результате будут получены строки не только этой таблицы, но и всех её дочерних таблиц. Чтобы выбрать строки только одной родительской таблицы, перед её именем нужно добавить ключевое слово <literal>ONLY</literal>. Учтите, что при этом будут получены только столбцы указанной таблицы &mdash; дополнительные столбцы дочерних таблиц не попадут в результат.

source: Instead of writing <literal>ONLY</literal> before the table name, you can write <literal>*</literal> after the table name to explicitly specify that descendant tables are included. Writing <literal>*</literal> is not necessary since that behavior is the default (unless you have changed the setting of the <xref linkend="guc-sql-inheritance"/> configuration option). However writing <literal>*</literal> might be useful to emphasize that additional tables will be searched.
ru: Если же вы не добавляете <literal>ONLY</literal> перед именем таблицы, вы можете дописать после него <literal>*</literal>, тем самым указав, что должны обрабатываться и все дочерние таблицы. Добавлять <literal>*</literal> не обязательно, так как теперь это поведение подразумевается по умолчанию (если только вы не измените параметр конфигурации <xref linkend="guc-sql-inheritance"/>). Однако такая запись может быть полезна тем, что подчеркнёт использование дополнительных таблиц.

source: Joined Tables
ru: Соединённые таблицы

source: <primary>join</primary>
ru: <primary>соединение</primary>

source: A joined table is a table derived from two other (real or derived) tables according to the rules of the particular join type. Inner, outer, and cross-joins are available. The general syntax of a joined table is <synopsis> <replaceable>T1</replaceable> <replaceable>join_type</replaceable> <replaceable>T2</replaceable> <optional> <replaceable>join_condition</replaceable> </optional> </synopsis> Joins of all types can be chained together, or nested: either or both <replaceable>T1</replaceable> and <replaceable>T2</replaceable> can be joined tables. Parentheses can be used around <literal>JOIN</literal> clauses to control the join order. In the absence of parentheses, <literal>JOIN</literal> clauses nest left-to-right.
ru: Соединённая таблица ­­­­­­&mdash; это таблица, полученная из двух других (реальных или производных от них) таблиц в соответствии с правилами соединения конкретного типа. Общий синтаксис описания соединённой таблицы: <synopsis> <replaceable>T1</replaceable> <replaceable>тип_соединения</replaceable> <replaceable>T2</replaceable> <optional> <replaceable>условие_соединения</replaceable> </optional> </synopsis>Соединения любых типов могут вкладываются друг в друга или объединяться: и <replaceable>T1</replaceable>, и <replaceable>T2</replaceable> могут быть результатами соединения. Для однозначного определения порядка соединений предложения <literal>JOIN</literal> можно заключать в скобки. Если скобки отсутствуют, предложения <literal>JOIN</literal> обрабатываются слева направо.

source: Join Types
ru: Типы соединений

source: <primary>join</primary> <secondary>cross</secondary>
ru: <primary>соединение</primary> <secondary>перекрёстное</secondary>

source: <primary>cross join</primary>
ru: <primary>перекрёстное соединение</primary>

source: Cross join <placeholder-1/> <placeholder-2/>
ru: Перекрёстное соединение <placeholder-1/> <placeholder-2/>

source: For every possible combination of rows from <replaceable>T1</replaceable> and <replaceable>T2</replaceable> (i.e., a Cartesian product), the joined table will contain a row consisting of all columns in <replaceable>T1</replaceable> followed by all columns in <replaceable>T2</replaceable>. If the tables have N and M rows respectively, the joined table will have N * M rows.
ru: Соединённую таблицу образуют все возможные сочетания строк из <replaceable>T1</replaceable> и <replaceable>T2</replaceable> (т. е. их декартово произведение), а набор её столбцов объединяет в себе столбцы <replaceable>T1</replaceable> со следующими за ними столбцами <replaceable>T2</replaceable>. Если таблицы содержат N и M строк, соединённая таблица будет содержать N * M строк.

source: This latter equivalence does not hold exactly when more than two tables appear, because <literal>JOIN</literal> binds more tightly than comma. For example <literal>FROM <replaceable>T1</replaceable> CROSS JOIN <replaceable>T2</replaceable> INNER JOIN <replaceable>T3</replaceable> ON <replaceable>condition</replaceable></literal> is not the same as <literal>FROM <replaceable>T1</replaceable>, <replaceable>T2</replaceable> INNER JOIN <replaceable>T3</replaceable> ON <replaceable>condition</replaceable></literal> because the <replaceable>condition</replaceable> can reference <replaceable>T1</replaceable> in the first case but not the second.
ru: Последняя запись не полностью эквивалентна первым при указании более чем двух таблиц, так как <literal>JOIN</literal> связывает таблицы сильнее, чем запятая. Например, <literal>FROM <replaceable>T1</replaceable> CROSS JOIN <replaceable>T2</replaceable> INNER JOIN <replaceable>T3</replaceable> ON <replaceable>условие</replaceable></literal> не равнозначно <literal>FROM <replaceable>T1</replaceable>, <replaceable>T2</replaceable> INNER JOIN <replaceable>T3</replaceable> ON <replaceable>условие</replaceable></literal>, так как <replaceable>условие</replaceable> может ссылаться на <replaceable>T1</replaceable> в первом случае, но не во втором.

source: <literal>FROM <replaceable>T1</replaceable> CROSS JOIN <replaceable>T2</replaceable></literal> is equivalent to <literal>FROM <replaceable>T1</replaceable> INNER JOIN <replaceable>T2</replaceable> ON TRUE</literal> (see below). It is also equivalent to <literal>FROM <replaceable>T1</replaceable>, <replaceable>T2</replaceable></literal>. <placeholder-1/>
ru: <literal>FROM <replaceable>T1</replaceable> CROSS JOIN <replaceable>T2</replaceable></literal> эквивалентно <literal>FROM <replaceable>T1</replaceable> INNER JOIN <replaceable>T2</replaceable> ON TRUE</literal> (см. ниже). Эта запись также эквивалентна <literal>FROM <replaceable>T1</replaceable>, <replaceable>T2</replaceable></literal>. <placeholder-1/>

source: <primary>join</primary> <secondary>outer</secondary>
ru: <primary>соединение</primary> <secondary>внешнее</secondary>

source: <primary>outer join</primary>
ru: <primary>внешнее соединение</primary>

source: Qualified joins <placeholder-1/> <placeholder-2/>
ru: Соединения с сопоставлениями строк <placeholder-1/> <placeholder-2/>

source: boolean_expression
ru: логическое_выражение

source: join column list
ru: список столбцов соединения

source: The words <literal>INNER</literal> and <literal>OUTER</literal> are optional in all forms. <literal>INNER</literal> is the default; <literal>LEFT</literal>, <literal>RIGHT</literal>, and <literal>FULL</literal> imply an outer join.
ru: Слова <literal>INNER</literal> и <literal>OUTER</literal> необязательны во всех формах. По умолчанию подразумевается <literal>INNER</literal> (внутреннее соединение), а при указании <literal>LEFT</literal>, <literal>RIGHT</literal> и <literal>FULL</literal> &mdash; внешнее соединение.

source: The <firstterm>join condition</firstterm> is specified in the <literal>ON</literal> or <literal>USING</literal> clause, or implicitly by the word <literal>NATURAL</literal>. The join condition determines which rows from the two source tables are considered to <quote>match</quote>, as explained in detail below.
ru: <firstterm>Условие соединения</firstterm> указывается в предложении <literal>ON</literal> или <literal>USING</literal>, либо неявно задаётся ключевым словом <literal>NATURAL</literal>. Это условие определяет, какие строки двух исходных таблиц считаются <quote>соответствующими</quote> друг другу (это подробно рассматривается ниже).

source: For each row R1 of T1, the joined table has a row for each row in T2 that satisfies the join condition with R1.
ru: Для каждой строки R1 из T1 в результирующей таблице содержится строка для каждой строки в T2, удовлетворяющей условию соединения с R1.

source: <primary>join</primary> <secondary>left</secondary>
ru: <primary>соединение</primary> <secondary>левое</secondary>

source: <primary>left join</primary>
ru: <primary>левое соединение</primary>

source: First, an inner join is performed. Then, for each row in T1 that does not satisfy the join condition with any row in T2, a joined row is added with null values in columns of T2. Thus, the joined table always has at least one row for each row in T1.
ru: Сначала выполняется внутреннее соединение (INNER JOIN). Затем в результат добавляются все строки из T1, которым не соответствуют никакие строки в T2, а вместо значений столбцов T2 вставляются NULL. Таким образом, в результирующей таблице всегда будет минимум одна строка для каждой строки из T1.

source: <primary>join</primary> <secondary>right</secondary>
ru: <primary>соединение</primary> <secondary>справа</secondary>

source: <primary>right join</primary>
ru: <primary>правое соединение</primary>

source: First, an inner join is performed. Then, for each row in T2 that does not satisfy the join condition with any row in T1, a joined row is added with null values in columns of T1. This is the converse of a left join: the result table will always have a row for each row in T2.
ru: Сначала выполняется внутреннее соединение (INNER JOIN). Затем в результат добавляются все строки из T2, которым не соответствуют никакие строки в T1, а вместо значений столбцов T1 вставляются NULL. Это соединение является обратным к левому (LEFT JOIN): в результирующей таблице всегда будет минимум одна строка для каждой строки из T2.

source: First, an inner join is performed. Then, for each row in T1 that does not satisfy the join condition with any row in T2, a joined row is added with null values in columns of T2. Also, for each row of T2 that does not satisfy the join condition with any row in T1, a joined row with null values in the columns of T1 is added.
ru: Сначала выполняется внутреннее соединение. Затем в результат добавляются все строки из T1, которым не соответствуют никакие строки в T2, а вместо значений столбцов T2 вставляются NULL. И наконец, в результат включаются все строки из T2, которым не соответствуют никакие строки в T1, а вместо значений столбцов T1 вставляются NULL.

source: The possible types of qualified join are: <placeholder-1/>
ru: Возможные типы соединений с сопоставлениями строк: <placeholder-1/>

source: The <literal>ON</literal> clause is the most general kind of join condition: it takes a Boolean value expression of the same kind as is used in a <literal>WHERE</literal> clause. A pair of rows from <replaceable>T1</replaceable> and <replaceable>T2</replaceable> match if the <literal>ON</literal> expression evaluates to true.
ru: Предложение <literal>ON</literal> определяет наиболее общую форму условия соединения: в нём указываются выражения логического типа, подобные тем, что используются в предложении <literal>WHERE</literal>. Пара строк из <replaceable>T1</replaceable> и <replaceable>T2</replaceable> соответствуют друг другу, если выражение <literal>ON</literal> возвращает для них true.

source: The <literal>USING</literal> clause is a shorthand that allows you to take advantage of the specific situation where both sides of the join use the same name for the joining column(s). It takes a comma-separated list of the shared column names and forms a join condition that includes an equality comparison for each one. For example, joining <replaceable>T1</replaceable> and <replaceable>T2</replaceable> with <literal>USING (a, b)</literal> produces the join condition <literal>ON <replaceable>T1</replaceable>.a = <replaceable>T2</replaceable>.a AND <replaceable>T1</replaceable>.b = <replaceable>T2</replaceable>.b</literal>.
ru: <literal>USING</literal> &mdash; это сокращённая запись условия, полезная в ситуации, когда с обеих сторон соединения столбцы имеют одинаковые имена. Она принимает список общих имён столбцов через запятую и формирует условие соединения с равенством этих столбцов. Например, запись соединения <replaceable>T1</replaceable> и <replaceable>T2</replaceable> с <literal>USING (a, b)</literal> формирует условие <literal>ON <replaceable>T1</replaceable>.a = <replaceable>T2</replaceable>.a AND <replaceable>T1</replaceable>.b = <replaceable>T2</replaceable>.b</literal>.

source: Furthermore, the output of <literal>JOIN USING</literal> suppresses redundant columns: there is no need to print both of the matched columns, since they must have equal values. While <literal>JOIN ON</literal> produces all columns from <replaceable>T1</replaceable> followed by all columns from <replaceable>T2</replaceable>, <literal>JOIN USING</literal> produces one output column for each of the listed column pairs (in the listed order), followed by any remaining columns from <replaceable>T1</replaceable>, followed by any remaining columns from <replaceable>T2</replaceable>.
ru: Более того, при выводе <literal>JOIN USING</literal> исключаются избыточные столбцы: оба сопоставленных столбца выводить не нужно, так как они содержат одинаковые значения. Тогда как <literal>JOIN ON</literal> выдаёт все столбцы из <replaceable>T1</replaceable>, а за ними все столбцы из <replaceable>T2</replaceable>, <literal>JOIN USING</literal> выводит один столбец для каждой пары (в указанном порядке), за ними все оставшиеся столбцы из <replaceable>T1</replaceable> и, наконец, все оставшиеся столбцы <replaceable>T2</replaceable>.

source: <primary>join</primary> <secondary>natural</secondary>
ru: <primary>соединение</primary> <secondary>естественное</secondary>

source: <primary>natural join</primary>
ru: <primary>естественное соединение</primary>
