Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/queries.po
Languages: ru

source: <placeholder-1/> <placeholder-2/> Finally, <literal>NATURAL</literal> is a shorthand form of <literal>USING</literal>: it forms a <literal>USING</literal> list consisting of all column names that appear in both input tables. As with <literal>USING</literal>, these columns appear only once in the output table. If there are no common column names, <literal>NATURAL JOIN</literal> behaves like <literal>JOIN ... ON TRUE</literal>, producing a cross-product join.
ru: <placeholder-1/> <placeholder-2/> Наконец, <literal>NATURAL</literal> &mdash; сокращённая форма <literal>USING</literal>: она образует список <literal>USING</literal> из всех имён столбцов, существующих в обеих входных таблицах. Как и с <literal>USING</literal>, эти столбцы оказываются в выходной таблице в единственном экземпляре. Если столбцов с одинаковыми именами не находится, <literal>NATURAL JOIN</literal> действует как <literal>JOIN ... ON TRUE</literal> и выдаёт декартово произведение строк.

source: <literal>USING</literal> is reasonably safe from column changes in the joined relations since only the listed columns are combined. <literal>NATURAL</literal> is considerably more risky since any schema changes to either relation that cause a new matching column name to be present will cause the join to combine that new column as well.
ru: Предложение <literal>USING</literal> разумно защищено от изменений в соединяемых отношениях, так как оно связывает только явно перечисленные столбцы. <literal>NATURAL</literal> считается более рискованным, так как при любом изменении схемы в одном или другом отношении, когда появляются столбцы с совпадающими именами, при соединении будут связываться и эти новые столбцы.

source: To put this together, assume we have tables <literal>t1</literal>: <placeholder-1/> and <literal>t2</literal>: <placeholder-2/> then we get the following results for the various joins: <screen> <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 CROSS JOIN t2;</userinput> num | name | num | value -----+------+-----+------- 1 | a | 1 | xxx 1 | a | 3 | yyy 1 | a | 5 | zzz 2 | b | 1 | xxx 2 | b | 3 | yyy 2 | b | 5 | zzz 3 | c | 1 | xxx 3 | c | 3 | yyy 3 | c | 5 | zzz (9 rows) <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 INNER JOIN t2 ON t1.num = t2.num;</userinput> num | name | num | value -----+------+-----+------- 1 | a | 1 | xxx 3 | c | 3 | yyy (2 rows) <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 INNER JOIN t2 USING (num);</userinput> num | name | value -----+------+------- 1 | a | xxx 3 | c | yyy (2 rows) <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 NATURAL INNER JOIN t2;</userinput> num | name | value -----+------+------- 1 | a | xxx 3 | c | yyy (2 rows) <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 LEFT JOIN t2 ON t1.num = t2.num;</userinput> num | name | num | value -----+------+-----+------- 1 | a | 1 | xxx 2 | b | | 3 | c | 3 | yyy (3 rows) <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 LEFT JOIN t2 USING (num);</userinput> num | name | value -----+------+------- 1 | a | xxx 2 | b | 3 | c | yyy (3 rows) <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 RIGHT JOIN t2 ON t1.num = t2.num;</userinput> num | name | num | value -----+------+-----+------- 1 | a | 1 | xxx 3 | c | 3 | yyy | | 5 | zzz (3 rows) <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 FULL JOIN t2 ON t1.num = t2.num;</userinput> num | name | num | value -----+------+-----+------- 1 | a | 1 | xxx 2 | b | | 3 | c | 3 | yyy | | 5 | zzz (4 rows) </screen>
ru: Для наглядности предположим, что у нас есть таблицы <literal>t1</literal>: <placeholder-1/> и <literal>t2</literal>: <placeholder-2/> С ними для разных типов соединений мы получим следующие результаты: <screen> <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 CROSS JOIN t2;</userinput> num | name | num | value -----+------+-----+------- 1 | a | 1 | xxx 1 | a | 3 | yyy 1 | a | 5 | zzz 2 | b | 1 | xxx 2 | b | 3 | yyy 2 | b | 5 | zzz 3 | c | 1 | xxx 3 | c | 3 | yyy 3 | c | 5 | zzz (9 rows) <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 INNER JOIN t2 ON t1.num = t2.num;</userinput> num | name | num | value -----+------+-----+------- 1 | a | 1 | xxx 3 | c | 3 | yyy (2 rows) <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 INNER JOIN t2 USING (num);</userinput> num | name | value -----+------+------- 1 | a | xxx 3 | c | yyy (2 rows) <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 NATURAL INNER JOIN t2;</userinput> num | name | value -----+------+------- 1 | a | xxx 3 | c | yyy (2 rows) <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 LEFT JOIN t2 ON t1.num = t2.num;</userinput> num | name | num | value -----+------+-----+------- 1 | a | 1 | xxx 2 | b | | 3 | c | 3 | yyy (3 rows) <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 LEFT JOIN t2 USING (num);</userinput> num | name | value -----+------+------- 1 | a | xxx 2 | b | 3 | c | yyy (3 rows) <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 RIGHT JOIN t2 ON t1.num = t2.num;</userinput> num | name | num | value -----+------+-----+------- 1 | a | 1 | xxx 3 | c | 3 | yyy | | 5 | zzz (3 rows) <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 FULL JOIN t2 ON t1.num = t2.num;</userinput> num | name | num | value -----+------+-----+------- 1 | a | 1 | xxx 2 | b | | 3 | c | 3 | yyy | | 5 | zzz (4 rows) </screen>

source: The join condition specified with <literal>ON</literal> can also contain conditions that do not relate directly to the join. This can prove useful for some queries but needs to be thought out carefully. For example: <screen> <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 LEFT JOIN t2 ON t1.num = t2.num AND t2.value = 'xxx';</userinput> num | name | num | value -----+------+-----+------- 1 | a | 1 | xxx 2 | b | | 3 | c | | (3 rows) </screen> Notice that placing the restriction in the <literal>WHERE</literal> clause produces a different result: <screen> <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 LEFT JOIN t2 ON t1.num = t2.num WHERE t2.value = 'xxx';</userinput> num | name | num | value -----+------+-----+------- 1 | a | 1 | xxx (1 row) </screen> This is because a restriction placed in the <literal>ON</literal> clause is processed <emphasis>before</emphasis> the join, while a restriction placed in the <literal>WHERE</literal> clause is processed <emphasis>after</emphasis> the join. That does not matter with inner joins, but it matters a lot with outer joins.
ru: Условие соединения в предложении <literal>ON</literal> может также содержать выражения, не связанные непосредственно с соединением. Это может быть полезно в некоторых запросах, но не следует использовать это необдуманно. Рассмотрите следующий запрос: <screen> <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 LEFT JOIN t2 ON t1.num = t2.num AND t2.value = 'xxx';</userinput> num | name | num | value -----+------+-----+------- 1 | a | 1 | xxx 2 | b | | 3 | c | | (3 rows) </screen> Заметьте, что если поместить ограничение в предложение <literal>WHERE</literal>, вы получите другой результат: <screen> <prompt>=&gt;</prompt> <userinput>SELECT * FROM t1 LEFT JOIN t2 ON t1.num = t2.num WHERE t2.value = 'xxx';</userinput> num | name | num | value -----+------+-----+------- 1 | a | 1 | xxx (1 row) </screen> Это связано с тем, что ограничение, помещённое в предложение <literal>ON</literal>, обрабатывается <emphasis>до</emphasis> операции соединения, тогда как ограничение в <literal>WHERE</literal> &mdash; <emphasis>после</emphasis>. Это не имеет значения при внутренних соединениях, но важно при внешних.

source: Table and Column Aliases
ru: Псевдонимы таблиц и столбцов

source: <primary>alias</primary> <secondary>in the FROM clause</secondary>
ru: <primary>псевдоним</primary> <secondary>в предложении FROM</secondary>

source: <primary>label</primary> <see>alias</see>
ru: <primary>метка</primary> <see>псевдоним</see>

source: A temporary name can be given to tables and complex table references to be used for references to the derived table in the rest of the query. This is called a <firstterm>table alias</firstterm>.
ru: Таблицам и ссылкам на сложные таблицы в запросе можно дать временное имя, по которому к ним можно будет обращаться в рамках запроса. Такое имя называется <firstterm>псевдонимом таблицы</firstterm>.

source: To create a table alias, write <synopsis> FROM <replaceable>table_reference</replaceable> AS <replaceable>alias</replaceable> </synopsis> or <synopsis> FROM <replaceable>table_reference</replaceable> <replaceable>alias</replaceable> </synopsis> The <literal>AS</literal> key word is optional noise. <replaceable>alias</replaceable> can be any identifier.
ru: Определить псевдоним таблицы можно, написав <synopsis> FROM <replaceable>табличная_ссылка</replaceable> AS <replaceable>псевдоним</replaceable> </synopsis> или <synopsis> FROM <replaceable>табличная_ссылка</replaceable> <replaceable>псевдоним</replaceable> </synopsis> Ключевое слово <literal>AS</literal> является необязательным. Вместо <replaceable>псевдоним</replaceable> здесь может быть любой идентификатор.

source: SELECT * FROM some_very_long_table_name s JOIN another_fairly_long_name a ON s.id = a.num;
ru: SELECT * FROM "очень_длинное_имя_таблицы" s JOIN "другое_длинное_имя" a ON s.id = a.num;

source: A typical application of table aliases is to assign short identifiers to long table names to keep the join clauses readable. For example: <placeholder-1/>
ru: Псевдонимы часто применяются для назначения коротких идентификаторов длинным именам таблиц с целью улучшения читаемости запросов. Например: <placeholder-1/>

source: SELECT * FROM my_table AS m WHERE my_table.a &gt; 5; -- wrong
ru: SELECT * FROM my_table AS m WHERE my_table.a &gt; 5; -- неправильно

source: The alias becomes the new name of the table reference so far as the current query is concerned &mdash; it is not allowed to refer to the table by the original name elsewhere in the query. Thus, this is not valid: <placeholder-1/>
ru: Псевдоним становится новым именем таблицы в рамках текущего запроса, т. е. после назначения псевдонима использовать исходное имя таблицы в другом месте запроса нельзя. Таким образом, следующий запрос недопустим: <placeholder-1/>

source: Table aliases are mainly for notational convenience, but it is necessary to use them when joining a table to itself, e.g.: <placeholder-1/> Additionally, an alias is required if the table reference is a subquery (see <xref linkend="queries-subqueries"/>).
ru: Хотя в основном псевдонимы используются для удобства, они бывают необходимы, когда таблица соединяется сама с собой, например: <placeholder-1/> Кроме того, псевдонимы обязательно нужно назначать подзапросам (см. <xref remap="4" linkend="queries-subqueries"/>).

source: Parentheses are used to resolve ambiguities. In the following example, the first statement assigns the alias <literal>b</literal> to the second instance of <literal>my_table</literal>, but the second statement assigns the alias to the result of the join: <placeholder-1/>
ru: В случае неоднозначности определения псевдонимов можно использовать скобки. В следующем примере первый оператор назначает псевдоним <literal>b</literal> второму экземпляру <literal>my_table</literal>, а второй оператор назначает псевдоним результату соединения: <placeholder-1/>

source: Another form of table aliasing gives temporary names to the columns of the table, as well as the table itself: <synopsis> FROM <replaceable>table_reference</replaceable> <optional>AS</optional> <replaceable>alias</replaceable> ( <replaceable>column1</replaceable> <optional>, <replaceable>column2</replaceable> <optional>, ...</optional></optional> ) </synopsis> If fewer column aliases are specified than the actual table has columns, the remaining columns are not renamed. This syntax is especially useful for self-joins or subqueries.
ru: В другой форме назначения псевдонима временные имена даются не только таблицам, но и её столбцам: <synopsis> FROM <replaceable>табличная_ссылка</replaceable> <optional>AS</optional> <replaceable>псевдоним</replaceable> ( <replaceable>столбец1</replaceable> <optional>, <replaceable>столбец2</replaceable> <optional>, ...</optional></optional> ) </synopsis> Если псевдонимов столбцов оказывается меньше, чем фактически столбцов в таблице, остальные столбцы сохраняют свои исходные имена. Эта запись особенно полезна для замкнутых соединений или подзапросов.

source: When an alias is applied to the output of a <literal>JOIN</literal> clause, the alias hides the original name(s) within the <literal>JOIN</literal>. For example: <placeholder-1/> is valid SQL, but: <placeholder-2/> is not valid; the table alias <literal>a</literal> is not visible outside the alias <literal>c</literal>.
ru: Когда псевдоним применяется к результату <literal>JOIN</literal>, он скрывает оригинальные имена таблиц внутри <literal>JOIN</literal>. Например, это допустимый SQL-запрос: <placeholder-1/>а запрос: <placeholder-2/> ошибочный, так как псевдоним таблицы <literal>a</literal> не виден снаружи определения псевдонима <literal>c</literal>.

source: Subqueries
ru: Подзапросы

source: <primary>subquery</primary>
ru: <primary>подзапрос</primary>

source: FROM (SELECT * FROM table1) AS alias_name
ru: FROM (SELECT * FROM table1) AS псевдоним

source: Subqueries specifying a derived table must be enclosed in parentheses and <emphasis>must</emphasis> be assigned a table alias name (as in <xref linkend="queries-table-aliases"/>). For example: <placeholder-1/>
ru: Подзапросы, образующие таблицы, должны заключаться в скобки и им <emphasis>обязательно</emphasis> должны назначаться псевдонимы (как описано в <xref remap="6" linkend="queries-table-aliases"/>). Например: <placeholder-1/>

source: This example is equivalent to <literal>FROM table1 AS alias_name</literal>. More interesting cases, which cannot be reduced to a plain join, arise when the subquery involves grouping or aggregation.
ru: Этот пример равносилен записи <literal>FROM table1 AS псевдоним</literal>. Более интересные ситуации, которые нельзя свести к простому соединению, возникают, когда в подзапросе используются агрегирующие функции или группировка.

source: A subquery can also be a <command>VALUES</command> list: <placeholder-1/> Again, a table alias is required. Assigning alias names to the columns of the <command>VALUES</command> list is optional, but is good practice. For more information see <xref linkend="queries-values"/>.
ru: Подзапросом может также быть список <command>VALUES</command>: <placeholder-1/> Такому подзапросу тоже требуется псевдоним. Назначать псевдонимы столбцам списка <command>VALUES</command> не требуется, но вообще это хороший приём. Подробнее это описано в <xref remap="6" linkend="queries-values"/>.

source: Table Functions
ru: Табличные функции

source: <primary>table function</primary>
ru: <primary>табличная функция</primary>

source: <primary>function</primary> <secondary>in the FROM clause</secondary>
ru: <primary>функция</primary> <secondary>в предложении FROM</secondary>

source: Table functions are functions that produce a set of rows, made up of either base data types (scalar types) or composite data types (table rows). They are used like a table, view, or subquery in the <literal>FROM</literal> clause of a query. Columns returned by table functions can be included in <literal>SELECT</literal>, <literal>JOIN</literal>, or <literal>WHERE</literal> clauses in the same manner as columns of a table, view, or subquery.
ru: Табличные функции &mdash; это функции, выдающие набор строк, содержащих либо базовые типы данных (скалярных типов), либо составные типы (табличные строки). Они применяются в запросах как таблицы, представления или подзапросы в предложении <literal>FROM</literal>. Столбцы, возвращённые табличными функциями, можно включить в выражения <literal>SELECT</literal>, <literal>JOIN</literal> или <literal>WHERE</literal> так же, как столбцы таблиц, представлений или подзапросов.

source: Table functions may also be combined using the <literal>ROWS FROM</literal> syntax, with the results returned in parallel columns; the number of result rows in this case is that of the largest function result, with smaller results padded with null values to match.
ru: Табличные функции можно также скомбинировать, используя запись <literal>ROWS FROM</literal>. Результаты функций будут возвращены в параллельных столбцах; число строк в этом случае будет наибольшим из результатов всех функций, а результаты функций с меньшим количеством строк будут дополнены значениями NULL.

source: function_call
ru: вызов_функции

source: table_alias
ru: псевдоним_таблицы

source: column_alias
ru: псевдоним_столбца

source: If the <literal>WITH ORDINALITY</literal> clause is specified, an additional column of type <type>bigint</type> will be added to the function result columns. This column numbers the rows of the function result set, starting from 1. (This is a generalization of the SQL-standard syntax for <literal>UNNEST ... WITH ORDINALITY</literal>.) By default, the ordinal column is called <literal>ordinality</literal>, but a different column name can be assigned to it using an <literal>AS</literal> clause.
ru: Если указано предложение <literal>WITH ORDINALITY</literal>, к столбцам результатов функций будет добавлен ещё один, с типом <type>bigint</type>. В этом столбце нумеруются строки результирующего набора, начиная с 1. (Это обобщение стандартного SQL-синтаксиса <literal>UNNEST ... WITH ORDINALITY</literal>.) По умолчанию, этот столбец называется <literal>ordinality</literal>, но ему можно присвоить и другое имя с помощью указания <literal>AS</literal>.

source: The special table function <literal>UNNEST</literal> may be called with any number of array parameters, and it returns a corresponding number of columns, as if <literal>UNNEST</literal> (<xref linkend="functions-array"/>) had been called on each parameter separately and combined using the <literal>ROWS FROM</literal> construct.
ru: Специальную табличную функцию <literal>UNNEST</literal> можно вызвать с любым числом параметров-массивов, а возвращает она соответствующее число столбцов, как если бы <literal>UNNEST</literal> (<xref linkend="functions-array"/>) вызывалась для каждого параметра в отдельности, а результаты объединялись с помощью конструкции <literal>ROWS FROM</literal>.

source: array_expression
ru: выражение_массива

source: If no <replaceable>table_alias</replaceable> is specified, the function name is used as the table name; in the case of a <literal>ROWS FROM()</literal> construct, the first function's name is used.
ru: Если <replaceable>псевдоним_таблицы</replaceable> не указан, в качестве имени таблицы используется имя функции; в случае с конструкцией <literal>ROWS FROM()</literal> &mdash; имя первой функции.

source: If column aliases are not supplied, then for a function returning a base data type, the column name is also the same as the function name. For a function returning a composite type, the result columns get the names of the individual attributes of the type.
ru: Если псевдонимы столбцов не указаны, то для функции, возвращающей базовый тип данных, именем столбца будет имя функции. Для функций, возвращающих составной тип, имена результирующих столбцов определяются индивидуальными атрибутами типа.

source: Some examples: <placeholder-1/>
ru: Несколько примеров: <placeholder-1/>

source: In some cases it is useful to define table functions that can return different column sets depending on how they are invoked. To support this, the table function can be declared as returning the pseudotype <type>record</type>. When such a function is used in a query, the expected row structure must be specified in the query itself, so that the system can know how to parse and plan the query. This syntax looks like:
ru: В некоторых случаях бывает удобно определить табличную функцию, возвращающую различные наборы столбцов при разных вариантах вызова. Для этого нужно указать, что она возвращает псевдотип <type>record</type>. Используя такую функцию, ожидаемую структуру строк нужно описать в самом запросе, чтобы система знала, как разобрать запрос и составить его план. Записывается это так:

source: alias
ru: псевдоним

source: column_definition
ru: определение_столбца

source: When not using the <literal>ROWS FROM()</literal> syntax, the <replaceable>column_definition</replaceable> list replaces the column alias list that could otherwise be attached to the <literal>FROM</literal> item; the names in the column definitions serve as column aliases. When using the <literal>ROWS FROM()</literal> syntax, a <replaceable>column_definition</replaceable> list can be attached to each member function separately; or if there is only one member function and no <literal>WITH ORDINALITY</literal> clause, a <replaceable>column_definition</replaceable> list can be written in place of a column alias list following <literal>ROWS FROM()</literal>.
ru: Без <literal>ROWS FROM()</literal> список <replaceable>определения_столбцов</replaceable> заменяет список псевдонимов, который можно также добавить в предложении <literal>FROM</literal>; имена в определениях столбцов служат псевдонимами. С <literal>ROWS FROM()</literal> список <replaceable>определения_столбцов</replaceable> можно добавить к каждой функции отдельно, либо в случае с одной функцией и без предложения <literal>WITH ORDINALITY</literal>, список <replaceable>определения_столбцов</replaceable> можно записать вместо списка с псевдонимами столбцов после <literal>ROWS FROM()</literal>.

source: Consider this example: <placeholder-1/> The <xref linkend="contrib-dblink-function"/> function (part of the <xref linkend="dblink"/> module) executes a remote query. It is declared to return <type>record</type> since it might be used for any kind of query. The actual column set must be specified in the calling query so that the parser knows, for example, what <literal>*</literal> should expand to.
ru: Взгляните на этот пример: <placeholder-1/> Здесь функция <xref linkend="contrib-dblink-function"/> (из модуля <xref linkend="dblink"/>) выполняет удалённый запрос. Она объявлена как функция, возвращающая тип <type>record</type>, так как он подойдёт для запроса любого типа. В этом случае фактический набор столбцов функции необходимо описать в вызывающем её запросе, чтобы анализатор запроса знал, например, как преобразовать <literal>*</literal>.

source: <literal>LATERAL</literal> Subqueries
ru: Подзапросы <literal>LATERAL</literal>

source: <primary>LATERAL</primary> <secondary>in the FROM clause</secondary>
ru: <primary>LATERAL</primary> <secondary>в предложении FROM</secondary>

source: Subqueries appearing in <literal>FROM</literal> can be preceded by the key word <literal>LATERAL</literal>. This allows them to reference columns provided by preceding <literal>FROM</literal> items. (Without <literal>LATERAL</literal>, each subquery is evaluated independently and so cannot cross-reference any other <literal>FROM</literal> item.)
ru: Перед подзапросами в предложении <literal>FROM</literal> можно добавить ключевое слово <literal>LATERAL</literal>. Это позволит ссылаться в них на столбцы предшествующих элементов списка <literal>FROM</literal>. (Без <literal>LATERAL</literal> каждый подзапрос выполняется независимо и поэтому не может обращаться к другим элементам <literal>FROM</literal>.)

source: Table functions appearing in <literal>FROM</literal> can also be preceded by the key word <literal>LATERAL</literal>, but for functions the key word is optional; the function's arguments can contain references to columns provided by preceding <literal>FROM</literal> items in any case.
ru: Перед табличными функциями в предложении <literal>FROM</literal> также можно указать <literal>LATERAL</literal>, но для них это ключевое слово необязательно; в аргументах функций в любом случае можно обращаться к столбцам в предыдущих элементах <literal>FROM</literal>.
