Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/queries.po
Languages: ru

source: References to the grouping columns or expressions are replaced by null values in result rows for grouping sets in which those columns do not appear. To distinguish which grouping a particular output row resulted from, see <xref linkend="functions-grouping-table"/>.
ru: Ссылки на группирующие столбцы или выражения заменяются в результирующих строках значениями NULL для тех группирующих наборов, в которых эти столбцы отсутствуют. Чтобы можно было понять, результатом какого группирования стала конкретная выходная строка, предназначена функция, описанная в <xref remap="6" linkend="functions-grouping-table"/>.

source: A shorthand notation is provided for specifying two common types of grouping set. A clause of the form <placeholder-1/> represents the given list of expressions and all prefixes of the list including the empty list; thus it is equivalent to <placeholder-2/> This is commonly used for analysis over hierarchical data; e.g. total salary by department, division, and company-wide total.
ru: Для указания двух распространённых видов наборов группирования предусмотрена краткая запись. Предложение формы <placeholder-1/> представляет заданный список выражений и всех префиксов списка, включая пустой список; то есть оно равнозначно записи <placeholder-2/> Оно часто применяется для анализа иерархических данных, например, для суммирования зарплаты по отделам, подразделениям и компании в целом.

source: A clause of the form <placeholder-1/> represents the given list and all of its possible subsets (i.e. the power set). Thus <placeholder-2/> is equivalent to <placeholder-3/>
ru: Предложение формы <placeholder-1/> представляет заданный список и все его возможные подмножества (степень множества). Таким образом, запись <placeholder-2/> равнозначна <placeholder-3/>

source: The individual elements of a <literal>CUBE</literal> or <literal>ROLLUP</literal> clause may be either individual expressions, or sublists of elements in parentheses. In the latter case, the sublists are treated as single units for the purposes of generating the individual grouping sets. For example: <placeholder-1/> is equivalent to <placeholder-2/> and <placeholder-3/> is equivalent to <placeholder-4/>
ru: Элементами предложений <literal>CUBE</literal> и <literal>ROLLUP</literal> могут быть либо отдельные выражения, либо вложенные списки элементов в скобках. Вложенные списки обрабатываются как атомарные единицы, с которыми формируются отдельные наборы группирования. Например: <placeholder-1/> равнозначно <placeholder-2/> и <placeholder-3/> равнозначно <placeholder-4/>

source: The <literal>CUBE</literal> and <literal>ROLLUP</literal> constructs can be used either directly in the <literal>GROUP BY</literal> clause, or nested inside a <literal>GROUPING SETS</literal> clause. If one <literal>GROUPING SETS</literal> clause is nested inside another, the effect is the same as if all the elements of the inner clause had been written directly in the outer clause.
ru: Конструкции <literal>CUBE</literal> и <literal>ROLLUP</literal> могут применяться либо непосредственно в предложении <literal>GROUP BY</literal>, либо вкладываться внутрь предложения <literal>GROUPING SETS</literal>. Если одно предложение <literal>GROUPING SETS</literal> вкладывается внутрь другого, результат будет таким же, как если бы все элементы внутреннего предложения были записаны непосредственно во внешнем.

source: If multiple grouping items are specified in a single <literal>GROUP BY</literal> clause, then the final list of grouping sets is the cross product of the individual items. For example: <placeholder-1/> is equivalent to <placeholder-2/>
ru: Если в одном предложении <literal>GROUP BY</literal> задаётся несколько элементов группирования, окончательный список наборов группирования образуется как прямое произведение этих элементов. Например: <placeholder-1/> равнозначно <placeholder-2/>

source: The construct <literal>(a, b)</literal> is normally recognized in expressions as a <link linkend="sql-syntax-row-constructors">row constructor</link>. Within the <literal>GROUP BY</literal> clause, this does not apply at the top levels of expressions, and <literal>(a, b)</literal> is parsed as a list of expressions as described above. If for some reason you <emphasis>need</emphasis> a row constructor in a grouping expression, use <literal>ROW(a, b)</literal>.
ru: Конструкция <literal>(a, b)</literal> обычно воспринимается в выражениях как <link linkend="sql-syntax-row-constructors">конструктор строки</link>. Однако в предложении <literal>GROUP BY</literal> на верхнем уровне выражений запись <literal>(a, b)</literal> воспринимается как список выражений, как описано выше. Если вам по какой-либо причине <emphasis>нужен</emphasis> именно конструктор строки в выражении группирования, используйте запись <literal>ROW(a, b)</literal>.

source: Window Function Processing
ru: Обработка оконных функций

source: <primary>window function</primary> <secondary>order of execution</secondary>
ru: <primary>оконная функция</primary> <secondary>порядок выполнения</secondary>

source: If the query contains any window functions (see <xref linkend="tutorial-window"/>, <xref linkend="functions-window"/> and <xref linkend="syntax-window-functions"/>), these functions are evaluated after any grouping, aggregation, and <literal>HAVING</literal> filtering is performed. That is, if the query uses any aggregates, <literal>GROUP BY</literal>, or <literal>HAVING</literal>, then the rows seen by the window functions are the group rows instead of the original table rows from <literal>FROM</literal>/<literal>WHERE</literal>.
ru: Если запрос содержит оконные функции (см. <xref remap="4" linkend="tutorial-window"/>, <xref remap="4" linkend="functions-window"/> и <xref remap="4" linkend="syntax-window-functions"/>), эти функции вычисляются после каждой группировки, агрегатных выражений и фильтрации <literal>HAVING</literal>. Другими словами, если в запросе есть агрегатные функции, предложения <literal>GROUP BY</literal> или <literal>HAVING</literal>, оконные функции видят не исходные строки, полученные из <literal>FROM</literal>/<literal>WHERE</literal>, а сгруппированные.

source: When multiple window functions are used, all the window functions having syntactically equivalent <literal>PARTITION BY</literal> and <literal>ORDER BY</literal> clauses in their window definitions are guaranteed to be evaluated in a single pass over the data. Therefore they will see the same sort ordering, even if the <literal>ORDER BY</literal> does not uniquely determine an ordering. However, no guarantees are made about the evaluation of functions having different <literal>PARTITION BY</literal> or <literal>ORDER BY</literal> specifications. (In such cases a sort step is typically required between the passes of window function evaluations, and the sort is not guaranteed to preserve ordering of rows that its <literal>ORDER BY</literal> sees as equivalent.)
ru: Когда используются несколько оконных функций, все оконные функции, имеющие в своих определениях синтаксически равнозначные предложения <literal>PARTITION BY</literal> и <literal>ORDER BY</literal>, гарантированно обрабатывают данные за один проход. Таким образом, они увидят один порядок сортировки, даже если <literal>ORDER BY</literal> не определяет порядок однозначно. Однако относительно функций с разными формулировками <literal>PARTITION BY</literal> и <literal>ORDER BY</literal> никаких гарантий не даётся. (В таких случаях между проходами вычислений оконных функций обычно требуется дополнительный этап сортировки и эта сортировка может не сохранять порядок строк, равнозначный с точки зрения <literal>ORDER BY</literal>.)

source: Currently, window functions always require presorted data, and so the query output will be ordered according to one or another of the window functions' <literal>PARTITION BY</literal>/<literal>ORDER BY</literal> clauses. It is not recommended to rely on this, however. Use an explicit top-level <literal>ORDER BY</literal> clause if you want to be sure the results are sorted in a particular way.
ru: В настоящее время оконные функции всегда требуют предварительно отсортированных данных, так что результат запроса будет отсортирован согласно тому или иному предложению <literal>PARTITION BY</literal>/<literal>ORDER BY</literal> оконных функций. Однако полагаться на это не следует. Если вы хотите, чтобы результаты сортировались определённым образом, явно добавьте предложение <literal>ORDER BY</literal> на верхнем уровне запроса.

source: Select Lists
ru: Списки выборки

source: <primary>SELECT</primary> <secondary>select list</secondary>
ru: <primary>SELECT</primary> <secondary>список выборки</secondary>

source: As shown in the previous section, the table expression in the <command>SELECT</command> command constructs an intermediate virtual table by possibly combining tables, views, eliminating rows, grouping, etc. This table is finally passed on to processing by the <firstterm>select list</firstterm>. The select list determines which <emphasis>columns</emphasis> of the intermediate table are actually output.
ru: Как говорилось в предыдущем разделе, табличное выражение в <command>SELECT</command> создаёт промежуточную виртуальную таблицу, возможно объединяя таблицы, представления, группируя и исключая лишние строки и т. д. Полученная таблица передаётся для обработки в <firstterm>список выборки</firstterm>. Этот список выбирает, какие <emphasis>столбцы</emphasis> промежуточной таблицы должны выводиться в результате и как именно.

source: Select-List Items
ru: Элементы списка выборки

source: The simplest kind of select list is <literal>*</literal> which emits all columns that the table expression produces. Otherwise, a select list is a comma-separated list of value expressions (as defined in <xref linkend="sql-expressions"/>). For instance, it could be a list of column names: <placeholder-1/> The columns names <literal>a</literal>, <literal>b</literal>, and <literal>c</literal> are either the actual names of the columns of tables referenced in the <literal>FROM</literal> clause, or the aliases given to them as explained in <xref linkend="queries-table-aliases"/>. The name space available in the select list is the same as in the <literal>WHERE</literal> clause, unless grouping is used, in which case it is the same as in the <literal>HAVING</literal> clause.
ru: Простейший список выборки образует элемент <literal>*</literal>, который выбирает все столбцы из полученного табличного выражения. Список выборки также может содержать список выражений значения через запятую (как определено в <xref remap="6" linkend="sql-expressions"/>). Например, это может быть список имён столбцов: <placeholder-1/> Имена столбцов <literal>a</literal>, <literal>b</literal> и <literal>c</literal> представляют либо фактические имена столбцов таблиц, перечисленных в предложении <literal>FROM</literal>, либо их псевдонимы, определённые как описано в <xref remap="6" linkend="queries-table-aliases"/>. Пространство имён в списке выборки то же, что и в предложении <literal>WHERE</literal>, если не используется группировка. В противном случае оно совпадает с пространством имён предложения <literal>HAVING</literal>.

source: If more than one table has a column of the same name, the table name must also be given, as in: <placeholder-1/> When working with multiple tables, it can also be useful to ask for all the columns of a particular table: <placeholder-2/> See <xref linkend="rowtypes-usage"/> for more about the <replaceable>table_name</replaceable><literal>.*</literal> notation.
ru: Если столбец с заданным именем есть в нескольких таблицах, необходимо также указать имя таблицы, например так: <placeholder-1/> Обращаясь к нескольким таблицам, бывает удобно получить сразу все столбцы одной из таблиц: <placeholder-2/> Подробнее запись <replaceable>имя_таблицы</replaceable><literal>.*</literal> описывается в <xref remap="6" linkend="rowtypes-usage"/>.

source: If an arbitrary value expression is used in the select list, it conceptually adds a new virtual column to the returned table. The value expression is evaluated once for each result row, with the row's values substituted for any column references. But the expressions in the select list do not have to reference any columns in the table expression of the <literal>FROM</literal> clause; they can be constant arithmetic expressions, for instance.
ru: Если в списке выборки используется обычное выражение значения, по сути при этом в возвращаемую таблицу добавляется новый виртуальный столбец. Выражение значения вычисляется один раз для каждой строки результата со значениями столбцов в данной строке. Хотя выражения в списке выборки не обязательно должны обращаться к столбцам табличного выражения из предложения <literal>FROM</literal>; они могут содержать, например и простые арифметические выражения.

source: Column Labels
ru: Метки столбцов

source: <primary>alias</primary> <secondary>in the select list</secondary>
ru: <primary>псевдоним</primary> <secondary>в списке выборке</secondary>

source: The entries in the select list can be assigned names for subsequent processing, such as for use in an <literal>ORDER BY</literal> clause or for display by the client application. For example: <placeholder-1/>
ru: Элементам в списке выборки можно назначить имена для последующей обработки, например, для указания в предложении <literal>ORDER BY</literal> или для вывода в клиентском приложении. Например: <placeholder-1/>

source: If no output column name is specified using <literal>AS</literal>, the system assigns a default column name. For simple column references, this is the name of the referenced column. For function calls, this is the name of the function. For complex expressions, the system will generate a generic name.
ru: Если выходное имя столбца не определено (с помощью <literal>AS</literal>), система назначает имя сама. Для простых ссылок на столбцы этим именем становится имя целевого столбца, а для вызовов функций это имя функции. Для сложных выражений система генерирует некоторое подходящее имя.

source: The <literal>AS</literal> keyword is optional, but only if the new column name does not match any <productname>PostgreSQL</productname> keyword (see <xref linkend="sql-keywords-appendix"/>). To avoid an accidental match to a keyword, you can double-quote the column name. For example, <literal>VALUE</literal> is a keyword, so this does not work: <placeholder-1/> but this does: <placeholder-2/> For protection against possible future keyword additions, it is recommended that you always either write <literal>AS</literal> or double-quote the output column name.
ru: Слово <literal>AS</literal> можно опустить, но только если имя нового столбца не является ключевым словом <productname>PostgreSQL</productname> (см. <xref remap="4" linkend="sql-keywords-appendix"/>). Во избежание случайного совпадения имени с ключевым словом это имя можно заключить в кавычки. Например, <literal>VALUE</literal> &mdash; ключевое слово, поэтому такой вариант не будет работать: <placeholder-1/> а такой будет: <placeholder-2/> Для предотвращения конфликта с ключевыми словами, которые могут появиться в будущем, рекомендуется всегда писать <literal>AS</literal> или заключать метки выходных столбцов в кавычки.

source: The naming of output columns here is different from that done in the <literal>FROM</literal> clause (see <xref linkend="queries-table-aliases"/>). It is possible to rename the same column twice, but the name assigned in the select list is the one that will be passed on.
ru: Именование выходных столбцов отличается от того, что происходит в предложении <literal>FROM</literal> (см. <xref remap="4" linkend="queries-table-aliases"/>). Один столбец можно переименовать дважды, но на выходе окажется имя, назначенное в списке выборки.

source: <primary>duplicates</primary>
ru: <primary>дублирование</primary>

source: After the select list has been processed, the result table can optionally be subject to the elimination of duplicate rows. The <literal>DISTINCT</literal> key word is written directly after <literal>SELECT</literal> to specify this: <synopsis> SELECT DISTINCT <replaceable>select_list</replaceable> ... </synopsis> (Instead of <literal>DISTINCT</literal> the key word <literal>ALL</literal> can be used to specify the default behavior of retaining all rows.)
ru: После обработки списка выборки в результирующей таблице можно дополнительно исключить дублирующиеся строки. Для этого сразу после <literal>SELECT</literal> добавляется ключевое слово <literal>DISTINCT</literal>: <synopsis> SELECT DISTINCT <replaceable>список_выборки</replaceable> ... </synopsis> (Чтобы явно включить поведение по умолчанию, когда возвращаются все строки, вместо <literal>DISTINCT</literal> можно указать ключевое слово <literal>ALL</literal>.)

source: <primary>null value</primary> <secondary sortas="DISTINCT">in DISTINCT</secondary>
ru: <primary>NULL-значение</primary> <secondary sortas="DISTINCT">в DISTINCT</secondary>

source: Obviously, two rows are considered distinct if they differ in at least one column value. Null values are considered equal in this comparison.
ru: Две строки считаются разными, если они содержат различные значения минимум в одном столбце. При этом значения NULL полагаются равными.

source: Alternatively, an arbitrary expression can determine what rows are to be considered distinct: <synopsis> SELECT DISTINCT ON (<replaceable>expression</replaceable> <optional>, <replaceable>expression</replaceable> ...</optional>) <replaceable>select_list</replaceable> ... </synopsis> Here <replaceable>expression</replaceable> is an arbitrary value expression that is evaluated for all rows. A set of rows for which all the expressions are equal are considered duplicates, and only the first row of the set is kept in the output. Note that the <quote>first row</quote> of a set is unpredictable unless the query is sorted on enough columns to guarantee a unique ordering of the rows arriving at the <literal>DISTINCT</literal> filter. (<literal>DISTINCT ON</literal> processing occurs after <literal>ORDER BY</literal> sorting.)
ru: Кроме того, можно явно определить, какие строки будут считаться различными, следующим образом: <synopsis> SELECT DISTINCT ON (<replaceable>выражение</replaceable> <optional>, <replaceable>выражение</replaceable> ...</optional>) <replaceable>список_выборки</replaceable> ... </synopsis> Здесь <replaceable>выражение</replaceable> &mdash; обычное выражение значения, вычисляемое для всех строк. Строки, для которых перечисленные выражения дают один результат, считаются дублирующимися и возвращается только первая строка из такого набора. Заметьте, что <quote>первая строка</quote> набора может быть любой, если только запрос не включает сортировку, гарантирующую однозначный порядок строк, поступающих в фильтр <literal>DISTINCT</literal>. (Обработка <literal>DISTINCT ON</literal> производится после сортировки <literal>ORDER BY</literal>.)

source: The <literal>DISTINCT ON</literal> clause is not part of the SQL standard and is sometimes considered bad style because of the potentially indeterminate nature of its results. With judicious use of <literal>GROUP BY</literal> and subqueries in <literal>FROM</literal>, this construct can be avoided, but it is often the most convenient alternative.
ru: Предложение <literal>DISTINCT ON</literal> не описано в стандарте SQL и иногда его применение считается плохим стилем из-за возможной неопределённости в результатах. При разумном использовании <literal>GROUP BY</literal> и подзапросов во <literal>FROM</literal> можно обойтись без этой конструкции, но часто она бывает удобнее.

source: Combining Queries
ru: Сочетание запросов

source: <primary>set union</primary>
ru: <primary>объединение множеств</primary>

source: <primary>set intersection</primary>
ru: <primary>пересечение множеств</primary>

source: <primary>set difference</primary>
ru: <primary>вычитание множеств</primary>

source: <primary>set operation</primary>
ru: <primary>операции над множествами</primary>

source: The results of two queries can be combined using the set operations union, intersection, and difference. The syntax is <synopsis> <replaceable>query1</replaceable> UNION <optional>ALL</optional> <replaceable>query2</replaceable> <replaceable>query1</replaceable> INTERSECT <optional>ALL</optional> <replaceable>query2</replaceable> <replaceable>query1</replaceable> EXCEPT <optional>ALL</optional> <replaceable>query2</replaceable> </synopsis> <replaceable>query1</replaceable> and <replaceable>query2</replaceable> are queries that can use any of the features discussed up to this point. Set operations can also be nested and chained, for example <synopsis> <replaceable>query1</replaceable> UNION <replaceable>query2</replaceable> UNION <replaceable>query3</replaceable> </synopsis> which is executed as: <synopsis> (<replaceable>query1</replaceable> UNION <replaceable>query2</replaceable>) UNION <replaceable>query3</replaceable> </synopsis>
ru: Результаты двух запросов можно обработать, используя операции над множествами: объединение, пересечение и вычитание. Эти операции записываются соответственно так: <synopsis> <replaceable>запрос1</replaceable> UNION <optional>ALL</optional> <replaceable>запрос2</replaceable> <replaceable>запрос1</replaceable> INTERSECT <optional>ALL</optional> <replaceable>запрос2</replaceable> <replaceable>запрос1</replaceable> EXCEPT <optional>ALL</optional> <replaceable>запрос2</replaceable> </synopsis> Здесь <replaceable>запрос1</replaceable> и <replaceable>запрос2</replaceable> &mdash; это запросы, в которых могут использоваться все возможности, рассмотренные до этого. Операции над множествами тоже можно вкладывать и соединять, например:<synopsis> <replaceable>запрос1</replaceable> UNION <replaceable>запрос2</replaceable> UNION <replaceable>запрос3</replaceable> </synopsis> Этот сложный запрос выполняется так: <synopsis> (<replaceable>запрос1</replaceable> UNION <replaceable>запрос2</replaceable>) UNION <replaceable>запрос3</replaceable> </synopsis>

source: <literal>UNION</literal> effectively appends the result of <replaceable>query2</replaceable> to the result of <replaceable>query1</replaceable> (although there is no guarantee that this is the order in which the rows are actually returned). Furthermore, it eliminates duplicate rows from its result, in the same way as <literal>DISTINCT</literal>, unless <literal>UNION ALL</literal> is used.
ru: <literal>UNION</literal> по сути добавляет результаты второго запроса к результатам первого (хотя никакой порядок возвращаемых строк при этом не гарантируется). Более того, эта операция убирает дублирующиеся строки из результата так же, как это делает <literal>DISTINCT</literal>, если только не указано <literal>UNION ALL</literal>.

source: <literal>INTERSECT</literal> returns all rows that are both in the result of <replaceable>query1</replaceable> and in the result of <replaceable>query2</replaceable>. Duplicate rows are eliminated unless <literal>INTERSECT ALL</literal> is used.
ru: <literal>INTERSECT</literal> возвращает все строки, содержащиеся в результате и первого, и второго запроса. Дублирующиеся строки отфильтровываются, если не указано <literal>ALL</literal>.
