Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/queries.po
Languages: ru

source: <literal>EXCEPT</literal> returns all rows that are in the result of <replaceable>query1</replaceable> but not in the result of <replaceable>query2</replaceable>. (This is sometimes called the <firstterm>difference</firstterm> between two queries.) Again, duplicates are eliminated unless <literal>EXCEPT ALL</literal> is used.
ru: <literal>EXCEPT</literal> возвращает все строки, которые есть в результате первого запроса, но отсутствуют в результате второго. (Иногда это называют <firstterm>разницей</firstterm> двух запросов.) И здесь дублирующиеся строки отфильтровываются, если не указано <literal>ALL</literal>.

source: In order to calculate the union, intersection, or difference of two queries, the two queries must be <quote>union compatible</quote>, which means that they return the same number of columns and the corresponding columns have compatible data types, as described in <xref linkend="typeconv-union-case"/>.
ru: Чтобы можно было вычислить объединение, пересечение или разницу результатов двух запросов, эти запросы должны быть <quote>совместимыми для объединения</quote>, что означает, что они должны иметь одинаковое число столбцов и соответствующие столбцы должны быть совместимых типов, как описывается в <xref remap="6" linkend="typeconv-union-case"/>.

source: Sorting Rows
ru: Сортировка строк

source: <primary>sorting</primary>
ru: <primary>сортировка</primary>

source: After a query has produced an output table (after the select list has been processed) it can optionally be sorted. If sorting is not chosen, the rows will be returned in an unspecified order. The actual order in that case will depend on the scan and join plan types and the order on disk, but it must not be relied on. A particular output ordering can only be guaranteed if the sort step is explicitly chosen.
ru: После того как запрос выдал таблицу результатов (после обработки списка выборки), её можно отсортировать. Если сортировка не задана, строки возвращаются в неопределённом порядке. Фактический порядок строк в этом случае будет зависеть от плана соединения и сканирования, а также от порядка данных на диске, поэтому полагаться на него нельзя. Определённый порядок выводимых строк гарантируется, только если этап сортировки задан явно.

source: Actually, <productname>PostgreSQL</productname> uses the <firstterm>default B-tree operator class</firstterm> for the expression's data type to determine the sort ordering for <literal>ASC</literal> and <literal>DESC</literal>. Conventionally, data types will be set up so that the <literal>&lt;</literal> and <literal>&gt;</literal> operators correspond to this sort ordering, but a user-defined data type's designer could choose to do something different.
ru: На деле <productname>PostgreSQL</productname> определяет порядок сортировки для <literal>ASC</literal> и <literal>DESC</literal> по <firstterm>классу оператора B-дерева по умолчанию</firstterm> для типа данных выражения. Обычно типы данных создаются так, что этому порядку соответствуют операторы <literal>&lt;</literal> и <literal>&gt;</literal>, но возможно разработать собственный тип данных, который будет вести себя по-другому.

source: The <literal>ORDER BY</literal> clause specifies the sort order: <synopsis> SELECT <replaceable>select_list</replaceable> FROM <replaceable>table_expression</replaceable> ORDER BY <replaceable>sort_expression1</replaceable> <optional>ASC | DESC</optional> <optional>NULLS { FIRST | LAST }</optional> <optional>, <replaceable>sort_expression2</replaceable> <optional>ASC | DESC</optional> <optional>NULLS { FIRST | LAST }</optional> ...</optional> </synopsis> The sort expression(s) can be any expression that would be valid in the query's select list. An example is: <placeholder-1/> When more than one expression is specified, the later values are used to sort rows that are equal according to the earlier values. Each expression can be followed by an optional <literal>ASC</literal> or <literal>DESC</literal> keyword to set the sort direction to ascending or descending. <literal>ASC</literal> order is the default. Ascending order puts smaller values first, where <quote>smaller</quote> is defined in terms of the <literal>&lt;</literal> operator. Similarly, descending order is determined with the <literal>&gt;</literal> operator. <placeholder-2/>
ru: Порядок сортировки определяет предложение <literal>ORDER BY</literal>: <synopsis> SELECT <replaceable>список_выборки</replaceable> FROM <replaceable>табличное_выражение</replaceable> ORDER BY <replaceable>выражение_сортировки1</replaceable> <optional>ASC | DESC</optional> <optional>NULLS { FIRST | LAST }</optional> <optional>, <replaceable>выражение_сортировки2</replaceable> <optional>ASC | DESC</optional> <optional>NULLS { FIRST | LAST }</optional> ...</optional> </synopsis> Выражениями сортировки могут быть любые выражения, допустимые в списке выборки запроса. Например: <placeholder-1/> Когда указывается несколько выражений, последующие значения позволяют отсортировать строки, в которых совпали все предыдущие значения. Каждое выражение можно дополнить ключевыми словами <literal>ASC</literal> или <literal>DESC</literal>, которые выбирают сортировку соответственно по возрастанию или убыванию. По умолчанию принят порядок по возрастанию (<literal>ASC</literal>). При сортировке по возрастанию сначала идут меньшие значения, где понятие <quote>меньше</quote> определяется оператором <literal>&lt;</literal>. Подобным образом, сортировка по возрастанию определяется оператором <literal>&gt;</literal>. <placeholder-2/>

source: The <literal>NULLS FIRST</literal> and <literal>NULLS LAST</literal> options can be used to determine whether nulls appear before or after non-null values in the sort ordering. By default, null values sort as if larger than any non-null value; that is, <literal>NULLS FIRST</literal> is the default for <literal>DESC</literal> order, and <literal>NULLS LAST</literal> otherwise.
ru: Для определения места значений NULL можно использовать указания <literal>NULLS FIRST</literal> и <literal>NULLS LAST</literal>, которые помещают значения NULL соответственно до или после значений не NULL. По умолчанию значения NULL считаются больше любых других, то есть подразумевается <literal>NULLS FIRST</literal> для порядка <literal>DESC</literal> и <literal>NULLS LAST</literal> в противном случае.

source: Note that the ordering options are considered independently for each sort column. For example <literal>ORDER BY x, y DESC</literal> means <literal>ORDER BY x ASC, y DESC</literal>, which is not the same as <literal>ORDER BY x DESC, y DESC</literal>.
ru: Заметьте, что порядки сортировки определяются независимо для каждого столбца. Например, <literal>ORDER BY x, y DESC</literal> означает <literal>ORDER BY x ASC, y DESC</literal>, и это не то же самое, что <literal>ORDER BY x DESC, y DESC</literal>.

source: SELECT a + b AS sum, c FROM table1 ORDER BY sum + c; -- wrong
ru: SELECT a + b AS sum, c FROM table1 ORDER BY sum + c; -- неправильно

source: A <replaceable>sort_expression</replaceable> can also be the column label or number of an output column, as in: <placeholder-1/> both of which sort by the first output column. Note that an output column name has to stand alone, that is, it cannot be used in an expression &mdash; for example, this is <emphasis>not</emphasis> correct: <placeholder-2/> This restriction is made to reduce ambiguity. There is still ambiguity if an <literal>ORDER BY</literal> item is a simple name that could match either an output column name or a column from the table expression. The output column is used in such cases. This would only cause confusion if you use <literal>AS</literal> to rename an output column to match some other table column's name.
ru: Здесь <replaceable>выражение_сортировки</replaceable> может быть меткой столбца или номером выводимого столбца, как в данном примере: <placeholder-1/>Оба эти запроса сортируют результат по первому столбцу. Заметьте, что имя выводимого столбца должно оставаться само по себе, его нельзя использовать в выражении. Например, это <emphasis>ошибка</emphasis>: <placeholder-2/> Это ограничение позволяет уменьшить неоднозначность. Тем не менее неоднозначность возможна, когда в <literal>ORDER BY</literal> указано простое имя, но оно соответствует и имени выходного столбца, и столбцу из табличного выражения. В этом случае используется выходной столбец. Эта ситуация может возникнуть, только когда с помощью <literal>AS</literal> выходному столбцу назначается то же имя, что имеет столбец в другой таблице.

source: <literal>ORDER BY</literal> can be applied to the result of a <literal>UNION</literal>, <literal>INTERSECT</literal>, or <literal>EXCEPT</literal> combination, but in this case it is only permitted to sort by output column names or numbers, not by expressions.
ru: <literal>ORDER BY</literal> можно применить к результату комбинации <literal>UNION</literal>, <literal>INTERSECT</literal> и <literal>EXCEPT</literal>, но в этом случае возможна сортировка только по номерам или именам столбцов, но не по выражениям.

source: <literal>LIMIT</literal> and <literal>OFFSET</literal>
ru: <literal>LIMIT</literal> и <literal>OFFSET</literal>

source: <literal>LIMIT</literal> and <literal>OFFSET</literal> allow you to retrieve just a portion of the rows that are generated by the rest of the query: <synopsis> SELECT <replaceable>select_list</replaceable> FROM <replaceable>table_expression</replaceable> <optional> ORDER BY ... </optional> <optional> LIMIT { <replaceable>number</replaceable> | ALL } </optional> <optional> OFFSET <replaceable>number</replaceable> </optional> </synopsis>
ru: Указания <literal>LIMIT</literal> и <literal>OFFSET</literal> позволяют получить только часть строк из тех, что выдал остальной запрос: <synopsis> SELECT <replaceable>список_выборки</replaceable> FROM <replaceable>табличное_выражение</replaceable> <optional> ORDER BY ... </optional> <optional> LIMIT { <replaceable>число</replaceable> | ALL } </optional> <optional> OFFSET <replaceable>число</replaceable> </optional> </synopsis>

source: If a limit count is given, no more than that many rows will be returned (but possibly fewer, if the query itself yields fewer rows). <literal>LIMIT ALL</literal> is the same as omitting the <literal>LIMIT</literal> clause, as is <literal>LIMIT</literal> with a NULL argument.
ru: Если указывается число LIMIT, в результате возвращается не больше заданного числа строк (меньше может быть, если сам запрос выдал меньшее количество строк). <literal>LIMIT ALL</literal> равносильно отсутствию указания <literal>LIMIT</literal>, как и <literal>LIMIT</literal> с аргументом NULL.

source: <literal>OFFSET</literal> says to skip that many rows before beginning to return rows. <literal>OFFSET 0</literal> is the same as omitting the <literal>OFFSET</literal> clause, as is <literal>OFFSET</literal> with a NULL argument.
ru: <literal>OFFSET</literal> указывает пропустить указанное число строк, прежде чем начать выдавать строки. <literal>OFFSET 0</literal> равносильно отсутствию указания <literal>OFFSET</literal>, как и <literal>OFFSET</literal> с аргументом NULL.

source: If both <literal>OFFSET</literal> and <literal>LIMIT</literal> appear, then <literal>OFFSET</literal> rows are skipped before starting to count the <literal>LIMIT</literal> rows that are returned.
ru: Если указано и <literal>OFFSET</literal>, и <literal>LIMIT</literal>, сначала система пропускает <literal>OFFSET</literal> строк, а затем начинает подсчитывать строки для ограничения <literal>LIMIT</literal>.

source: When using <literal>LIMIT</literal>, it is important to use an <literal>ORDER BY</literal> clause that constrains the result rows into a unique order. Otherwise you will get an unpredictable subset of the query's rows. You might be asking for the tenth through twentieth rows, but tenth through twentieth in what ordering? The ordering is unknown, unless you specified <literal>ORDER BY</literal>.
ru: Применяя <literal>LIMIT</literal>, важно использовать также предложение <literal>ORDER BY</literal>, чтобы строки результата выдавались в определённом порядке. Иначе будут возвращаться непредсказуемые подмножества строк. Вы можете запросить строки с десятой по двадцатую, но какой порядок вы имеете в виду? Порядок будет неизвестен, если не добавить <literal>ORDER BY</literal>.

source: The query optimizer takes <literal>LIMIT</literal> into account when generating query plans, so you are very likely to get different plans (yielding different row orders) depending on what you give for <literal>LIMIT</literal> and <literal>OFFSET</literal>. Thus, using different <literal>LIMIT</literal>/<literal>OFFSET</literal> values to select different subsets of a query result <emphasis>will give inconsistent results</emphasis> unless you enforce a predictable result ordering with <literal>ORDER BY</literal>. This is not a bug; it is an inherent consequence of the fact that SQL does not promise to deliver the results of a query in any particular order unless <literal>ORDER BY</literal> is used to constrain the order.
ru: Оптимизатор запроса учитывает ограничение <literal>LIMIT</literal>, строя планы выполнения запросов, поэтому вероятнее всего планы (а значит и порядок строк) будут меняться при разных <literal>LIMIT</literal> и <literal>OFFSET</literal>. Таким образом, различные значения <literal>LIMIT</literal>/<literal>OFFSET</literal>, выбирающие разные подмножества результатов запроса, <emphasis>приведут к несогласованности результатов</emphasis>, если не установить предсказуемую сортировку с помощью <literal>ORDER BY</literal>. Это не ошибка, а неизбежное следствие того, что SQL не гарантирует вывод результатов запроса в некотором порядке, если порядок не определён явно предложением <literal>ORDER BY</literal>.

source: The rows skipped by an <literal>OFFSET</literal> clause still have to be computed inside the server; therefore a large <literal>OFFSET</literal> might be inefficient.
ru: Строки, пропускаемые согласно предложению <literal>OFFSET</literal>, тем не менее должны вычисляться на сервере. Таким образом, при больших значениях <literal>OFFSET</literal> работает неэффективно.

source: <literal>VALUES</literal> Lists
ru: Списки <literal>VALUES</literal>

source: <literal>VALUES</literal> provides a way to generate a <quote>constant table</quote> that can be used in a query without having to actually create and populate a table on-disk. The syntax is <synopsis> VALUES ( <replaceable class="parameter">expression</replaceable> [, ...] ) [, ...] </synopsis> Each parenthesized list of expressions generates a row in the table. The lists must all have the same number of elements (i.e., the number of columns in the table), and corresponding entries in each list must have compatible data types. The actual data type assigned to each column of the result is determined using the same rules as for <literal>UNION</literal> (see <xref linkend="typeconv-union-case"/>).
ru: Предложение <literal>VALUES</literal> позволяет создать <quote>постоянную таблицу</quote>, которую можно использовать в запросе, не создавая и не наполняя таблицу в БД. Синтаксис предложения: <synopsis> VALUES ( <replaceable class="parameter">выражение</replaceable> [, ...] ) [, ...] </synopsis> Для каждого списка выражений в скобках создаётся строка таблицы. Все списки должны иметь одинаковое число элементов (т. е. число столбцов в таблице) и соответствующие элементы во всех списках должны иметь совместимые типы данных. Фактический тип данных столбцов результата определяется по тем же правилам, что и для <literal>UNION</literal> (см. <xref remap="4" linkend="typeconv-union-case"/>).

source: As an example: <placeholder-1/> will return a table of two columns and three rows. It's effectively equivalent to: <placeholder-2/> By default, <productname>PostgreSQL</productname> assigns the names <literal>column1</literal>, <literal>column2</literal>, etc. to the columns of a <literal>VALUES</literal> table. The column names are not specified by the SQL standard and different database systems do it differently, so it's usually better to override the default names with a table alias list, like this: <placeholder-3/>
ru: Как пример: <placeholder-1/> вернёт таблицу из двух столбцов и трёх строк. Это равносильно такому запросу: <placeholder-2/> По умолчанию <productname>PostgreSQL</productname> назначает столбцам таблицы <literal>VALUES</literal> имена <literal>column1</literal>, <literal>column2</literal> и т. д. Имена столбцов не определены в стандарте SQL и в другой СУБД они могут быть другими, поэтому обычно лучше переопределить имена списком псевдонимов, например так: <placeholder-3/>

source: Syntactically, <literal>VALUES</literal> followed by expression lists is treated as equivalent to: <synopsis> SELECT <replaceable>select_list</replaceable> FROM <replaceable>table_expression</replaceable> </synopsis> and can appear anywhere a <literal>SELECT</literal> can. For example, you can use it as part of a <literal>UNION</literal>, or attach a <replaceable>sort_specification</replaceable> (<literal>ORDER BY</literal>, <literal>LIMIT</literal>, and/or <literal>OFFSET</literal>) to it. <literal>VALUES</literal> is most commonly used as the data source in an <command>INSERT</command> command, and next most commonly as a subquery.
ru: Синтаксически список <literal>VALUES</literal> с набором выражений равнозначен: <synopsis> SELECT <replaceable>список_выборки</replaceable> FROM <replaceable>табличное_выражение</replaceable> </synopsis> и допускается везде, где допустим <literal>SELECT</literal>. Например, вы можете использовать его в составе <literal>UNION</literal> или добавить к нему <replaceable>определение_сортировки</replaceable> (<literal>ORDER BY</literal>, <literal>LIMIT</literal> и/или <literal>OFFSET</literal>). <literal>VALUES</literal> чаще всего используется как источник данных для команды <command>INSERT</command>, а также как подзапрос.

source: For more information see <xref linkend="sql-values"/>.
ru: За дополнительными сведениями обратитесь к справке <xref remap="1" linkend="sql-values"/>.

source: <literal>WITH</literal> Queries (Common Table Expressions)
ru: Запросы <literal>WITH</literal> (Общие табличные выражения)

source: <primary>WITH</primary> <secondary>in SELECT</secondary>
ru: <primary>WITH</primary> <secondary>внутри SELECT</secondary>

source: <primary>common table expression</primary> <see>WITH</see>
ru: <primary>общее табличное выражение</primary> <see>WITH</see>

source: <literal>WITH</literal> provides a way to write auxiliary statements for use in a larger query. These statements, which are often referred to as Common Table Expressions or <acronym>CTE</acronym>s, can be thought of as defining temporary tables that exist just for one query. Each auxiliary statement in a <literal>WITH</literal> clause can be a <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command>; and the <literal>WITH</literal> clause itself is attached to a primary statement that can also be a <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command>.
ru: <literal>WITH</literal> предоставляет способ записывать дополнительные операторы для применения в больших запросах. Эти операторы, которые также называют общими табличными выражениями (Common Table Expressions, <acronym>CTE</acronym>), можно представить как определения временных таблиц, существующих только для одного запроса. Дополнительным оператором в предложении <literal>WITH</literal> может быть <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>, а само предложение <literal>WITH</literal> присоединяется к основному оператору, которым также может быть <command>SELECT</command>, <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>.

source: <command>SELECT</command> in <literal>WITH</literal>
ru: <command>SELECT</command> в <literal>WITH</literal>

source: The basic value of <command>SELECT</command> in <literal>WITH</literal> is to break down complicated queries into simpler parts. An example is: <placeholder-1/> which displays per-product sales totals in only the top sales regions. The <literal>WITH</literal> clause defines two auxiliary statements named <structname>regional_sales</structname> and <structname>top_regions</structname>, where the output of <structname>regional_sales</structname> is used in <structname>top_regions</structname> and the output of <structname>top_regions</structname> is used in the primary <command>SELECT</command> query. This example could have been written without <literal>WITH</literal>, but we'd have needed two levels of nested sub-<command>SELECT</command>s. It's a bit easier to follow this way.
ru: Основное предназначение <command>SELECT</command> в предложении <literal>WITH</literal> заключается в разбиении сложных запросов на простые части. Например, запрос: <placeholder-1/> выводит итоги по продажам только для передовых регионов. Предложение <literal>WITH</literal> определяет два дополнительных оператора <structname>regional_sales</structname> и <structname>top_regions</structname> так, что результат <structname>regional_sales</structname> используется в <structname>top_regions</structname>, а результат <structname>top_regions</structname> используется в основном запросе <command>SELECT</command>. Этот пример можно было бы переписать без <literal>WITH</literal>, но тогда нам понадобятся два уровня вложенных подзапросов <command>SELECT</command>. Показанным выше способом это можно сделать немного проще.

source: The optional <literal>RECURSIVE</literal> modifier changes <literal>WITH</literal> from a mere syntactic convenience into a feature that accomplishes things not otherwise possible in standard SQL. Using <literal>RECURSIVE</literal>, a <literal>WITH</literal> query can refer to its own output. A very simple example is this query to sum the integers from 1 through 100: <placeholder-1/> The general form of a recursive <literal>WITH</literal> query is always a <firstterm>non-recursive term</firstterm>, then <literal>UNION</literal> (or <literal>UNION ALL</literal>), then a <firstterm>recursive term</firstterm>, where only the recursive term can contain a reference to the query's own output. Such a query is executed as follows:
ru: Необязательное указание <literal>RECURSIVE</literal> превращает <literal>WITH</literal> из простого синтаксического удобства в средство реализации того, что невозможно в стандартном SQL. Используя <literal>RECURSIVE</literal>, запрос <literal>WITH</literal> может обращаться к собственному результату. Очень простой пример, суммирующий числа от 1 до 100: <placeholder-1/> В общем виде рекурсивный запрос <literal>WITH</literal> всегда записывается как <firstterm>не рекурсивная часть</firstterm>, потом <literal>UNION</literal> (или <literal>UNION ALL</literal>), а затем <firstterm>рекурсивная часть</firstterm>, где только в рекурсивной части можно обратиться к результату запроса. Такой запрос выполняется следующим образом:

source: Recursive Query Evaluation
ru: Вычисление рекурсивного запроса

source: Evaluate the non-recursive term. For <literal>UNION</literal> (but not <literal>UNION ALL</literal>), discard duplicate rows. Include all remaining rows in the result of the recursive query, and also place them in a temporary <firstterm>working table</firstterm>.
ru: Вычисляется не рекурсивная часть. Для <literal>UNION</literal> (но не <literal>UNION ALL</literal>) отбрасываются дублирующиеся строки. Все оставшиеся строки включаются в результат рекурсивного запроса и также помещаются во временную <firstterm>рабочую таблицу</firstterm>.
