Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/queries.po
Languages: ru

source: So long as the working table is not empty, repeat these steps:
ru: Пока рабочая таблица не пуста, повторяются следующие действия:

source: Evaluate the recursive term, substituting the current contents of the working table for the recursive self-reference. For <literal>UNION</literal> (but not <literal>UNION ALL</literal>), discard duplicate rows and rows that duplicate any previous result row. Include all remaining rows in the result of the recursive query, and also place them in a temporary <firstterm>intermediate table</firstterm>.
ru: Вычисляется рекурсивная часть так, что рекурсивная ссылка на сам запрос обращается к текущему содержимому рабочей таблицы. Для <literal>UNION</literal> (но не <literal>UNION ALL</literal>) отбрасываются дублирующиеся строки и строки, дублирующие ранее полученные. Все оставшиеся строки включаются в результат рекурсивного запроса и также помещаются во временную <firstterm>промежуточную таблицу</firstterm>.

source: Replace the contents of the working table with the contents of the intermediate table, then empty the intermediate table.
ru: Содержимое рабочей таблицы заменяется содержимым промежуточной таблицы, а затем промежуточная таблица очищается.

source: Strictly speaking, this process is iteration not recursion, but <literal>RECURSIVE</literal> is the terminology chosen by the SQL standards committee.
ru: Строго говоря, этот процесс является итерационным, а не рекурсивным, но комитетом по стандартам SQL был выбран термин <literal>RECURSIVE</literal>.

source: In the example above, the working table has just a single row in each step, and it takes on the values from 1 through 100 in successive steps. In the 100th step, there is no output because of the <literal>WHERE</literal> clause, and so the query terminates.
ru: В показанном выше примере в рабочей таблице на каждом этапе содержится всего одна строка и в ней последовательно накапливаются значения от 1 до 100. На сотом шаге, благодаря условию <literal>WHERE</literal>, не возвращается ничего, так что вычисление запроса завершается.

source: Recursive queries are typically used to deal with hierarchical or tree-structured data. A useful example is this query to find all the direct and indirect sub-parts of a product, given only a table that shows immediate inclusions: <placeholder-1/>
ru: Рекурсивные запросы обычно применяются для работы с иерархическими или древовидными структурами данных. В качестве полезного примера можно привести запрос, находящий все непосредственные и косвенные составные части продукта, используя только таблицу с прямыми связями: <placeholder-1/>

source: When working with recursive queries it is important to be sure that the recursive part of the query will eventually return no tuples, or else the query will loop indefinitely. Sometimes, using <literal>UNION</literal> instead of <literal>UNION ALL</literal> can accomplish this by discarding rows that duplicate previous output rows. However, often a cycle does not involve output rows that are completely duplicate: it may be necessary to check just one or a few fields to see if the same point has been reached before. The standard method for handling such situations is to compute an array of the already-visited values. For example, consider the following query that searches a table <structname>graph</structname> using a <structfield>link</structfield> field: <placeholder-1/> This query will loop if the <structfield>link</structfield> relationships contain cycles. Because we require a <quote>depth</quote> output, just changing <literal>UNION ALL</literal> to <literal>UNION</literal> would not eliminate the looping. Instead we need to recognize whether we have reached the same row again while following a particular path of links. We add two columns <structfield>path</structfield> and <structfield>cycle</structfield> to the loop-prone query: <placeholder-2/> Aside from preventing cycles, the array value is often useful in its own right as representing the <quote>path</quote> taken to reach any particular row.
ru: Работая с рекурсивными запросами, важно обеспечить, чтобы рекурсивная часть запроса в конце концов не выдала никаких кортежей (строк), в противном случае цикл будет бесконечным. Иногда для этого достаточно применять <literal>UNION</literal> вместо <literal>UNION ALL</literal>, так как при этом будут отбрасываться строки, которые уже есть в результате. Однако часто в цикле выдаются строки, не совпадающие полностью с предыдущими: в таких случаях может иметь смысл проверить одно или несколько полей, чтобы определить, не была ли текущая точка достигнута раньше. Стандартный способ решения подобных задач &mdash; вычислить массив с уже обработанными значениями. Например, рассмотрите следующий запрос, просматривающий таблицу <structname>graph</structname> по полю <structfield>link</structfield>: <placeholder-1/> Этот запрос зациклится, если связи <structfield>link</structfield> содержат циклы. Так как нам нужно получать в результате <quote>depth</quote>, одно лишь изменение <literal>UNION ALL</literal> на <literal>UNION</literal> не позволит избежать зацикливания. Вместо этого мы должны как-то определить, что уже достигали текущей строки, пройдя некоторый путь. Для этого мы добавляем два столбца <structfield>path</structfield> и <structfield>cycle</structfield> и получаем запрос, защищённый от зацикливания: <placeholder-2/> Помимо предотвращения циклов, значения массива часто бывают полезны сами по себе для представления <quote>пути</quote>, приведшего к определённой строке.

source: In the general case where more than one field needs to be checked to recognize a cycle, use an array of rows. For example, if we needed to compare fields <structfield>f1</structfield> and <structfield>f2</structfield>: <placeholder-1/>
ru: В общем случае, когда для выявления цикла нужно проверять несколько полей, следует использовать массив строк. Например, если нужно сравнить поля <structfield>f1</structfield> и <structfield>f2</structfield>: <placeholder-1/>

source: Omit the <literal>ROW()</literal> syntax in the common case where only one field needs to be checked to recognize a cycle. This allows a simple array rather than a composite-type array to be used, gaining efficiency.
ru: Часто для распознавания цикла достаточного одного поля и тогда <literal>ROW()</literal> можно опустить. При этом будет использоваться не массив данных составного типа, а простой массив, что более эффективно.

source: The recursive query evaluation algorithm produces its output in breadth-first search order. You can display the results in depth-first search order by making the outer query <literal>ORDER BY</literal> a <quote>path</quote> column constructed in this way.
ru: Этот алгоритм рекурсивного вычисления запроса выдаёт в результате узлы, упорядоченные по пути погружения. Чтобы получить результаты, отсортированные по глубине, можно добавить во внешний запрос <literal>ORDER BY</literal> по столбцу <quote>path</quote>, полученному, как показано выше.

source: A helpful trick for testing queries when you are not certain if they might loop is to place a <literal>LIMIT</literal> in the parent query. For example, this query would loop forever without the <literal>LIMIT</literal>: <placeholder-1/> This works because <productname>PostgreSQL</productname>'s implementation evaluates only as many rows of a <literal>WITH</literal> query as are actually fetched by the parent query. Using this trick in production is not recommended, because other systems might work differently. Also, it usually won't work if you make the outer query sort the recursive query's results or join them to some other table, because in such cases the outer query will usually try to fetch all of the <literal>WITH</literal> query's output anyway.
ru: Для тестирования запросов, которые могут зацикливаться, есть хороший приём &mdash; добавить <literal>LIMIT</literal> в родительский запрос. Например, следующий запрос зациклится, если не добавить предложение <literal>LIMIT</literal>: <placeholder-1/> Но в данном случае этого не происходит, так как в <productname>PostgreSQL</productname> запрос <literal>WITH</literal> выдаёт столько строк, сколько фактически принимает родительский запрос. В производственной среде использовать этот приём не рекомендуется, так как другие системы могут вести себя по-другому. Кроме того, это не будет работать, если внешний запрос сортирует результаты рекурсивного запроса или соединяет их с другой таблицей, так как в подобных случаях внешний запрос обычно всё равно выбирает результат запроса <literal>WITH</literal> полностью.

source: A useful property of <literal>WITH</literal> queries is that they are evaluated only once per execution of the parent query, even if they are referred to more than once by the parent query or sibling <literal>WITH</literal> queries. Thus, expensive calculations that are needed in multiple places can be placed within a <literal>WITH</literal> query to avoid redundant work. Another possible application is to prevent unwanted multiple evaluations of functions with side-effects. However, the other side of this coin is that the optimizer is less able to push restrictions from the parent query down into a <literal>WITH</literal> query than an ordinary subquery. The <literal>WITH</literal> query will generally be evaluated as written, without suppression of rows that the parent query might discard afterwards. (But, as mentioned above, evaluation might stop early if the reference(s) to the query demand only a limited number of rows.)
ru: Запросы <literal>WITH</literal> имеют полезное свойство &mdash; они вычисляются только раз для всего родительского запроса, даже если этот запрос или соседние запросы <literal>WITH</literal> обращаются к ним неоднократно. Таким образом, сложные вычисления, результаты которых нужны в нескольких местах, можно выносить в запросы <literal>WITH</literal> в целях оптимизации. Кроме того, такие запросы позволяют избежать нежелательных вычислений функций с побочными эффектами. Однако есть и обратная сторона &mdash; оптимизатор не может распространить ограничения родительского запроса на запрос <literal>WITH</literal> так, как он делает это для обычного подзапроса. Запрос <literal>WITH</literal> обычно выполняется буквально и возвращает все строки, включая те, что потом может отбросить родительский запрос. (Но как было сказано выше, вычисление может остановиться раньше, если в ссылке на этот запрос затребуется только ограниченное число строк.)

source: The examples above only show <literal>WITH</literal> being used with <command>SELECT</command>, but it can be attached in the same way to <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command>. In each case it effectively provides temporary table(s) that can be referred to in the main command.
ru: Примеры выше показывают только предложение <literal>WITH</literal> с <command>SELECT</command>, но таким же образом его можно использовать с командами <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command>. В каждом случае он по сути создаёт временную таблицу, к которой можно обратиться в основной команде.

source: Data-Modifying Statements in <literal>WITH</literal>
ru: Изменение данных в <literal>WITH</literal>

source: You can use data-modifying statements (<command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command>) in <literal>WITH</literal>. This allows you to perform several different operations in the same query. An example is: <placeholder-1/> This query effectively moves rows from <structname>products</structname> to <structname>products_log</structname>. The <command>DELETE</command> in <literal>WITH</literal> deletes the specified rows from <structname>products</structname>, returning their contents by means of its <literal>RETURNING</literal> clause; and then the primary query reads that output and inserts it into <structname>products_log</structname>.
ru: В предложении <literal>WITH</literal> можно также использовать операторы, изменяющие данные (<command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>). Это позволяет выполнять в одном запросе сразу несколько разных операций. Например: <placeholder-1/> Этот запрос фактически перемещает строки из <structname>products</structname> в <structname>products_log</structname>. Оператор <command>DELETE</command> в <literal>WITH</literal> удаляет указанные строки из <structname>products</structname> и возвращает их содержимое в предложении <literal>RETURNING</literal>; а затем главный запрос читает это содержимое и вставляет в таблицу <structname>products_log</structname>.

source: A fine point of the above example is that the <literal>WITH</literal> clause is attached to the <command>INSERT</command>, not the sub-<command>SELECT</command> within the <command>INSERT</command>. This is necessary because data-modifying statements are only allowed in <literal>WITH</literal> clauses that are attached to the top-level statement. However, normal <literal>WITH</literal> visibility rules apply, so it is possible to refer to the <literal>WITH</literal> statement's output from the sub-<command>SELECT</command>.
ru: Следует заметить, что предложение <literal>WITH</literal> в данном случае присоединяется к оператору <command>INSERT</command>, а не к <command>SELECT</command>, вложенному в <command>INSERT</command>. Это необходимо, так как <literal>WITH</literal> может содержать операторы, изменяющие данные, только на верхнем уровне запроса. Однако при этом применяются обычные правила видимости <literal>WITH</literal>, так что к результату <literal>WITH</literal> можно обратиться и из вложенного оператора <command>SELECT</command>.

source: Data-modifying statements in <literal>WITH</literal> usually have <literal>RETURNING</literal> clauses (see <xref linkend="dml-returning"/>), as shown in the example above. It is the output of the <literal>RETURNING</literal> clause, <emphasis>not</emphasis> the target table of the data-modifying statement, that forms the temporary table that can be referred to by the rest of the query. If a data-modifying statement in <literal>WITH</literal> lacks a <literal>RETURNING</literal> clause, then it forms no temporary table and cannot be referred to in the rest of the query. Such a statement will be executed nonetheless. A not-particularly-useful example is: <placeholder-1/> This example would remove all rows from tables <structname>foo</structname> and <structname>bar</structname>. The number of affected rows reported to the client would only include rows removed from <structname>bar</structname>.
ru: Операторы, изменяющие данные, в <literal>WITH</literal> обычно дополняются предложением <literal>RETURNING</literal> (см. <xref remap="4" linkend="dml-returning"/>), как показано в этом примере. Важно понимать, что временная таблица, которую можно будет использовать в остальном запросе, создаётся из результата <literal>RETURNING</literal>, а <emphasis>не</emphasis> целевой таблицы оператора. Если оператор, изменяющий данные, в <literal>WITH</literal> не дополнен предложением <literal>RETURNING</literal>, временная таблица не создаётся и обращаться к ней в остальном запросе нельзя. Однако такой запрос всё равно будет выполнен. Например, допустим следующий не очень практичный запрос: <placeholder-1/> Он удалит все строки из таблиц <structname>foo</structname> и <structname>bar</structname>. При этом число задействованных строк, которое получит клиент, будет подсчитываться только по строкам, удалённым из <structname>bar</structname>.

source: Recursive self-references in data-modifying statements are not allowed. In some cases it is possible to work around this limitation by referring to the output of a recursive <literal>WITH</literal>, for example: <placeholder-1/> This query would remove all direct and indirect subparts of a product.
ru: Рекурсивные ссылки в операторах, изменяющих данные, не допускаются. В некоторых случаях это ограничение можно обойти, обратившись к конечному результату рекурсивного <literal>WITH</literal>, например так: <placeholder-1/> Этот запрос удаляет все непосредственные и косвенные составные части продукта.

source: Data-modifying statements in <literal>WITH</literal> are executed exactly once, and always to completion, independently of whether the primary query reads all (or indeed any) of their output. Notice that this is different from the rule for <command>SELECT</command> in <literal>WITH</literal>: as stated in the previous section, execution of a <command>SELECT</command> is carried only as far as the primary query demands its output.
ru: Операторы, изменяющие данные в <literal>WITH</literal>, выполняются только один раз и всегда полностью, вне зависимости от того, принимает ли их результат основной запрос. Заметьте, что это отличается от поведения <command>SELECT</command> в <literal>WITH</literal>: как говорилось в предыдущем разделе, <command>SELECT</command> выполняется только до тех пор, пока его результаты востребованы основным запросом.

source: The sub-statements in <literal>WITH</literal> are executed concurrently with each other and with the main query. Therefore, when using data-modifying statements in <literal>WITH</literal>, the order in which the specified updates actually happen is unpredictable. All the statements are executed with the same <firstterm>snapshot</firstterm> (see <xref linkend="mvcc"/>), so they cannot <quote>see</quote> one another's effects on the target tables. This alleviates the effects of the unpredictability of the actual order of row updates, and means that <literal>RETURNING</literal> data is the only way to communicate changes between different <literal>WITH</literal> sub-statements and the main query. An example of this is that in <placeholder-1/> the outer <command>SELECT</command> would return the original prices before the action of the <command>UPDATE</command>, while in <placeholder-2/> the outer <command>SELECT</command> would return the updated data.
ru: Вложенные операторы в <literal>WITH</literal> выполняются одновременно друг с другом и с основным запросом. Таким образом, порядок, в котором операторы в <literal>WITH</literal> будут фактически изменять данные, непредсказуем. Все эти операторы выполняются с одним <firstterm>снимком данных</firstterm> (см. <xref remap="4" linkend="mvcc"/>), так что они не могут <quote>видеть</quote>, как каждый из них меняет целевые таблицы. Это уменьшает эффект непредсказуемости фактического порядка изменения строк и означает, что <literal>RETURNING</literal> &mdash; единственный вариант передачи изменений от вложенных операторов <literal>WITH</literal> основному запросу. Например, в данном случае: <placeholder-1/> внешний оператор <command>SELECT</command> выдаст цены, которые были до действия <command>UPDATE</command>, тогда как в запросе <placeholder-2/> внешний <command>SELECT</command> выдаст изменённые данные.

source: Trying to update the same row twice in a single statement is not supported. Only one of the modifications takes place, but it is not easy (and sometimes not possible) to reliably predict which one. This also applies to deleting a row that was already updated in the same statement: only the update is performed. Therefore you should generally avoid trying to modify a single row twice in a single statement. In particular avoid writing <literal>WITH</literal> sub-statements that could affect the same rows changed by the main statement or a sibling sub-statement. The effects of such a statement will not be predictable.
ru: Неоднократное изменение одной и той же строки в рамках одного оператора не поддерживается. Иметь место будет только одно из нескольких изменений и надёжно определить, какое именно, часто довольно сложно (а иногда и вовсе невозможно). Это так же касается случая, когда строка удаляется и изменяется в том же операторе: в результате может быть выполнено только обновление. Поэтому в общем случае следует избегать подобного наложения операций. В частности, избегайте подзапросов <literal>WITH</literal>, которые могут повлиять на строки, изменяемые основным оператором или операторами, вложенные в него. Результат действия таких запросов будет непредсказуемым.

source: At present, any table used as the target of a data-modifying statement in <literal>WITH</literal> must not have a conditional rule, nor an <literal>ALSO</literal> rule, nor an <literal>INSTEAD</literal> rule that expands to multiple statements.
ru: В настоящее время, для оператора, изменяющего данные в <literal>WITH</literal>, в качестве целевой нельзя использовать таблицу, для которой определено условное правило или правило <literal>ALSO</literal> или <literal>INSTEAD</literal>, если оно состоит из нескольких операторов.
