Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.5.po
Languages: ru

source: Allow identical <literal>CHECK</literal> constraints to be added to a parent and child table in either order. Prevent merging of a valid constraint from the parent table with a <literal>NOT VALID</literal> constraint on the child. Likewise, prevent merging of a <literal>NO INHERIT</literal> child constraint with an inherited constraint.
ru: Теперь одинаковые ограничения <literal>CHECK</literal> могут добавляться в родительскую и дочернюю таблицу в любом порядке. С другой стороны, слияние проверенного ограничения из родительской таблицы с непроверенным (<literal>NOT VALID</literal>) ограничением в дочерней не должно допускаться. Подобным образом, не должно допускаться слияние дочернего ненаследуемого (<literal>NO INHERIT</literal>) ограничения с наследуемым.

source: Show a sensible value in <structname>pg_settings</structname>.<structfield>unit</structfield> for <varname>min_wal_size</varname> and <varname>max_wal_size</varname> (Tom Lane)
ru: Вывод разумного значения в <structname>pg_settings</structname>.<structfield>unit</structfield> для параметров <varname>min_wal_size</varname> и <varname>max_wal_size</varname> (Том Лейн)

source: Remove artificial restrictions on the values accepted by <function>numeric_in()</function> and <function>numeric_recv()</function> (Tom Lane)
ru: Ликвидация искусственных ограничений на значения, принимаемые функциями <function>numeric_in()</function> и <function>numeric_recv()</function> (Том Лейн)

source: We allow numeric values up to the limit of the storage format (more than <literal>1e100000</literal>), so it seems fairly pointless that <function>numeric_in()</function> rejected scientific-notation exponents above 1000. Likewise, it was silly for <function>numeric_recv()</function> to reject more than 1000 digits in an input value.
ru: Мы принимаем числовые значения, не превышающие предела хранения (больше <literal>1e100000</literal>), поэтому кажется довольно неразумным, что <function>numeric_in()</function> не принимала в научной записи экспоненты больше 1000. Также нет смысла не принимать в <function>numeric_recv()</function> более 1000 цифр во вводимом значении.

source: Avoid very-low-probability data corruption due to testing tuple visibility without holding buffer lock (Thomas Munro, Peter Geoghegan, Tom Lane)
ru: Предотвращение очень маловероятного повреждения данных в результате проверки видимости кортежа без удержания блокировки буфера (Томас Мунро, Питер Геохеган, Том Лейн)

source: Preserve commit timestamps across server restart (Julien Rouhaud, Craig Ringer)
ru: Сохранение времени фиксирования транзакций после перезагрузки сервера (Жульен Рохо, Крейг Рингер)

source: With <xref linkend="guc-track-commit-timestamp"/> turned on, old commit timestamps became inaccessible after a clean server restart.
ru: При включённом параметре <xref linkend="guc-track-commit-timestamp"/> старые метки времени фиксации становились недоступными после полной перезагрузки сервера.

source: Fix logical WAL decoding to work properly when a subtransaction's WAL output is large enough to spill to disk (Andres Freund)
ru: Исправление логического декодирования WAL в случаях, когда вывод WAL из подтранзакции оказывался слишком большим и вымещался на диск (Андрес Фройнд)

source: Fix possible sorting error when aborting use of abbreviated keys (Peter Geoghegan)
ru: Исправление возможной ошибки сортировки при прекращении использования сокращённых ключей (Питер Геохеган)

source: In the worst case, this could result in a corrupt btree index, which would need to be rebuilt using <command>REINDEX</command>. However, the situation is believed to be rare.
ru: В худшем случае это могло приводить к повреждению индекса-B-дерева, что потребует перестроить его с помощью команды <command>REINDEX</command>. Но, как нам представляется, такие ситуации очень редки.

source: Fix file descriptor leakage when truncating a temporary relation of more than 1GB (Andres Freund)
ru: Ликвидация утечки дескриптора файла, имевшей место при опустошении временного отношения размером более 1 Гбайта (Андрес Фройнд)

source: Disallow starting a standalone backend with <literal>standby_mode</literal> turned on (Michael Paquier)
ru: Запрещение запуска самостоятельного обслуживающего процесса при включённом режиме <literal>standby_mode</literal> (Мишель Пакье)

source: This can't do anything useful, since there will be no WAL receiver process to fetch more WAL data; and it could result in misbehavior in code that wasn't designed with this situation in mind.
ru: Такой режим не будет ничем полезен, так как никакой процесс-приёмник WAL не сможет получать данные WAL; и это может привести к некорректному поведению кода, который не рассчитан на такую ситуацию.

source: Properly initialize replication slot state when recycling a previously-used slot (Michael Paquier)
ru: Исправление инициализации состояния слота репликации при повторном использовании слота (Мишель Пакье)

source: This failure to reset all of the fields of the slot could prevent <command>VACUUM</command> from removing dead tuples.
ru: В результате того, что не все поля слота сбрасывались, команда <command>VACUUM</command> могла не удалять «мёртвые» кортежи.

source: Round shared-memory allocation request to a multiple of the actual huge page size when attempting to use huge pages on Linux (Tom Lane)
ru: Округление размера запроса разделяемой памяти до числа, кратного размеру огромной страницы, когда огромные страницы используются в Linux (Том Лейн)

source: This avoids possible failures during <function>munmap()</function> on systems with atypical default huge page sizes. Except in crash-recovery cases, there were no ill effects other than a log message.
ru: Это позволяет избежать возможных сбоев в <function>munmap()</function> в системах с нетипичными размерами огромных страниц. За исключением случаев краха, эти сбои проявлялись только в сообщениях в журнале.

source: Use a more random value for the dynamic shared memory control segment's ID (Robert Haas, Tom Lane)
ru: Выбор более случайного значения для идентификатора управляющего сегмента динамической разделяемой памяти (Роберт Хаас, Том Лейн)

source: Previously, the same value would be chosen every time, because it was derived from <function>random()</function> but <function>srandom()</function> had not yet been called. While relatively harmless, this was not the intended behavior.
ru: Ранее каждый раз выбиралось одно и то же значение, потому что оно получалось из <function>random()</function>, но <function>srandom()</function> к этому моменту ещё не вызывалась. Это относительно безвредно, однако планировалось другое поведение.

source: On Windows, retry creation of the dynamic shared memory control segment after an access-denied error (Kyotaro Horiguchi, Amit Kapila)
ru: В Windows нужно повторять попытку создания управляющего сегмента динамической разделяемой памяти после ошибки «нет доступа» (Киотаро Хоригучи, Амит Капила)

source: Windows sometimes returns <literal>ERROR_ACCESS_DENIED</literal> rather than <literal>ERROR_ALREADY_EXISTS</literal> when there is an existing segment. This led to postmaster startup failure due to believing that the former was an unrecoverable error.
ru: Иногда Windows выдаёт ошибку <literal>ERROR_ACCESS_DENIED</literal> вместо <literal>ERROR_ALREADY_EXISTS</literal>, когда такой сегмент уже существует. Получая такую ошибку, главный процесс не мог запуститься, считая, что столкнулся с неисправимой ошибкой.

source: Fix <application>PL/pgSQL</application> to not misbehave with parameters and local variables of type <type>int2vector</type> or <type>oidvector</type> (Tom Lane)
ru: Исправление в <application>PL/pgSQL</application> поведения с параметрами и локальными переменными типов <type>int2vector</type> и <type>oidvector</type> (Том Лейн)

source: Don't try to share SSL contexts across multiple connections in <application>libpq</application> (Heikki Linnakangas)
ru: Не пытаться разделять контекст SSL между несколькими подключениями в <application>libpq</application> (Хейкки Линнакангас)

source: This led to assorted corner-case bugs, particularly when trying to use different SSL parameters for different connections.
ru: Такое разделение приводило к разнообразным ошибкам, особенно при попытке использования различных параметров SSL для разных соединений.

source: Avoid corner-case memory leak in <application>libpq</application> (Tom Lane)
ru: Предотвращение утечек памяти в особых случаях в <application>libpq</application> (Том Лейн)

source: The reported problem involved leaking an error report during <function>PQreset()</function>, but there might be related cases.
ru: Поступило сообщение об утечке в процессе <function>PQreset()</function>, но были возможны проявления и в связанных случаях.

source: Make <application>ecpg</application>'s <option>--help</option> and <option>--version</option> options work consistently with our other executables (Haribabu Kommi)
ru: Согласование поведения параметров <option>--help</option> и <option>--version</option> программы <application>ecpg</application> со всеми остальными нашими программами (Харибабу Комми)

source: Fix <application>pgbench</application>'s calculation of average latency (Fabien Coelho)
ru: Исправление расчёта средней задержки в <application>pgbench</application> (Фабьен Коэльо)

source: The calculation was incorrect when there were <literal>\sleep</literal> commands in the script, or when the test duration was specified in number of transactions rather than total time.
ru: Этот расчёт был неверным при наличии в скрипте команд <literal>\sleep</literal> или когда длительность теста ограничивалась числом транзакций, а не общим временем.

source: In <application>pg_upgrade</application>, check library loadability in name order (Tom Lane)
ru: В <application>pg_upgrade</application> проверка загружаемости библиотек должна производиться по порядку имён (Том Лейн)

source: This is a workaround to deal with cross-extension dependencies from language transform modules to their base language and data type modules.
ru: Это обходное решение проблемы зависимостей между расширениями, образуемых связями модулей трансформации языков с базовыми модулями самих языков и типов данных.

source: In <application>pg_dump</application>, never dump range constructor functions (Tom Lane)
ru: Программа <application>pg_dump</application> никогда не должна выгружать функции-конструкторы диапазонов (Том Лейн)

source: This oversight led to <application>pg_upgrade</application> failures with extensions containing range types, due to duplicate creation of the constructor functions.
ru: В результате такой выгрузки программа <application>pg_upgrade</application> не могла справиться с расширениями, включающими диапазонные типы, пытаясь дважды создать их функции-конструкторы.

source: In <application>pg_dump</application> with <option>-C</option>, suppress <literal>TABLESPACE</literal> clause of <command>CREATE DATABASE</command> if <option>--no-tablespaces</option> is specified (Tom Lane)
ru: При запуске <application>pg_dump</application> с ключом <option>-C</option> должно подавляться предложение <literal>TABLESPACE</literal> команды <command>CREATE DATABASE</command>, если указан ключ <option>--no-tablespaces</option> (Том Лейн)

source: Make <application>pg_receivexlog</application> work correctly with <option>--synchronous</option> without slots (Gabriele Bartolini)
ru: Исправление работы <application>pg_receivexlog</application> с ключом <option>--synchronous</option> без слотов (Габриэль Бартолини)

source: Disallow specifying both <option>--source-server</option> and <option>--source-target</option> options to <application>pg_rewind</application> (Michael Banck)
ru: Недопущение одновременного указания аргументов <option>--source-server</option> и <option>--source-target</option> для <application>pg_rewind</application> (Михаэль Банк)

source: Make <application>pg_rewind</application> turn off <varname>synchronous_commit</varname> in its session on the source server (Michael Banck, Michael Paquier)
ru: Программа <application>pg_rewind</application> должна отключать <varname>synchronous_commit</varname> в своём сеансе на исходном сервере (Михаэль Банк, Мишель Пакье)

source: This allows <application>pg_rewind</application> to work even when the source server is using synchronous replication that is not working for some reason.
ru: При этом <application>pg_rewind</application> сможет работать, даже когда на исходном сервере настроена синхронная репликация, но она по какой-то причине не функционирует.

source: In <application>pg_xlogdump</application>, retry opening new WAL segments when using <option>--follow</option> option (Magnus Hagander)
ru: В <application>pg_xlogdump</application> нужно повторять попытку открыть новый сегмент WAL, когда используется параметр <option>--follow</option> (Магнус Хагандер)

source: This allows for a possible delay in the server's creation of the next segment.
ru: Это позволяет справиться с возможной задержкой при создании сервером следующего сегмента.

source: Fix <application>pg_xlogdump</application> to cope with a WAL file that begins with a continuation record spanning more than one page (Pavan Deolasee)
ru: Исправление программы <application>pg_xlogdump</application>, чтобы она корректно работала с файлом WAL, начинающимся с записи продолжения, располагающейся на нескольких страницах (Паван Деоласи)

source: Fix <filename>contrib/pg_buffercache</filename> to work when <varname>shared_buffers</varname> exceeds 256GB (KaiGai Kohei)
ru: Исправление <filename>contrib/pg_buffercache</filename> для работы со значением <varname>shared_buffers</varname>, превышающим 256 Гбайт (КайГай Кохей)

source: Fix <filename>contrib/intarray/bench/bench.pl</filename> to print the results of the <command>EXPLAIN</command> it does when given the <option>-e</option> option (Daniel Gustafsson)
ru: Исправление скрипта <filename>contrib/intarray/bench/bench.pl</filename>, чтобы он выводил результаты команды <command>EXPLAIN</command>, которую он выполняет при запуске с ключом <option>-e</option> (Даниэль Густафсон)

source: Support OpenSSL 1.1.0 (Heikki Linnakangas)
ru: Поддержка OpenSSL 1.1.0 (Хейкки Линнакангас)

source: Install TAP test infrastructure so that it's available for extension testing (Craig Ringer)
ru: Внедрение инфраструктуры тестирования TAP, чтобы её можно было применять для тестирования расширений (Крейг Рингер)

source: When <productname>PostgreSQL</productname> has been configured with <option>--enable-tap-tests</option>, <quote>make install</quote> will now install the Perl support files for TAP testing where PGXS can find them. This allows non-core extensions to use <literal>$(prove_check)</literal> without extra tests.
ru: Когда <productname>PostgreSQL</productname> конфигурируется с параметром <option>--enable-tap-tests</option>, теперь команда <quote>make install</quote> будет устанавливать файлы поддержки Perl для тестирования TAP туда, где PGXS сможет найти их. Благодаря этому внешние расширения смогут использовать <literal>$(prove_check)</literal> без дополнительных проверок.

source: In MSVC builds, include <application>pg_recvlogical</application> in a client-only installation (MauMau)
ru: В сборках MSVC программа <application>pg_recvlogical</application> включена в клиентский набор (МауМау)

source: Update Windows time zone mapping to recognize some time zone names added in recent Windows versions (Michael Paquier)
ru: Корректировка сопоставления часовых поясов в Windows, чтобы сервер корректно распознавал имена часовых поясов, появившиеся в последних версиях Windows (Мишель Пакье)

source: Prevent failure of obsolete dynamic time zone abbreviations (Tom Lane)
ru: Предупреждение ошибок при использовании устаревших аббревиатур динамических часовых поясов (Том Лейн)

source: If a dynamic time zone abbreviation does not match any entry in the referenced time zone, treat it as equivalent to the time zone name. This avoids unexpected failures when IANA removes abbreviations from their time zone database, as they did in <application>tzdata</application> release 2016f and seem likely to do again in the future. The consequences were not limited to not recognizing the individual abbreviation; any mismatch caused the <structname>pg_timezone_abbrevs</structname> view to fail altogether.
ru: Если аббревиатуре динамического часового пояса не соответствует запись в данных часового пояса, считать её равнозначной имени часового пояса. Это предупреждает неожиданные ошибки, когда IANA удаляет аббревиатуры из своей базы данных часовых поясов, что произошло в выпуске <application>tzdata</application> 2016f и, вполне вероятно, повторится в будущем. Вследствие этого не только не распознавались отдельные аббревиатуры; при любом расхождении происходил сбой в представлении <structname>pg_timezone_abbrevs</structname>.

source: Update time zone data files to <application>tzdata</application> release 2016h for DST law changes in Palestine and Turkey, plus historical corrections for Turkey and some regions of Russia. Switch to numeric abbreviations for some time zones in Antarctica, the former Soviet Union, and Sri Lanka.
ru: Обновление данных часовых поясов до версии <application>tzdata</application> 2016h, включающее изменение правил перехода на летнее время в Палестине и Турции, а также исторические изменения для Турции и некоторых регионов России. Переход к числовым аббревиатурам для некоторых часовых поясов в Антарктике, бывшем Советском Союзе и на Шри-Ланке.

source: In this update, <literal>AMT</literal> is no longer shown as being in use to mean Armenia Time. Therefore, we have changed the <literal>Default</literal> abbreviation set to interpret it as Amazon Time, thus UTC-4 not UTC+4.
ru: Начиная с этого выпуска, аббревиатура <literal>AMT</literal> более не считается занятой часовым поясом Армении. Поэтому мы изменили значение этой аббревиатуры по умолчанию, чтобы она обозначала Амазонское время (Amazon Time), так что теперь она означает UTC-4, а не UTC+4.

source: Release 9.5.4
ru: Выпуск 9.5.4

source: This release contains a variety of fixes from 9.5.3. For information about new features in the 9.5 major release, see <xref linkend="release-9-5"/>.
ru: В этот выпуск вошли различные исправления, внесённые после версии 9.5.3. За информацией о нововведениях версии 9.5 обратитесь к <xref remap="3" linkend="release-9-5"/>.

source: Migration to Version 9.5.4
ru: Миграция на версию 9.5.4

source: However, if you are upgrading from a version earlier than 9.5.2, see <xref linkend="release-9-5-2"/>.
ru: Однако, если вы обновляете сервер с версии, более ранней, чем 9.5.2, см. <xref remap="4" linkend="release-9-5-2"/>.

source: Fix possible mis-evaluation of nested <literal>CASE</literal>-<literal>WHEN</literal> expressions (Heikki Linnakangas, Michael Paquier, Tom Lane)
ru: Исправление некорректного вычисления вложенных выражений <literal>CASE</literal>-<literal>WHEN</literal> (Хейкки Линнакангас, Мишель Пакье, Том Лейн)

source: A <literal>CASE</literal> expression appearing within the test value subexpression of another <literal>CASE</literal> could become confused about whether its own test value was null or not. Also, inlining of a SQL function implementing the equality operator used by a <literal>CASE</literal> expression could result in passing the wrong test value to functions called within a <literal>CASE</literal> expression in the SQL function's body. If the test values were of different data types, a crash might result; moreover such situations could be abused to allow disclosure of portions of server memory. (CVE-2016-5423)
ru: Выражение <literal>CASE</literal>, фигурирующее в подвыражении проверки другого выражения <literal>CASE</literal>, могло некорректно оценивать, отличается ли его собственное проверяемое значение от NULL. Кроме того, встраивание SQL-функции, реализующей оператор равенства, который используется выражением <literal>CASE</literal>, может привести к передаче неправильного проверяемого значения функциям, вызываемым в выражении <literal>CASE</literal> в теле функции SQL. Если же проверяемые значения оказываются разных типов, возможен сбой; более того, это может эксплуатироваться для несанкционированного чтения областей памяти сервера. (CVE-2016-5423)

source: Fix client programs' handling of special characters in database and role names (Noah Misch, Nathan Bossart, Michael Paquier)
ru: Корректировка в клиентских программах обработки специальных символов в именах ролей и баз данных (Ной Миш, Натан Боссарт, Мишель Пакье)

source: Numerous places in <application>vacuumdb</application> and other client programs could become confused by database and role names containing double quotes or backslashes. Tighten up quoting rules to make that safe. Also, ensure that when a conninfo string is used as a database name parameter to these programs, it is correctly treated as such throughout.
ru: Программа <application>vacuumdb</application> и другие клиентские утилиты во многих местах могли некорректно воспринимать имена ролей и баз данных, включающие кавычки или обратную косую черту. Теперь проверки ужесточены во избежание рисков. Также, когда этим программам вместо имени базы передаётся строка подключения, она обрабатывается должным образом.

source: Fix handling of paired double quotes in <application>psql</application>'s <command>\connect</command> and <command>\password</command> commands to match the documentation.
ru: Приведение в соответствие с документацией правил обработки пар двойных кавычек в командах <application>psql</application> <command>\connect</command> и <command>\password</command>.

source: Introduce a new <option>-reuse-previous</option> option in <application>psql</application>'s <command>\connect</command> command to allow explicit control of whether to re-use connection parameters from a previous connection. (Without this, the choice is based on whether the database name looks like a conninfo string, as before.) This allows secure handling of database names containing special characters in <application>pg_dumpall</application> scripts.
ru: Введение нового параметра <option>-reuse-previous</option> для команды <application>psql</application> <command>\connect</command>, позволяющего явно указывать, должны ли повторно использоваться параметры предыдущего подключения. (Без данного параметра это, как и раньше, зависит от того, похоже ли имя базы данных на строку подключения.) Это позволяет безопасно оперировать с именами баз данных, содержащими специальные символы, в скриптах <application>pg_dumpall</application>.

source: <application>pg_dumpall</application> now refuses to deal with database and role names containing carriage returns or newlines, as it seems impractical to quote those characters safely on Windows. In future we may reject such names on the server side, but that step has not been taken yet.
ru: <application>pg_dumpall</application> теперь не будет принимать имена ролей или баз данных, содержащие символы перевода строки или возврата каретки, так как безопасно экранировать эти символы в Windows не представляется практичным. В будущем мы можем запретить такие имена и на стороне сервера, но пока это не сделано.
