Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.5.po
Languages: ru

source: These are considered security fixes because crafted object names containing special characters could have been used to execute commands with superuser privileges the next time a superuser executes <application>pg_dumpall</application> or other routine maintenance operations. (CVE-2016-5424)
ru: Эти коррективы считаются исправлениями уязвимостей, так как, сконструировав имена объектов специальным образом (используя спецсимволы), можно было сформировать произвольные команды, которые выполнятся с правами суперпользователя, когда суперпользователь будет выполнять <application>pg_dumpall</application> или другие операции обслуживания базы. (CVE-2016-5424)

source: Fix corner-case misbehaviors for <literal>IS NULL</literal>/<literal>IS NOT NULL</literal> applied to nested composite values (Andrew Gierth, Tom Lane)
ru: Исправление некорректного в особых случаях поведения проверок <literal>IS NULL</literal>/<literal>IS NOT NULL</literal>, применяемых к вложенным составным значениям (Эндрю Гирт, Том Лейн)

source: The SQL standard specifies that <literal>IS NULL</literal> should return TRUE for a row of all null values (thus <literal>ROW(NULL,NULL) IS NULL</literal> yields TRUE), but this is not meant to apply recursively (thus <literal>ROW(NULL, ROW(NULL,NULL)) IS NULL</literal> yields FALSE). The core executor got this right, but certain planner optimizations treated the test as recursive (thus producing TRUE in both cases), and <filename>contrib/postgres_fdw</filename> could produce remote queries that misbehaved similarly.
ru: В стандарте SQL говорится, что проверка <literal>IS NULL</literal> должна возвращать TRUE для строки со всеми значениями NULL (то есть <literal>ROW(NULL,NULL) IS NULL</literal> выдаёт TRUE), но это не должно действовать рекурсивно (то есть, <literal>ROW(NULL, ROW(NULL,NULL)) IS NULL</literal> выдаёт FALSE). В основном исполнителе это реализовано правильно, но при некоторых оптимизациях планировщика эта проверка рассматривалась как рекурсивная (и TRUE выдавалось в обоих случаях), кроме того, обёртка <filename>contrib/postgres_fdw</filename> тоже могла выдавать удалённые запросы с подобным некорректным поведением.

source: Fix <quote>unrecognized node type</quote> error for <command>INSERT ... ON CONFLICT</command> within a recursive CTE (a <literal>WITH</literal> item) (Peter Geoghegan)
ru: Исправление ошибки <quote>unrecognized node type</quote> (нераспознанный тип узла) при <command>INSERT ... ON CONFLICT</command> в рекурсивном CTE (элементе <literal>WITH</literal>) (Питер Геохеган)

source: Fix <command>INSERT ... ON CONFLICT</command> to successfully match index expressions or index predicates that are simplified during the planner's expression preprocessing phase (Tom Lane)
ru: Исправление в <command>INSERT ... ON CONFLICT</command> сопоставления предикатов или выражений индексов, которые были упрощены планировщиком на стадии предобработки выражений (Том Лейн)

source: Correctly handle violations of exclusion constraints that apply to the target table of an <literal>INSERT ... ON CONFLICT</literal> command, but are not one of the selected arbiter indexes (Tom Lane)
ru: Правильная обработка нарушений ограничений-исключений, которые применяются к целевой таблице команды <literal>INSERT ... ON CONFLICT</literal>, но не являются решающими индексами (Том Лейн)

source: Such a case should raise a normal constraint-violation error, but it got into an infinite loop instead.
ru: В таких случаях должна выдаваться обычная ошибка нарушения ограничения, но вместо этого код попадал в бесконечный цикл.

source: Fix <command>INSERT ... ON CONFLICT</command> to not fail if the target table has a unique index on OID (Tom Lane)
ru: Исправление <command>INSERT ... ON CONFLICT</command>, чтобы при наличии в целевой таблице уникального индекса по OID не происходила ошибка (Том Лейн)

source: Make the <type>inet</type> and <type>cidr</type> data types properly reject IPv6 addresses with too many colon-separated fields (Tom Lane)
ru: Недопущение для типов данных <type>inet</type> и <type>cidr</type> входных адресов IPv6 со слишком большим количеством разделённых двоеточиями полей (Том Лейн)

source: Prevent crash in <function>close_ps()</function> (the <type>point</type> <literal>##</literal> <type>lseg</type> operator) for NaN input coordinates (Tom Lane)
ru: Предотвращение сбоя в <function>close_ps()</function> (операторе <type>point</type> <literal>##</literal> <type>lseg</type>) для входных координат NaN (Том Лейн)

source: Make it return NULL instead of crashing.
ru: В таких случаях должен просто возвращаться NULL.

source: Avoid possible crash in <function>pg_get_expr()</function> when inconsistent values are passed to it (Michael Paquier, Thomas Munro)
ru: Предотвращение сбоя в функции <function>pg_get_expr()</function>, когда ей передаются несогласованные значения (Мишель Пакье, Томас Мунро)

source: Fix several one-byte buffer over-reads in <function>to_number()</function> (Peter Eisentraut)
ru: Исправление в нескольких местах выхода на один байт за границу буфера в <function>to_number()</function> (Питер Эйзентраут)

source: In several cases the <function>to_number()</function> function would read one more character than it should from the input string. There is a small chance of a crash, if the input happens to be adjacent to the end of memory.
ru: В некоторых случаях функция <function>to_number()</function> могла читать из входной строки на один символ больше, чем нужно. Это создавало небольшой риск сбоя в случае расположения входной строки у края блока памяти.

source: Do not run the planner on the query contained in <literal>CREATE MATERIALIZED VIEW</literal> or <literal>CREATE TABLE AS</literal> when <literal>WITH NO DATA</literal> is specified (Michael Paquier, Tom Lane)
ru: Планировщик не должен запускаться для запроса, заданного в операторе <literal>CREATE MATERIALIZED VIEW</literal> или <literal>CREATE TABLE AS</literal> с указанием <literal>WITH NO DATA</literal> (Мишель Пакье, Том Лейн)

source: This avoids some unnecessary failure conditions, for example if a stable function invoked by the materialized view depends on a table that doesn't exist yet.
ru: Это предотвращает некоторые лишние условия ошибки, например, когда стабильная функция, вызываемая материализованным представлением, зависит от ещё не существующей таблицы.

source: Avoid unsafe intermediate state during expensive paths through <function>heap_update()</function> (Masahiko Sawada, Andres Freund)
ru: Ликвидация небезопасного промежуточного состояния при выполнении <function>heap_update()</function> по сложному пути (Масахико Савада, Андрес Фройнд)

source: Previously, these cases locked the target tuple (by setting its XMAX) but did not WAL-log that action, thus risking data integrity problems if the page were spilled to disk and then a database crash occurred before the tuple update could be completed.
ru: Ранее в особых случаях целевой кортеж блокировался (путём изменения его XMAX), но это действие не отражалось в журнале, что могло угрожать целостности данных, если страница вымещалась на диск, а затем, до завершения изменения кортежа, происходил сбой базы.

source: Fix hint bit update during WAL replay of row locking operations (Andres Freund)
ru: Исправление обновления вспомогательных битов при воспроизведении из WAL операций блокирования строк (Андрес Фройнд)

source: The only known consequence of this problem is that row locks held by a prepared, but uncommitted, transaction might fail to be enforced after a crash and restart.
ru: Единственным известным последствием этой проблемы было то, что блокировки строк, удерживаемые подготовленной, но не зафиксированной транзакцией, могли теряться после сбоя и перезапуска сервера.

source: Avoid unnecessary <quote>could not serialize access</quote> errors when acquiring <literal>FOR KEY SHARE</literal> row locks in serializable mode (&Aacute;lvaro Herrera)
ru: Предотвращение неоправданных ошибок <quote>could not serialize access</quote> (не удалось сериализовать доступ) при получении блокировок строк <literal>FOR KEY SHARE</literal> в сериализуемом режиме (Альваро Эррера)

source: Make sure <quote>expanded</quote> datums returned by a plan node are read-only (Tom Lane)
ru: <quote>Развёрнутые</quote> данные, возвращаемые узлом плана, должны быть доступны только для чтения (Том Лейн)

source: This avoids failures in some cases where the result of a lower plan node is referenced in multiple places in upper nodes. So far as core <productname>PostgreSQL</productname> is concerned, only array values returned by PL/pgSQL functions are at risk; but extensions might use expanded datums for other things.
ru: Это предотвращает сбои в некоторых случаях, когда результат нижнего узла плана неоднократно задействуется в верхних узлах. Если говорить о ядре <productname>PostgreSQL</productname>, риску подвержены только значения массивов, возвращаемые функциями PL/pgSQL; но расширения могут использовать развёрнутые данные и для других целей.

source: Avoid crash in <literal>postgres -C</literal> when the specified variable has a null string value (Michael Paquier)
ru: Предупреждение сбоя в <literal>postgres -C</literal>, когда указанная переменная имеет пустое строковое значение (Мишель Пакье)

source: Prevent unintended waits for the receiver in WAL sender processes (Kyotaro Horiguchi)
ru: Предотвращение незапланированного ожидания приёмника в процессах, передающих WAL (Киотаро Хоригучи)

source: Fix possible loss of large subtransactions in logical decoding (Petru-Florin Mihancea)
ru: Исправление возможной потери больших подтранзакций при логическом декодировании (Петру-Флорин Миханча)

source: Fix failure of logical decoding when a subtransaction contains no actual changes (Marko Tiikkaja, Andrew Gierth)
ru: Исправление сбоя логического декодирования, когда подтранзакция не содержит фактических изменений (Марко Тииккая, Эндрю Гирт)

source: Ensure that backends see up-to-date statistics for shared catalogs (Tom Lane)
ru: Предоставление обслуживающим процессам актуальной статистики по общим каталогам (Том Лейн)

source: The statistics collector failed to update the statistics file for shared catalogs after a request from a regular backend. This problem was partially masked because the autovacuum launcher regularly makes requests that did cause such updates; however, it became obvious with autovacuum disabled.
ru: Ранее сборщик статистики не мог обновлять файл статистики для общих каталогов по запросу от обычного обслуживающего процесса. Эта проблема была частично скрыта, так как процесс запуска автоочистки регулярно выдавал запросы, в результате которых такие обновления производились: однако она проявлялась при отключении автоочистки.

source: Avoid redundant writes of the statistics files when multiple backends request updates close together (Tom Lane, Tomas Vondra)
ru: Исключение ненужной записи в файлы статистики, когда несколько обслуживающих процессов запрашивают обновление один за другим (Том Лейн, Томас Вондра)

source: Avoid consuming a transaction ID during <command>VACUUM</command> (Alexander Korotkov)
ru: Исключение потребления лишнего ID транзакции во время <command>VACUUM</command> (Александр Коротков)

source: Some cases in <command>VACUUM</command> unnecessarily caused an XID to be assigned to the current transaction. Normally this is negligible, but if one is up against the XID wraparound limit, consuming more XIDs during anti-wraparound vacuums is a very bad thing.
ru: В некоторых случаях в процессе <command>VACUUM</command> текущей транзакции без необходимости присваивался XID. В обычных условиях это некритично, но если очистка выполняется для предотвращения зацикливания идентификаторов транзакций, потребление дополнительных идентификаторов может привести к очень плохим последствиям.

source: Prevent possible failure when vacuuming multixact IDs in an installation that has been pg_upgrade'd from pre-9.3 (Andrew Gierth, &Aacute;lvaro Herrera)
ru: Предотвращение риска сбоя при очистке идентификаторов мультитранзакций в инсталляции, обновлённой (с помощью pg_upgrade) с версии старее 9.3 (Эндрю Гирт, Альваро Эррера)

source: The usual symptom of this bug is errors like <quote>MultiXactId <replaceable>NNN</replaceable> has not been created yet -- apparent wraparound</quote>.
ru: Обычно этот дефект проявлялся в ошибках типа <quote>MultiXactId <replaceable>NNN</replaceable> has not been created yet -- apparent wraparound</quote> (MultiXactId %u ещё не был создан: видимо, произошло наложение).

source: When a manual <command>ANALYZE</command> specifies a column list, don't reset the table's <literal>changes_since_analyze</literal> counter (Tom Lane)
ru: Когда в запускаемой вручную команде <command>ANALYZE</command> задаётся список столбцов, не нужно сбрасывать счётчик <literal>changes_since_analyze</literal> целевой таблицы (Том Лейн)

source: If we're only analyzing some columns, we should not prevent routine auto-analyze from happening for the other columns.
ru: Если мы анализируем только избранные столбцы, мы не должны предотвращать запуск процедуры автоанализа для других столбцов.

source: Fix <command>ANALYZE</command>'s overestimation of <literal>n_distinct</literal> for a unique or nearly-unique column with many null entries (Tom Lane)
ru: Исправление ошибки в <command>ANALYZE</command> с завышением показателя <literal>n_distinct</literal> для столбца, содержащего уникальные или почти уникальные значениями и вместе с тем множество NULL (Том Лейн)

source: The nulls could get counted as though they were themselves distinct values, leading to serious planner misestimates in some types of queries.
ru: Значения NULL могли учитываться как будто они сами являются уникальными, что приводило к серьёзным просчётам планировщика с запросами некоторых типов.

source: Prevent autovacuum from starting multiple workers for the same shared catalog (&Aacute;lvaro Herrera)
ru: Недопущение запуска при автоочистке нескольких рабочих процессов для одного общего каталога (Альваро Эррера)

source: Normally this isn't much of a problem because the vacuum doesn't take long anyway; but in the case of a severely bloated catalog, it could result in all but one worker uselessly waiting instead of doing useful work on other tables.
ru: Обычно это не представляет большой проблемы, так как очистка выполняется быстро; но если каталог очень сильно замусорен, это может привести к тому, что все рабочие процессы, кроме одного, будут бессмысленно ждать, вместо того, чтобы делать что-то полезное с другими таблицами.

source: Fix bug in b-tree mark/restore processing (Kevin Grittner)
ru: Исправление ошибки при обработке пометки/восстановления позиции в B-дереве (Кевин Гриттнер)

source: This error could lead to incorrect join results or assertion failures in a merge join whose inner source node is a b-tree indexscan.
ru: Вследствие этой ошибки могли выдаваться некорректные результаты соединения или ошибочные утверждения при соединении слиянием, в котором внутренним узлом оказывалось сканирование индекса-B-дерева.

source: Avoid duplicate buffer lock release when abandoning a b-tree index page deletion attempt (Tom Lane)
ru: Предупреждение двойного освобождения блокировки буфера при отказе от попытки удаления страницы индекса-B-дерева (Том Лейн)

source: This mistake prevented <command>VACUUM</command> from completing in some cases involving corrupt b-tree indexes.
ru: В результате этой ошибки процедура <command>VACUUM</command> не могла завершиться в некоторых случаях при наличии проблем с индексами-B-деревьями.

source: Fix building of large (bigger than <varname>shared_buffers</varname>) hash indexes (Tom Lane)
ru: Исправление ошибки при построении больших (больше <varname>shared_buffers</varname>) хеш-индексов (Том Лейн)

source: The code path used for large indexes contained a bug causing incorrect hash values to be inserted into the index, so that subsequent index searches always failed, except for tuples inserted into the index after the initial build.
ru: В коде, работающем с большими индексами, обнаружилась ошибка, приводящая к добавлению в индекс некорректных хеш-значений, так что последующий поиск по индексу всегда был безуспешным, кроме случаев, когда кортежи вставлялись в индекс уже после его создания.

source: Prevent infinite loop in GiST index build for geometric columns containing NaN component values (Tom Lane)
ru: Предотвращение бесконечного цикла при построении индексов GiST для геометрических столбцов с составными значениями, содержащими NaN (Том Лейн)

source: Fix possible crash during a nearest-neighbor (<literal>ORDER BY</literal> distance) indexscan on a <filename>contrib/btree_gist</filename> index on an <type>interval</type> column (Peter Geoghegan)
ru: Предупреждение сбоя при сканировании с поиском ближайших соседей (упорядоченного (<literal>ORDER BY</literal>) по расстоянию) по индексу <filename>contrib/btree_gist</filename>, построенному по столбцу <type>interval</type> (Питер Геохеган)

source: Fix <quote>PANIC: failed to add BRIN tuple</quote> error when attempting to update a BRIN index entry (&Aacute;lvaro Herrera)
ru: Исправление ошибки <quote>PANIC: failed to add BRIN tuple</quote> (ПАНИКА: не удалось добавить кортеж BRIN), возникавшей при попытке изменить элемент индекса BRIN (Альваро Эррера)

source: Fix possible crash during background worker shutdown (Dmitry Ivanov)
ru: Предупреждение возможных сбоев при остановке фонового рабочего процесса (Дмитрий Иванов)

source: Fix PL/pgSQL's handling of the <literal>INTO</literal> clause within <command>IMPORT FOREIGN SCHEMA</command> commands (Tom Lane)
ru: Исправление поведения в PL/pgSQL предложения <literal>INTO</literal> внутри команд <command>IMPORT FOREIGN SCHEMA</command> (Том Лейн)

source: Fix <filename>contrib/btree_gin</filename> to handle the smallest possible <type>bigint</type> value correctly (Peter Eisentraut)
ru: Исправление кода <filename>contrib/btree_gin</filename>, чтобы он корректно выдавал наименьшее возможное значение <type>bigint</type> (Питер Эйзентраут)

source: Teach libpq to correctly decode server version from future servers (Peter Eisentraut)
ru: Наделение libpq способностью корректно декодировать версию сервера по схеме нумерации, которая вскоре будет принята (Питер Эйзентраут)

source: It's planned to switch to two-part instead of three-part server version numbers for releases after 9.6. Make sure that <function>PQserverVersion()</function> returns the correct value for such cases.
ru: Для выпусков после 9.6 планируется перейти на нумерацию версий по схеме с двумя, а не тремя компонентами. Поэтому нужно, чтобы <function>PQserverVersion()</function> возвращала правильное значение с такой нумерацией.

source: Fix <application>ecpg</application>'s code for <literal>unsigned long long</literal> array elements (Michael Meskes)
ru: Исправление в <application>ecpg</application> кода обработки элементов массива <literal>unsigned long long</literal> (Михаэль Мескес)

source: In <application>pg_dump</application> with both <option>-c</option> and <option>-C</option> options, avoid emitting an unwanted <literal>CREATE SCHEMA public</literal> command (David Johnston, Tom Lane)
ru: В <application>pg_dump</application> с одновременно заданными ключами <option>-c</option> и <option>-C</option> не должна выдаваться команда <literal>CREATE SCHEMA public</literal> (Дэвид Джонсон, Том Лейн)

source: Improve handling of <systemitem>SIGTERM</systemitem>/control-C in parallel <application>pg_dump</application> and <application>pg_restore</application> (Tom Lane)
ru: Улучшение обработки <systemitem>SIGTERM</systemitem>/control-C в параллельном режиме <application>pg_dump</application> и <application>pg_restore</application> (Том Лейн)

source: Make sure that the worker processes will exit promptly, and also arrange to send query-cancel requests to the connected backends, in case they are doing something long-running such as a <command>CREATE INDEX</command>.
ru: Обеспечение своевременного завершения рабочих процессов и передачи команд отмены запросов в подключённые рабочие процессы, в случае, если они выполняют какие-либо длительные операции, например <command>CREATE INDEX</command>.

source: Fix error reporting in parallel <application>pg_dump</application> and <application>pg_restore</application> (Tom Lane)
ru: Корректировка выдачи ошибок в параллельном режиме <application>pg_dump</application> и <application>pg_restore</application> (Том Лейн)

source: Previously, errors reported by <application>pg_dump</application> or <application>pg_restore</application> worker processes might never make it to the user's console, because the messages went through the master process, and there were various deadlock scenarios that would prevent the master process from passing on the messages. Instead, just print everything to <literal>stderr</literal>. In some cases this will result in duplicate messages (for instance, if all the workers report a server shutdown), but that seems better than no message.
ru: Ранее ошибки, выдаваемые рабочими процессами <application>pg_dump</application> или <application>pg_restore</application>, могли никогда не достигать консоли пользователя, так как они проходили через главный процесс, и были возможны различные сценарии взаимоблокировки, когда главный процесс не мог передавать сообщения. Теперь вместо этого всё будет просто выводиться в <literal>stderr</literal>. В некоторых случах при этом возможны повторы сообщений (например, когда все рабочие процессы сообщают об отключении главного), но это представляется лучшим вариантом, чем терять сообщения.

source: Ensure that parallel <application>pg_dump</application> or <application>pg_restore</application> on Windows will shut down properly after an error (Kyotaro Horiguchi)
ru: Обеспечение корректного отключения параллельных процессов <application>pg_dump</application> и <application>pg_restore</application> в Windows в случае ошибки (Киотаро Хоригучи)

source: Previously, it would report the error, but then just sit until manually stopped by the user.
ru: Ранее процесс выдавал ошибку, но затем просто оставался в памяти, пока пользователь не останавливал его вручную.

source: Make parallel <application>pg_dump</application> fail cleanly when run against a standby server (Magnus Hagander)
ru: Параллельный <application>pg_dump</application> должен завершаться штатно при попытке подключения к резервному серверу (Магнус Хагандер)

source: This usage is not supported unless <option>--no-synchronized-snapshots</option> is specified, but the error was not handled very well.
ru: Такое использование не поддерживается (если только не применяется <option>--no-synchronized-snapshots</option>), но эта ошибка не обрабатывалась должным образом.

source: Make <application>pg_dump</application> behave better when built without zlib support (Kyotaro Horiguchi)
ru: Улучшение поведения <application>pg_dump</application> при сборке без поддержки zlib (Киотаро Хоригучи)

source: It didn't work right for parallel dumps, and emitted some rather pointless warnings in other cases.
ru: С такой сборкой не работала корректно параллельная выгрузка, а в других случаях выдавались довольно бессмысленные предупреждения.

source: Make <application>pg_basebackup</application> accept <literal>-Z 0</literal> as specifying no compression (Fujii Masao)
ru: Добавление для <application>pg_basebackup</application> параметра <literal>-Z 0</literal>, позволяющего отключить сжатие (Фудзии Масао)

source: Fix makefiles' rule for building AIX shared libraries to be safe for parallel make (Noah Misch)
ru: Корректировка в makefile правила для безопасной сборки разделяемых библиотек AIX в параллельном режиме (Ной Миш)
