Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.5.po
Languages: ru

source: Avoid emitting an invalid list file in <literal>pg_restore -l</literal> when SQL object names contain newlines (Tom Lane)
ru: Предотвращение вывода командой <literal>pg_restore -l</literal> некорректного файла со списком объектов, когда имена объектов SQL содержат символы перевода строки (Том Лейн)

source: Replace newlines by spaces, which is sufficient to make the output valid for <literal>pg_restore -L</literal>'s purposes.
ru: Символы перевода строки заменяются пробелами, что достаточно для того, чтобы этот список корректно обработала команда <literal>pg_restore -L</literal>.

source: Fix <application>pg_upgrade</application> to transfer comments and security labels attached to <quote>large objects</quote> (blobs) (Stephen Frost)
ru: Исправление поведения <application>pg_upgrade</application> для корректного переноса комментариев и меток безопасности, связанных с <quote>большими объектами</quote> (BLOB) (Стивен Фрост)

source: Previously, blobs were correctly transferred to the new database, but any comments or security labels attached to them were lost.
ru: Ранее такие объекты корректно переносились в новую базу данных, но связанные с ними комментарии и метки безопасности терялись.

source: Improve error handling in <filename>contrib/adminpack</filename>'s <function>pg_file_write()</function> function (Noah Misch)
ru: Улучшение обработки ошибок в функции <function>pg_file_write()</function> из <filename>contrib/adminpack</filename> (Ной Миш)

source: Notably, it failed to detect errors reported by <function>fclose()</function>.
ru: В частности, она не реагировала на ошибки в вызове <function>fclose()</function>.

source: In <filename>contrib/dblink</filename>, avoid leaking the previous unnamed connection when establishing a new unnamed connection (Joe Conway)
ru: Предупреждение утечки предыдущего безымянного соединения при установлении нового безымянного соединения в <filename>contrib/dblink</filename> (Джо Конвей)

source: Fix <filename>contrib/pg_trgm</filename>'s extraction of trigrams from regular expressions (Tom Lane)
ru: Исправление извлечения триграмм из регулярных выражений в <filename>contrib/pg_trgm</filename> (Том Лейн)

source: In some cases it would produce a broken data structure that could never match anything, leading to GIN or GiST indexscans that use a trigram index not finding any matches to the regular expression.
ru: В некоторых случаях это могло приводить к формированию испорченной структуры данных, для которой отсутствуют какие-либо соответствия. Вследствие этого при сканировании по индексам GIN и GiST с использованием триграмм для регулярного выражения могли не находиться никакие результаты.

source: In <filename>contrib/postgres_fdw</filename>, transmit query cancellation requests to the remote server (Michael Paquier, Etsuro Fujita)
ru: В <filename>contrib/postgres_fdw</filename> реализована передача требования отмены запроса удалённому серверу (Мишель Пакье, Эцуро Фудзита)

source: Previously, a local query cancellation request did not cause an already-sent remote query to terminate early. This is a back-patch of work originally done for 9.6.
ru: Ранее требование на отмену локального запроса не влекло за собой досрочную отмену удалённого запроса, уже переданного на выполнение. Это доработка ранее была реализована в 9.6 и теперь перенесена в 9.5.

source: Support Tcl 8.6 in MSVC builds (&Aacute;lvaro Herrera)
ru: Поддержка Tcl 8.6 в сборках с MSVC (Альваро Эррера)

source: Sync our copy of the timezone library with IANA release tzcode2017b (Tom Lane)
ru: Синхронизация нашей копии библиотеки timezone с выпущенной IANA версией tzcode2017b (Том Лейн)

source: This fixes a bug affecting some DST transitions in January 2038.
ru: Это устраняет ошибку с некоторыми вариантами перехода на летнее время в январе 2038.

source: Update time zone data files to <application>tzdata</application> release 2017b for DST law changes in Chile, Haiti, and Mongolia, plus historical corrections for Ecuador, Kazakhstan, Liberia, and Spain. Switch to numeric abbreviations for numerous time zones in South America, the Pacific and Indian oceans, and some Asian and Middle Eastern countries.
ru: Обновление данных часовых поясов до версии <application>tzdata</application> 2017b, включающее изменение правил перехода на летнее время в Чили, Монголии и на Гаити, а также исторические изменения для Эквадора, Казахстана, Либерии и Испании. Переход к числовым аббревиатурам для ряда часовых поясов в Южной Америке, в Тихом и Индийском океанах, а также в некоторых азиатских и ближневосточных странах.

source: The IANA time zone database previously provided textual abbreviations for all time zones, sometimes making up abbreviations that have little or no currency among the local population. They are in process of reversing that policy in favor of using numeric UTC offsets in zones where there is no evidence of real-world use of an English abbreviation. At least for the time being, <productname>PostgreSQL</productname> will continue to accept such removed abbreviations for timestamp input. But they will not be shown in the <structname>pg_timezone_names</structname> view nor used for output.
ru: Ранее в базе данных часовых поясов IANA предоставлялись текстовые аббревиатуры для всех часовых поясов и иногда при этом указывались аббревиатуры, которые практически не употреблялись местным населением. Сейчас происходит процесс ухода от этой практики в пользу использования числовых смещений UTC в тех часовых поясах, где нет никаких свидетельств реального использования английской аббревиатуры. Как минимум на данном этапе, <productname>PostgreSQL</productname> продолжит принимать подобные удалённые аббревиатуры при вводе дат/времени. Но они не будут видны при просмотре представления <structname>pg_timezone_names</structname> и не будут выводиться с датами/временем.

source: Use correct daylight-savings rules for POSIX-style time zone names in MSVC builds (David Rowley)
ru: Использование корректных правил перехода на летнее время для названий часовых поясов в стиле POSIX при сборке с MSVC (Дэвид Роули)

source: The Microsoft MSVC build scripts neglected to install the <filename>posixrules</filename> file in the timezone directory tree. This resulted in the timezone code falling back to its built-in rule about what DST behavior to assume for a POSIX-style time zone name. For historical reasons that still corresponds to the DST rules the USA was using before 2007 (i.e., change on first Sunday in April and last Sunday in October). With this fix, a POSIX-style zone name will use the current and historical DST transition dates of the <literal>US/Eastern</literal> zone. If you don't want that, remove the <filename>posixrules</filename> file, or replace it with a copy of some other zone file (see <xref linkend="datatype-timezones"/>). Note that due to caching, you may need to restart the server to get such changes to take effect.
ru: Сборочные скрипты для MSVC не устанавливали корректно файл <filename>posixrules</filename> в дерево каталогов timezone. Это приводило к тому, что код timezone переходил к использованию встроенных представлений о том, какой вариант перехода на летнее время применим для названия пояса в стиле POSIX. По историческим причинам это соответствует правилам, которые действовали в США до 2007 г. (то есть переход на летнее время происходил в первое воскресенье апреля, а на зимнее — в последнее воскресенье октября). С этим исправлением для часового пояса с названием в стиле POSIX будут использоваться текущие и исторические даты перехода для пояса <literal>US/Eastern</literal>. Если для вас это нежелательно, удалите файл <filename>posixrules</filename> или замените его файлом другого часового пояса (см. <xref remap="4" linkend="datatype-timezones"/>). Учтите, что вследствие кеширования вам потребуется перезапустить сервер, чтобы подобные изменения вступили в силу.

source: Release 9.5.6
ru: Выпуск 9.5.6

source: This release contains a variety of fixes from 9.5.5. For information about new features in the 9.5 major release, see <xref linkend="release-9-5"/>.
ru: В этот выпуск вошли различные исправления, внесённые после версии 9.5.5. За информацией о нововведениях версии 9.5 обратитесь к <xref remap="3" linkend="release-9-5"/>.

source: Migration to Version 9.5.6
ru: Миграция на версию 9.5.6

source: However, if your installation has been affected by the bug described in the first changelog entry below, then after updating you may need to take action to repair corrupted indexes.
ru: Однако, если в вашей инсталляции проявилась ошибка, описанная в первой записи следующего списка изменений, после обновления вам может потребоваться предпринять дополнительные действия для исправления испорченных индексов.

source: Also, if you are upgrading from a version earlier than 9.5.5, see <xref linkend="release-9-5-5"/>.
ru: Также, если вы обновляете сервер с версии, более ранней, чем 9.5.5, см. <xref remap="4" linkend="release-9-5-5"/>.

source: Fix a race condition that could cause indexes built with <command>CREATE INDEX CONCURRENTLY</command> to be corrupt (Pavan Deolasee, Tom Lane)
ru: Исправление поведения в особых условиях, которое приводило к повреждению индексов, создаваемых командой <command>CREATE INDEX CONCURRENTLY</command> (Паван Деоласи, Том Лейн)

source: If <command>CREATE INDEX CONCURRENTLY</command> was used to build an index that depends on a column not previously indexed, then rows updated by transactions that ran concurrently with the <command>CREATE INDEX</command> command could have received incorrect index entries. If you suspect this may have happened, the most reliable solution is to rebuild affected indexes after installing this update.
ru: Если команда <command>CREATE INDEX CONCURRENTLY</command> применялась для построения индекса, зависящего от столбца, ранее не индексированного, то у строк, изменяемых транзакциями, выполняемыми одновременно с командой <command>CREATE INDEX</command>, могли оказываться некорректные записи в индексе. В случае подозрений, что вас это коснулось, самое надёжное решение — перестроить такие индексы после установки этого обновления.

source: Ensure that the special snapshot used for catalog scans is not invalidated by premature data pruning (Tom Lane)
ru: Предотвращение утери специального снимка, используемого при сканированиях каталога, при преждевременной очистке данных (Tom Lane)

source: Backends failed to account for this snapshot when advertising their oldest xmin, potentially allowing concurrent vacuuming operations to remove data that was still needed. This led to transient failures along the lines of <quote>cache lookup failed for relation 1255</quote>.
ru: Рабочие процессы не учитывали этот снимок, сообщая о своём самом старом xmin, что оставляло возможность для удаления по-прежнему нужных данных параллельными операциями очистки. Это приводило к появлению плавающих ошибок с сообщениями <quote>ошибка поиска в кеше для отношения 1255</quote>.

source: Fix incorrect WAL logging for BRIN indexes (Kuntal Ghosh)
ru: Исправление некорректной записи в WAL, формируемой для индексов BRIN (Кунтал Гхош)

source: The WAL record emitted for a BRIN <quote>revmap</quote> page when moving an index tuple to a different page was incorrect. Replay would make the related portion of the index useless, forcing it to be recomputed.
ru: Запись WAL, выдаваемая для страницы BRIN <quote>revmap</quote> при перемещении кортежа индекса в другую страницу, была некорректной. При воспроизведении журнала соответствующая часть индекса становилась непригодной, и её требовалось вычислять заново.

source: Unconditionally WAL-log creation of the <quote>init fork</quote> for an unlogged table (Michael Paquier)
ru: Безусловное фиксирование в WAL создания <quote>слоя инициализации</quote> для нежурналируемых таблиц (Мишель Пакье)

source: Previously, this was skipped when <xref linkend="guc-wal-level"/> = <literal>minimal</literal>, but actually it's necessary even in that case to ensure that the unlogged table is properly reset to empty after a crash.
ru: Ранее это действие пропускалось при <xref linkend="guc-wal-level"/> = <literal>minimal</literal>, но на самом деле это необходимо даже в этом случае, чтобы нежурналируемая таблица корректно создавалась пустой после сбоя.

source: Reduce interlocking on standby servers during the replay of btree index vacuuming operations (Simon Riggs)
ru: Сокращение взаимоблокировок на резервных серверах при воспроизведении операций очистки индекса-B-дерева (Саймон Риггс)

source: This change avoids substantial replication delays that sometimes occurred while replaying such operations.
ru: Это изменение исключает существенные задержки при репликации, которые иногда имели место при воспроизведении таких операций.

source: If the stats collector dies during hot standby, restart it (Takayuki Tsunakawa)
ru: Если процесс сборщика статистики потерян, перезапускать его и в режиме горячего резерва (Такаюки Цунакава)

source: Ensure that hot standby feedback works correctly when it's enabled at standby server start (Ants Aasma, Craig Ringer)
ru: Обеспечение корректной работы механизма уведомлений горячего резерва, когда он включается при запуске резервного сервера (Антс Аасма, Крейг Рингер)

source: Check for interrupts while hot standby is waiting for a conflicting query (Simon Riggs)
ru: Проверка прерываний в момент ожидания конфликтующего запроса сервером горячего резерва (Саймон Риггс)

source: Avoid constantly respawning the autovacuum launcher in a corner case (Amit Khandekar)
ru: Предупреждение постоянного перезапуска процесса запуска автоочистки в особых случаях (Амит Хандекар)

source: This fix avoids problems when autovacuum is nominally off and there are some tables that require freezing, but all such tables are already being processed by autovacuum workers.
ru: Это исправление решает проблему, возникавшую, когда автоочистка номинально отключена и есть несколько таблиц, требующих «заморозки», но эти таблицы уже обработаны рабочими процессами автоочистки.

source: Fix check for when an extension member object can be dropped (Tom Lane)
ru: Исправление проверки на возможность удаления объекта, принадлежащего расширению (Том Лейн)

source: Extension upgrade scripts should be able to drop member objects, but this was disallowed for serial-column sequences, and possibly other cases.
ru: Скрипты обновления расширений должны иметь возможность удалять объекты расширений, но это запрещалось для последовательностей со столбцами serial, а также, возможно, в других случаях.

source: Make sure <command>ALTER TABLE</command> preserves index tablespace assignments when rebuilding indexes (Tom Lane, Michael Paquier)
ru: Команда <command>ALTER TABLE</command> должна сохранять назначения табличных пространств индексам при перестраивании индексов (Том Лейн, Мишель Пакье)

source: Previously, non-default settings of <xref linkend="guc-default-tablespace"/> could result in broken indexes.
ru: Ранее с нестандартными значениями <xref linkend="guc-default-tablespace"/> были возможны разрушения индексов.

source: Fix incorrect updating of trigger function properties when changing a foreign-key constraint's deferrability properties with <command>ALTER TABLE ... ALTER CONSTRAINT</command> (Tom Lane)
ru: Исправление некорректного изменения свойств триггерной функции при изменении свойства «откладываемости» ограничения внешнего ключа с помощью команды <command>ALTER TABLE ... ALTER CONSTRAINT</command> (Том Лейн)

source: This led to odd failures during subsequent exercise of the foreign key, as the triggers were fired at the wrong times.
ru: Это приводило к странным сбоям при последующем обращении к внешнему ключу, так как триггеры срабатывали не в положенное время.

source: Prevent dropping a foreign-key constraint if there are pending trigger events for the referenced relation (Tom Lane)
ru: Недопущение удаления ограничения внешнего ключа при наличии событий, ожидающих обработки триггерами, для целевого отношения (Том Лейн)

source: This avoids <quote>could not find trigger <replaceable>NNN</replaceable></quote> or <quote>relation <replaceable>NNN</replaceable> has no triggers</quote> errors.
ru: Это предотвращает ошибки <quote>не удалось найти триггер <replaceable>NNN</replaceable></quote> и <quote>в отношении <replaceable>NNN</replaceable> нет триггеров</quote>.

source: Fix <command>ALTER TABLE ... SET DATA TYPE ... USING</command> when child table has different column ordering than the parent (&Aacute;lvaro Herrera)
ru: Исправление поведения <command>ALTER TABLE ... SET DATA TYPE ... USING</command> в случаях, когда порядок столбцов в дочерней таблице отличается от родительской (Альваро Эррера)

source: Failure to adjust the column numbering in the <literal>USING</literal> expression led to errors, typically <quote>attribute <replaceable>N</replaceable> has wrong type</quote>.
ru: Вследствие того, что столбцы в выражении <literal>USING</literal> не перенумеровывались, возникала ошибка, обычно такая: <quote>атрибут <replaceable>N</replaceable> имеет неправильный тип</quote>.

source: Fix processing of OID column when a table with OIDs is associated to a parent with OIDs via <command>ALTER TABLE ... INHERIT</command> (Amit Langote)
ru: Исправление обращения к столбцу OID в случаях, когда таблица с таким столбцом связывается с родительской, тоже с OID, посредством <command>ALTER TABLE ... INHERIT</command> (Амит Ланготе)

source: The OID column should be treated the same as regular user columns in this case, but it wasn't, leading to odd behavior in later inheritance changes.
ru: В таких случаях столбец OID должен обрабатываться как обычный пользовательский столбец, но этого не происходило, что приводило к странному поведению при последующих изменениях наследования.

source: Fix <command>CREATE OR REPLACE VIEW</command> to update the view query before attempting to apply the new view options (Dean Rasheed)
ru: Исправление поведения <command>CREATE OR REPLACE VIEW</command> — запрос представления должен изменяться до применения новых параметров представления (Дин Рашид)

source: Previously the command would fail if the new options were inconsistent with the old view definition.
ru: Ранее в команде происходил сбой, если новые параметры оказывались несогласованными со старым определением представления.

source: Report correct object identity during <command>ALTER TEXT SEARCH CONFIGURATION</command> (Artur Zakirov)
ru: Получение правильного идентификатора объекта в <command>ALTER TEXT SEARCH CONFIGURATION</command> (Артур Закиров)

source: The wrong catalog OID was reported to extensions such as logical decoding.
ru: Ранее расширениям, таким как модули логического декодирования, выдавался неправильный OID каталога.

source: Fix commit timestamp mechanism to not fail when queried about the special XIDs <literal>FrozenTransactionId</literal> and <literal>BootstrapTransactionId</literal> (Craig Ringer)
ru: Предупреждение сбоев механизма учёта времени транзакций при запросе особых XID (<literal>FrozenTransactionId</literal> и <literal>BootstrapTransactionId</literal>) (Крейг Рингер)

source: Check for serializability conflicts before reporting constraint-violation failures (Thomas Munro)
ru: Проверка конфликтов сериализуемости перед тем, как будет выдана ошибка нарушения ограничений (Томас Мунро)

source: When using serializable transaction isolation, it is desirable that any error due to concurrent transactions should manifest as a serialization failure, thereby cueing the application that a retry might succeed. Unfortunately, this does not reliably happen for duplicate-key failures caused by concurrent insertions. This change ensures that such an error will be reported as a serialization error if the application explicitly checked for the presence of a conflicting key (and did not find it) earlier in the transaction.
ru: В транзакциях сериализуемого уровня изоляции желательно, чтобы ошибка, вызванная параллельными транзакциями, заявлялась как ошибка сериализации, что скажет приложению, что попытка повторить то же действие может быть успешной. К сожалению, это не будет надёжно работать при дублировании ключа при параллельном его добавлении. В результате этого изменения такая ошибка будет выдаваться как ошибка сериализации, если приложение явно проверяет присутствие конфликтующего ключа (и не находит его) до этого в транзакции.

source: Fix incorrect use of view reloptions as regular table reloptions (Tom Lane)
ru: Исправление некорректного использования reloptions представлений как reloptions обычных таблиц (Том Лейн)

source: The symptom was spurious <quote>ON CONFLICT is not supported on table ... used as a catalog table</quote> errors when the target of <command>INSERT ... ON CONFLICT</command> is a view with cascade option.
ru: Симптомами ошибки были неуместные сообщения <quote>ON CONFLICT не поддерживается для таблицы ..., служащей таблицей каталога</quote> когда целевым отношением <command>INSERT ... ON CONFLICT</command> было представление с каскадной проверкой.

source: Fix incorrect <quote>target lists can have at most <replaceable>N</replaceable> entries</quote> complaint when using <literal>ON CONFLICT</literal> with wide tables (Tom Lane)
ru: Исправление некорректного сообщения <quote>допустимое число элементов в целевом списке ограничено <replaceable>N</replaceable></quote> при использовании <literal>ON CONFLICT</literal> с широкими таблицами (Том Лейн)

source: Prevent multicolumn expansion of <replaceable>foo</replaceable><literal>.*</literal> in an <command>UPDATE</command> source expression (Tom Lane)
ru: Предотвращение разворачивания <replaceable>foo</replaceable><literal>.*</literal> в набор столбцов в исходном выражении <command>UPDATE</command> (Том Лейн)

source: This led to <quote>UPDATE target count mismatch --- internal error</quote>. Now the syntax is understood as a whole-row variable, as it would be in other contexts.
ru: Это приводило к ошибкам с сообщением <quote>несоответствие целевого количества в UPDATE --- внутренняя ошибка</quote>. Теперь эта запись воспринимается как обозначение переменной «вся-строка», как и в других контекстах.

source: Ensure that column typmods are determined accurately for multi-row <literal>VALUES</literal> constructs (Tom Lane)
ru: Обеспечение точного определения модификаторов типа столбцов в конструкциях <literal>VALUES</literal> с несколькими строками (Том Лейн)

source: This fixes problems occurring when the first value in a column has a determinable typmod (e.g., length for a <type>varchar</type> value) but later values don't share the same limit.
ru: Это устраняет проблемы, возникавшие, когда первое значение в столбце имеет воспринимаемый модификатор типа (например, длину значения <type>varchar</type>), но последующие значения не разделяют его ограничение.

source: Throw error for an unfinished Unicode surrogate pair at the end of a Unicode string (Tom Lane)
ru: При нахождении незаконченной суррогатной пары Unicode в конце строки символов Unicode должна выдаваться ошибка (Том Лейн)

source: Normally, a Unicode surrogate leading character must be followed by a Unicode surrogate trailing character, but the check for this was missed if the leading character was the last character in a Unicode string literal (<literal>U&amp;'...'</literal>) or Unicode identifier (<literal>U&amp;"..."</literal>).
ru: Обычно за начальным суррогатным символом Unicode должно следовать продолжение, но это не проверялось когда такой начальный символ оказывался последним в строке символов Unicode (<literal>U&amp;'...'</literal>) или в Unicode-идентификаторе (<literal>U&amp;"..."</literal>).
