Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.5.po
Languages: ru

source: Change index operator class for columns <link linkend="catalog-pg-seclabel"><structname>pg_seclabel</structname></link>.<structname>provider</structname> and <link linkend="catalog-pg-shseclabel"><structname>pg_shseclabel</structname></link>.<structname>provider</structname> to be <literal>text_pattern_ops</literal> (Tom Lane)
ru: Смена индексируемого класса операторов для столбцов <link linkend="catalog-pg-seclabel"><structname>pg_seclabel</structname></link>.<structname>provider</structname> и <link linkend="catalog-pg-shseclabel"><structname>pg_shseclabel</structname></link>.<structname>provider</structname> на <literal>text_pattern_ops</literal> (Том Лейн)

source: This avoids possible problems with these indexes when different databases of a cluster have different default collations.
ru: Это позволяет избежать возможных проблем с этими индексами, когда в разных базах данных кластера используются разные правила сортировки.

source: Change the spinlock primitives to function as compiler barriers (Robert Haas)
ru: Изменение примитивов spinlock, чтобы они действовали как барьеры для оптимизаций компилятора (Роберт Хаас)

source: Allow higher-precision time stamp resolution on <systemitem class="osname">Windows 8</systemitem>, <systemitem class="osname">Windows Server 2012</systemitem>, and later Windows systems (Craig Ringer)
ru: Получение системного времени с большей точностью в <systemitem class="osname">Windows 8</systemitem>, <systemitem class="osname">Windows Server 2012</systemitem> и более новых системах Windows (Крейг Рингер)

source: Install shared libraries to <filename>bin</filename> in <systemitem class="osname">MS Windows</systemitem> (Peter Eisentraut, Michael Paquier)
ru: Установка разделяемых библиотек в <filename>bin</filename> в <systemitem class="osname">MS Windows</systemitem> (Питер Эйзентраут, Мишель Пакье)

source: Install <filename>src/test/modules</filename> together with <filename>contrib</filename> on <productname>MSVC</productname> builds (Michael Paquier)
ru: Установка <filename>src/test/modules</filename> вместе с <filename>contrib</filename> в сборках с <productname>MSVC</productname> (Мишель Пакье)

source: Allow <link linkend="install-procedure">configure</link>'s <option>--with-extra-version</option> option to be honored by the <productname>MSVC</productname> build (Michael Paquier)
ru: В сборке с <productname>MSVC</productname> теперь может учитываться задаваемый для <link linkend="install-procedure">configure</link> параметр <option>--with-extra-version</option> (Мишель Пакье)

source: Pass <envar>PGFILEDESC</envar> into <productname>MSVC</productname> contrib builds (Michael Paquier)
ru: Передача <envar>PGFILEDESC</envar> в сборки contrib с <productname>MSVC</productname> (Мишель Пакье)

source: Add icons to all <productname>MSVC</productname>-built binaries and version information to all <systemitem class="osname">MS Windows</systemitem> binaries (Noah Misch)
ru: Добавление значков во все собираемые с <productname>MSVC</productname> двоичные файлы и информации о версии во все двоичные файлы, собираемые для <systemitem class="osname">MS Windows</systemitem> (Ной Миш)

source: MinGW already had such icons.
ru: При сборке с MinGW такие значки уже добавлялись ранее.

source: Add optional-argument support to the internal <function>getopt_long()</function> implementation (Michael Paquier, Andres Freund)
ru: Добавление поддержки необязательных аргументов во внутреннюю реализацию <function>getopt_long()</function> (Мишель Пакье, Андрес Фройнд)

source: This is used by the <productname>MSVC</productname> build.
ru: Это используется при сборке с <productname>MSVC</productname>.

source: Additional Modules
ru: Дополнительные модули

source: Add statistics for minimum, maximum, mean, and standard deviation times to <link linkend="pgstatstatements-columns"><application>pg_stat_statements</application></link> (Mitsumasa Kondo, Andrew Dunstan)
ru: Добавление статистики для получения минимального, максимального, среднего времени и стандартного отклонения в <link linkend="pgstatstatements-columns"><application>pg_stat_statements</application></link> (Мицумаса Кондо, Эндрю Дунстан)

source: Add <link linkend="pgcrypto"><application>pgcrypto</application></link> function <function>pgp_armor_headers()</function> to extract <productname>PGP</productname> armor headers (Marko Tiikkaja, Heikki Linnakangas)
ru: Добавление в <link linkend="pgcrypto"><application>pgcrypto</application></link> функции <function>pgp_armor_headers()</function> для извлечения заголовков <productname>PGP</productname> Armor (Марко Тииккая, Хейкки Линнакангас)

source: Allow empty replacement strings in <link linkend="unaccent"><application>unaccent</application></link> (Mohammad Alhashash)
ru: Возможность задавать пустые строки замены в <link linkend="unaccent"><application>unaccent</application></link> (Мохаммед Альхашаш)

source: This is useful in languages where diacritic signs are represented as separate characters.
ru: Это полезно для языков, в которых диакритические знаки представляются как отдельные символы.

source: Allow multicharacter source strings in <link linkend="unaccent"><application>unaccent</application></link> (Tom Lane)
ru: Возможность задавать многосимвольные исходные строки в <link linkend="unaccent"><application>unaccent</application></link> (Том Лейн)

source: This could be useful in languages where diacritic signs are represented as separate characters. It also allows more complex unaccent dictionaries.
ru: Это может быть полезно для языков, в которых диакритические знаки представляются как отдельные символы. Это также позволяет создавать более сложные словари удаления диакритики.

source: Add <filename>contrib</filename> modules <link linkend="tsm-system-rows"><application>tsm_system_rows</application></link> and <link linkend="tsm-system-time"><application>tsm_system_time</application></link> to allow additional table sampling methods (Petr Jel&iacute;nek)
ru: Добавление в <filename>contrib</filename> модулей <link linkend="tsm-system-rows"><application>tsm_system_rows</application></link> и <link linkend="tsm-system-time"><application>tsm_system_time</application></link>, реализующих дополнительные методы извлечения выборки (Петр Желинек)

source: Add <link linkend="gin"><acronym>GIN</acronym></link> index inspection functions to <link linkend="pageinspect"><application>pageinspect</application></link> (Heikki Linnakangas, Peter Geoghegan, Michael Paquier)
ru: Добавление функций исследования индекса <link linkend="gin"><acronym>GIN</acronym></link> в <link linkend="pageinspect"><application>pageinspect</application></link> (Хейкки Линнакангас, Питер Геохеган, Мишель Пакье)

source: Add information about buffer pins to <link linkend="pgbuffercache"><application>pg_buffercache</application></link> display (Andres Freund)
ru: Добавление информации о закреплении буфера в вывод <link linkend="pgbuffercache"><application>pg_buffercache</application></link> (Андрес Фройнд)

source: Allow <link linkend="pgstattuple"><application>pgstattuple</application></link> to report approximate answers with less overhead using <function>pgstattuple_approx()</function> (Abhijit Menon-Sen)
ru: Возможность получать от <link linkend="pgstattuple"><application>pgstattuple</application></link> приблизительных ответов с меньшими издержками, используя <function>pgstattuple_approx()</function> (Абхиджит Менон-Сен)

source: Move <application>dummy_seclabel</application>, <application>test_shm_mq</application>, <application>test_parser</application>, and <application>worker_spi</application> from <filename>contrib</filename> to <filename>src/test/modules</filename> (&Aacute;lvaro Herrera)
ru: Перемещение <application>dummy_seclabel</application>, <application>test_shm_mq</application>, <application>test_parser</application> и <application>worker_spi</application> из <filename>contrib</filename> в <filename>src/test/modules</filename> (Альваро Эррера)

source: These modules are only meant for server testing, so they do not need to be built or installed when packaging <productname>PostgreSQL</productname>.
ru: Этим модули предназначаются только для тестирования сервера, поэтому их нет смысла собирать или устанавливать в составе пакета <productname>PostgreSQL</productname>.
