Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.6.po
Languages: ru

source: Add <xref linkend="guc-log-line-prefix"/> option <literal>%n</literal> to print the current time in Unix epoch form, with milliseconds (Tomas Vondra, Jeff Davis)
ru: Добавление в <xref linkend="guc-log-line-prefix"/> спецкода <literal>%n</literal> для вывода текущего времени в формате Unix, с миллисекундами (Томас Вондра, Джефф Дэвис)

source: Add <xref linkend="guc-syslog-sequence-numbers"/> and <xref linkend="guc-syslog-split-messages"/> configuration parameters to provide more control over the message format when logging to <systemitem>syslog</systemitem> (Peter Eisentraut)
ru: Добавление конфигурационных параметров <xref linkend="guc-syslog-sequence-numbers"/> и <xref linkend="guc-syslog-split-messages"/> для дополнительной манипуляции форматом сообщений при выводе их в <systemitem>syslog</systemitem> (Питер Эйзентраут)

source: Merge the <literal>archive</literal> and <literal>hot_standby</literal> values of the <xref linkend="guc-wal-level"/> configuration parameter into a single new value <literal>replica</literal> (Peter Eisentraut)
ru: Объединение значений <literal>archive</literal> и <literal>hot_standby</literal> конфигурационного параметра <xref linkend="guc-wal-level"/> в одном новом значении <literal>replica</literal> (Питер Эйзентраут)

source: Making a distinction between these settings is no longer useful, and merging them is a step towards a planned future simplification of replication setup. The old names are still accepted but are converted to <literal>replica</literal> internally.
ru: Различать эти варианты больше не имеет смысла, и их слияние является шагом вперёд к запланированному упрощению организации репликации. Старые варианты по-прежнему принимаются, но внутри преобразуются к <literal>replica</literal>.

source: Add configure option <option>--with-systemd</option> to enable calling <function>sd_notify()</function> at server start and stop (Peter Eisentraut)
ru: Добавление в configure параметра <option>--with-systemd</option>, позволяющего вызывать <function>sd_notify()</function> при запуске и остановке сервера (Питер Эйзентраут)

source: This allows the use of <application>systemd</application> service units of type <literal>notify</literal>, which greatly simplifies the management of <productname>PostgreSQL</productname> under <application>systemd</application>.
ru: Это позволяет использовать единицы служб <application>systemd</application> типа <literal>notify</literal>, что значительно упрощает управление <productname>PostgreSQL</productname> в окружении <application>systemd</application>.

source: Allow the server's <acronym>SSL</acronym> key file to have group read access if it is owned by <literal>root</literal> (Christoph Berg)
ru: Теперь к файлу <acronym>SSL</acronym>-ключа сервера может быть разрешён доступ группы на чтение, если он принадлежит пользователю <literal>root</literal> (Кристоф Берг)

source: Formerly, we insisted the key file be owned by the user running the <productname>PostgreSQL</productname> server, but that is inconvenient on some systems (such as <systemitem class="osname">Debian</systemitem>) that are configured to manage certificates centrally. Therefore, allow the case where the key file is owned by <literal>root</literal> and has group read access. It is up to the operating system administrator to ensure that the group does not include any untrusted users.
ru: Ранее мы настаивали на том, чтобы файл ключа принадлежал пользователю, запускающему сервер <productname>PostgreSQL</productname>, но это оказалось неудобным в некоторых системах (например, в <systemitem class="osname">Debian</systemitem>), в которых организовано централизованное управление сертификатами. Поэтому стоит допустить случай, когда файл принадлежит <literal>root</literal>, а группа имеет доступ на чтение. И в этом случае администратор отвечает за то, чтобы в эту группу не входили недоверенные пользователи.

source: Reliability
ru: Надёжность

source: Force backends to exit if the postmaster dies (Rajeev Rastogi, Robert Haas)
ru: Принудительное завершение обслуживающих процессов в случае отключения главного процесса (Раджив Растоги, Роберт Хаас)

source: Under normal circumstances the postmaster should always outlive its child processes. If for some reason the postmaster dies, force backend sessions to exit with an error. Formerly, existing backends would continue to run until their clients disconnect, but that is unsafe and inefficient. It also prevents a new postmaster from being started until the last old backend has exited. Backends will detect postmaster death when waiting for client I/O, so the exit will not be instantaneous, but it should happen no later than the end of the current query.
ru: При нормальных обстоятельствах главный процесс всегда должен жить дольше своих дочерних процессов. Если же он по какой-то причине умирает, процессы, обслуживающие клиентов, принудительно завершаются с ошибкой. Ранее работающие процессы продолжали выполняться до отключения клиента; но это было небезопасно и неэффективно. Это также не давало запустить новый управляющий процесс до завершения последнего из старых обслуживающих процессов. Теперь обслуживающие процессы будут проверять, жив ли главный процесс, ожидая ввода/вывода от клиента, так что они завершатся не мгновенно, но это должно произойти не позже завершения текущего запроса.

source: Check for serializability conflicts before reporting constraint-violation failures (Thomas Munro)
ru: Проверка конфликтов сериализуемости перед тем, как будет выдана ошибка нарушения ограничений (Томас Мунро)

source: When using serializable transaction isolation, it is desirable that any error due to concurrent transactions should manifest as a serialization failure, thereby cueing the application that a retry might succeed. Unfortunately, this does not reliably happen for duplicate-key failures caused by concurrent insertions. This change ensures that such an error will be reported as a serialization error if the application explicitly checked for the presence of a conflicting key (and did not find it) earlier in the transaction.
ru: В транзакциях сериализуемого уровня изоляции желательно, чтобы ошибка, вызванная параллельными транзакциями, заявлялась как ошибка сериализации, что скажет приложению, что попытка повторить то же действие может быть успешной. К сожалению, это не будет надёжно работать при дублировании ключа при параллельном его добавлении. В результате этого изменения такая ошибка будет выдаваться как ошибка сериализации, если приложение явно проверяет присутствие конфликтующего ключа (и не находит его) до этого в транзакции.

source: Ensure that invalidation messages are recorded in <acronym>WAL</acronym> even when issued by a transaction that has no <acronym>XID</acronym> assigned (Andres Freund)
ru: Сообщения аннулирования должны записываться в <acronym>WAL</acronym>, даже если они выдаются транзакцией, которой не назначен <acronym>XID</acronym> (Андрес Фройнд)

source: This fixes some corner cases in which transactions on standby servers failed to notice changes, such as new indexes.
ru: Это решает проблемы в особых случаях, когда транзакции на резервных серверах не замечали некоторые изменения, например, создание индексов.

source: Prevent multiple processes from trying to clean a <acronym>GIN</acronym> index's pending list concurrently (Teodor Sigaev, Jeff Janes)
ru: Предупреждение одновременной отработки несколькими процессами очереди изменений в индексе <acronym>GIN</acronym> (Фёдор Сигаев, Джефф Джейнс)

source: This had been intentionally allowed, but it causes race conditions that can result in vacuum missing index entries it needs to delete.
ru: Это допускалось намеренно, но вызывало условия гонки, при которых процедура очистки пропускала записи в индексе, которые нужно было удалить.

source: Replication and Recovery
ru: Репликация и восстановление

source: Allow synchronous replication to support multiple simultaneous synchronous standby servers, not just one (Masahiko Sawada, Beena Emerson, Michael Paquier, Fujii Masao, Kyotaro Horiguchi)
ru: Возможность при синхронной репликации задействовать одновременно несколько синхронных резервных серверов (раньше поддерживался только один) (Масахико Савада, Бина Емерсон, Мишель Пакье, Фудзии Масао, Киотаро Хоригучи)

source: The number of standby servers that must acknowledge a commit before it is considered complete is now configurable as part of the <xref linkend="guc-synchronous-standby-names"/> parameter.
ru: Число резервных серверов, которые должны подтвердить фиксацию, прежде чем она будет считаться завершённой, теперь устанавливается в значении параметра <xref linkend="guc-synchronous-standby-names"/>.

source: Add new setting <literal>remote_apply</literal> for configuration parameter <xref linkend="guc-synchronous-commit"/> (Thomas Munro)
ru: Добавление нового значения <literal>remote_apply</literal> для конфигурационного параметра <xref linkend="guc-synchronous-commit"/> (Томас Мунро)

source: In this mode, the master waits for the transaction to be <emphasis>applied</emphasis> on the standby server, not just written to disk. That means that you can count on a transaction started on the standby to see all commits previously acknowledged by the master.
ru: В этом режиме главный сервер ждёт, пока транзакция не будет <emphasis>применена</emphasis> на резервном, а не просто сохранена на диске. Это значит, что можно рассчитывать, что транзакция, запущенная на резервном сервере, будет видеть все изменения, подтверждённые на главном.

source: Add a feature to the replication protocol, and a corresponding option to <link linkend="functions-replication-table"><function>pg_create_physical_replication_slot()</function></link>, to allow reserving <acronym>WAL</acronym> immediately when creating a replication slot (Gurjeet Singh, Michael Paquier)
ru: Усовершенствование протокола репликации и добавление параметра в функцию <link linkend="functions-replication-table"><function>pg_create_physical_replication_slot()</function></link> для немедленного резервирования <acronym>WAL</acronym> при создании слота репликации (Гуржит Сингх, Мишель Пакье)

source: This allows the creation of a replication slot to guarantee that all the <acronym>WAL</acronym> needed for a base backup will be available.
ru: Это позволяет при создании слота репликации гарантировать, что будут доступны все файлы <acronym>WAL</acronym>, нужные для базовой копии.

source: Add a <option>--slot</option> option to <link linkend="app-pgbasebackup"><application>pg_basebackup</application></link> (Peter Eisentraut)
ru: Добавление ключа <option>--slot</option> для <link linkend="app-pgbasebackup"><application>pg_basebackup</application></link> (Питер Эйзентраут)

source: This lets <application>pg_basebackup</application> use a replication slot defined for <acronym>WAL</acronym> streaming. After the base backup completes, selecting the same slot for regular streaming replication allows seamless startup of the new standby server.
ru: Это позволяет <application>pg_basebackup</application> использовать слот репликации, созданный для трансляции <acronym>WAL</acronym>. Выбрав тот же слот для обычной потоковой репликации после создания базовой резервной копии, можно запустить новый резервный сервер, не прерывая приём потока.

source: Extend <link linkend="functions-admin-backup-table"><function>pg_start_backup()</function></link> and <function>pg_stop_backup()</function> to support non-exclusive backups (Magnus Hagander)
ru: Доработка функций <link linkend="functions-admin-backup-table"><function>pg_start_backup()</function></link> и <function>pg_stop_backup()</function> для поддержки немонопольного резервного копирования (Магнус Хагандер)

source: Queries
ru: Запросы

source: Allow functions that return sets of tuples to return simple <literal>NULL</literal>s (Andrew Gierth, Tom Lane)
ru: Функции, возвращающие наборы кортежей, теперь могут возвращать просто <literal>NULL</literal> (Эндрю Гирт, Том Лейн)

source: In the context of <literal>SELECT FROM function(...)</literal>, a function that returned a set of composite values was previously not allowed to return a plain <literal>NULL</literal> value as part of the set. Now that is allowed and interpreted as a row of <literal>NULL</literal>s. This avoids corner-case errors with, for example, unnesting an array of composite values.
ru: В контексте <literal>SELECT FROM function(...)</literal> функция, возвращающая набор составных значений, не могла вернуть обычное значение <literal>NULL</literal> в составе набора. Теперь это допускается и такой результат воспринимается как строка с полями <literal>NULL</literal>. Это позволяет избежать ошибок в особых случаях, например, при разворачивании массива составных значений.

source: Fully support array subscripts and field selections in the target column list of an <command>INSERT</command> with multiple <literal>VALUES</literal> rows (Tom Lane)
ru: Полная поддержка указаний индексов массивов и выбора полей в списке целевых столбцов команды <command>INSERT</command> с несколькими строками <literal>VALUES</literal> (Том Лейн)

source: Previously, such cases failed if the same target column was mentioned more than once, e.g., <literal>INSERT INTO tab (x[1], x[2]) VALUES (...)</literal>.
ru: Ранее в таких ситуациях возникала ошибка, если один и тот же целевой столбец упоминался более одного раза, например так: <literal>INSERT INTO tab (x[1], x[2]) VALUES (...)</literal>.

source: When appropriate, postpone evaluation of <command>SELECT</command> output expressions until after an <literal>ORDER BY</literal> sort (Konstantin Knizhnik)
ru: Когда уместно, вычисление выходных выражений <command>SELECT</command> откладывается и производится после сортировки <literal>ORDER BY</literal> (Константин Книжник)

source: This change ensures that volatile or expensive functions in the output list are executed in the order suggested by <literal>ORDER BY</literal>, and that they are not evaluated more times than required when there is a <literal>LIMIT</literal> clause. Previously, these properties held if the ordering was performed by an index scan or pre-merge-join sort, but not if it was performed by a top-level sort.
ru: В результате этого изменения изменчивые или дорогостоящие функции в выходном списке выполняются в порядке, установленном предложением <literal>ORDER BY</literal>, и не будут вычисляться лишний раз, когда присутствует предложение <literal>LIMIT</literal>. Ранее эта оптимизация имела место, когда сортировка выполнялась при сканировании индекса или перед соединением слиянием, но не когда она производилась на верхнем уровне запроса.

source: Widen counters recording the number of tuples processed to 64 bits (Andreas Scherbaum)
ru: Расширение счётчиков, хранящих число обработанных кортежей, до 64 бит (Андреас Шербаум)

source: This change allows command tags, e.g. <command>SELECT</command>, to correctly report tuple counts larger than 4 billion. This also applies to PL/pgSQL's <command>GET DIAGNOSTICS ... ROW_COUNT</command> command.
ru: В результате этого изменения в метках команд, например <command>SELECT</command>, теперь будут корректно выдаваться количества кортежей, превышающие 4 миллиарда. Это также распространяется на команду <command>GET DIAGNOSTICS ... ROW_COUNT</command> в PL/pgSQL.

source: Avoid doing encoding conversions by converting through the <literal>MULE_INTERNAL</literal> encoding (Tom Lane)
ru: Уход от преобразования некоторых кодировок через кодировку <literal>MULE_INTERNAL</literal> (Том Лейн)

source: Previously, many conversions for Cyrillic and Central European single-byte encodings were done by converting to a related <literal>MULE_INTERNAL</literal> coding scheme and then to the destination encoding. Aside from being inefficient, this meant that when the conversion encountered an untranslatable character, the error message would confusingly complain about failure to convert to or from <literal>MULE_INTERNAL</literal>, rather than the user-visible encoding.
ru: Ранее преобразования кириллических и центральноевропейских однобайтовых кодировок зачастую выполнялись путём перевода в связанную схему <literal>MULE_INTERNAL</literal>, и только затем в целевую кодировку. Помимо того, что это неэффективно, это означает, что при обнаружении непереводимого символа будет выдано некорректное сообщение об ошибке преобразования в/из кодировки <literal>MULE_INTERNAL</literal>, а не кодировки, видимой пользователю.

source: Consider performing joins of foreign tables remotely only when the tables will be accessed under the same role ID (Shigeru Hanada, Ashutosh Bapat, Etsuro Fujita)
ru: Допускать удалённое соединение сторонних таблиц, только если к ним обращается одна и та же роль (Шигеру Ханада, Ашутош Бапат, Эцуро Фудзита)

source: Previously, the foreign join pushdown infrastructure left the question of security entirely up to individual foreign data wrappers, but that made it too easy for an <acronym>FDW</acronym> to inadvertently create subtle security holes. So, make it the core code's job to determine which role ID will access each table, and do not attempt join pushdown unless the role is the same for all relevant relations.
ru: Ранее инфраструктура вынесения соединений наружу доверяла заботу о безопасности целиком обёрткам сторонних данных, но при этом в обёртке слишком легко могли непреднамеренно образовываться неочевидные уязвимости. Поэтому решено было в коде ядра определять, какая роль обращается к каждой таблице, и пытаться выносить соединение наружу, только если это одна роль для всех задействованных отношений.

source: Utility Commands
ru: Служебные команды

source: Allow <command>COPY</command> to copy the output of an <literal>INSERT</literal>/<literal>UPDATE</literal>/<literal>DELETE</literal> ... <literal>RETURNING</literal> query (Marko Tiikkaja)
ru: Поддержка в <command>COPY</command> копирования вывода запроса <literal>INSERT</literal>/<literal>UPDATE</literal>/<literal>DELETE</literal> ... <literal>RETURNING</literal> (Марко Тииккая)

source: Previously, an intermediate <acronym>CTE</acronym> had to be written to get this result.
ru: Ранее для этого приходилось создавать промежуточные <acronym>CTE</acronym> (общие табличные выражения).

source: Introduce <command>ALTER <replaceable>object</replaceable> DEPENDS ON EXTENSION</command> (Abhijit Menon-Sen)
ru: Введение команды <command>ALTER <replaceable>объект</replaceable> DEPENDS ON EXTENSION</command> (Абхиджит Менон-Сен)

source: This command allows a database object to be marked as depending on an extension, so that it will be dropped automatically if the extension is dropped (without needing <literal>CASCADE</literal>). However, the object is not part of the extension, and thus will be dumped separately by <application>pg_dump</application>.
ru: Эта команда позволяет пометить объект базы данных как зависимый от расширения, чтобы он автоматически ликвидировался при удалении расширения (без явного указания <literal>CASCADE</literal>). Но при этом такой объект не будет частью расширения и поэтому <application>pg_dump</application> будет выгружать его отдельно.

source: Make <command>ALTER <replaceable>object</replaceable> SET SCHEMA</command> do nothing when the object is already in the requested schema, rather than throwing an error as it historically has for most object types (Marti Raudsepp)
ru: Команда <command>ALTER <replaceable>объект</replaceable> SET SCHEMA</command> теперь не будет делать ничего, если объект уже относится к заданной схеме, вместо того, чтобы выдавать ошибку, что имело место раньше для большинства типов объектов (Марти Раудсепп)

source: Add options to <command>ALTER OPERATOR</command> to allow changing the selectivity functions associated with an existing operator (Yury Zhuravlev)
ru: Добавление в <command>ALTER OPERATOR</command> параметров, позволяющих изменять функции оценки избирательности, связанные с существующим оператором (Юрий Журавлёв)

source: Add an <option>IF NOT EXISTS</option> option to <command>ALTER TABLE ADD COLUMN</command> (Fabr&iacute;zio de Royes Mello)
ru: Добавление указания <option>IF NOT EXISTS</option> в команду <command>ALTER TABLE ADD COLUMN</command> (Фабрицио де Ройес Мелло)

source: Reduce the lock strength needed by <command>ALTER TABLE</command> when setting fillfactor and autovacuum-related relation options (Fabr&iacute;zio de Royes Mello, Simon Riggs)
ru: Снижение уровня блокировок, запрашиваемых командой <command>ALTER TABLE</command> при установке фактора заполнения и параметров отношения, связанных с автоочисткой (Фабрицио де Ройес Мелло, Саймон Риггс)

source: Introduce <link linkend="sql-create-access-method"><command>CREATE ACCESS METHOD</command></link> to allow extensions to create index access methods (Alexander Korotkov, Petr Jel&iacute;nek)
ru: Введение команды <link linkend="sql-create-access-method"><command>CREATE ACCESS METHOD</command></link>, позволяющей расширениям создавать методы доступа индексов (Александр Коротков, Петр Желинек)

source: Add a <literal>CASCADE</literal> option to <command>CREATE EXTENSION</command> to automatically create any extensions the requested one depends on (Petr Jel&iacute;nek)
ru: Добавление указания <literal>CASCADE</literal> для команды <command>CREATE EXTENSION</command>, позволяющего автоматически устанавливать расширения, от которых зависит создаваемое (Петр Желинек)

source: Make <command>CREATE TABLE ... LIKE</command> include an <type>OID</type> column if any source table has one (Bruce Momjian)
ru: Команда <command>CREATE TABLE ... LIKE</command> должна включать столбец <type>OID</type>, если он есть в какой-либо из исходных таблиц (Брюс Момджян)

source: If a <literal>CHECK</literal> constraint is declared <literal>NOT VALID</literal> in a table creation command, automatically mark it as valid (Amit Langote, Amul Sul)
ru: Если ограничение <literal>CHECK</literal> объявлено как <literal>NOT VALID</literal> (непроверенное) в команде создания таблицы, оно должно автоматически помечаться как проверенное (Амит Ланготе, Амул Сул)

source: This is safe because the table has no existing rows. This matches the longstanding behavior of <literal>FOREIGN KEY</literal> constraints.
ru: Это безопасно, так как в таблице ещё нет строк, и соответствует давно принятому поведению ограничений <literal>FOREIGN KEY</literal>.

source: Fix <command>DROP OPERATOR</command> to clear <structname>pg_operator</structname>.<structfield>oprcom</structfield> and <structname>pg_operator</structname>.<structfield>oprnegate</structfield> links to the dropped operator (Roma Sokolov)
ru: Исправлена команда <command>DROP OPERATOR</command>; она должна очищать ссылки на удаляемый оператор <structname>pg_operator</structname>.<structfield>oprcom</structfield> и <structname>pg_operator</structname>.<structfield>oprnegate</structfield> (Рома Соколов)

source: Formerly such links were left as-is, which could pose a problem in the somewhat unlikely event that the dropped operator's <type>OID</type> was reused for another operator.
ru: Ранее эти ссылки оставлялись как есть, что было чревато проблемами в довольно маловероятных случаях повторного использования <type>OID</type> удалённого оператора другим оператором.

source: Do not show the same subplan twice in <command>EXPLAIN</command> output (Tom Lane)
ru: Один и тот же подплан не должен выдаваться дважды в выводе <command>EXPLAIN</command> (Том Лейн)

source: In certain cases, typically involving SubPlan nodes in index conditions, <command>EXPLAIN</command> would print data for the same subplan twice.
ru: В некоторых случаях, обычно с узлами SubPlan в условиях индексов, команда <command>EXPLAIN</command> выводила данные одного и того же подплана дважды.
