Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.6.po
Languages: ru

source: If necessary, vacuum can be forced to process all-frozen pages using the new <literal>DISABLE_PAGE_SKIPPING</literal> option. Normally this should never be needed, but it might help in recovering from visibility-map corruption.
ru: Если необходимо, при очистке можно принудительно включить обработку полностью замороженных страниц, передав нововведённый параметр <literal>DISABLE_PAGE_SKIPPING</literal>. Это никогда не нужно делать в обычных условиях, но при повреждении карты видимости это может быть полезно.

source: Avoid useless heap-truncation attempts during <command>VACUUM</command> (Jeff Janes, Tom Lane)
ru: Предупреждение бесполезных попыток усечения кучи в процессе <command>VACUUM</command> (Джефф Джейнс, Том Лейн)

source: This change avoids taking an exclusive table lock in some cases where no truncation is possible. The main benefit comes from avoiding unnecessary query cancellations on standby servers.
ru: Это изменение предотвращает исключительную блокировку таблицы в некоторых случаях, когда усечение таблицы невозможно. Прежде всего это полезно тем, что позволяет лишний раз не отменять запросы на резервных серверах.

source: General Performance
ru: Общая производительность

source: Allow old <acronym>MVCC</acronym> snapshots to be invalidated after a configurable timeout (Kevin Grittner)
ru: Возможность аннулирования старых снимков <acronym>MVCC</acronym> после настраиваемого промежутка времени (Кевин Гриттнер)

source: Normally, deleted tuples cannot be physically removed by vacuuming until the last transaction that could <quote>see</quote> them is gone. A transaction that stays open for a long time can thus cause considerable table bloat because space cannot be recycled. This feature allows setting a time-based limit, via the new configuration parameter <xref linkend="guc-old-snapshot-threshold"/>, on how long an <acronym>MVCC</acronym> snapshot is guaranteed to be valid. After that, dead tuples are candidates for removal. A transaction using an outdated snapshot will get an error if it attempts to read a page that potentially could have contained such data.
ru: Обычно удалённые кортежи не могут быть ликвидированы физически при очистке, пока не будет отработана последняя транзакция, в которой они могут быть видны. Транзакция, остающаяся открытой в течение долгого времени, таким образом может стать причиной значительного замусоривания таблицы, препятствуя освобождению места. Это средство позволяет задать с помощью нового конфигурационного параметра <xref linkend="guc-old-snapshot-threshold"/> ограничение времени, в течение которого снимок <acronym>MVCC</acronym> будет гарантированно актуальным. По истечении этого времени мёртвые кортежи могут быть удалены. Транзакция, использующая просроченный снимок, получит ошибку, если она попытается прочитать страницу, которая могла бы содержать такие данные.

source: Ignore <literal>GROUP BY</literal> columns that are functionally dependent on other columns (David Rowley)
ru: Игнорирование в <literal>GROUP BY</literal> столбцов, функционально зависящих от других (Дэвид Роули)

source: If a <literal>GROUP BY</literal> clause includes all columns of a non-deferred primary key, as well as other columns of the same table, those other columns are redundant and can be dropped from the grouping. This saves computation in many common cases.
ru: Если в предложение <literal>GROUP BY</literal> включаются все столбцы неотложенного первичного ключа, а также другие столбцы той же таблицы, последние столбцы являются избыточными и могут быть исключены из группировки. Во многих распространённых случаях это упрощает вычисления.

source: Allow use of an <link linkend="indexes-index-only-scans">index-only scan</link> on a partial index when the index's <literal>WHERE</literal> clause references columns that are not indexed (Tomas Vondra, Kyotaro Horiguchi)
ru: Возможность использования <link linkend="indexes-index-only-scans">сканирования только индекса</link> с частичным индексом, когда предложение <literal>WHERE</literal> индекса обращается к не индексированным столбцам (Томас Вондра, Киотаро Хоригучи)

source: For example, an index defined by <command>CREATE INDEX tidx_partial ON t(b) WHERE a &gt; 0</command> can now be used for an index-only scan by a query that specifies <literal>WHERE a &gt; 0</literal> and does not otherwise use <literal>a</literal>. Previously this was disallowed because <literal>a</literal> is not listed as an index column.
ru: Например, индекс, определённый командой <command>CREATE INDEX tidx_partial ON t(b) WHERE a &gt; 0</command>, теперь может использоваться для сканирования только по индексу в запросе, в котором задаётся условие <literal>WHERE a &gt; 0</literal> и никак больше не задействуется <literal>a</literal>. Ранее это использование не допускалось, на основании того, что <literal>a</literal> не входит в число столбцов индекса.

source: Perform checkpoint writes in sorted order (Fabien Coelho, Andres Freund)
ru: Выполнение записи в контрольных точках упорядоченным образом (Фабьен Коэльо, Андрес Фройнд)

source: Previously, checkpoints wrote out dirty pages in whatever order they happen to appear in shared buffers, which usually is nearly random. That performs poorly, especially on rotating media. This change causes checkpoint-driven writes to be done in order by file and block number, and to be balanced across tablespaces.
ru: Ранее, в контрольных точках грязные страницы записывались в том порядке, в каком они располагались в общих буферах, то есть практически в случайном. Это влекло снижение производительности, особенно на вращающихся носителях. В результате данного изменения запись в контрольных точках будет производиться по порядку файлов и номеров блоков, и будет сбалансирована по табличным пространствам.

source: Where feasible, trigger kernel writeback after a configurable number of writes, to prevent accumulation of dirty data in kernel disk buffers (Fabien Coelho, Andres Freund)
ru: Там, где возможно, вызывать функцию отложенной записи в ядре после некоторого количества операций записи, во избежание накопления &laquo;грязных&raquo; данных в дисковых буферах ядра (Фабьен Коэльо, Андрес Фройнд)

source: <productname>PostgreSQL</productname> writes data to the kernel's disk cache, from where it will be flushed to physical storage in due time. Many operating systems are not smart about managing this and allow large amounts of dirty data to accumulate before deciding to flush it all at once, causing long delays for new I/O requests until the flushing finishes. This change attempts to alleviate this problem by explicitly requesting data flushes after a configurable interval.
ru: <productname>PostgreSQL</productname> записывает данные в дисковый кеш ядра, откуда они будут сброшены в физическое хранилище в нужное время. Многие операционные системы не очень эффективно управляют этим, позволяя накапливаться в памяти большим объёмам данным, которые затем приходится сбрасывать на диск одномоментно, что приводит к большим задержкам при очередных операциях ввода/вывода до завершения сброса. Это изменение внесено, чтобы снять эту проблему, явно запрашивая сброс данных через определённый настраиваемый интервал.

source: On Linux, <function>sync_file_range()</function> is used for this purpose, and the feature is on by default on Linux because that function has few downsides. This flushing capability is also available on other platforms if they have <function>msync()</function> or <function>posix_fadvise()</function>, but those interfaces have some undesirable side-effects so the feature is disabled by default on non-Linux platforms.
ru: В Linux для этой цели применяется функция <function>sync_file_range()</function>, и так как она практически безвредна, этот механизм задействуется в Linux по умолчанию. Возможность сброса буфера доступна и на других платформах, где имеется функция <function>msync()</function> или <function>posix_fadvise()</function>, но эти функции дают некоторые нежелательные побочные эффекты, поэтому на всех платформах кроме Linux данный механизм по умолчанию отключён.

source: The new configuration parameters <xref linkend="guc-backend-flush-after"/>, <xref linkend="guc-bgwriter-flush-after"/>, <xref linkend="guc-checkpoint-flush-after"/>, and <xref linkend="guc-wal-writer-flush-after"/> control this behavior.
ru: Этим поведением управляют новые конфигурационные параметры <xref linkend="guc-backend-flush-after"/>, <xref linkend="guc-bgwriter-flush-after"/>, <xref linkend="guc-checkpoint-flush-after"/> и <xref linkend="guc-wal-writer-flush-after"/>.

source: Improve aggregate-function performance by sharing calculations across multiple aggregates if they have the same arguments and transition functions (David Rowley)
ru: Увеличение производительности агрегатных функций в результате разделения вычислений между несколькими агрегатами, если они имеют одинаковые аргументы и функции перехода (Дэвид Роули)

source: For example, <command>SELECT AVG(x), VARIANCE(x) FROM tab</command> can use a single per-row computation for both aggregates.
ru: Например, в запросе <command>SELECT AVG(x), VARIANCE(x) FROM tab</command> для строки может быть достаточно одной операции для вычисления обоих агрегатов.

source: Speed up visibility tests for recently-created tuples by checking the current transaction's snapshot, not <structname>pg_clog</structname>, to decide if the source transaction should be considered committed (Jeff Janes, Tom Lane)
ru: Ускорение проверок видимости для недавно созданных кортежей путём проверки снимка текущей транзакции, вместо <structname>pg_clog</structname>, для определения, должна ли исходная транзакция считаться зафиксированной (Джефф Джейнс, Том Лейн)

source: Allow tuple hint bits to be set sooner than before (Andres Freund)
ru: Допущение установки вспомогательных битов кортежей на более раннем этапе (Андрес Фройнд)

source: Improve performance of short-lived prepared transactions (Stas Kelvich, Simon Riggs, Pavan Deolasee)
ru: Увеличение производительности подготовленных транзакций с коротким временем жизни (Стас Кельвич, Саймон Риггс, Паван Деоласи)

source: Two-phase commit information is now written only to <acronym>WAL</acronym> during <command>PREPARE TRANSACTION</command>, and will be read back from <acronym>WAL</acronym> during <command>COMMIT PREPARED</command> if that happens soon thereafter. A separate state file is created only if the pending transaction does not get committed or aborted by the time of the next checkpoint.
ru: Информация о двухфазной фиксации теперь записывается только в <acronym>WAL</acronym> во время <command>PREPARE TRANSACTION</command> и считывается назад из <acronym>WAL</acronym> во время <command>COMMIT PREPARED</command>, если это имеет место вскоре. Отдельный файл состояния создаётся, только если ожидающая транзакция не фиксируется и не прерывается к моменту следующей контрольной точки.

source: Improve performance of memory context destruction (Jan Wieck)
ru: Увеличение скорости уничтожения контекста памяти (Ян Вик)

source: Improve performance of resource owners with many tracked objects (Aleksander Alekseev)
ru: Увеличение производительности владельцев ресурсов с большим количеством отслеживаемых объектов (Александр Алексеев)

source: Improve speed of the output functions for <type>timestamp</type>, <type>time</type>, and <type>date</type> data types (David Rowley, Andres Freund)
ru: Увеличение скорости функций вывода типов <type>timestamp</type>, <type>time</type> и <type>date</type> (Дэвид Роули, Андрес Фройнд)

source: Avoid some unnecessary cancellations of hot-standby queries during replay of actions that take <literal>AccessExclusive</literal> locks (Jeff Janes)
ru: Недопущение некоторых излишних отмен запросов на серверах горячего резерва при воспроизведении действий, требующих блокировок <literal>AccessExclusive</literal> (Джефф Джейнс)

source: Extend relations multiple blocks at a time when there is contention for the relation's extension lock (Dilip Kumar)
ru: Расширение отношений на несколько блоков сразу при конкуренции за блокировку расширения отношения (Дилип Кумар)

source: This improves scalability by decreasing contention.
ru: Это улучшает масштабируемость и снижает уровень конфликтов.

source: Increase the number of clog buffers for better scalability (Amit Kapila, Andres Freund)
ru: Увеличение числа буферов clog для лучшей масштабируемости (Амит Капила, Андрес Фройнд)

source: Speed up expression evaluation in <application>PL/pgSQL</application> by keeping <literal>ParamListInfo</literal> entries for simple variables valid at all times (Tom Lane)
ru: Ускорение вычисления выражений в <application>PL/pgSQL</application> за счёт постоянного хранения в памяти записей <literal>ParamListInfo</literal> для простых переменных (Том Лейн)

source: Avoid reducing the <literal>SO_SNDBUF</literal> setting below its default on recent Windows versions (Chen Huajun)
ru: Недопущение уменьшения значения <literal>SO_SNDBUF</literal> ниже значения по умолчанию в последних версиях Windows (Чен Хуацзюнь)

source: Disable <xref linkend="guc-update-process-title"/> by default on Windows (Takayuki Tsunakawa)
ru: Отключение механизма <xref linkend="guc-update-process-title"/> по умолчанию в Windows (Такаюки Цунакава)

source: The overhead of updating the process title is much larger on Windows than most other platforms, and it is also less useful to do it since most Windows users do not have tools that can display process titles.
ru: В Windows издержки изменения заголовка процесса гораздо выше, чем на многих других платформах, и само это изменение менее полезно, так как большинство пользователей Windows не имеют утилит для наблюдения за заголовками процессов.

source: Monitoring
ru: Наблюдение

source: Add <link linkend="pg-stat-progress-vacuum-view"><structname>pg_stat_progress_vacuum</structname></link> system view to provide progress reporting for <command>VACUUM</command> operations (Amit Langote, Robert Haas, Vinayak Pokale, Rahila Syed)
ru: Добавление системного представления <link linkend="pg-stat-progress-vacuum-view"><structname>pg_stat_progress_vacuum</structname></link> для наблюдения за процессом выполнения операций <command>VACUUM</command> (Амит Ланготе, Роберт Хаас, Винаяк Покале, Рахила Сьед)

source: Add <link linkend="functions-controldata"><function>pg_control_system()</function></link>, <function>pg_control_checkpoint()</function>, <function>pg_control_recovery()</function>, and <function>pg_control_init()</function> functions to expose fields of <filename>pg_control</filename> to <acronym>SQL</acronym> (Joe Conway, Michael Paquier)
ru: Добавление функций <link linkend="functions-controldata"><function>pg_control_system()</function></link>, <function>pg_control_checkpoint()</function>, <function>pg_control_recovery()</function> и <function>pg_control_init()</function>, выдающих поля <filename>pg_control</filename> в <acronym>SQL</acronym> (Джо Конвей, Мишель Пакье)

source: Add <link linkend="view-pg-config"><structname>pg_config</structname></link> system view (Joe Conway)
ru: Добавление системного представления <link linkend="view-pg-config"><structname>pg_config</structname></link> (Джо Конвей)

source: This view exposes the same information available from the <application>pg_config</application> command-line utility, namely assorted compile-time configuration information for <productname>PostgreSQL</productname>.
ru: В этом представлении выводится та же информация, что выдаётся утилитой командной строки <application>pg_config</application>, а именно разнообразные конфигурационные параметры времени компиляции <productname>PostgreSQL</productname>.

source: Add a <structfield>confirmed_flush_lsn</structfield> column to the <link linkend="view-pg-replication-slots"><structname>pg_replication_slots</structname></link> system view (Marko Tiikkaja)
ru: Добавление столбца <structfield>confirmed_flush_lsn</structfield> в системное представление <link linkend="view-pg-replication-slots"><structname>pg_replication_slots</structname></link> (Марко Тииккая)

source: Add <link linkend="pg-stat-wal-receiver-view"><structname>pg_stat_wal_receiver</structname></link> system view to provide information about the state of a hot-standby server's <acronym>WAL</acronym> receiver process (Michael Paquier)
ru: Добавление системного представления <link linkend="pg-stat-wal-receiver-view"><structname>pg_stat_wal_receiver</structname></link> с информацией о состоянии процесса приёмника <acronym>WAL</acronym> на сервере горячего резерва (Мишель Пакье)

source: Add <link linkend="functions-info-session-table"><function>pg_blocking_pids()</function></link> function to reliably identify which sessions block which others (Tom Lane)
ru: Добавление функции <link linkend="functions-info-session-table"><function>pg_blocking_pids()</function></link> для надёжного определения, какие сеансы блокируют какие (Том Лейн)

source: This function returns an array of the process IDs of any sessions that are blocking the session with the given process ID. Historically users have obtained such information using a self-join on the <structname>pg_locks</structname> view. However, it is unreasonably tedious to do it that way with any modicum of correctness, and the addition of parallel queries has made the old approach entirely impractical, since locks might be held or awaited by child worker processes rather than the session's main process.
ru: Эта функция возвращает массив идентификаторов процессов всех сеансов, которые блокируют сеанс с заданным идентификатором. Ранее пользователи получали такую информацию, образуя замкнутое соединение с представлением <structname>pg_locks</structname>. Однако сделать это сколь-нибудь корректно слишком сложно, а с внедрением параллельных запросов старый подход стал полностью непрактичным, так как блокировки могут удерживаться или запрашиваться дочерними рабочими процессами, а не главным обслуживающим процессом сеанса.

source: Add function <link linkend="functions-admin-backup-table"><function>pg_current_xlog_flush_location()</function></link> to expose the current transaction log flush location (Tomas Vondra)
ru: Добавление функции <link linkend="functions-admin-backup-table"><function>pg_current_xlog_flush_location()</function></link> для вывода текущей позиции сброшенной записи в журнале транзакции (Томас Вондра)

source: Add function <link linkend="functions-info-session-table"><function>pg_notification_queue_usage()</function></link> to report how full the <command>NOTIFY</command> queue is (Brendan Jurd)
ru: Добавление функции <link linkend="functions-info-session-table"><function>pg_notification_queue_usage()</function></link>, показывающей, насколько заполнена очередь <command>NOTIFY</command> (Брендан Юрд)

source: Limit the verbosity of memory context statistics dumps (Tom Lane)
ru: Ограничение подробностей при выводе статистики использования контекстов памяти (Том Лейн)

source: The memory usage dump that is output to the postmaster log during an out-of-memory failure now summarizes statistics when there are a large number of memory contexts, rather than possibly generating a very large report. There is also a <quote>grand total</quote> summary line now.
ru: Информация об использовании памяти, выводимая в протокол главного сервера при нехватке памяти, теперь включает итоговую статистику при большом числе контекстов памяти, вместо одного объёмного отчёта. Также в неё теперь входит итоговая строка <quote>Всего</quote>.

source: Authentication
ru: Аутентификация

source: Add a <link linkend="auth-bsd"><acronym>BSD</acronym> authentication method</link> to allow use of the <systemitem class="osname">BSD</systemitem> Authentication service for <productname>PostgreSQL</productname> client authentication (Marisa Emerson)
ru: Добавление <link linkend="auth-bsd">метода аутентификации <acronym>BSD</acronym></link>, позволяющего использовать для проверки подлинности клиентов <productname>PostgreSQL</productname> системную службу аутентификации <systemitem class="osname">BSD</systemitem> (Мариса Емерсон)

source: BSD Authentication is currently only available on <systemitem class="osname">OpenBSD</systemitem>.
ru: Аутентификация BSD в настоящее время поддерживается только в <systemitem class="osname">OpenBSD</systemitem>.

source: When using <link linkend="auth-pam"><acronym>PAM</acronym> authentication</link>, provide the client IP address or host name to <acronym>PAM</acronym> modules via the <literal>PAM_RHOST</literal> item (Grzegorz Sampolski)
ru: Когда используется <link linkend="auth-pam">аутентификация <acronym>PAM</acronym></link>, через поле <literal>PAM_RHOST</literal> модулям <acronym>PAM</acronym> может выдаваться IP-адрес или имя компьютера клиента (Гжегож Сампольски)

source: Provide detail in the postmaster log for more types of password authentication failure (Tom Lane)
ru: Добавление вывода в протокол сервера сообщений о дополнительных типах ошибок при проверке пароля (Том Лейн)

source: All ordinarily-reachable password authentication failure cases should now provide specific <literal>DETAIL</literal> fields in the log.
ru: Теперь в случае любых ошибок, которые обычно могут возникать, в протокол должны выдаваться сообщения уровня <literal>ПОДРОБНО</literal>.

source: Support <link linkend="auth-radius"><acronym>RADIUS</acronym> passwords</link> up to 128 characters long (Marko Tiikkaja)
ru: Поддержка <link linkend="auth-radius">паролей <acronym>RADIUS</acronym></link> длиной до 128 символов (Марко Тииккая)

source: Add new <link linkend="sspi-auth"><acronym>SSPI</acronym> authentication</link> parameters <varname>compat_realm</varname> and <varname>upn_username</varname> to control whether <productname>NetBIOS</productname> or <productname>Kerberos</productname> realm names and user names are used during <acronym>SSPI</acronym> authentication (Christian Ullrich)
ru: Добавление новых параметров <link linkend="sspi-auth">аутентификации <acronym>SSPI</acronym></link> <varname>compat_realm</varname> и <varname>upn_username</varname>, позволяющих выбрать, как при проверке подлинности <acronym>SSPI</acronym> будут использоваться имена области и пользователя (<productname>NetBIOS</productname> или <productname>Kerberos</productname>) (Кристиан Ульрих)

source: Server Configuration
ru: Настройка сервера

source: Allow sessions to be terminated automatically if they are in idle-in-transaction state for too long (Vik Fearing)
ru: Возможность автоматического завершения сеансов, которые находятся в состоянии простоя в транзакции слишком долго (Вик Фиринг)

source: This behavior is controlled by the new configuration parameter <xref linkend="guc-idle-in-transaction-session-timeout"/>. It can be useful to prevent forgotten transactions from holding locks or preventing vacuum cleanup for too long.
ru: Данное поведение настраивается новым конфигурационным параметром <xref linkend="guc-idle-in-transaction-session-timeout"/>. Это помогает бороться с забытыми транзакциями, которые могут удерживать блокировки или мешать производить очистку в течение длительного времени.

source: Raise the maximum allowed value of <xref linkend="guc-checkpoint-timeout"/> to 24 hours (Simon Riggs)
ru: Увеличение максимально допустимого значения <xref linkend="guc-checkpoint-timeout"/> до 24 часов (Саймон Риггс)

source: Allow <varname>effective_io_concurrency</varname> to be set per-tablespace to support cases where different tablespaces have different I/O characteristics (Julien Rouhaud)
ru: Возможность устанавливать <varname>effective_io_concurrency</varname> для табличного пространства; это полезно в случаях, когда различные табличные пространства имеют разные характеристики ввода/вывода (Жульен Рохо)
