Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.6.po
Languages: ru

source: Previously the command would fail if the new options were inconsistent with the old view definition.
ru: Ранее в команде происходил сбой, если новые параметры оказывались несогласованными со старым определением представления.

source: Report correct object identity during <command>ALTER TEXT SEARCH CONFIGURATION</command> (Artur Zakirov)
ru: Получение правильного идентификатора объекта в <command>ALTER TEXT SEARCH CONFIGURATION</command> (Артур Закиров)

source: The wrong catalog OID was reported to extensions such as logical decoding.
ru: Ранее расширениям, таким как модули логического декодирования, выдавался неправильный OID каталога.

source: Fix commit timestamp mechanism to not fail when queried about the special XIDs <literal>FrozenTransactionId</literal> and <literal>BootstrapTransactionId</literal> (Craig Ringer)
ru: Предупреждение сбоев механизма учёта времени транзакций при запросе особых XID (<literal>FrozenTransactionId</literal> и <literal>BootstrapTransactionId</literal>) (Крейг Рингер)

source: Fix incorrect use of view reloptions as regular table reloptions (Tom Lane)
ru: Исправление некорректного использования reloptions представлений как reloptions обычных таблиц (Том Лейн)

source: The symptom was spurious <quote>ON CONFLICT is not supported on table ... used as a catalog table</quote> errors when the target of <command>INSERT ... ON CONFLICT</command> is a view with cascade option.
ru: Симптомами ошибки были неуместные сообщения <quote>ON CONFLICT не поддерживается для таблицы ..., служащей таблицей каталога</quote> когда целевым отношением <command>INSERT ... ON CONFLICT</command> было представление с каскадной проверкой.

source: Fix incorrect <quote>target lists can have at most <replaceable>N</replaceable> entries</quote> complaint when using <literal>ON CONFLICT</literal> with wide tables (Tom Lane)
ru: Исправление некорректного сообщения <quote>допустимое число элементов в целевом списке ограничено <replaceable>N</replaceable></quote> при использовании <literal>ON CONFLICT</literal> с широкими таблицами (Том Лейн)

source: Fix spurious <quote>query provides a value for a dropped column</quote> errors during <command>INSERT</command> or <command>UPDATE</command> on a table with a dropped column (Tom Lane)
ru: Устранение ошибок с ложными сообщениями <quote>в запросе обнаружены данные для удалённого столбца</quote> при выполнении <command>INSERT</command> или <command>UPDATE</command> в таблице с удалённым столбцом (Том Лейн)

source: Prevent multicolumn expansion of <replaceable>foo</replaceable><literal>.*</literal> in an <command>UPDATE</command> source expression (Tom Lane)
ru: Предотвращение разворачивания <replaceable>foo</replaceable><literal>.*</literal> в набор столбцов в исходном выражении <command>UPDATE</command> (Том Лейн)

source: This led to <quote>UPDATE target count mismatch --- internal error</quote>. Now the syntax is understood as a whole-row variable, as it would be in other contexts.
ru: Это приводило к ошибкам с сообщением <quote>несоответствие целевого количества в UPDATE --- внутренняя ошибка</quote>. Теперь эта запись воспринимается как обозначение переменной «вся-строка», как и в других контекстах.

source: Ensure that column typmods are determined accurately for multi-row <literal>VALUES</literal> constructs (Tom Lane)
ru: Обеспечение точного определения модификаторов типа столбцов в конструкциях <literal>VALUES</literal> с несколькими строками (Том Лейн)

source: This fixes problems occurring when the first value in a column has a determinable typmod (e.g., length for a <type>varchar</type> value) but later values don't share the same limit.
ru: Это устраняет проблемы, возникавшие, когда первое значение в столбце имеет воспринимаемый модификатор типа (например, длину значения <type>varchar</type>), но последующие значения не разделяют его ограничение.

source: Throw error for an unfinished Unicode surrogate pair at the end of a Unicode string (Tom Lane)
ru: При нахождении незаконченной суррогатной пары Unicode в конце строки символов Unicode должна выдаваться ошибка (Том Лейн)

source: Normally, a Unicode surrogate leading character must be followed by a Unicode surrogate trailing character, but the check for this was missed if the leading character was the last character in a Unicode string literal (<literal>U&amp;'...'</literal>) or Unicode identifier (<literal>U&amp;"..."</literal>).
ru: Обычно за начальным суррогатным символом Unicode должно следовать продолжение, но это не проверялось когда такой начальный символ оказывался последним в строке символов Unicode (<literal>U&amp;'...'</literal>) или в Unicode-идентификаторе (<literal>U&amp;"..."</literal>).

source: Fix execution of <literal>DISTINCT</literal> and ordered aggregates when multiple such aggregates are able to share the same transition state (Heikki Linnakangas)
ru: Корректировка выполнения агрегатов с <literal>DISTINCT</literal> и упорядочиванием, когда несколько таких агрегатов могут разделять одно состояние перехода (Хейкки Линнакангас)

source: Fix implementation of phrase search operators in <type>tsquery</type> (Tom Lane)
ru: Исправление реализации операторов поиска фраз в <type>tsquery</type> (Том Лейн)

source: Remove incorrect, and inconsistently-applied, rewrite rules that tried to transform away AND/OR/NOT operators appearing below a PHRASE operator; instead upgrade the execution engine to handle such cases correctly. This fixes assorted strange behavior and possible crashes for text search queries containing such combinations. Also fix nested PHRASE operators to work sanely in combinations other than simple left-deep trees, correct the behavior when removing stopwords from a phrase search clause, and make sure that index searches behave consistently with simple sequential-scan application of such queries.
ru: Ликвидация некорректных и применяемых несогласованно правил перезаписи, которые пытались оптимизировать операторы И/ИЛИ/НЕ внутри оператора поиска фразы; вместо этого обработка таких выражений была добавлена в сам исполнитель. В результате устранены разнообразные странности в поведении и возможные сбои в запросах полнотекстового поиска, содержащих такие выражения. Также реализовано разумное поведение вложенных операторов поиска фраз не только с простыми деревьями, растущими влево; исправлено поведение при удалении стоп-слов из предложения поиска фразы; обеспечена согласованность поиска по индексу и простого выполнения этих запросов с последовательным сканированием.

source: Ensure that a purely negative text search query, such as <literal>!foo</literal>, matches empty <type>tsvector</type>s (Tom Dunstan)
ru: Определённо отрицательному поисковому запросу, например, <literal>!foo</literal>, должны удовлетворять пустые значения <type>tsvector</type> (Том Дунстан)

source: Such matches were found by GIN index searches, but not by sequential scans or GiST index searches.
ru: Такие соответствия находились при поиске по индексу GIN, но не при последовательном сканировании или поиске по индексу GiST.

source: Prevent crash when <function>ts_rewrite()</function> replaces a non-top-level subtree with an empty query (Artur Zakirov)
ru: Предотвращение сбоя в ситуации, когда <function>ts_rewrite()</function> заменяет поддерево не верхнего уровня пустым запросом (Артур Закиров)

source: Fix performance problems in <function>ts_rewrite()</function> (Tom Lane)
ru: Устранение проблем с производительностью в <function>ts_rewrite()</function> (Том Лейн)

source: Fix <function>ts_rewrite()</function>'s handling of nested NOT operators (Tom Lane)
ru: Исправление обработки в <function>ts_rewrite()</function> вложенных операторов NOT (Том Лейн)

source: Improve speed of user-defined aggregates that use <function>array_append()</function> as transition function (Tom Lane)
ru: Увеличение скорости пользовательских агрегатов, использующих в качестве перехода функцию <function>array_append()</function> (Том Лейн)

source: Fix <function>array_fill()</function> to handle empty arrays properly (Tom Lane)
ru: Исправление <function>array_fill()</function> для корректной обработки пустых массивов (Том Лейн)

source: Fix possible crash in <function>array_position()</function> or <function>array_positions()</function> when processing arrays of records (Junseok Yang)
ru: Предупреждение возможных сбоев в функциях <function>array_position()</function> и <function>array_positions()</function> при обработке массивов записей (Джун-сок Янг)

source: Fix one-byte buffer overrun in <function>quote_literal_cstr()</function> (Heikki Linnakangas)
ru: Устранение выхода на один байт за границу буфера в функции <function>quote_literal_cstr()</function> (Хейкки Линнакангас)

source: The overrun occurred only if the input consisted entirely of single quotes and/or backslashes.
ru: Этот выход имел место только если входная строка содержала исключительно апострофы и/или обратные косые черты.

source: Prevent multiple calls of <function>pg_start_backup()</function> and <function>pg_stop_backup()</function> from running concurrently (Michael Paquier)
ru: Предотвращение одновременного выполнения вызовов <function>pg_start_backup()</function> и <function>pg_stop_backup()</function> (Мишель Пакье)

source: This avoids an assertion failure, and possibly worse things, if someone tries to run these functions in parallel.
ru: Это предупреждает сбой проверки истинности и, вероятно, худшие последствия, в случае, если кто-то попытается запустить эти функции параллельно.

source: Disable transform that attempted to remove no-op <literal>AT TIME ZONE</literal> conversions (Tom Lane)
ru: Отключение трансформации, которая пыталась оптимизировать бесполезные преобразования <literal>AT TIME ZONE</literal> (Том Лейн)

source: This resulted in wrong answers when the simplified expression was used in an index condition.
ru: Вследствие этого выдавались неверные результаты, когда упрощённое выражение использовалось в условии индекса.

source: Avoid discarding <type>interval</type>-to-<type>interval</type> casts that aren't really no-ops (Tom Lane)
ru: Сохранение приведений <type>interval</type>-в-<type>interval</type>, которые на самом деле несут смысловую нагрузку (Том Лейн)

source: In some cases, a cast that should result in zeroing out low-order <type>interval</type> fields was mistakenly deemed to be a no-op and discarded. An example is that casting from <type>INTERVAL MONTH</type> to <type>INTERVAL YEAR</type> failed to clear the months field.
ru: В некоторых случаях приведения, которые должны были обнулять младшие поля значений <type>interval</type>, ошибочно считались бессмысленными и просто убирались. В результате, например, при приведении значения типа <type>INTERVAL MONTH</type> к <type>INTERVAL YEAR</type> поле месяцев не обнулялось.

source: Fix crash if the number of workers available to a parallel query decreases during a rescan (Andreas Seltenreich)
ru: Устранения сбоя в ситуациях, когда число рабочих процессов, доступных для параллельных запросов, уменьшалось при повторном сканировании (Андреас Сельтенрейх)

source: Fix bugs in transmitting GUC parameter values to parallel workers (Michael Paquier, Tom Lane)
ru: Исправление ошибок при передаче значений параметров GUC параллельным исполнителям (Мишель Пакье, Том Лейн)

source: Allow statements prepared with <command>PREPARE</command> to be given parallel plans (Amit Kapila, Tobias Bussmann)
ru: Допущение возможности для операторов, подготовленных командой <command>PREPARE</command>, иметь параллельные планы (Амит Капила, Тобиас Бусман)

source: Fix incorrect generation of parallel plans for semi-joins (Tom Lane)
ru: Исправление некорректного построения параллельных планов для полусоединений (Том Лейн)

source: Fix planner's cardinality estimates for parallel joins (Robert Haas)
ru: Исправление оценок количества строк для параллельных соединений (Роберт Хаас)

source: Ensure that these estimates reflect the number of rows predicted to be seen by each worker, rather than the total.
ru: Эти оценки должны отражать количество строк, которое будет видеть отдельный рабочий процесс, а не общее их число.

source: Fix planner to avoid trying to parallelize plan nodes containing initplans or subplans (Tom Lane, Amit Kapila)
ru: Исправление планировщика, чтобы он не пытался распараллеливать узлы плана, содержащие вложенные и инициализирующие планы (Том Лейн, Амит Капила)

source: Ensure that cached plans are invalidated by changes in foreign-table options (Amit Langote, Etsuro Fujita, Ashutosh Bapat)
ru: Аннулирование кешированных планов при изменениях в параметрах сторонних таблиц (Амит Ланготе, Эцуро Фудзита, Ашутош Бапат)

source: Fix the plan generated for sorted partial aggregation with a constant <literal>GROUP BY</literal> clause (Tom Lane)
ru: Исправление плана, формируемого для частичного агрегирования с выражением <literal>GROUP BY</literal> с константой (Том Лейн)

source: Fix <quote>could not find plan for CTE</quote> planner error when dealing with a <literal>UNION ALL</literal> containing CTE references (Tom Lane)
ru: Исправление ошибки планировщика <quote>не удалось найти план для CTE</quote> при обработке конструкции <literal>UNION ALL</literal>, включающей CTE (Том Лейн)

source: Fix mishandling of initplans when forcibly adding a Material node to a subplan (Tom Lane)
ru: Исправление некорректной обработки инициализирующих планов при принудительном добавлении узла Material во вложенный план (Том Лейн)

source: The typical consequence of this mistake was a <quote>plan should not reference subplan's variable</quote> error.
ru: Типичным проявлением этого дефекта были ошибки <quote>в плане не должно быть обращения к переменной вложенного плана</quote>.

source: Fix foreign-key-based join selectivity estimation for semi-joins and anti-joins, as well as inheritance cases (Tom Lane)
ru: Исправление оценки избирательности соединения по внешнему ключу для полусоединений и антисоединений, а также в ситуациях с наследованием (Том Лейн)

source: The new code for taking the existence of a foreign key relationship into account did the wrong thing in these cases, making the estimates worse not better than the pre-9.6 code.
ru: Новый код, принимающий в рассмотрение связь по внешнему ключу, работал неправильно в этих случаях, и оценки оказывались хуже, а не лучше, чем в коде до 9.6.

source: Fix <application>pg_dump</application> to emit the data of a sequence that is marked as an extension configuration table (Michael Paquier)
ru: Исправление <application>pg_dump</application>, чтобы в выгрузку попадали данные последовательности, помеченной как конфигурационная таблица расширения (Мишель Пакье)

source: Fix mishandling of <command>ALTER DEFAULT PRIVILEGES ... REVOKE</command> in <application>pg_dump</application> (Stephen Frost)
ru: Корректировка неправильной обработки <command>ALTER DEFAULT PRIVILEGES ... REVOKE</command> в <application>pg_dump</application> (Стивен Фрост)

source: <application>pg_dump</application> missed issuing the required <literal>REVOKE</literal> commands in cases where <command>ALTER DEFAULT PRIVILEGES</command> had been used to reduce privileges to less than they would normally be.
ru: Программа <application>pg_dump</application> не выдавала требуемые команды <literal>REVOKE</literal> в случаях, когда с помощью <command>ALTER DEFAULT PRIVILEGES</command> некоторые права доступа исключались из начального набора.

source: Fix <application>pg_dump</application> to dump user-defined casts and transforms that use built-in functions (Stephen Frost)
ru: Исправление <application>pg_dump</application> для корректной выгрузки пользовательских приведений и преобразований, использующих встроенные функции (Стивен Фрост)

source: Fix <application>pg_restore</application> with <option>--create --if-exists</option> to behave more sanely if an archive contains unrecognized <command>DROP</command> commands (Tom Lane)
ru: Реализация более разумного поведения <application>pg_restore</application> с <option>--create --if-exists</option> в случаях, когда архив содержит нераспознанные команды <command>DROP</command> (Том Лейн)

source: This doesn't fix any live bug, but it may improve the behavior in future if <application>pg_restore</application> is used with an archive generated by a later <application>pg_dump</application> version.
ru: Это не устраняет никакую наблюдаемую ошибку, но может улучшить поведение в будущем, при использовании <application>pg_restore</application> с архивом, созданным предыдущей версией <application>pg_dump</application>.

source: Fix <application>pg_basebackup</application>'s rate limiting in the presence of slow I/O (Antonin Houska)
ru: Исправление ограничения нагрузки <application>pg_basebackup</application> при низкой скорости ввода/вывода (Антонин Хоуска)

source: If disk I/O was transiently much slower than the specified rate limit, the calculation overflowed, effectively disabling the rate limit for the rest of the run.
ru: Если скорость диска на время оказывалась ниже заданного ограничения, в вычислении происходило переполнение, и в результате ограничение отключалось до конца операции.

source: Fix <application>pg_basebackup</application>'s handling of symlinked <filename>pg_stat_tmp</filename> and <filename>pg_replslot</filename> subdirectories (Magnus Hagander, Michael Paquier)
ru: Обеспечение корректной работы <application>pg_basebackup</application> с подкаталогами <filename>pg_stat_tmp</filename> и <filename>pg_replslot</filename>, являющимися символическими ссылками (Магнус Хагандер, Мишель Пакье)

source: Fix possible <application>pg_basebackup</application> failure on standby server when including WAL files (Amit Kapila, Robert Haas)
ru: Предотвращение возможного сбоя <application>pg_basebackup</application> на резервном сервере при задействовании файлов WAL (Амит Капила, Роберт Хаас)

source: Improve <application>initdb</application> to insert the correct platform-specific default values for the <replaceable>xxx</replaceable><literal>_flush_after</literal> parameters into <filename>postgresql.conf</filename> (Fabien Coelho, Tom Lane)
ru: Усовершенствование <application>initdb</application>, чтобы в <filename>postgresql.conf</filename> вставлялись корректные для текущей платформы значения по умолчанию параметров <replaceable>xxx</replaceable><literal>_flush_after</literal> (Фабьен Коэльо, Том Лейн)

source: This is a cleaner way of documenting the default values than was used previously.
ru: Это позволило описать значения по умолчанию в документации более понятно, чем раньше.

source: Fix possible mishandling of expanded arrays in domain check constraints and <literal>CASE</literal> execution (Tom Lane)
ru: Исправление возможного дефекта при обработке развёрнутых массивов в ограничениях-проверках доменов и в конструкциях <literal>CASE</literal> (Том Лейн)

source: It was possible for a PL/pgSQL function invoked in these contexts to modify or even delete an array value that needs to be preserved for additional operations.
ru: Существовала вероятность, что функция PL/pgSQL, вызванная в этих контекстах, изменит или даже удалит значение массива, которое должно сохраняться для дополнительных операций.

source: Fix nested uses of PL/pgSQL functions in contexts such as domain check constraints evaluated during assignment to a PL/pgSQL variable (Tom Lane)
ru: Исправление рекурсивного вызова функций PL/pgSQL в таких контекстах, как проверки ограничений домена, выполняемые при присвоении значения переменной PL/pgSQL (Том Лейн)

source: Ensure that the Python exception objects we create for PL/Python are properly reference-counted (Rafa de la Torre, Tom Lane)
ru: Обеспечение правильного учёта объектов исключений Python, создаваемых нами для PL/Python, счётчиками использования (Рафа де ла Торре, Том Лейн)

source: This avoids failures if the objects are used after a Python garbage collection cycle has occurred.
ru: Это предотвращает ошибки, возникавшие при использовании объектов после цикла уборки мусора в Python.

source: Fix PL/Tcl to support triggers on tables that have <literal>.tupno</literal> as a column name (Tom Lane)
ru: Исправление в PL/Tcl поддержки триггеров для таблиц, в которых имеется столбец <literal>.tupno</literal> (Том Лейн)

source: This matches the (previously undocumented) behavior of PL/Tcl's <command>spi_exec</command> and <command>spi_execp</command> commands, namely that a magic <literal>.tupno</literal> column is inserted only if there isn't a real column named that.
ru: Это соответствует (ранее недокументированному) поведению команд PL/Tcl <command>spi_exec</command> и <command>spi_execp</command>, в том, что особый столбец <literal>.tupno</literal> добавляется, только если отсутствует настоящий с таким именем.

source: Allow DOS-style line endings in <filename>~/.pgpass</filename> files, even on Unix (Vik Fearing)
ru: В файлах <filename>~/.pgpass</filename> должны допускаться завершения строк в стиле DOS, даже на Unix-платформах (Вик Фиринг)

source: This change simplifies use of the same password file across Unix and Windows machines.
ru: Это изменение упрощает использование одних и тех же файлов паролей на машинах с Unix и Windows.

source: Fix one-byte buffer overrun if <application>ecpg</application> is given a file name that ends with a dot (Takayuki Tsunakawa)
ru: Устранение выхода на один байт за границу буфера, когда <application>ecpg</application> передаётся имя файла, которое заканчивается точкой (Такаюки Цунакава)

source: Fix incorrect error reporting for duplicate data in <application>psql</application>'s <command>\crosstabview</command> (Tom Lane)
ru: Исправление некорректных сообщений об ошибках при дублировании данных в <application>psql</application> <command>\crosstabview</command> (Том Лейн)

source: <application>psql</application> sometimes quoted the wrong row and/or column values when complaining about multiple entries for the same crosstab cell.
ru: <application>psql</application> иногда цитировал некорректное содержимое строки/столбца, выдавая сообщение о множественных значениях в одной ячейке перекрёстной таблицы.

source: Fix <application>psql</application>'s tab completion for <command>ALTER DEFAULT PRIVILEGES</command> (Gilles Darold, Stephen Frost)
ru: Исправление в <application>psql</application> дополнения табуляцией для команды <command>ALTER DEFAULT PRIVILEGES</command> (Жиль Даролд, Стивен Фрост)

source: Fix <application>psql</application>'s tab completion for <command>ALTER TABLE t ALTER c DROP ...</command> (Kyotaro Horiguchi)
ru: Исправление в <application>psql</application> дополнения табуляцией для <command>ALTER TABLE t ALTER c DROP ...</command> (Киотаро Хоригучи)

source: In <application>psql</application>, treat an empty or all-blank setting of the <envar>PAGER</envar> environment variable as meaning <quote>no pager</quote> (Tom Lane)
ru: В <application>psql</application> пустое или содержащее только пробелы значение переменной окружения <envar>PAGER</envar> должно означать <quote>без постраничника</quote> (Том Лейн)

source: Previously, such a setting caused output intended for the pager to vanish entirely.
ru: Ранее с таким значением вывод, предназначенный для постраничника, просто исчезал.

source: Improve <filename>contrib/dblink</filename>'s reporting of low-level <application>libpq</application> errors, such as out-of-memory (Joe Conway)
ru: Улучшение в <filename>contrib/dblink</filename> передачи сообщений о низкоуровневых ошибках <application>libpq</application>, например, о нехватке памяти (Джо Конвей)
