Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.5.po
Languages: ru

source: Allow more <link linkend="plpgsql"><application>PL/pgSQL</application></link> keywords to be used as identifiers (Tom Lane)
ru: Допущение использования в качестве идентификаторов большего количества ключевых слов <link linkend="plpgsql"><application>PL/pgSQL</application></link> (Том Лейн)

source: Client Applications
ru: Клиентские приложения

source: Move <link linkend="pgarchivecleanup"><application>pg_archivecleanup</application></link>, <link linkend="pgtestfsync"><application>pg_test_fsync</application></link>, <link linkend="pgtesttiming"><application>pg_test_timing</application></link>, and <link linkend="pgxlogdump"><application>pg_xlogdump</application></link> from <filename>contrib</filename> to <filename>src/bin</filename> (Peter Eisentraut)
ru: Перемещение <link linkend="pgarchivecleanup"><application>pg_archivecleanup</application></link>, <link linkend="pgtestfsync"><application>pg_test_fsync</application></link>, <link linkend="pgtesttiming"><application>pg_test_timing</application></link> и <link linkend="pgxlogdump"><application>pg_xlogdump</application></link> из <filename>contrib</filename> в <filename>src/bin</filename> (Питер Эйзентраут)

source: This should result in these programs being installed by default in most installations.
ru: В результате эти программы должны по умолчанию устанавливаться в большем числе инсталляций.

source: Add <link linkend="app-pgrewind"><application>pg_rewind</application></link>, which allows re-synchronizing a master server after failback (Heikki Linnakangas)
ru: Добавление программы <link linkend="app-pgrewind"><application>pg_rewind</application></link>, позволяющей восстановить синхронизированное состояние главного сервера после отработки отказа (Хейкки Линнакангас)

source: Allow <link linkend="app-pgreceivexlog"><application>pg_receivexlog</application></link> to manage physical replication slots (Michael Paquier)
ru: Возможность управления слотами физической репликации с помощью <link linkend="app-pgreceivexlog"><application>pg_receivexlog</application></link> (Мишель Пакье)

source: This is controlled via new <option>--create-slot</option> and <option>--drop-slot</option> options.
ru: Для этого введены новые параметры <option>--create-slot</option> и <option>--drop-slot</option>.

source: Allow <link linkend="app-pgreceivexlog"><application>pg_receivexlog</application></link> to synchronously flush <acronym>WAL</acronym> to storage using new <option>--synchronous</option> option (Furuya Osamu, Fujii Masao)
ru: В <link linkend="app-pgreceivexlog"><application>pg_receivexlog</application></link> появилась возможность синхронно сбрасывать <acronym>WAL</acronym> на диск с нововведённым параметром <option>--synchronous</option> (Фуруя Осаму, Фудзии Масао)

source: Without this, <acronym>WAL</acronym> files are fsync'ed only on close.
ru: Без него файлы <acronym>WAL</acronym> сохраняются на диске только при закрытии.

source: Allow <link linkend="app-vacuumdb"><application>vacuumdb</application></link> to vacuum in parallel using new <option>--jobs</option> option (Dilip Kumar)
ru: В <link linkend="app-vacuumdb"><application>vacuumdb</application></link> появилась возможность очистки в параллельном режиме с нововведённым параметром <option>--jobs</option> (Дилип Кумар)

source: In <link linkend="app-vacuumdb"><application>vacuumdb</application></link>, do not prompt for the same password repeatedly when multiple connections are necessary (Haribabu Kommi, Michael Paquier)
ru: Программа <link linkend="app-vacuumdb"><application>vacuumdb</application></link> теперь не запрашивает один и тот же пароль многократно, когда устанавливает несколько подключений (Харибабу Комми, Мишель Пакье)

source: Add <option>--verbose</option> option to <link linkend="app-reindexdb"><application>reindexdb</application></link> (Sawada Masahiko)
ru: Добавление ключа <option>--verbose</option> для <link linkend="app-reindexdb"><application>reindexdb</application></link> (Савада Масахико)

source: Make <link linkend="app-pgbasebackup"><application>pg_basebackup</application></link> use a tablespace mapping file when using <application>tar</application> format, to support symbolic links and file paths of 100+ characters in length on <systemitem class="osname">MS Windows</systemitem> (Amit Kapila)
ru: Использование в <link linkend="app-pgbasebackup"><application>pg_basebackup</application></link> файла отображений табличных пространств при выборе формата <application>tar</application>, что позволяет поддерживать символические ссылки и пути длиннее 100 символов в <systemitem class="osname">MS Windows</systemitem> (Амит Капила)

source: Add <link linkend="pgxlogdump"><application>pg_xlogdump</application></link> option <option>--stats</option> to display summary statistics (Abhijit Menon-Sen)
ru: Добавление в <link linkend="pgxlogdump"><application>pg_xlogdump</application></link> ключа <option>--stats</option> для получения сводной статистики (Абхиджит Менон-Сен)

source: Allow <application>psql</application> to produce AsciiDoc output (Szymon Guz)
ru: Возможность получить вывод <application>psql</application> в формате AsciiDoc (Шимон Гуз)

source: Add an <literal>errors</literal> mode that displays only failed commands to <application>psql</application>'s <varname>ECHO</varname> variable (Pavel Stehule)
ru: Добавление режима <literal>errors</literal> в переменной <varname>ECHO</varname>, в котором <application>psql</application> выводит только команды с ошибками (Павел Стехуле)

source: This behavior can also be selected with <application>psql</application>'s <option>-b</option> option.
ru: Этот режим также можно включить, передав <application>psql</application> ключ <option>-b</option>.

source: Provide separate column, header, and border linestyle control in <application>psql</application>'s unicode linestyle (Pavel Stehule)
ru: Разделение в <application>psql</application> параметров, управляющих стилем линий в Юникоде, на параметры для колонок, заголовка и границ (Павел Стехуле)

source: Single or double lines are supported; the default is <literal>single</literal>.
ru: Поддерживаются одинарные и двойные линии; вариант по умолчанию — <literal>single</literal> (одинарные).

source: Add new option <literal>%l</literal> in <application>psql</application>'s <link linkend="app-psql-variables"><envar>PROMPT</envar></link> variables to display the current multiline statement line number (Sawada Masahiko)
ru: Поддержка нового параметра <literal>%l</literal> в переменных окружения <link linkend="app-psql-variables"><envar>PROMPT</envar></link> в <application>psql</application>, позволяющего увидеть текущий номер строки в многострочном операторе (Савада Масахико)

source: Add <literal>\pset</literal> option <link linkend="app-psql-meta-commands"><varname>pager_min_lines</varname></link> to control pager invocation (Andrew Dunstan)
ru: Добавление в <literal>\pset</literal> параметра <link linkend="app-psql-meta-commands"><varname>pager_min_lines</varname></link>, управляющего вызовом постраничника (Эндрю Дунстан)

source: Improve <application>psql</application> line counting used when deciding to invoke the pager (Andrew Dunstan)
ru: Улучшение подсчёта строк в <application>psql</application>, по результатам которого принимается решения о вызове постраничника (Эндрю Дунстан)

source: <application>psql</application> now fails if the file specified by an <option>--output</option> or <option>--log-file</option> switch cannot be written (Tom Lane, Daniel V&eacute;rit&eacute;)
ru: Теперь <application>psql</application> не запускается, если не может записать в файл, заданный ключом <option>--output</option> или <option>--log-file</option> (Том Лейн, Даниэль Верите)

source: Previously, it effectively ignored the switch in such cases.
ru: Ранее <application>psql</application> по сути игнорировал этот ключ в таких случаях.

source: Add <application>psql</application> tab completion when setting the <xref linkend="guc-search-path"/> variable (Jeff Janes)
ru: Добавление в <application>psql</application> дополнения табуляцией, когда устанавливается переменная <xref linkend="guc-search-path"/> (Джефф Джейнс)

source: Currently only the first schema can be tab-completed.
ru: В настоящее время дополнение табуляцией возможно только для первой схемы.

source: Improve <application>psql</application>'s tab completion for triggers and rules (Andreas Karlsson)
ru: Улучшение в <application>psql</application> дополнения табуляцией для триггеров и правил (Андреас Карлсон)

source: <link linkend="app-psql-meta-commands">Backslash Commands</link>
ru: <link linkend="app-psql-meta-commands">Команды с обратной косой чертой</link>

source: Add <application>psql</application> <command>\?</command> help sections <literal>variables</literal> and <literal>options</literal> (Pavel Stehule)
ru: Добавление для команды <application>psql</application> <command>\?</command> разделов справки <literal>variables</literal> и <literal>options</literal> (Павел Стехуле)

source: <literal>\? variables</literal> shows <application>psql</application>'s special variables and <literal>\? options</literal> shows the command-line options. <command>\? commands</command> shows the meta-commands, which is the traditional output and remains the default. These help displays can also be obtained with the command-line option <literal>--help=<replaceable>section</replaceable></literal>.
ru: Команда <literal>\? variables</literal> показывает справку по специальным переменным <application>psql</application>, а <literal>\? options</literal> — по параметрам командной строки. Команда <command>\? commands</command> выводит метакоманды, которые выводились раньше, и это остаётся вариантом по умолчанию. Эти разделы справки также можно получить, передав в командной строке аргумент <literal>--help=<replaceable>раздел</replaceable></literal>.

source: Show tablespace size in <application>psql</application>'s <literal>\db+</literal> (Fabr&iacute;zio de Royes Mello)
ru: В команде <application>psql</application> <literal>\db+</literal> добавлен вывод размера табличного пространства (Фабрицио де Ройес Мелло)

source: Show data type owners in <application>psql</application>'s <literal>\dT+</literal> (Magnus Hagander)
ru: В <application>psql</application> <literal>\dT+</literal> добавлено отображение владельцев типов данных (Магнус Хагандер)

source: Allow <application>psql</application>'s <command>\watch</command> to output <command>\timing</command> information (Fujii Masao)
ru: В <application>psql</application> <command>\watch</command> добавлен вывод информации <command>\timing</command> (Фудзии Масао)

source: Also prevent <option>--echo-hidden</option> from echoing <command>\watch</command> queries, since that is generally unwanted.
ru: Отключение вывода запросов <command>\watch</command> при запуске с ключом <option>--echo-hidden</option>, так как обычно они не нужны.

source: Make <application>psql</application>'s <literal>\sf</literal> and <literal>\ef</literal> commands honor <envar>ECHO_HIDDEN</envar> (Andrew Dunstan)
ru: Команды <application>psql</application> <literal>\sf</literal> и <literal>\ef</literal> должны учитывать переменную <envar>ECHO_HIDDEN</envar> (Эндрю Дунстан)

source: Improve <application>psql</application> tab completion for <command>\set</command>, <command>\unset</command>, and <literal>:variable</literal> names (Pavel Stehule)
ru: Улучшение в <application>psql</application> дополнения табуляцией для <command>\set</command>, <command>\unset</command> и имён <literal>:variable</literal> (Павел Стехуле)

source: Allow tab completion of role names in <application>psql</application> <literal>\c</literal> commands (Ian Barwick)
ru: Возможность дополнения табуляцией имён ролей в командах <application>psql</application> <literal>\c</literal> (Иэн Барвик)

source: Allow <application>pg_dump</application> to share a snapshot taken by another session using <option>--snapshot</option> (Simon Riggs, Michael Paquier)
ru: Возможность использовать в <application>pg_dump</application> снимок данных, полученный в другом сеансе, с параметром <option>--snapshot</option> (Саймон Риггс, Мишель Пакье)

source: The remote snapshot must have been exported by <function>pg_export_snapshot()</function> or logical replication slot creation. This can be used to share a consistent snapshot across multiple <application>pg_dump</application> processes.
ru: Этот снимок должен быть экспортирован функцией <function>pg_export_snapshot()</function> или при создании слота логической репликации. Это может применяться для совместного использования согласованного снимка несколькими процессами <application>pg_dump</application>.

source: Support table sizes exceeding 8GB in tar archive format (Tom Lane)
ru: Поддержка в архивном формате tar таблиц размером больше 8 ГБ (Том Лейн)

source: The POSIX standard for tar format does not allow elements of a tar archive to exceed 8GB, but most modern implementations of tar support an extension that does allow it. Use the extension format when necessary, rather than failing.
ru: Стандарт POSIX формата tar не позволяет включать в архив элементы размером больше 8 ГБ, но большинство современных реализаций tar поддерживают расширение, допускающие это. Поэтому нужно использовать расширенный формат, когда это необходимо, а не выдавать ошибку.

source: Make <application>pg_dump</application> always print the server and <application>pg_dump</application> versions (Jing Wang)
ru: Включение в <application>pg_dump</application> вывода версий сервера и <application>pg_dump</application> во всех режимах (Цзин Ван)

source: Previously, version information was only printed in <option>--verbose</option> mode.
ru: До этого информация о версии выводилась только в режиме <option>--verbose</option>.

source: Remove the long-ignored <option>-i</option>/<option>--ignore-version</option> option from <application>pg_dump</application>, <application>pg_dumpall</application>, and <application>pg_restore</application> (Fujii Masao)
ru: Исключение давно забытого параметра <option>-i</option>/<option>--ignore-version</option> из <application>pg_dump</application>, <application>pg_dumpall</application> и <application>pg_restore</application> (Фудзии Масао)

source: Support multiple <application>pg_ctl</application> <option>-o</option> options, concatenating their values (Bruce Momjian)
ru: Поддержка нескольких параметров <application>pg_ctl</application> <option>-o</option>, так что их значения соединяются вместе (Брюс Момджян)

source: Allow control of <application>pg_ctl</application>'s event source logging on <systemitem class="osname">MS Windows</systemitem> (MauMau)
ru: Возможность определения для <application>pg_ctl</application> источника событий, записываемых в журнал событий <systemitem class="osname">MS Windows</systemitem> (МауМау)

source: This only controls <application>pg_ctl</application>, not the server, which has separate settings in <filename>postgresql.conf</filename>.
ru: Это влияет только на события <application>pg_ctl</application>, а не сервера — для него источник событий задаётся отдельно, в <filename>postgresql.conf</filename>.

source: If the server's listen address is set to a wildcard value (<literal>0.0.0.0</literal> in IPv4 or <literal>::</literal> in IPv6), connect via the loopback address rather than trying to use the wildcard address literally (Kondo Yuta)
ru: Если в качестве принимающего адреса сервера задаётся всёохватывающее значение (<literal>0.0.0.0</literal> в IPv4 или <literal>::</literal> в IPv6), нужно подключаться через адрес локального замыкания, а не использовать заданный адрес буквально (Кондо Юта)

source: This fix primarily affects Windows, since on other platforms <application>pg_ctl</application> will prefer to use a Unix-domain socket.
ru: Это исправление в первую очередь затрагивает Windows, так как на других платформах <application>pg_ctl</application> предпочитает использовать доменный сокет Unix.

source: Move <application>pg_upgrade</application> from <filename>contrib</filename> to <filename>src/bin</filename> (Peter Eisentraut)
ru: Перемещение <application>pg_upgrade</application> из <filename>contrib</filename> в <filename>src/bin</filename> (Питер Эйзентраут)

source: In connection with this change, the functionality previously provided by the <application>pg_upgrade_support</application> module has been moved into the core server.
ru: В связи с этим изменением, функциональность, ранее предоставляемая модулем <application>pg_upgrade_support</application>, была включена в ядро сервера.

source: Support multiple <application>pg_upgrade</application> <option>-o</option>/<option>-O</option> options, concatenating their values (Bruce Momjian)
ru: Поддержка нескольких параметров <application>pg_upgrade</application> <option>-o</option>/<option>-O</option>, так что их значения соединяются вместе (Брюс Момджян)

source: Improve database collation comparisons in <application>pg_upgrade</application> (Heikki Linnakangas)
ru: Улучшение сравнений правил сортировки для баз данных в <application>pg_upgrade</application> (Хейкки Линнакангас)

source: Remove support for upgrading from 8.3 clusters (Bruce Momjian)
ru: Ликвидация поддержки обновления с версии 8.3 (Брюс Момджян)

source: Move pgbench from <filename>contrib</filename> to <filename>src/bin</filename> (Peter Eisentraut)
ru: Перемещение pgbench из <filename>contrib</filename> в <filename>src/bin</filename> (Питер Эйзентраут)

source: Fix calculation of TPS number <quote>excluding connections establishing</quote> (Tatsuo Ishii, Fabien Coelho)
ru: Исправлено вычисление TPS <quote>за исключением установленных соединений</quote> (Тацуо Исии, Фабьен Коэльо)

source: The overhead for connection establishment was miscalculated whenever the number of pgbench threads was less than the number of client connections. Although this is clearly a bug, we won't back-patch it into pre-9.5 branches since it makes TPS numbers not comparable to previous results.
ru: Накладные расходы на установление соединения подсчитывались неправильно, когда число потоков pgbench было меньше числа клиентских подключений. Хотя это определённо ошибка, мы не будем переносить её исправление в версии до 9.5, так как при этом значения TPS окажутся несравнимыми с предыдущими результатами.

source: Allow counting of pgbench transactions that take over a specified amount of time (Fabien Coelho)
ru: Подсчёт транзакций, выполнявшихся дольше заданного времени (Фабьен Коэльо)

source: This is controlled by a new <option>--latency-limit</option> option.
ru: Этим подсчётом управляет нововведённый параметр <option>--latency-limit</option>.

source: Allow pgbench to generate Gaussian/exponential distributions using <command>\setrandom</command> (Kondo Mitsumasa, Fabien Coelho)
ru: Возможность получить в pgbench случайное распределение Гаусса или экспоненциальное распределение <command>\setrandom</command> (Мицумаса Кондо, Фабьен Коэльо)

source: Allow <application>pgbench</application>'s <command>\set</command> command to handle arithmetic expressions containing more than one operator, and add <literal>%</literal> (modulo) to the set of operators it supports (Robert Haas, Fabien Coelho)
ru: Реализация в команде <application>pgbench</application> <command>\set</command> обработки арифметических выражений с несколькими операторами и включение <literal>%</literal> (деления по модулю) в список поддерживаемых операторов (Роберт Хаас, Фабьен Коэльо)

source: Source Code
ru: Исходный код

source: Simplify <link linkend="wal"><acronym>WAL</acronym></link> record format (Heikki Linnakangas)
ru: Упрощение формата записи <link linkend="wal"><acronym>WAL</acronym></link> (Хейкки Линнакангас)

source: This allows external tools to more easily track what blocks are modified.
ru: Благодаря этому изменению, внешним средствам будет легче отслеживать, какие блоки изменяются.

source: Improve the representation of transaction commit and abort WAL records (Andres Freund)
ru: Улучшение представления записей фиксации и прерывания транзакций в WAL (Андрес Фройнд)

source: Add atomic memory operations <acronym>API</acronym> (Andres Freund)
ru: Добавление <acronym>API</acronym> атомарных операций с памятью (Андрес Фройнд)

source: Allow custom path and scan methods (KaiGai Kohei, Tom Lane)
ru: Возможность реализации нестандартных методов сканирования и путей (КайГай Кохей, Том Лейн)

source: This allows extensions greater control over the optimizer and executor.
ru: Это даёт расширениям дополнительные рычаги управления оптимизатором и исполнителем.

source: Allow foreign data wrappers to do post-filter locking (Etsuro Fujita)
ru: Возможность устанавливать блокировки после фильтрации в обёртках сторонних данных (Эцуро Фудзита)

source: Foreign tables can now take part in <command>INSERT ... ON CONFLICT DO NOTHING</command> queries (Peter Geoghegan, Heikki Linnakangas, Andres Freund)
ru: Сторонние таблицы теперь могут участвовать в запросах <command>INSERT ... ON CONFLICT DO NOTHING</command> (Питер Геохеган, Хейкки Линнакангас, Андрес Фройнд)

source: Foreign data wrappers must be modified to handle this. <command>INSERT ... ON CONFLICT DO UPDATE</command> is not supported on foreign tables.
ru: Обёртки сторонних данных не нужно модифицировать, чтобы это поддерживалось. Однако команда <command>INSERT ... ON CONFLICT DO UPDATE</command> со сторонними таблицами не поддерживается.

source: Improve <function>hash_create()</function>'s API for selecting simple-binary-key hash functions (Teodor Sigaev, Tom Lane)
ru: Улучшение интерфейса <function>hash_create()</function>, позволяющее выбирать хеш-функции с простым двоичным ключом (Фёдор Сигаев, Том Лейн)

source: Improve parallel execution infrastructure (Robert Haas, Amit Kapila, Noah Misch, Rushabh Lathia, Jeevan Chalke)
ru: Улучшение инфраструктуры параллельного выполнения (Роберт Хаас, Амит Капила, Ной Миш, Рушаб Латиа, Дживан Чок)

source: Remove <productname>Alpha</productname> (<acronym>CPU</acronym>) and <systemitem class="osname">Tru64</systemitem> (OS) ports (Andres Freund)
ru: Ликвидация портов для <productname>Alpha</productname> (<acronym>CPU</acronym>) и <systemitem class="osname">Tru64</systemitem> (ОС) (Андрес Фройнд)

source: Remove swap-byte-based spinlock implementation for <acronym>ARM</acronym>v5 and earlier <acronym>CPU</acronym>s (Robert Haas)
ru: Ликвидация реализации циклических блокировок (spinlock) на основе перестановки байт для <acronym>ARM</acronym>v5 и предыдущих процессоров (Роберт Хаас)

source: <acronym>ARM</acronym>v5's weak memory ordering made this locking implementation unsafe. Spinlock support is still possible on newer gcc implementations with atomics support.
ru: Особенность слабого упорядочивания доступа к памяти в <acronym>ARM</acronym> v5 делает такую реализацию блокировки ненадёжной. Однако использование циклических блокировок всё же возможно с новыми версиями gcc, поддерживающими атомарные операции.

source: Generate an error when excessively long (100+ character) file paths are written to tar files (Peter Eisentraut)
ru: Выдача ошибки при попытке записать в файлы tar чрезмерно длинный (больше 100 символов) путь (Питер Эйзентраут)

source: Tar does not support such overly-long paths.
ru: Tar не поддерживает такие длинные пути.
