Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.6.po
Languages: ru

source: Disallow creation of indexes on system columns, except for <type>OID</type> columns (David Rowley)
ru: Запрет создания индексов по системным столбцам, за исключением <type>OID</type> (Дэвид Роули)

source: Such indexes were never considered supported, and would very possibly misbehave since the system might change the system-column fields of a tuple without updating indexes. However, previously there were no error checks to prevent them from being created.
ru: Такие индексы никогда не считались поддерживаемыми и провоцировали некорректное поведение, так как система могла менять значения системных столбцов, не обновляя индексы. Однако ранее отсутствовали проверки, которые бы мешали их создавать.

source: Permissions Management
ru: Управление разрешениями

source: Use the privilege system to manage access to sensitive functions (Stephen Frost)
ru: Использование системы прав для управления доступом к важным функциям (Стивен Фрост)

source: Formerly, many security-sensitive functions contained hard-wired checks that would throw an error if they were called by a non-superuser. This forced the use of superuser roles for some relatively pedestrian tasks. The hard-wired error checks are now gone in favor of making <application>initdb</application> revoke the default public <literal>EXECUTE</literal> privilege on these functions. This allows installations to choose to grant usage of such functions to trusted roles that do not need all superuser privileges.
ru: Ранее многие требующие ограниченного доступа функции содержали жёстко зашитые проверки, которые выдавали ошибки, если эти функции пытался выполнять не суперпользователь. Это вынуждало применять роли суперпользователей для выполнения и некоторых заурядных задач. Теперь эти проверки ушли, вместо этого <application>initdb</application> отзывает у роли public право на выполнение (<literal>EXECUTE</literal>) этих функций. Это позволяет на местах дать право использовать их доверенным ролям, которым не нужны все полномочия суперпользователей.

source: Create some <link linkend="default-roles">built-in roles</link> that can be used to grant access to what were previously superuser-only functions (Stephen Frost)
ru: Создание нескольких <link linkend="default-roles">встроенных ролей</link>, используя которые можно давать доступ к операциям, ранее доступным только суперпользователям (Стивен Фрост)

source: Currently the only such role is <literal>pg_signal_backend</literal>, but more are expected to be added in future.
ru: В настоящее время есть только одна такая роль, <literal>pg_signal_backend</literal>, но в дальнейшем ожидается добавление других ролей.

source: Data Types
ru: Типы данных

source: Improve <link linkend="textsearch">full-text search</link> to support searching for phrases, that is, lexemes appearing adjacent to each other in a specific order, or with a specified distance between them (Teodor Sigaev, Oleg Bartunov, Dmitry Ivanov)
ru: Усовершенствование <link linkend="textsearch">полнотекстового поиска</link>; поддержка поиска фраз, то есть лексем, встречающихся рядом в определённом порядке, либо с заданным расстоянием между ними (Фёдор Сигаев, Олег Бартунов, Дмитрий Иванов)

source: A phrase-search query can be specified in <type>tsquery</type> input using the new operators <literal>&lt;-&gt;</literal> and <literal>&lt;<replaceable>N</replaceable>&gt;</literal>. The former means that the lexemes before and after it must appear adjacent to each other in that order. The latter means they must be exactly <replaceable>N</replaceable> lexemes apart.
ru: Запрос поиска фразы может быть записан в значении <type>tsquery</type> с использованием новых операторов <literal>&lt;-&gt;</literal> и <literal>&lt;<replaceable>N</replaceable>&gt;</literal>. Первая запись означает, что лексемы до и после неё должны находиться рядом и в заданном порядке. Вторая запись означает, что они могут быть разделены ровно <replaceable>N</replaceable> лексемами.

source: Allow omitting one or both boundaries in an array slice specifier, e.g. <literal>array_col[3:]</literal> (Yury Zhuravlev)
ru: Возможность записать указание среза массива без одной или двух границ, например, <literal>array_col[3:]</literal> (Юрий Журавлёв)

source: Omitted boundaries are taken as the upper or lower limit of the corresponding array subscript. This allows simpler specification for many common use-cases.
ru: Опущенные границы воспринимаются как значения верхнего или нижнего предела соответствующей позиции в массиве. Это позволяет упростить запись срезов во многих распространённых ситуациях.

source: Be more careful about out-of-range dates and timestamps (Vitaly Burovoy)
ru: Более аккуратное обращение с датами и временем за пределами допустимого диапазона (Виталий Буровой)

source: This change prevents unexpected out-of-range errors for <type>timestamp with time zone</type> values very close to the implementation limits. Previously, the <quote>same</quote> value might be accepted or not depending on the <varname>timezone</varname> setting, meaning that a dump and reload could fail on a value that had been accepted when presented. Now the limits are enforced according to the equivalent <acronym>UTC</acronym> time, not local time, so as to be independent of <varname>timezone</varname>.
ru: Это изменение предотвращает неожиданные ошибки выхода за пределы диапазона для значений дата/время с часовым поясом, очень близких к предельным значениям реализации. Ранее <quote>одно и то же</quote> значение могло быть принято или нет, в зависимости от значения параметра <varname>timezone</varname> (часового пояса), и как следствие, ранее выгруженные данные могли не загружаться из-за значений, который до этого считались приемлемыми. Теперь границы проверяются по <acronym>UTC</acronym>, а не по местному часовому поясу, так что эта проверка не зависит от значения <varname>timezone</varname>.

source: Also, <productname>PostgreSQL</productname> is now more careful to detect overflow in operations that compute new date or timestamp values, such as <type>date</type> <literal>+</literal> <type>integer</type>.
ru: Также <productname>PostgreSQL</productname> теперь более аккуратно выявляет переполнение при вычислениях новых значений даты или даты/времени, таких как <type>date</type> <literal>+</literal> <type>integer</type>.

source: For geometric data types, make sure <literal>infinity</literal> and <literal>NaN</literal> component values are treated consistently during input and output (Tom Lane)
ru: Обеспечена согласованная обработка значений <literal>infinity</literal> (бесконечность) и <literal>NaN</literal> (не число) в компонентах геометрических типов данных при вводе и выводе (Том Лейн)

source: Such values will now always print the same as they would in a simple <type>float8</type> column, and be accepted the same way on input. Previously the behavior was platform-dependent.
ru: Такие значения теперь всегда будут выводиться как они выводились бы в обычном столбце <type>float8</type>, и таким же образом будут вводиться. Предыдущее поведение зависело от платформы.

source: Upgrade the <link linkend="textsearch-ispell-dictionary"><literal>ispell</literal></link> dictionary type to handle modern <productname>Hunspell</productname> files and support more languages (Artur Zakirov)
ru: Добавление в словарь <link linkend="textsearch-ispell-dictionary"><literal>ispell</literal></link> поддержки дополнительных языков и современного формата файлов <productname>Hunspell</productname> (Артур Закиров)

source: Implement look-behind constraints in <link linkend="functions-posix-regexp">regular expressions</link> (Tom Lane)
ru: Реализация условий с просмотром назад в <link linkend="functions-posix-regexp">регулярных выражениях</link> (Том Лейн)

source: A look-behind constraint is like a lookahead constraint in that it consumes no text; but it checks for existence (or nonexistence) of a match ending at the current point in the string, rather than one starting at the current point. Similar features exist in many other regular-expression engines.
ru: Условие с просмотром назад похоже на условие с просмотром вперёд тем, что оно не вбирает текст; оно проверяет наличие (или отсутствие) соответствия, заканчивающегося в текущей позиции в строке, а не начинающегося с текущей позиции. Это поддерживают и многие другие исполнители регулярных выражений.

source: In regular expressions, if an apparent three-digit octal escape <literal>\</literal><replaceable>nnn</replaceable> would exceed 377 (255 decimal), assume it is a two-digit octal escape instead (Tom Lane)
ru: Если в регулярных выражениях предположительно трёхсимвольное восьмеричное значение <literal>\</literal><replaceable>nnn</replaceable> превосходит 377 (255 в десятичном виде), должно считываться только двухсимвольное восьмеричное значение (Том Лейн)

source: This makes the behavior match current <application>Tcl</application> releases.
ru: Это поведение соответствует тому, что наблюдается в текущих версиях <application>Tcl</application>.

source: Add transaction ID operators <type>xid</type> <literal>&lt;&gt;</literal> <type>xid</type> and <type>xid</type> <literal>&lt;&gt;</literal> <type>int4</type>, for consistency with the corresponding equality operators (Michael Paquier)
ru: Добавление операторов для идентификаторов транзакций <type>xid</type> <literal>&lt;&gt;</literal> <type>xid</type> и <type>xid</type> <literal>&lt;&gt;</literal> <type>int4</type>, для согласованности с соответствующими операторами равенства (Мишель Пакье)

source: Functions
ru: Функции

source: Add <link linkend="functions-json-processing-table"><function>jsonb_insert()</function></link> function to insert a new element into a <type>jsonb</type> array, or a not-previously-existing key into a <type>jsonb</type> object (Dmitry Dolgov)
ru: Добавление функции <link linkend="functions-json-processing-table"><function>jsonb_insert()</function></link> для вставки нового элемента в массив <type>jsonb</type> или ранее не существовавшего ключа в объект <type>jsonb</type> (Дмитрий Долгов)

source: Improve the accuracy of the <function>ln()</function>, <function>log()</function>, <function>exp()</function>, and <function>pow()</function> functions for type <type>numeric</type> (Dean Rasheed)
ru: Увеличение точности функций <function>ln()</function>, <function>log()</function>, <function>exp()</function> и <function>pow()</function> для типа <type>numeric</type> (Дин Рашид)

source: Add a <link linkend="functions-math-func-table"><function>scale(numeric)</function></link> function to extract the display scale of a <type>numeric</type> value (Marko Tiikkaja)
ru: Добавление функции <link linkend="functions-math-func-table"><function>scale(numeric)</function></link>, выдающей масштаб значения <type>numeric</type> (Марко Тииккая)

source: Add trigonometric functions that work in degrees (Dean Rasheed)
ru: Добавление тригонометрических функций, работающих с градусами (Дин Рашид)

source: For example, <link linkend="functions-math-trig-table"><function>sind()</function></link> measures its argument in degrees, whereas <function>sin()</function> measures in radians. These functions go to some lengths to deliver exact results for values where an exact result can be expected, for instance <literal>sind(30) = 0.5</literal>.
ru: Например, <link linkend="functions-math-trig-table"><function>sind()</function></link> воспринимает свой аргумент в градусах, тогда как <function>sin()</function> — в радианах. Эти функции до некоторой степени выдают точный результат для аргументов, для которых его можно ожидать, например, <literal>sind(30) = 0.5</literal>.

source: Ensure that trigonometric functions handle <literal>infinity</literal> and <literal>NaN</literal> inputs per the <acronym>POSIX</acronym> standard (Dean Rasheed)
ru: Обработка аргументов <literal>infinity</literal> и <literal>NaN</literal> в тригонометрических функциях по стандарту <acronym>POSIX</acronym> (Дин Рашид)

source: The <acronym>POSIX</acronym> standard says that these functions should return <literal>NaN</literal> for <literal>NaN</literal> input, and should throw an error for out-of-range inputs including <literal>infinity</literal>. Previously our behavior varied across platforms.
ru: Стандарт <acronym>POSIX</acronym> говорит, что эти функции должны возвращать <literal>NaN</literal> для аргумента <literal>NaN</literal> и выдавать ошибку для любых значений вне допустимого диапазона (включая <literal>infinity</literal>). Ранее они вели себя по-разному на разных платформах.

source: Make <link linkend="functions-datetime-table"><function>to_timestamp(float8)</function></link> convert float <literal>infinity</literal> to timestamp <literal>infinity</literal> (Vitaly Burovoy)
ru: Функция <link linkend="functions-datetime-table"><function>to_timestamp(float8)</function></link> теперь преобразует <literal>infinity</literal> (бесконечность) в числе с плавающей точкой в <literal>infinity</literal> в дате (Виталий Буровой)

source: Formerly it just failed on an infinite input.
ru: Ранее она просто выдавала ошибку для аргумента бесконечность.

source: Add new functions for <type>tsvector</type> data (Stas Kelvich)
ru: Добавление новых функций для значений <type>tsvector</type> (Стас Кельвич)

source: The new functions are <link linkend="textsearch-functions-table"><function>ts_delete()</function></link>, <function>ts_filter()</function>, <function>unnest()</function>, <function>tsvector_to_array()</function>, <function>array_to_tsvector()</function>, and a variant of <function>setweight()</function> that sets the weight only for specified lexeme(s).
ru: Это функции <link linkend="textsearch-functions-table"><function>ts_delete()</function></link>, <function>ts_filter()</function>, <function>unnest()</function>, <function>tsvector_to_array()</function>, <function>array_to_tsvector()</function> и вариация <function>setweight()</function>, устанавливающая вес только для заданных лексем.

source: Allow <link linkend="textsearch-statistics"><function>ts_stat()</function></link> and <link linkend="textsearch-update-triggers"><function>tsvector_update_trigger()</function></link> to operate on values that are of types binary-compatible with the expected argument type, not just exactly that type; for example allow <type>citext</type> where <type>text</type> is expected (Teodor Sigaev)
ru: Функции <link linkend="textsearch-statistics"><function>ts_stat()</function></link> и <link linkend="textsearch-update-triggers"><function>tsvector_update_trigger()</function></link> теперь принимают значения, имеющие не только конкретный ожидаемый тип аргумента, но и тип, двоично совместимый с ним; например, они могут принимать <type>citext</type> там, где ожидается <type>text</type> (Фёдор Сигаев)

source: Add variadic functions <link linkend="functions-comparison-func-table"><function>num_nulls()</function></link> and <function>num_nonnulls()</function> that count the number of their arguments that are null or non-null (Marko Tiikkaja)
ru: Добавление функций <link linkend="functions-comparison-func-table"><function>num_nulls()</function></link> и <function>num_nonnulls()</function> с переменным числом аргументов, возвращающих число переданных им значений NULL и значений, отличных от NULL (Марко Тииккая)

source: An example usage is <literal>CHECK(num_nonnulls(a,b,c) = 1)</literal> which asserts that exactly one of a,b,c is not <literal>NULL</literal>. These functions can also be used to count the number of null or nonnull elements in an array.
ru: Например, их можно использовать в ограничении <literal>CHECK(num_nonnulls(a,b,c) = 1)</literal>, которое требует, чтобы ровно одно из значений a,b,c было отлично от <literal>NULL</literal>. Эти функции также могут применяться для подсчёта элементов NULL и элементов, отличных от NULL, в массиве.

source: Add function <link linkend="functions-string-other"><function>parse_ident()</function></link> to split a qualified, possibly quoted <acronym>SQL</acronym> identifier into its parts (Pavel Stehule)
ru: Добавление функции <link linkend="functions-string-other"><function>parse_ident()</function></link> для разбиения полного (и возможно заключённого в кавычки) идентификатора <acronym>SQL</acronym> на компоненты (Павел Стехуле)

source: In <link linkend="functions-formatting-table"><function>to_number()</function></link>, interpret a <literal>V</literal> format code as dividing by 10 to the power of the number of digits following <literal>V</literal> (Bruce Momjian)
ru: Функция <link linkend="functions-formatting-table"><function>to_number()</function></link> воспринимает код формата <literal>V</literal> как признак деления числа на 10 в степени, заданной цифрами после <literal>V</literal> (Брюс Момджян)

source: This makes it operate in an inverse fashion to <function>to_char()</function>.
ru: Таким образом поведение этой функции оказывается обратным к <function>to_char()</function>.

source: Make the <link linkend="functions-info-catalog-table"><function>to_reg*()</function></link> functions accept type <type>text</type> not <type>cstring</type> (Petr Korobeinikov)
ru: Функции <link linkend="functions-info-catalog-table"><function>to_reg*()</function></link> теперь принимают тип <type>text</type>, а не <type>cstring</type> (Пётр Коробейников)

source: This avoids the need to write an explicit cast in most cases where the argument is not a simple literal constant.
ru: Это избавляет от необходимости записывать явное приведение в большинстве случаев, когда аргумент не является простой строковой константой.

source: Add <link linkend="functions-admin-dbsize"><function>pg_size_bytes()</function></link> function to convert human-readable size strings to numbers (Pavel Stehule, Vitaly Burovoy, Dean Rasheed)
ru: Добавление функции <link linkend="functions-admin-dbsize"><function>pg_size_bytes()</function></link> для преобразования понятных человеку объёмов в числа (Павел Стехуле, Виталий Буровой, Дин Рашид)

source: This function converts strings like those produced by <function>pg_size_pretty()</function> into bytes. An example usage is <literal>SELECT oid::regclass FROM pg_class WHERE pg_total_relation_size(oid) &gt; pg_size_bytes('10 GB')</literal>.
ru: Эта функция преобразует строки, в частности, те, что выдаёт <function>pg_size_pretty()</function>, в количество байтов. Использовать её можно, например, так: <literal>SELECT oid::regclass FROM pg_class WHERE pg_total_relation_size(oid) &gt; pg_size_bytes('10 GB')</literal>.

source: In <link linkend="functions-admin-dbsize"><function>pg_size_pretty()</function></link>, format negative numbers similarly to positive ones (Adrian Vondendriesch)
ru: Формат вывода отрицательных чисел в <link linkend="functions-admin-dbsize"><function>pg_size_pretty()</function></link> не должен отличаться от положительных (Адриан фон ден Дриш)

source: Previously, negative numbers were never abbreviated, just printed in bytes.
ru: Ранее отрицательные числа никогда не сокращались и всегда выводились в байтах.

source: Add an optional <replaceable>missing_ok</replaceable> argument to the <link linkend="functions-admin-set-table"><function>current_setting()</function></link> function (David Christensen)
ru: Добавление необязательного аргумента <replaceable>missing_ok</replaceable> в функцию <link linkend="functions-admin-set-table"><function>current_setting()</function></link> (Дэвид Кристенсен)

source: This allows avoiding an error for an unrecognized parameter name, instead returning a <literal>NULL</literal>.
ru: Это позволяет избежать ошибки при передаче неизвестного имени параметра; вместо ошибки будет выдан <literal>NULL</literal>.

source: Change various catalog-inspection functions to return <literal>NULL</literal> for invalid input (Michael Paquier)
ru: Модификация ряда функций просмотра каталога, чтобы они возвращали <literal>NULL</literal> при недопустимых входных данных (Мишель Пакье)

source: <link linkend="functions-info-catalog-table"><function>pg_get_viewdef()</function></link> now returns <literal>NULL</literal> if given an invalid view <type>OID</type>, and several similar functions likewise return <literal>NULL</literal> for bad input. Previously, such cases usually led to <quote>cache lookup failed</quote> errors, which are not meant to occur in user-facing cases.
ru: Функция <link linkend="functions-info-catalog-table"><function>pg_get_viewdef()</function></link> теперь возвращает <literal>NULL</literal>, получая неправильный <type>OID</type> представления; также и другие функции будут возвращать <literal>NULL</literal> при некорректных параметрах. Ранее в таких случаях обычно возникали ошибки типа <quote>cache lookup failed</quote> (ошибка поиска в кеше), с которыми не должны сталкиваться пользователи.

source: Fix <link linkend="pg-replication-origin-xact-reset"><function>pg_replication_origin_xact_reset()</function></link> to not have any arguments (Fujii Masao)
ru: Избавление функции <link linkend="pg-replication-origin-xact-reset"><function>pg_replication_origin_xact_reset()</function></link> от аргументов (Фудзии Масао)

source: The documentation said that it has no arguments, and the C code did not expect any arguments, but the entry in <structname>pg_proc</structname> mistakenly specified two arguments.
ru: В документации говорится, что у неё нет аргументов, и коду функции на C никакие аргументы не нужны, но в записи в <structname>pg_proc</structname> по ошибке указаны два аргумента.

source: Server-Side Languages
ru: Языки программирования на стороне сервера

source: In <link linkend="plpgsql">PL/pgSQL</link>, detect mismatched <command>CONTINUE</command> and <command>EXIT</command> statements while compiling a function, rather than at execution time (Jim Nasby)
ru: Выявление некорректных операторов <command>CONTINUE</command> и <command>EXIT</command> в <link linkend="plpgsql">PL/pgSQL</link> при компиляции функции, а не во время выполнения (Джим Нэсби)

source: Extend <application>PL/Python</application>'s error-reporting and message-reporting functions to allow specifying additional message fields besides the primary error message (Pavel Stehule)
ru: Расширение функций, выдающих ошибки и сообщения в <application>PL/Python</application>, чтобы они могли передавать помимо основного сообщения и дополнительные поля (Павел Стехуле)

source: Allow PL/Python functions to call themselves recursively via <application>SPI</application>, and fix the behavior when multiple set-returning PL/Python functions are called within one query (Alexey Grishchenko, Tom Lane)
ru: Исправление механизма вызова функций PL/Python, позволяющее производить рекурсивные вызовы этих функций через <application>SPI</application>, и корректировка поведения в ситуации, когда несколько функций на PL/Python, возвращающих множества, вызываются в одном запросе (Алексей Грищенко, Том Лейн)

source: Fix session-lifespan memory leaks in PL/Python (Heikki Linnakangas, Haribabu Kommi, Tom Lane)
ru: Ликвидация утечек памяти в пределах длительности сеанса в PL/Python (Хейкки Линнакангас, Харибабу Комми, Том Лейн)

source: Modernize <application>PL/Tcl</application> to use Tcl's <quote>object</quote> <acronym>API</acronym>s instead of simple strings (Jim Nasby, Karl Lehenbauer)
ru: Модернизация <application>PL/Tcl</application>, переход от передачи простых строк к <quote>объектному</quote> <acronym>API</acronym> Tcl (Джим Нэсби, Карл Лехенбауэр)

source: This can improve performance substantially in some cases. Note that <application>PL/Tcl</application> now requires Tcl 8.4 or later.
ru: Это может значительно увеличить производительность в некоторых случаях. Заметьте, что для <application>PL/Tcl</application> теперь требуется версия Tcl 8.4 или новее.
