Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.6.po
Languages: ru

source: Nail the <structname>pg_shseclabel</structname> system catalog into cache, so that it is available for access during connection authentication (Adam Brightwell)
ru: Закрепление системного каталога <structname>pg_shseclabel</structname> в кеше, чтобы он был доступен при проверке подлинности в момент подключения (Адам Брайтвелл)

source: The core code does not use this catalog for authentication, but extensions might wish to consult it.
ru: Код ядра не использует этот каталог для аутентификации, но к нему могут обращаться расширения.

source: Restructure <link linkend="indexam">index access method <acronym>API</acronym></link> to hide most of it at the <application>C</application> level (Alexander Korotkov, Andrew Gierth)
ru: Реструктуризация <link linkend="indexam"><acronym>API</acronym> методов доступа индексов</link> с целью в большей степени скрыть его на уровне <application>C</application> (Александр Коротков, Эндрю Гирт)

source: This change modernizes the index <acronym>AM API</acronym> to look more like the designs we have adopted for foreign data wrappers and tablesample handlers. This simplifies the <application>C</application> code and makes it much more practical to define index access methods in installable extensions. A consequence is that most of the columns of the <structname>pg_am</structname> system catalog have disappeared. New <link linkend="functions-info-catalog-table">inspection functions</link> have been added to allow SQL queries to determine index AM properties that used to be discoverable from <structname>pg_am</structname>.
ru: В результате этого изменения <acronym>API</acronym> индексных методов становится больше похожим на API, принятый для обёрток сторонних данных и генераторов выборки из таблицы. Это упрощает код <application>C</application> и должно сделать более приемлемой реализацию методов доступа индексов в устанавливаемых расширениях. Данное изменение позволило удалить из системного каталога <structname>pg_am</structname> многие столбцы. Чтобы SQL-запросы могли анализировать свойства МД индексов, которые раньше были доступны в <structname>pg_am</structname>, были добавлены новые <link linkend="functions-info-catalog-table">функции проверки свойств</link>.

source: Add <link linkend="catalog-pg-init-privs"><structname>pg_init_privs</structname></link> system catalog to hold original privileges of <application>initdb</application>-created and extension-created objects (Stephen Frost)
ru: Добавление системного каталога <link linkend="catalog-pg-init-privs"><structname>pg_init_privs</structname></link> для записи изначальных прав, назначаемых для объектов, которые создаёт <application>initdb</application> и расширения (Стивен Фрост)

source: This infrastructure allows <application>pg_dump</application> to dump changes that an installation may have made in privileges attached to system objects. Formerly, such changes would be lost in a dump and reload, but now they are preserved.
ru: Благодаря этой инфраструктуре <application>pg_dump</application> может выгружать изменённые в данной инсталляции назначения прав на системные объекты. Ранее такие назначения терялись после выгрузки/загрузки, но теперь они сохраняются.

source: Change the way that extensions allocate custom <literal>LWLocks</literal> (Amit Kapila, Robert Haas)
ru: Изменение способа запрашивания дополнительных лёгких блокировок расширениями (Амит Капила, Роберт Хаас)

source: The <function>RequestAddinLWLocks()</function> function is removed, and replaced by <function>RequestNamedLWLockTranche()</function>. This allows better identification of custom <literal>LWLocks</literal>, and is less error-prone.
ru: Функция <function>RequestAddinLWLocks()</function> была удалена, а ей на смену пришла <function>RequestNamedLWLockTranche()</function>. С новым подходом будет проще идентифицировать лёгкие блокировки и сложнее допустить ошибку.

source: Improve the isolation tester to allow multiple sessions to wait concurrently, allowing testing of deadlock scenarios (Robert Haas)
ru: Усовершенствование тестировщика изоляции, чтобы в состоянии ожидания могли находиться сразу несколько сеансов; это позволяет тестировать сценарии взаимоблокировок (Роберт Хаас)

source: Introduce extensible node types (KaiGai Kohei)
ru: Введение расширяемых типов узлов (КайГай Кохей)

source: This change allows <application>FDW</application>s or custom scan providers to store data in a plan tree in a more convenient format than was previously possible.
ru: В результате этого изменения обёртки сторонних данных или провайдеры нестандартного сканирования могут сохранить данные в дереве плана в более удобном формате, чем было возможно ранее.

source: Make the planner deal with post-scan/join query steps by generating and comparing <literal>Paths</literal>, replacing a lot of ad-hoc logic (Tom Lane)
ru: Планировщик должен рассматривать дальнейшие шаги после сканирования/объединения, генерируя и сравнивая структуры <literal>Path</literal>; это позволяет упростить большой объём несистематической логики (Том Лейн)

source: This change provides only marginal user-visible improvements today, but it enables future work on a lot of upper-planner improvements that were impractical to tackle using the old code structure.
ru: Сегодня это изменение практически никак не проявляется для конечных пользователей, но в будущем оно позволит реализовать множество усовершенствований планировщика, которые не вписывались в старую структуру кода.

source: Support partial aggregation (David Rowley, Simon Riggs)
ru: Поддержка частичного агрегирования (Дэвид Роули, Саймон Риггс)

source: This change allows the computation of an aggregate function to be split into separate parts, for example so that parallel worker processes can cooperate on computing an aggregate. In future it might allow aggregation across local and remote data to occur partially on the remote end.
ru: Это изменение позволяет разделить вычисление агрегатной функции на части, например, чтобы параллельные рабочие процессы могли вычислять её совместно. В будущем это может позволить производить агрегатное вычисление по локальным и удалённым данным частично на удалённой стороне.

source: Add a generic command progress reporting facility (Vinayak Pokale, Rahila Syed, Amit Langote, Robert Haas)
ru: Внедрение универсального механизма для отслеживания процесса выполнения команд (Винаяк Покале, Рахила Сьед, Амит Ланготе, Роберт Хаас)

source: Separate out <application>psql</application>'s <application>flex</application> lexer to make it usable by other client programs (Tom Lane, Kyotaro Horiguchi)
ru: Выделение из <application>psql</application> лексического анализатора <application>flex</application>, чтобы его можно было использовать в других клиентских программах (Том Лейн, Киотаро Хоригучи)

source: This eliminates code duplication for programs that need to be able to parse SQL commands well enough to identify command boundaries. Doing that in full generality is more painful than one could wish, and up to now only <application>psql</application> has really gotten it right among our supported client programs.
ru: Это избавляет от необходимости дублировать код для программ, которым нужно достаточно хорошо понимать команды SQL, чтобы распознавать границы команд. Полноценно реализовать это оказывается гораздо сложнее, чем хотелось бы, и на данный момент только <application>psql</application> из всех поддерживаемых клиентских программ делает это на самом деле правильно.

source: A new source-code subdirectory <filename>src/fe_utils/</filename> has been created to hold this and other code that is shared across our client programs. Formerly such sharing was accomplished by symbolic linking or copying source files at build time, which was ugly and required duplicate compilation.
ru: Для размещения этого и другого кода, который будут совместно использовать наши клиентские программы, был создан новый подкаталог <filename>src/fe_utils/</filename>. Раньше для такого совместного использования приходилось создавать символические ссылки или копировать исходные файлы во время сборки, что было некрасиво и требовало двойной компиляции.

source: Introduce <literal>WaitEventSet</literal> <acronym>API</acronym> to allow efficient waiting for event sets that usually do not change from one wait to the next (Andres Freund, Amit Kapila)
ru: Внедрение нового <acronym>API</acronym> <literal>WaitEventSet</literal> для эффективного ожидания набора событий, которые обычно не меняются от одного цикла ожидания к другому (Андрес Фройнд, Амит Капила)

source: Add a generic interface for writing <acronym>WAL</acronym> records (Alexander Korotkov, Petr Jel&iacute;nek, Markus Nullmeier)
ru: Добавление унифицированного интерфейса для добавления записей в <acronym>WAL</acronym> (Александр Коротков, Петр Желинек, Маркус Нуллмейер)

source: This change allows extensions to write <acronym>WAL</acronym> records for changes to pages using a standard layout. The problem of needing to replay <acronym>WAL</acronym> without access to the extension is solved by having generic replay code. This allows extensions to implement, for example, index access methods and have <acronym>WAL</acronym> support for them.
ru: Благодаря этому изменению, расширения могут записывать в <acronym>WAL</acronym> изменения страниц со стандартной структурой. При этом проблема воспроизведения <acronym>WAL</acronym> без доступа к этому расширению решается универсальным кодом воспроизведения. Это позволяет расширениям реализовывать, например, свои методы доступа индексов и рассчитывать на то, что <acronym>WAL</acronym> будет поддерживать их.

source: Support generic <acronym>WAL</acronym> messages for logical decoding (Petr Jel&iacute;nek, Andres Freund)
ru: Поддержка произвольных сообщений <acronym>WAL</acronym> при логическом декодировании (Петр Желинек, Андрес Фройнд)

source: This feature allows extensions to insert data into the <acronym>WAL</acronym> stream that can be read by logical-decoding plugins, but is not connected to physical data restoration.
ru: Этот механизм позволяет расширениям вставлять в поток <acronym>WAL</acronym> произвольные данные, которые могут быть прочитаны модулями логического декодирования, но не связаны с физическим восстановлением данных.

source: Allow SP-GiST operator classes to store an arbitrary <quote>traversal value</quote> while descending the index (Alexander Lebedev, Teodor Sigaev)
ru: Реализация возможности для классов операторов SP-GiST сохранять произвольное <quote>переходящее значение</quote> при проходе по индексу (Александр Лебедев, Фёдор Сигаев)

source: This is somewhat like the <quote>reconstructed value</quote>, but it could be any arbitrary chunk of data, not necessarily of the same data type as the indexed column.
ru: Это может быть нечто вроде <quote>восстановленного значения</quote>, но могут быть и произвольные данные, не обязательно того же типа, что индексируемый столбец.

source: Introduce a <literal>LOG_SERVER_ONLY</literal> message level for <function>ereport()</function> (David Steele)
ru: Введение уровня сообщений <literal>LOG_SERVER_ONLY</literal> для <function>ereport()</function> (Дэвид Стил)

source: This level acts like <literal>LOG</literal> except that the message is never sent to the client. It is meant for use in auditing and similar applications.
ru: Этот уровень обрабатывается как <literal>LOG</literal>, за исключением того, что такое сообщение никогда не передаётся клиенту. Он предназначен для организации аудита и подобных приложений.

source: Provide a <filename>Makefile</filename> target to build all generated headers (Michael Paquier, Tom Lane)
ru: Реализация в <filename>Makefile</filename> цели для сборки всех генерируемых заголовочных файлов (Мишель Пакье, Том Лейн)

source: <literal>submake-generated-headers</literal> can now be invoked to ensure that generated backend header files are up-to-date. This is useful in subdirectories that might be built <quote>standalone</quote>.
ru: Теперь, чтобы убедиться, что все генерируемые серверные заголовочные файлы актуальны, можно выполнить сборку цели <literal>submake-generated-headers</literal>. Это полезно в подкаталогах, которые могут собираться <quote>отдельно</quote>.

source: Support OpenSSL 1.1.0 (Andreas Karlsson, Heikki Linnakangas)
ru: Поддержка OpenSSL 1.1.0 (Андреас Карлсон, Хейкки Линнакангас)

source: Additional Modules
ru: Дополнительные модули

source: Add configuration parameter <literal>auto_explain.sample_rate</literal> to allow <link linkend="auto-explain"><filename>contrib/auto_explain</filename></link> to capture just a configurable fraction of all queries (Craig Ringer, Julien Rouhaud)
ru: Добавление параметра конфигурации <literal>auto_explain.sample_rate</literal>, устанавливающего для <link linkend="auto-explain"><filename>contrib/auto_explain</filename></link> процент запросов, подлежащих анализу (Крейг Рингер, Жульен Рохо)

source: This allows reduction of overhead for heavy query traffic, while still getting useful information on average.
ru: Это позволяет снизить издержки при большой нагрузке и при этом всё же получать полезную общую информацию.

source: Add <link linkend="bloom"><filename>contrib/bloom</filename></link> module that implements an index access method based on Bloom filtering (Teodor Sigaev, Alexander Korotkov)
ru: Добавление модуля <link linkend="bloom"><filename>contrib/bloom</filename></link>, реализующего метод доступа индекса на основе фильтра Блума (Фёдор Сигаев, Александр Коротков)

source: This is primarily a proof-of-concept for non-core index access methods, but it could be useful in its own right for queries that search many columns.
ru: Это в первую очередь пилотная реализация метода доступа вне ядра, но этот модуль может иметь и практическую пользу для запросов, производящих поиск по множеству столбцов.

source: In <link linkend="cube"><filename>contrib/cube</filename></link>, introduce distance operators for cubes, and support kNN-style searches in GiST indexes on cube columns (Stas Kelvich)
ru: В модуле <link linkend="cube"><filename>contrib/cube</filename></link> введены операторы расстояния для кубов и поддержка поиска в стиле kNN в индексах GiST по столбцам типа cube (Стас Кельвич)

source: Make <filename>contrib/hstore</filename>'s <link linkend="hstore-func-table"><function>hstore_to_jsonb_loose()</function></link> and <function>hstore_to_json_loose()</function> functions agree on what is a number (Tom Lane)
ru: Согласование представления о числах в функциях <link linkend="hstore-func-table"><function>hstore_to_jsonb_loose()</function></link> и <function>hstore_to_json_loose()</function> расширения <filename>contrib/hstore</filename> (Том Лейн)

source: Previously, <function>hstore_to_jsonb_loose()</function> would convert numeric-looking strings to <acronym>JSON</acronym> numbers, rather than strings, even if they did not exactly match the <acronym>JSON</acronym> syntax specification for numbers. This was inconsistent with <function>hstore_to_json_loose()</function>, so tighten the test to match the <acronym>JSON</acronym> syntax.
ru: Ранее функция <function>hstore_to_jsonb_loose()</function> преобразовывала похожие на числа строки в числа <acronym>JSON</acronym>, а не в строки, даже когда они в точности не соответствовали правилам записи чисел в <acronym>JSON</acronym>. Это не согласовывалось с поведением <function>hstore_to_json_loose()</function>, так что проверки были усилены для соблюдения синтаксиса <acronym>JSON</acronym>.

source: Add selectivity estimation functions for <link linkend="intarray"><filename>contrib/intarray</filename></link> operators to improve plans for queries using those operators (Yury Zhuravlev, Alexander Korotkov)
ru: Добавление функций оценки избирательности для операторов модуля <link linkend="intarray"><filename>contrib/intarray</filename></link> с целью улучшения планов запросов, использующих эти операторы (Юрий Журавлёв, Александр Коротков)

source: Make <link linkend="pageinspect"><filename>contrib/pageinspect</filename></link>'s <function>heap_page_items()</function> function show the raw data in each tuple, and add new functions <function>tuple_data_split()</function> and <function>heap_page_item_attrs()</function> for inspection of individual tuple fields (Nikolay Shaplov)
ru: Доработка функции <function>heap_page_items()</function> в модуле <link linkend="pageinspect"><filename>contrib/pageinspect</filename></link>, чтобы она выводила неструктурированные данные в каждом кортеже, а также добавление функций <function>tuple_data_split()</function> и <function>heap_page_item_attrs()</function> для исследования отдельных полей кортежей (Николай Шаплов)

source: Add an optional <literal>S2K</literal> iteration count parameter to <link linkend="pgcrypto"><filename>contrib/pgcrypto</filename></link>'s <function>pgp_sym_encrypt()</function> function (Jeff Janes)
ru: Добавление необязательного параметра, задающего число итераций <literal>S2K</literal>, в функцию <link linkend="pgcrypto"><filename>contrib/pgcrypto</filename></link> в модуле <function>pgp_sym_encrypt()</function> (Джефф Джейнс)

source: Add support for <quote>word similarity</quote> to <link linkend="pgtrgm"><filename>contrib/pg_trgm</filename></link> (Alexander Korotkov, Artur Zakirov)
ru: Добавление возможности оценивать <quote>схожесть слов</quote> в <link linkend="pgtrgm"><filename>contrib/pg_trgm</filename></link> (Александр Коротков, Артур Закиров)

source: These functions and operators measure the similarity between one string and the most similar single word of another string.
ru: Добавленные функции и операторы оценивают схожесть между одной строкой и наиболее похожим отдельным словом в другой строке.

source: Add configuration parameter <varname>pg_trgm.similarity_threshold</varname> for <filename>contrib/pg_trgm</filename>'s similarity threshold (Artur Zakirov)
ru: Добавление параметра конфигурации <varname>pg_trgm.similarity_threshold</varname>, устанавливающего порог схожести для <filename>contrib/pg_trgm</filename> (Артур Закиров)

source: This threshold has always been configurable, but formerly it was controlled by special-purpose functions <function>set_limit()</function> and <function>show_limit()</function>. Those are now deprecated.
ru: Этот порог настраивался и раньше, но до этого им управляли специальные функции <function>set_limit()</function> и <function>show_limit()</function>. Теперь они считаются устаревшими.

source: Improve <filename>contrib/pg_trgm</filename>'s GIN operator class to speed up index searches in which both common and rare keys appear (Jeff Janes)
ru: Усовершенствование класса операторов GIN в <filename>contrib/pg_trgm</filename> для ускорения запросов с применением индекса, в которых ищутся и редкие, и частые ключи (Джефф Джейнс)

source: Improve performance of similarity searches in <filename>contrib/pg_trgm</filename> GIN indexes (Christophe Fornaroli)
ru: Увеличение производительности поиска по схожести в индексах GIN (модуль <filename>contrib/pg_trgm</filename>) (Кристоф Форнароли)

source: Add <link linkend="pgvisibility"><filename>contrib/pg_visibility</filename></link> module to allow examining table visibility maps (Robert Haas)
ru: Добавление модуля <link linkend="pgvisibility"><filename>contrib/pg_visibility</filename></link>, позволяющего изучать карты видимости таблиц (Роберт Хаас)

source: Add <link linkend="sslinfo"><function>ssl_extension_info()</function></link> function to <filename>contrib/sslinfo</filename>, to print information about <acronym>SSL</acronym> extensions present in the <literal>X509</literal> certificate used for the current connection (Dmitry Voronin)
ru: Добавление в <filename>contrib/sslinfo</filename> функции <link linkend="sslinfo"><function>ssl_extension_info()</function></link> для вывода информации о расширениях <acronym>SSL</acronym>, представленных в сертификате <literal>X509</literal>, который используется для текущего соединения (Дмитрий Воронин)

source: Allow extension-provided operators and functions to be sent for remote execution, if the extension is whitelisted in the foreign server's options (Paul Ramsey)
ru: Возможность передавать предоставляемые расширением операторы и функции на удалённый сервер, если это расширение указано в белом списке в параметрах стороннего сервера (Пол Рамси)

source: Users can enable this feature when the extension is known to exist in a compatible version in the remote database. It allows more efficient execution of queries involving extension operators.
ru: Пользователи могут использовать это, когда точно известно, что в удалённой базе установлена совместимая версия заданного расширения. Это позволяет более эффективно выполнять запросы с операторами, поддерживаемыми расширениями.

source: Consider performing sorts on the remote server (Ashutosh Bapat)
ru: Возможность выполнения сортировки на удалённом сервере (Ашутош Бапат)

source: Consider performing joins on the remote server (Shigeru Hanada, Ashutosh Bapat)
ru: Возможность выполнения соединений на удалённом сервере (Шигеру Ханада, Ашутош Бапат)

source: When feasible, perform <command>UPDATE</command> or <command>DELETE</command> entirely on the remote server (Etsuro Fujita)
ru: Если возможно, выполнять <command>UPDATE</command> или <command>DELETE</command> полностью на удалённом сервере (Эцуро Фудзита)

source: Formerly, remote updates involved sending a <command>SELECT FOR UPDATE</command> command and then updating or deleting the selected rows one-by-one. While that is still necessary if the operation requires any local processing, it can now be done remotely if all elements of the query are safe to send to the remote server.
ru: Ранее для удалённой модификации данных требовалось передавать команду <command>SELECT FOR UPDATE</command>, а затем изменять или удалять отобранные строки по одной. Хотя это по-прежнему необходимо, если эта операция требует локальных действий, теперь она может выполняться и удалённо, если все элементы запроса можно безопасно передать на удалённый сервер.

source: Allow the fetch size to be set as a server or table option (Corey Huinker)
ru: Возможность задавать число извлекаемых строк в параметрах сервера или таблицы (Кори Хаинкер)

source: Formerly, <filename>postgres_fdw</filename> always fetched 100 rows at a time from remote queries; now that behavior is configurable.
ru: Ранее <filename>postgres_fdw</filename> всегда читала результаты удалённых запросов по 100 строк; теперь это количество стало настраиваемым.

source: Use a single foreign-server connection for local user IDs that all map to the same remote user (Ashutosh Bapat)
ru: Для всех локальных пользователей, сопоставленных с одним удалённым пользователем, должно использоваться одно соединение со сторонним сервером (Ашутош Бапат)

source: Transmit query cancellation requests to the remote server (Michael Paquier, Etsuro Fujita)
ru: Передача требования отмены запроса на удалённый сервер (Мишель Пакье, Эцуро Фудзита)

source: Previously, a local query cancellation request did not cause an already-sent remote query to terminate early.
ru: Ранее требование на отмену локального запроса не влекло за собой досрочную отмену удалённого запроса, уже переданного на выполнение.
