Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.6.po
Languages: ru

source: Neither of these system calls are likely to fail in typical situations, but if they did, <filename>fd.c</filename> could get quite confused.
ru: В типичных ситуациях эти системные вызовы отрабатывают без ошибок, но в случае ошибки код <filename>fd.c</filename> мог повести себя некорректно.

source: Fix incorrect check for whether postmaster is running as a Windows service (Michael Paquier)
ru: Исправление некорректной проверки факта работы postmaster в виде службы Windows (Мишель Пакье)

source: This could result in attempting to write to the event log when that isn't accessible, so that no logging happens at all.
ru: Вследствие ошибки для вывода сообщений мог выбираться системный журнал событий (там где его на самом деле не было), так что запись сообщений фактически не производилась.

source: Fix <application>ecpg</application> to support <command>COMMIT PREPARED</command> and <command>ROLLBACK PREPARED</command> (Masahiko Sawada)
ru: Исправление в <application>ecpg</application> поддержки <command>COMMIT PREPARED</command> и <command>ROLLBACK PREPARED</command> (Масахико Савада)

source: Fix a double-free error when processing dollar-quoted string literals in <application>ecpg</application> (Michael Meskes)
ru: Исправление ошибки двойного освобождения при обработке строковых констант, заключённых в доллары, в <application>ecpg</application> (Михаэль Мескес)

source: Fix <application>pgbench</application> to handle the combination of <option>--connect</option> and <option>--rate</option> options correctly (Fabien Coelho)
ru: Исправление поведения <application>pgbench</application> с сочетанием параметров <option>--connect</option> и <option>--rate</option> (Фабьен Коэльо)

source: Fix <application>pgbench</application> to honor the long-form option spelling <option>--builtin</option>, as per its documentation (Tom Lane)
ru: Исправление в <application>pgbench</application> обработки развёрнутого написания параметра <option>--builtin</option> согласно документации (Том Лейн)

source: Fix <application>pg_dump</application>/<application>pg_restore</application> to correctly handle privileges for the <literal>public</literal> schema when using <option>--clean</option> option (Stephen Frost)
ru: Исправление поведения <application>pg_dump</application>/<application>pg_restore</application> для корректной обработки прав, назначенных для схемы <literal>public</literal>, при использовании параметра <option>--clean</option> (Стивен Фрост)

source: Other schemas start out with no privileges granted, but <literal>public</literal> does not; this requires special-case treatment when it is dropped and restored due to the <option>--clean</option> option.
ru: Другие схемы создаются без назначенных для них прав, но схема <literal>public</literal> представляет собой исключение; когда она удаляется и восстанавливается вследствие указания <option>--clean</option>, её нужно обработать особым образом.

source: In <application>pg_dump</application>, fix incorrect schema and owner marking for comments and security labels of some types of database objects (Giuseppe Broccolo, Tom Lane)
ru: В <application>pg_dump</application> исправлена пометка схемы и владельца для комментариев и меток безопасности некоторых типов объектов БД (Джузеппе Брокколо, Том Лейн)

source: In simple cases this caused no ill effects; but for example, a schema-selective restore might omit comments it should include, because they were not marked as belonging to the schema of their associated object.
ru: В простых случаях это не проявлялось никак, но например, при восстановлении с выбором схемы, могли потеряться комментарии, которые в ней должны быть, из-за того, что они не были помечены как принадлежащие схеме своего объекта.

source: Fix typo in <application>pg_dump</application>'s query for initial privileges of a procedural language (Peter Eisentraut)
ru: Исправление ошибки в запросе <application>pg_dump</application>, предназначенном для получения начальных прав, назначенных для процедурного языка (Питер Эйзентраут)

source: This resulted in <application>pg_dump</application> always believing that the language had no initial privileges. Since that's true for most procedural languages, ill effects from this bug are probably rare.
ru: Вследствие этой ошибки <application>pg_dump</application> всегда полагал, что для языка не определены начальные права. Так как это справедливо для большинства процедурных языков, последствия ошибки могли проявляться довольно редко.

source: Avoid emitting an invalid list file in <literal>pg_restore -l</literal> when SQL object names contain newlines (Tom Lane)
ru: Предотвращение вывода командой <literal>pg_restore -l</literal> некорректного файла со списком объектов, когда имена объектов SQL содержат символы перевода строки (Том Лейн)

source: Replace newlines by spaces, which is sufficient to make the output valid for <literal>pg_restore -L</literal>'s purposes.
ru: Символы перевода строки заменяются пробелами, что достаточно для того, чтобы этот список корректно обработала команда <literal>pg_restore -L</literal>.

source: Fix <application>pg_upgrade</application> to transfer comments and security labels attached to <quote>large objects</quote> (blobs) (Stephen Frost)
ru: Исправление поведения <application>pg_upgrade</application> для корректного переноса комментариев и меток безопасности, связанных с <quote>большими объектами</quote> (BLOB) (Стивен Фрост)

source: Previously, blobs were correctly transferred to the new database, but any comments or security labels attached to them were lost.
ru: Ранее такие объекты корректно переносились в новую базу данных, но связанные с ними комментарии и метки безопасности терялись.

source: Improve error handling in <filename>contrib/adminpack</filename>'s <function>pg_file_write()</function> function (Noah Misch)
ru: Улучшение обработки ошибок в функции <function>pg_file_write()</function> из <filename>contrib/adminpack</filename> (Ной Миш)

source: Notably, it failed to detect errors reported by <function>fclose()</function>.
ru: В частности, она не реагировала на ошибки в вызове <function>fclose()</function>.

source: In <filename>contrib/dblink</filename>, avoid leaking the previous unnamed connection when establishing a new unnamed connection (Joe Conway)
ru: Предупреждение утечки предыдущего безымянного соединения при установлении нового безымянного соединения в <filename>contrib/dblink</filename> (Джо Конвей)

source: Fix <filename>contrib/pg_trgm</filename>'s extraction of trigrams from regular expressions (Tom Lane)
ru: Исправление извлечения триграмм из регулярных выражений в <filename>contrib/pg_trgm</filename> (Том Лейн)

source: In some cases it would produce a broken data structure that could never match anything, leading to GIN or GiST indexscans that use a trigram index not finding any matches to the regular expression.
ru: В некоторых случаях это могло приводить к формированию испорченной структуры данных, для которой отсутствуют какие-либо соответствия. Вследствие этого при сканировании по индексам GIN и GiST с использованием триграмм для регулярного выражения могли не находиться никакие результаты.

source: In <filename>contrib/postgres_fdw</filename>, allow join conditions that contain shippable extension-provided functions to be pushed to the remote server (David Rowley, Ashutosh Bapat)
ru: В <filename>contrib/postgres_fdw</filename> добавлена возможность вынесения на удалённый сервер условий соединения, содержащих функции из поставляемых расширений (Дэвид Роули, Ашутош Бапат)

source: Support Tcl 8.6 in MSVC builds (&Aacute;lvaro Herrera)
ru: Поддержка Tcl 8.6 в сборках с MSVC (Альваро Эррера)

source: Sync our copy of the timezone library with IANA release tzcode2017b (Tom Lane)
ru: Синхронизация нашей копии библиотеки timezone с выпущенной IANA версией tzcode2017b (Том Лейн)

source: This fixes a bug affecting some DST transitions in January 2038.
ru: Это устраняет ошибку с некоторыми вариантами перехода на летнее время в январе 2038.

source: Update time zone data files to <application>tzdata</application> release 2017b for DST law changes in Chile, Haiti, and Mongolia, plus historical corrections for Ecuador, Kazakhstan, Liberia, and Spain. Switch to numeric abbreviations for numerous time zones in South America, the Pacific and Indian oceans, and some Asian and Middle Eastern countries.
ru: Обновление данных часовых поясов до версии <application>tzdata</application> 2017b, включающее изменение правил перехода на летнее время в Чили, Монголии и на Гаити, а также исторические изменения для Эквадора, Казахстана, Либерии и Испании. Переход к числовым аббревиатурам для ряда часовых поясов в Южной Америке, в Тихом и Индийском океанах, а также в некоторых азиатских и ближневосточных странах.

source: The IANA time zone database previously provided textual abbreviations for all time zones, sometimes making up abbreviations that have little or no currency among the local population. They are in process of reversing that policy in favor of using numeric UTC offsets in zones where there is no evidence of real-world use of an English abbreviation. At least for the time being, <productname>PostgreSQL</productname> will continue to accept such removed abbreviations for timestamp input. But they will not be shown in the <structname>pg_timezone_names</structname> view nor used for output.
ru: Ранее в базе данных часовых поясов IANA предоставлялись текстовые аббревиатуры для всех часовых поясов и иногда при этом указывались аббревиатуры, которые практически не употреблялись местным населением. Сейчас происходит процесс ухода от этой практики в пользу использования числовых смещений UTC в тех часовых поясах, где нет никаких свидетельств реального использования английской аббревиатуры. Как минимум на данном этапе, <productname>PostgreSQL</productname> продолжит принимать подобные удалённые аббревиатуры при вводе дат/времени. Но они не будут видны при просмотре представления <structname>pg_timezone_names</structname> и не будут выводиться с датами/временем.

source: Use correct daylight-savings rules for POSIX-style time zone names in MSVC builds (David Rowley)
ru: Использование корректных правил перехода на летнее время для названий часовых поясов в стиле POSIX при сборке с MSVC (Дэвид Роули)

source: The Microsoft MSVC build scripts neglected to install the <filename>posixrules</filename> file in the timezone directory tree. This resulted in the timezone code falling back to its built-in rule about what DST behavior to assume for a POSIX-style time zone name. For historical reasons that still corresponds to the DST rules the USA was using before 2007 (i.e., change on first Sunday in April and last Sunday in October). With this fix, a POSIX-style zone name will use the current and historical DST transition dates of the <literal>US/Eastern</literal> zone. If you don't want that, remove the <filename>posixrules</filename> file, or replace it with a copy of some other zone file (see <xref linkend="datatype-timezones"/>). Note that due to caching, you may need to restart the server to get such changes to take effect.
ru: Сборочные скрипты для MSVC не устанавливали корректно файл <filename>posixrules</filename> в дерево каталогов timezone. Это приводило к тому, что код timezone переходил к использованию встроенных представлений о том, какой вариант перехода на летнее время применим для названия пояса в стиле POSIX. По историческим причинам это соответствует правилам, которые действовали в США до 2007 г. (то есть переход на летнее время происходил в первое воскресенье апреля, а на зимнее — в последнее воскресенье октября). С этим исправлением для часового пояса с названием в стиле POSIX будут использоваться текущие и исторические даты перехода для пояса <literal>US/Eastern</literal>. Если для вас это нежелательно, удалите файл <filename>posixrules</filename> или замените его файлом другого часового пояса (см. <xref remap="4" linkend="datatype-timezones"/>). Учтите, что вследствие кеширования вам потребуется перезапустить сервер, чтобы подобные изменения вступили в силу.

source: Release 9.6.2
ru: Выпуск 9.6.2

source: This release contains a variety of fixes from 9.6.1. For information about new features in the 9.6 major release, see <xref linkend="release-9-6"/>.
ru: В этот выпуск вошли различные исправления, внесённые после версии 9.6.1. За информацией о нововведениях версии 9.6 обратитесь к <xref remap="3" linkend="release-9-6"/>.

source: Migration to Version 9.6.2
ru: Миграция на версию 9.6.2

source: However, if your installation has been affected by the bug described in the first changelog entry below, then after updating you may need to take action to repair corrupted indexes.
ru: Однако, если в вашей инсталляции проявилась ошибка, описанная в первой записи следующего списка изменений, после обновления вам может потребоваться предпринять дополнительные действия для исправления испорченных индексов.

source: Also, if you are upgrading from a version earlier than 9.6.1, see <xref linkend="release-9-6-1"/>.
ru: Также, если вы обновляете сервер с версии, более ранней, чем 9.6.1, см. <xref remap="4" linkend="release-9-6-1"/>.

source: Fix a race condition that could cause indexes built with <command>CREATE INDEX CONCURRENTLY</command> to be corrupt (Pavan Deolasee, Tom Lane)
ru: Исправление поведения в особых условиях, которое приводило к повреждению индексов, создаваемых командой <command>CREATE INDEX CONCURRENTLY</command> (Паван Деоласи, Том Лейн)

source: If <command>CREATE INDEX CONCURRENTLY</command> was used to build an index that depends on a column not previously indexed, then rows updated by transactions that ran concurrently with the <command>CREATE INDEX</command> command could have received incorrect index entries. If you suspect this may have happened, the most reliable solution is to rebuild affected indexes after installing this update.
ru: Если команда <command>CREATE INDEX CONCURRENTLY</command> применялась для построения индекса, зависящего от столбца, ранее не индексированного, то у строк, изменяемых транзакциями, выполняемыми одновременно с командой <command>CREATE INDEX</command>, могли оказываться некорректные записи в индексе. В случае подозрений, что вас это коснулось, самое надёжное решение — перестроить такие индексы после установки этого обновления.

source: Ensure that the special snapshot used for catalog scans is not invalidated by premature data pruning (Tom Lane)
ru: Предотвращение утери специального снимка, используемого при сканированиях каталога, при преждевременной очистке данных (Tom Lane)

source: Backends failed to account for this snapshot when advertising their oldest xmin, potentially allowing concurrent vacuuming operations to remove data that was still needed. This led to transient failures along the lines of <quote>cache lookup failed for relation 1255</quote>.
ru: Рабочие процессы не учитывали этот снимок, сообщая о своём самом старом xmin, что оставляло возможность для удаления по-прежнему нужных данных параллельными операциями очистки. Это приводило к появлению плавающих ошибок с сообщениями <quote>ошибка поиска в кеше для отношения 1255</quote>.

source: Fix incorrect WAL logging for BRIN indexes (Kuntal Ghosh)
ru: Исправление некорректной записи в WAL, формируемой для индексов BRIN (Кунтал Гхош)

source: The WAL record emitted for a BRIN <quote>revmap</quote> page when moving an index tuple to a different page was incorrect. Replay would make the related portion of the index useless, forcing it to be recomputed.
ru: Запись WAL, выдаваемая для страницы BRIN <quote>revmap</quote> при перемещении кортежа индекса в другую страницу, была некорректной. При воспроизведении журнала соответствующая часть индекса становилась непригодной, и её требовалось вычислять заново.

source: Unconditionally WAL-log creation of the <quote>init fork</quote> for an unlogged table (Michael Paquier)
ru: Безусловное фиксирование в WAL создания <quote>слоя инициализации</quote> для нежурналируемых таблиц (Мишель Пакье)

source: Previously, this was skipped when <xref linkend="guc-wal-level"/> = <literal>minimal</literal>, but actually it's necessary even in that case to ensure that the unlogged table is properly reset to empty after a crash.
ru: Ранее это действие пропускалось при <xref linkend="guc-wal-level"/> = <literal>minimal</literal>, но на самом деле это необходимо даже в этом случае, чтобы нежурналируемая таблица корректно создавалась пустой после сбоя.

source: If the stats collector dies during hot standby, restart it (Takayuki Tsunakawa)
ru: Если процесс сборщика статистики потерян, перезапускать его и в режиме горячего резерва (Такаюки Цунакава)

source: Ensure that hot standby feedback works correctly when it's enabled at standby server start (Ants Aasma, Craig Ringer)
ru: Обеспечение корректной работы механизма уведомлений горячего резерва, когда он включается при запуске резервного сервера (Антс Аасма, Крейг Рингер)

source: Check for interrupts while hot standby is waiting for a conflicting query (Simon Riggs)
ru: Проверка прерываний в момент ожидания конфликтующего запроса сервером горячего резерва (Саймон Риггс)

source: Avoid constantly respawning the autovacuum launcher in a corner case (Amit Khandekar)
ru: Предупреждение постоянного перезапуска процесса запуска автоочистки в особых случаях (Амит Хандекар)

source: This fix avoids problems when autovacuum is nominally off and there are some tables that require freezing, but all such tables are already being processed by autovacuum workers.
ru: Это исправление решает проблему, возникавшую, когда автоочистка номинально отключена и есть несколько таблиц, требующих «заморозки», но эти таблицы уже обработаны рабочими процессами автоочистки.

source: Disallow setting the <replaceable>num_sync</replaceable> field to zero in <xref linkend="guc-synchronous-standby-names"/> (Fujii Masao)
ru: Недопущение установки нулевого значения для поля <replaceable>num_sync</replaceable> в <xref remap="6" linkend="guc-synchronous-standby-names"/> (Фудзии Масао)

source: The correct way to disable synchronous standby is to set the whole value to an empty string.
ru: Правильный вариант отключения синхронных резервных серверов — задать пустую строку в качестве всего значения.

source: Don't count background worker processes against a user's connection limit (David Rowley)
ru: Не учитывать фоновые рабочие процессы при проверке ограничения на число подключений пользователя (Дэвид Роули)

source: Fix check for when an extension member object can be dropped (Tom Lane)
ru: Исправление проверки на возможность удаления объекта, принадлежащего расширению (Том Лейн)

source: Extension upgrade scripts should be able to drop member objects, but this was disallowed for serial-column sequences, and possibly other cases.
ru: Скрипты обновления расширений должны иметь возможность удалять объекты расширений, но это запрещалось для последовательностей со столбцами serial, а также, возможно, в других случаях.

source: Fix tracking of initial privileges for extension member objects so that it works correctly with <command>ALTER EXTENSION ... ADD/DROP</command> (Stephen Frost)
ru: Исправление отслеживания начальных прав доступа для объектов, принадлежащих расширению, чтобы это корректно работало с <command>ALTER EXTENSION ... ADD/DROP</command> (Стивен Фрост)

source: An object's current privileges at the time it is added to the extension will now be considered its default privileges; only later changes in its privileges will be dumped by subsequent <application>pg_dump</application> runs.
ru: Текущие права доступа к объекту в момент добавления его в расширение теперь будут считаться правами по умолчанию; только в случае изменений они будут выгружаться при последующем выполнении <application>pg_dump</application>.

source: Make sure <command>ALTER TABLE</command> preserves index tablespace assignments when rebuilding indexes (Tom Lane, Michael Paquier)
ru: Команда <command>ALTER TABLE</command> должна сохранять назначения табличных пространств индексам при перестраивании индексов (Том Лейн, Мишель Пакье)

source: Previously, non-default settings of <xref linkend="guc-default-tablespace"/> could result in broken indexes.
ru: Ранее с нестандартными значениями <xref linkend="guc-default-tablespace"/> были возможны разрушения индексов.

source: Fix incorrect updating of trigger function properties when changing a foreign-key constraint's deferrability properties with <command>ALTER TABLE ... ALTER CONSTRAINT</command> (Tom Lane)
ru: Исправление некорректного изменения свойств триггерной функции при изменении свойства «откладываемости» ограничения внешнего ключа с помощью команды <command>ALTER TABLE ... ALTER CONSTRAINT</command> (Том Лейн)

source: This led to odd failures during subsequent exercise of the foreign key, as the triggers were fired at the wrong times.
ru: Это приводило к странным сбоям при последующем обращении к внешнему ключу, так как триггеры срабатывали не в положенное время.

source: Prevent dropping a foreign-key constraint if there are pending trigger events for the referenced relation (Tom Lane)
ru: Недопущение удаления ограничения внешнего ключа при наличии событий, ожидающих обработки триггерами, для целевого отношения (Том Лейн)

source: This avoids <quote>could not find trigger <replaceable>NNN</replaceable></quote> or <quote>relation <replaceable>NNN</replaceable> has no triggers</quote> errors.
ru: Это предотвращает ошибки <quote>не удалось найти триггер <replaceable>NNN</replaceable></quote> и <quote>в отношении <replaceable>NNN</replaceable> нет триггеров</quote>.

source: Fix <command>ALTER TABLE ... SET DATA TYPE ... USING</command> when child table has different column ordering than the parent (&Aacute;lvaro Herrera)
ru: Исправление поведения <command>ALTER TABLE ... SET DATA TYPE ... USING</command> в случаях, когда порядок столбцов в дочерней таблице отличается от родительской (Альваро Эррера)

source: Failure to adjust the column numbering in the <literal>USING</literal> expression led to errors, typically <quote>attribute <replaceable>N</replaceable> has wrong type</quote>.
ru: Вследствие того, что столбцы в выражении <literal>USING</literal> не перенумеровывались, возникала ошибка, обычно такая: <quote>атрибут <replaceable>N</replaceable> имеет неправильный тип</quote>.

source: Fix processing of OID column when a table with OIDs is associated to a parent with OIDs via <command>ALTER TABLE ... INHERIT</command> (Amit Langote)
ru: Исправление обращения к столбцу OID в случаях, когда таблица с таким столбцом связывается с родительской, тоже с OID, посредством <command>ALTER TABLE ... INHERIT</command> (Амит Ланготе)

source: The OID column should be treated the same as regular user columns in this case, but it wasn't, leading to odd behavior in later inheritance changes.
ru: В таких случаях столбец OID должен обрабатываться как обычный пользовательский столбец, но этого не происходило, что приводило к странному поведению при последующих изменениях наследования.

source: Ensure that <command>CREATE TABLE ... LIKE ... WITH OIDS</command> creates a table with OIDs, whether or not the <literal>LIKE</literal>-referenced table(s) have OIDs (Tom Lane)
ru: Команда <command>CREATE TABLE ... LIKE ... WITH OIDS</command> должна создавать таблицу с OID вне зависимости от того, есть ли OID в таблице, указанной в <literal>LIKE</literal> (Том Лейн)

source: Fix <command>CREATE OR REPLACE VIEW</command> to update the view query before attempting to apply the new view options (Dean Rasheed)
ru: Исправление поведения <command>CREATE OR REPLACE VIEW</command> — запрос представления должен изменяться до применения новых параметров представления (Дин Рашид)
