Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.6.po
Languages: ru

source: Historically a process has only been shown as waiting if it was waiting for a heavyweight lock. Now waits for lightweight locks and buffer pins are also shown in <structname>pg_stat_activity</structname>. Also, the type of lock being waited for is now visible. These changes replace the <structfield>waiting</structfield> column with <structfield>wait_event_type</structfield> and <structfield>wait_event</structfield>.
ru: Исторически процесс показывался как ожидающий, только если он ожидал тяжёлой блокировки. Теперь в <structname>pg_stat_activity</structname> также показываются ожидания лёгких блокировок и закреплений буферов. Также теперь виден тип ожидаемой блокировки. В результате этих изменений столбец <structfield>waiting</structfield> был заменён столбцами <structfield>wait_event_type</structfield> и <structfield>wait_event</structfield>.

source: In <link linkend="functions-formatting-table"><function>to_char()</function></link>, do not count a minus sign (when needed) as part of the field width for time-related fields (Bruce Momjian)
ru: В функции <link linkend="functions-formatting-table"><function>to_char()</function></link> знак минус не должен считаться частью поля с заданной шириной для компонентов времени (Брюс Момджян)

source: For example, <literal>to_char('-4 years'::interval, 'YY')</literal> now returns <literal>-04</literal>, rather than <literal>-4</literal>.
ru: Например, <literal>to_char('-4 years'::interval, 'YY')</literal> теперь возвращает <literal>-04</literal>, а не <literal>-4</literal>.

source: Make <link linkend="functions-datetime-table"><function>extract()</function></link> behave more reasonably with infinite inputs (Vitaly Burovoy)
ru: Более разумное поведение функции <link linkend="functions-datetime-table"><function>extract()</function></link> с бесконечными значениями в аргументах (Виталий Буровой)

source: Historically the <function>extract()</function> function just returned zero given an infinite timestamp, regardless of the given field name. Make it return <literal>infinity</literal> or <literal>-infinity</literal> as appropriate when the requested field is one that is monotonically increasing (e.g, <literal>year</literal>, <literal>epoch</literal>), or <literal>NULL</literal> when it is not (e.g., <literal>day</literal>, <literal>hour</literal>). Also, throw the expected error for bad field names.
ru: Ранее функция <function>extract()</function> просто возвращала ноль для аргумента &laquo;бесконечность&raquo;, вне зависимости от выбранного поля. Теперь она будет возвращать <literal>infinity</literal> или <literal>-infinity</literal> соответственно, когда это поле является монотонно возрастающим (например, <literal>year</literal>, <literal>epoch</literal>), и <literal>NULL</literal> в противном случае (например, <literal>day</literal>, <literal>hour</literal>). Также теперь выдаётся ожидаемая ошибка при некорректном указании поля.

source: Remove PL/pgSQL's <quote>feature</quote> that suppressed the innermost line of <literal>CONTEXT</literal> for messages emitted by <command>RAISE</command> commands (Pavel Stehule)
ru: Ликвидация <quote>особенности</quote> PL/pgSQL, подавляющей строку <literal>КОНТЕКСТ</literal> в сообщениях, выдаваемых командами <command>RAISE</command> (Павел Стехуле)

source: This ancient backwards-compatibility hack was agreed to have outlived its usefulness.
ru: Этот древний трюк для обратной совместимости по общему мнению пережил то время, когда он был полезен.

source: Fix the default text search parser to allow leading digits in <literal>email</literal> and <literal>host</literal> tokens (Artur Zakirov)
ru: Исправление стандартного анализатора текстового поиска, чтобы он принимал начальные цифры во фрагментах текста типа <literal>email</literal> и <literal>host</literal> (Артур Закиров)

source: In most cases this will result in few changes in the parsing of text. But if you have data where such addresses occur frequently, it may be worth rebuilding dependent <type>tsvector</type> columns and indexes so that addresses of this form will be found properly by text searches.
ru: В большинстве случаев это не должно отразиться на разборе текста, но если вы часто имеете дело с такими адресами, может иметь смысл перестроить зависимые столбцы и индексы <type>tsvector</type>, чтобы адреса этих видов корректно находились при поиске.

source: Extend <link linkend="unaccent"><filename>contrib/unaccent</filename></link>'s standard <filename>unaccent.rules</filename> file to handle all diacritics known to Unicode, and to expand ligatures correctly (Thomas Munro, L&eacute;onard Benedetti)
ru: Расширение стандартного файла <filename>unaccent.rules</filename> в модуле <link linkend="unaccent"><filename>contrib/unaccent</filename></link> для обработки всех существующих в Unicode диакритик и корректного разворачивания лигатур (Томас Мунро, Леонард Бенедетти)

source: The previous version neglected to convert some less-common letters with diacritic marks. Also, ligatures are now expanded into separate letters. Installations that use this rules file may wish to rebuild <type>tsvector</type> columns and indexes that depend on the result.
ru: Предыдущая версия не считала нужным преобразовывать некоторые редкие буквы с диакритическими знаками. Кроме того, лигатуры теперь разворачиваются в отдельные буквы. В инсталляциях, где используется этот файл правил, может иметь смысл перестроить столбцы <type>tsvector</type> и зависимые индексы.

source: Remove the long-deprecated <literal>CREATEUSER</literal>/<literal>NOCREATEUSER</literal> options from <command>CREATE ROLE</command> and allied commands (Tom Lane)
ru: Ликвидация давно считавшихся устаревшими указаний <literal>CREATEUSER</literal>/<literal>NOCREATEUSER</literal> команды <command>CREATE ROLE</command> и родственных ей (Том Лейн)

source: <literal>CREATEUSER</literal> actually meant <literal>SUPERUSER</literal>, for ancient backwards-compatibility reasons. This has been a constant source of confusion for people who (reasonably) expect it to mean <literal>CREATEROLE</literal>. It has been deprecated for ten years now, so fix the problem by removing it.
ru: Указание <literal>CREATEUSER</literal> на самом деле означало <literal>SUPERUSER</literal> из давних соображений относительно обратной совместимости. Это постоянно вводило в заблуждение людей, которые полагали (и имели на это право), что оно означало <literal>CREATEROLE</literal>. Это указание считается устаревшим уже десять лет, так что пора решить эту проблему, убрав его.

source: Treat role names beginning with <literal>pg_</literal> as reserved (Stephen Frost)
ru: Считать имена ролей, начинающиеся с <literal>pg_</literal>, зарезервированными (Стивен Фрост)

source: User creation of such role names is now disallowed. This prevents conflicts with built-in roles created by <application>initdb</application>.
ru: Теперь пользователям будет запрещено создавать роли с такими именами. Это предотвращает конфликты со встроенными ролями, создаваемыми программой <application>initdb</application>.

source: Change a column name in the <structname>information_schema</structname>.<structname>routines</structname> view from <structfield>result_cast_character_set_name</structfield> to <structfield>result_cast_char_set_name</structfield> (Cl&eacute;ment Pr&eacute;vost)
ru: Смена имени столбца в представлении <structname>information_schema</structname>.<structname>routines</structname> с <structfield>result_cast_character_set_name</structfield> на <structfield>result_cast_char_set_name</structfield> (Клеман Прево)

source: The SQL:2011 standard specifies the longer name, but that appears to be a mistake, because adjacent column names use the shorter style, as do other <structname>information_schema</structname> views.
ru: Стандарт SQL:2011 устанавливает более длинное имя, но это, скорее всего, ошибка, так как у соседних столбцов имена более краткие, как и в других представлениях <structname>information_schema</structname>.

source: <application>psql</application>'s <option>-c</option> option no longer implies <option>--no-psqlrc</option> (Pavel Stehule, Catalin Iacob)
ru: Параметр <application>psql</application> <option>-c</option> теперь не подразумевает поведение параметра <option>--no-psqlrc</option> (Павел Стехуле, Каталин Якоб)

source: Write <option>--no-psqlrc</option> (or its abbreviation <option>-X</option>) explicitly to obtain the old behavior. Scripts so modified will still work with old versions of <application>psql</application>.
ru: Для получения старого поведения нужно явно написать <option>--no-psqlrc</option> (или сокращение <option>-X</option>). Модифицированные таким образом скрипты будут продолжать работать и со старыми версиями <application>psql</application>.

source: Improve <application>pg_restore</application>'s <option>-t</option> option to match all types of relations, not only plain tables (Craig Ringer)
ru: Усовершенствование функции параметра <application>pg_restore</application> <option>-t</option>, чтобы он отбирал все типы отношений, а не только простые таблицы (Крейг Рингер)

source: Change the display format used for <literal>NextXID</literal> in <application>pg_controldata</application> and related places (Joe Conway, Bruce Momjian)
ru: Изменение формата отображения <literal>NextXID</literal> в <application>pg_controldata</application> и связанных местах (Джо Конвей, Брюс Момджян)

source: Display epoch-and-transaction-ID values in the format <replaceable>number</replaceable><literal>:</literal><replaceable>number</replaceable>. The previous format <replaceable>number</replaceable><literal>/</literal><replaceable>number</replaceable> was confusingly similar to that used for <acronym>LSN</acronym>s.
ru: Отображение значений эпоха-и-ID-транзакции в формате <replaceable>число</replaceable><literal>:</literal><replaceable>число</replaceable>. Предыдущий формат <replaceable>число</replaceable><literal>/</literal><replaceable>число</replaceable> был похож на формат <acronym>LSN</acronym>, что могло вводить в заблуждение.

source: Update extension functions to be marked parallel-safe where appropriate (Andreas Karlsson)
ru: Функции расширений, для которых это уместно, помечены как безопасные для распараллеливания (Андреас Карлсон)

source: Many of the standard extensions have been updated to allow their functions to be executed within parallel query worker processes. These changes will not take effect in databases <application>pg_upgrade</application>'d from prior versions unless you apply <command>ALTER EXTENSION UPDATE</command> to each such extension (in each database of a cluster).
ru: Во многие стандартные расширения внесены изменения, чтобы их функции могли выполняться параллельными исполнителями запросов. Эти изменения не вступят в силу в базах данных, обновлённых с предыдущих версий (с помощью <application>pg_upgrade</application>), пока вы не примените для каждого такого расширения команду <command>ALTER EXTENSION UPDATE</command> (в каждой базе данных кластера).

source: Below you will find a detailed account of the changes between <productname>PostgreSQL</productname> 9.6 and the previous major release.
ru: Ниже вы найдёте подробный список изменений, произошедших между предыдущим основным выпуском и выпуском <productname>PostgreSQL</productname> 9.6.

source: Server
ru: Сервер

source: Parallel Queries
ru: Параллельное выполнение запросов

source: Parallel queries (Robert Haas, Amit Kapila, David Rowley, many others)
ru: Параллельные запросы (Роберт Хаас, Амит Капила, Дэвид Роули и многие другие)

source: With 9.6, <productname>PostgreSQL</productname> introduces initial support for parallel execution of large queries. Only strictly read-only queries where the driving table is accessed via a sequential scan can be parallelized. Hash joins and nested loops can be performed in parallel, as can aggregation (for supported aggregates). Much remains to be done, but this is already a useful set of features.
ru: С версией 9.6 в <productname>PostgreSQL</productname> появляется начальная поддержка параллельного выполнения больших запросов. Параллельному выполнению подлежат строго запросы только на чтение, в которых производится последовательное сканирование целевой таблицы. В параллельном режиме могут выполняться и соединения по хешу с вложенными циклами, а также агрегирование (с поддерживаемыми агрегатными функциями). Ещё многое предстоит сделать, но и этот набор возможностей уже весьма полезен.

source: Parallel query execution is not (yet) enabled by default. To allow it, set the new configuration parameter <xref linkend="guc-max-parallel-workers-per-gather"/> to a value larger than zero. Additional control over use of parallelism is available through other new configuration parameters <xref linkend="guc-force-parallel-mode"/>, <xref linkend="guc-parallel-setup-cost"/>, <xref linkend="guc-parallel-tuple-cost"/>, and <xref linkend="guc-min-parallel-relation-size"/>.
ru: Параллельное выполнение запросов по умолчанию отключено (пока). Чтобы выключить его, установите для нового конфигурационного параметра <xref linkend="guc-max-parallel-workers-per-gather"/> значение, большее нуля. Для дополнительной настройки распараллеливания запросов также введены новые параметры <xref linkend="guc-force-parallel-mode"/>, <xref linkend="guc-parallel-setup-cost"/>, <xref linkend="guc-parallel-tuple-cost"/> и <xref linkend="guc-min-parallel-relation-size"/>.

source: Provide infrastructure for marking the parallel-safety status of functions (Robert Haas, Amit Kapila)
ru: Инфраструктура для обозначения параллельно-безопасности функций (Роберт Хаас, Амит Капила)

source: Indexes
ru: Индексы

source: Allow <link linkend="gin"><acronym>GIN</acronym></link> index builds to make effective use of <xref linkend="guc-maintenance-work-mem"/> settings larger than 1 GB (Robert Abraham, Teodor Sigaev)
ru: Индексы <link linkend="gin"><acronym>GIN</acronym></link> строятся более эффективно при значениях <xref linkend="guc-maintenance-work-mem"/>, превышающих 1 ГБ (Роберт Абрахам, Фёдор Сигаев)

source: Add pages deleted from a GIN index's pending list to the free space map immediately (Jeff Janes, Teodor Sigaev)
ru: Включение страниц, удаляемых из очереди обработки индекса GIN, сразу в карту свободного пространства (Джефф Джейнс, Фёдор Сигаев)

source: This reduces bloat if the table is not vacuumed often.
ru: Это предотвращает замусоривание базы, если таблица очищается нечасто.

source: Add <link linkend="functions-admin-index"><function>gin_clean_pending_list()</function></link> function to allow manual invocation of pending-list cleanup for a GIN index (Jeff Janes)
ru: Добавление функции <link linkend="functions-admin-index"><function>gin_clean_pending_list()</function></link>, позволяющей вручную вызвать очистку очереди обработки индекса GIN (Джефф Джейнс)

source: Formerly, such cleanup happened only as a byproduct of vacuuming or analyzing the parent table.
ru: Ранее такая очистка производилась только в результате очистки или анализа родительской таблицы.

source: Improve handling of dead index tuples in <link linkend="gist">GiST</link> indexes (Anastasia Lubennikova)
ru: Оптимизация обработки &laquo;мёртвых&raquo; кортежей в индексах <link linkend="gist">GiST</link> (Анастасия Лубенникова)

source: Dead index tuples are now marked as such when an index scan notices that the corresponding heap tuple is dead. When inserting tuples, marked-dead tuples will be removed if needed to make space on the page.
ru: Кортежи в индексе теперь помечаются как &laquo;мёртвые&raquo;, если при сканировании индекса обнаруживается, что соответствующий кортеж в куче — &laquo;мёртвый&raquo;. Впоследствии, при добавлении новых кортежей, кортежи, помеченные как &laquo;мёртвые&raquo;, могут быть замещены, если потребуется место на этой странице.

source: Add an <link linkend="spgist">SP-GiST</link> operator class for type <type>box</type> (Alexander Lebedev)
ru: Добавлен класс операторов <link linkend="spgist">SP-GiST</link> для типа <type>box</type> (Александр Лебедев)

source: Sorting
ru: Сортировка

source: Improve sorting performance by using quicksort, not replacement selection sort, when performing external sort steps (Peter Geoghegan)
ru: Увеличение производительности сортировки за счёт использования quicksort вместо выбора с замещением при выполнении этапов внешней сортировки (Питер Геохеган)

source: The new approach makes better use of the <acronym>CPU</acronym> cache for typical cache sizes and data volumes. Where necessary, the behavior can be adjusted via the new configuration parameter <xref linkend="guc-replacement-sort-tuples"/>.
ru: Новый подход позволяет эффективнее использовать кеш процессора при типичных размерах кеша и объёмах данных. Где необходимо, новое поведение можно скорректировать, воспользовавшись новым конфигурационным параметром <xref linkend="guc-replacement-sort-tuples"/>.

source: Speed up text sorts where the same string occurs multiple times (Peter Geoghegan)
ru: Ускорение сортировки текста, когда одна и та же строка встречается многократно (Питер Геохеган)

source: Speed up sorting of <type>uuid</type>, <type>bytea</type>, and <type>char(n)</type> fields by using <quote>abbreviated</quote> keys (Peter Geoghegan)
ru: Ускорение сортировки типов <type>uuid</type>, <type>bytea</type> и <type>char(n)</type> за счёт использования <quote>сокращённых</quote> ключей (Питер Геохеган)

source: Support for abbreviated keys has also been added to the non-default operator classes <link linkend="indexes-opclass"><literal>text_pattern_ops</literal></link>, <literal>varchar_pattern_ops</literal>, and <literal>bpchar_pattern_ops</literal>. Processing of ordered-set aggregates can also now exploit abbreviated keys.
ru: Поддержка сокращённых ключей была также добавлена в дополнительные классы операторов <link linkend="indexes-opclass"><literal>text_pattern_ops</literal></link>, <literal>varchar_pattern_ops</literal> и <literal>bpchar_pattern_ops</literal>. Сокращённые ключи теперь могут задействоваться и при вычислении сортирующих агрегатных функций.

source: Speed up <command>CREATE INDEX CONCURRENTLY</command> by treating <acronym>TID</acronym>s as 64-bit integers during sorting (Peter Geoghegan)
ru: Ускорение команды <command>CREATE INDEX CONCURRENTLY</command> за счёт обработки идентификаторов <acronym>TID</acronym> как 64-битных целых в процессе сортировки (Питер Геохеган)

source: Locking
ru: Блокировки

source: Reduce contention for the <literal>ProcArrayLock</literal> (Amit Kapila, Robert Haas)
ru: Уменьшение конкуренции за <literal>ProcArrayLock</literal> (Амит Капила, Роберт Хаас)

source: Improve performance by moving buffer content locks into the buffer descriptors (Andres Freund, Simon Riggs)
ru: Улучшение производительности за счёт переноса блокировок содержимого буфера в дескрипторы буферов (Андрес Фройнд, Саймон Риггс)

source: Replace shared-buffer header spinlocks with atomic operations to improve scalability (Alexander Korotkov, Andres Freund)
ru: Замена циклических блокировок заголовков в общем буфере атомарными операциями для улучшения масштабируемости (Александр Коротков, Андрес Фройнд)

source: Use atomic operations, rather than a spinlock, to protect an <literal>LWLock</literal>'s wait queue (Andres Freund)
ru: Использование атомарных операций вместо циклических блокировок для защиты очереди ожидания <literal>LWLock</literal> (Андрес Фройнд)

source: Partition the shared hash table freelist to reduce contention on multi-<acronym>CPU</acronym>-socket servers (Aleksander Alekseev)
ru: Разбиение на части списка свободных элементов для разделяемых по хешу таблиц, для уменьшения конкуренции на многопроцессорных серверах (Александр Алексеев)

source: Reduce interlocking on standby servers during the replay of btree index vacuuming operations (Simon Riggs)
ru: Сокращение взаимоблокировок на резервных серверах при воспроизведении операций очистки индекса-B-дерева (Саймон Риггс)

source: This change avoids substantial replication delays that sometimes occurred while replaying such operations.
ru: Это изменение исключает существенные задержки при репликации, которые иногда имели место при воспроизведении таких операций.

source: Optimizer Statistics
ru: Статистика оптимизатора

source: Improve <command>ANALYZE</command>'s estimates for columns with many nulls (Tomas Vondra, Alex Shulgin)
ru: Улучшение оценок <command>ANALYZE</command> для столбцов с большим количеством NULL (Томас Вондра, Александр Шульгин)

source: Previously <command>ANALYZE</command> tended to underestimate the number of non-<literal>NULL</literal> distinct values in a column with many <literal>NULL</literal>s, and was also inaccurate in computing the most-common values.
ru: Ранее процедура <command>ANALYZE</command> была склонна недооценивать число различных и отличных от <literal>NULL</literal> значений в столбце со множеством <literal>NULL</literal>, и также неточно вычисляла наиболее распространённые значения.

source: Improve planner's estimate of the number of distinct values in a query result (Tomas Vondra)
ru: Улучшение оценки планировщиком количества различных значений в результате запроса (Томас Вондра)

source: Use foreign key relationships to infer selectivity for join predicates (Tomas Vondra, David Rowley)
ru: Использование связей по внешним ключам для оценки избирательности предикатов соединения (Томас Вондра, Дэвид Роули)

source: If a table <literal>t</literal> has a foreign key restriction, say <literal>(a,b) REFERENCES r (x,y)</literal>, then a <literal>WHERE</literal> condition such as <literal>t.a = r.x AND t.b = r.y</literal> cannot select more than one <literal>r</literal> row per <literal>t</literal> row. The planner formerly considered these <literal>AND</literal> conditions to be independent and would often drastically misestimate selectivity as a result. Now it compares the <literal>WHERE</literal> conditions to applicable foreign key constraints and produces better estimates.
ru: Если в таблице <literal>t</literal> имеется ограничение внешнего ключа, например <literal>(a,b) REFERENCES r (x,y)</literal>, то условие <literal>WHERE</literal> вида <literal>t.a = r.x AND t.b = r.y</literal> не может выбрать больше одной строки из <literal>r</literal> для строки <literal>t</literal>. Ранее планировщик считал объединённые <literal>AND</literal> условия независимыми и поэтому часто неправильно оценивал избирательность запроса. Теперь он сравнивает условия <literal>WHERE</literal> с применимыми ограничениями внешнего ключа и получает более точные оценки.

source: Avoid re-vacuuming pages containing only frozen tuples (Masahiko Sawada, Robert Haas, Andres Freund)
ru: Предупреждение повторной очистки страниц, содержащих только замороженные кортежи (Масахико Савада, Роберт Хаас, Андрес Фройнд)

source: Formerly, anti-wraparound vacuum had to visit every page of a table, even pages where there was nothing to do. Now, pages containing only already-frozen tuples are identified in the table's visibility map, and can be skipped by vacuum even when doing transaction wraparound prevention. This should greatly reduce the cost of maintaining large tables containing mostly-unchanging data.
ru: Ранее очистка для предотвращения зацикливания должна была просматривать все страницы таблицы, даже страницы, с которыми ничего не нужно делать. Теперь страницы, содержащие только замороженные кортежи, обозначаются в карте видимости таблицы, и могут быть пропущены при очистке, даже когда она производится в целях предотвращения зацикливания транзакций. Это должно значительно снизить стоимость обслуживания больших таблиц, содержащих в основном постоянные данные.
