Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.5.po
Languages: ru

source: Major enhancements in <productname>PostgreSQL</productname> 9.5 include:
ru: В число ключевых усовершенствований <productname>PostgreSQL</productname> 9.5 входят:

source: Allow <link linkend="sql-on-conflict"><command>INSERT</command></link>s that would generate constraint conflicts to be turned into <command>UPDATE</command>s or ignored
ru: Возможность превращать команды <link linkend="sql-on-conflict"><command>INSERT</command></link>, вызывающие конфликты ограничений, в команды <command>UPDATE</command>, либо игнорировать их

source: Add <literal>GROUP BY</literal> analysis features <link linkend="queries-grouping-sets"><literal>GROUPING SETS</literal></link>, <link linkend="queries-grouping-sets"><literal>CUBE</literal></link> and <link linkend="queries-grouping-sets"><literal>ROLLUP</literal></link>
ru: Добавление в <literal>GROUP BY</literal> аналитической функциональности: <link linkend="queries-grouping-sets"><literal>GROUPING SETS</literal></link>, <link linkend="queries-grouping-sets"><literal>CUBE</literal></link> и <link linkend="queries-grouping-sets"><literal>ROLLUP</literal></link>

source: Add <link linkend="ddl-rowsecurity">row-level security control</link>
ru: Добавление <link linkend="ddl-rowsecurity">механизма защиты на уровне строк</link>

source: Create mechanisms for tracking the <link linkend="replication-origins">progress of replication</link>, including methods for identifying the origin of individual changes during logical replication
ru: Создание механизмов для отслеживания <link linkend="replication-origins">прогресса репликации</link>, включая средства идентификации источника отдельных изменений при логической репликации

source: Add <link linkend="brin">Block Range Indexes</link> (<acronym>BRIN</acronym>)
ru: Добавление <link linkend="brin">блочно-зональных индексов</link> (<acronym>BRIN</acronym>)

source: Substantial performance improvements for sorting
ru: Существенное увеличение скорости сортировки

source: Substantial performance improvements for multi-CPU machines
ru: Существенное увеличение производительности на многопроцессорных машинах

source: The above items are explained in more detail in the sections below.
ru: Предыдущие пункты более подробно описаны в следующих разделах.

source: Migration to Version 9.5
ru: Миграция на версию 9.5

source: A dump/restore using <xref linkend="app-pg-dumpall"/>, or use of <xref linkend="pgupgrade"/>, is required for those wishing to migrate data from any previous release.
ru: Тем, кто хочет мигрировать данные из любой предыдущей версии, необходимо выполнить выгрузку/загрузку данных с помощью <xref linkend="app-pg-dumpall"/> или воспользоваться <xref linkend="pgupgrade"/>.

source: Version 9.5 contains a number of changes that may affect compatibility with previous releases. Observe the following incompatibilities:
ru: В версии 9.5 реализован ряд изменений, которые могут повлиять на совместимость с предыдущими выпусками. Рассмотрите следующие несовместимые аспекты:

source: Adjust <link linkend="sql-precedence">operator precedence</link> to match the <acronym>SQL</acronym> standard (Tom Lane)
ru: Изменение <link linkend="sql-precedence">приоритета операторов</link> в соответствии со стандартом <acronym>SQL</acronym> (Том Лейн)

source: The precedence of <literal>&lt;=</literal>, <literal>&gt;=</literal> and <literal>&lt;&gt;</literal> has been reduced to match that of <literal>&lt;</literal>, <literal>&gt;</literal> and <literal>=</literal>. The precedence of <literal>IS</literal> tests (e.g., <replaceable>x</replaceable> <literal>IS NULL</literal>) has been reduced to be just below these six comparison operators. Also, multi-keyword operators beginning with <literal>NOT</literal> now have the precedence of their base operator (for example, <literal>NOT BETWEEN</literal> now has the same precedence as <literal>BETWEEN</literal>) whereas before they had inconsistent precedence, behaving like <literal>NOT</literal> with respect to their left operand but like their base operator with respect to their right operand. The new configuration parameter <xref linkend="guc-operator-precedence-warning"/> can be enabled to warn about queries in which these precedence changes result in different parsing choices.
ru: Приоритет операторов <literal>&lt;=</literal>, <literal>&gt;=</literal> и <literal>&lt;&gt;</literal> был понижен до приоритета операторов <literal>&lt;</literal>, <literal>&gt;</literal> и <literal>=</literal>. Приоритет проверок <literal>IS</literal> (например, <replaceable>x</replaceable> <literal>IS NULL</literal>) был понижен и стал непосредственно ниже приоритета этих шести операторов сравнения. Также операторы из нескольких слов, начинающиеся с <literal>NOT</literal>, теперь имеют приоритет своего базового оператора (например, <literal>NOT BETWEEN</literal> теперь имеет тот же приоритет, что и <literal>BETWEEN</literal>), тогда как раньше их приоритет был несогласованным; они воспринимались как <literal>NOT</literal> по отношению к левому операнду, но при этом как базовый оператор по отношению к правому. Новый параметр конфигурации <xref linkend="guc-operator-precedence-warning"/> даёт возможность получать предупреждения о запросах, в которых эти изменения приоритета приводят к другому результату разбора запроса.

source: Change <xref linkend="app-pg-ctl"/>'s default shutdown mode from <literal>smart</literal> to <literal>fast</literal> (Bruce Momjian)
ru: Смена в <xref linkend="app-pg-ctl"/> выбираемого по умолчанию режима отключения с <literal>smart</literal> на <literal>fast</literal> (Брюс Момджян)

source: This means the default behavior will be to forcibly cancel existing database sessions, not simply wait for them to exit.
ru: Это означает, что теперь по умолчанию сервер будет принудительно прерывать существующие сеансы, а не просто ждать их завершения.

source: Use assignment cast behavior for data type conversions in <application>PL/pgSQL</application> assignments, rather than converting to and from text (Tom Lane)
ru: Использование приведения присваивания для преобразований типов данных в присваиваниях <application>PL/pgSQL</application>, вместо перевода в текстовый вид и обратно (Том Лейн)

source: This change causes conversions of Booleans to strings to produce <literal>true</literal> or <literal>false</literal>, not <literal>t</literal> or <literal>f</literal>. Other type conversions may succeed in more cases than before; for example, assigning a numeric value <literal>3.9</literal> to an integer variable will now assign 4 rather than failing. If no assignment-grade cast is defined for the particular source and destination types, <application>PL/pgSQL</application> will fall back to its old I/O conversion behavior.
ru: Вследствие этого изменения при преобразовании булевых значений в строковые получаются значения <literal>true</literal> и <literal>false</literal>, а не <literal>t</literal> и <literal>f</literal>. Другие преобразования типов могут быть успешны в большем числе случаев, чем раньше; например, при присвоении числового значения <literal>3.9</literal> целочисленной переменной, ей будет присвоено 4, а не произойдёт ошибка, как раньше. Если для некоторых исходного и целевого типов приведение присваивания не определено, <application>PL/pgSQL</application> вернётся к старому поведению с преобразованием через вывод/ввод.

source: Allow characters in <link linkend="libpq-connect-options">server command-line options</link> to be escaped with a backslash (Andres Freund)
ru: Возможность использования экранирования обратной косой чертой символов в <link linkend="libpq-connect-options">параметрах командной строки сервера</link> (Андрес Фройнд)

source: Formerly, spaces in the options string always separated options, so there was no way to include a space in an option value. Including a backslash in an option value now requires writing <literal>\\</literal>.
ru: Ранее, пробелы в строке параметров всегда служили разделителями параметров, так что не было никакой возможности включить пробел в значение параметра. Чтобы указать обратную косую черту в значении параметра, теперь нужно написать <literal>\\</literal>.

source: Change the default value of the GSSAPI <link linkend="gssapi-auth"><varname>include_realm</varname></link> parameter to 1, so that by default the realm is not removed from a <acronym>GSS</acronym> or <acronym>SSPI</acronym> principal name (Stephen Frost)
ru: Изменение значения по умолчанию параметра GSSAPI <link linkend="gssapi-auth"><varname>include_realm</varname></link> на 1, чтобы по умолчанию имя области клиента не удалялось из имени принципала <acronym>GSS</acronym> или <acronym>SSPI</acronym> (Стивен Фрост)

source: Replace configuration parameter <varname>checkpoint_segments</varname> with <xref linkend="guc-min-wal-size"/> and <xref linkend="guc-max-wal-size"/> (Heikki Linnakangas)
ru: Замена параметра конфигурации <varname>checkpoint_segments</varname> параметрами <xref linkend="guc-min-wal-size"/> и <xref linkend="guc-max-wal-size"/> (Хейкки Линнакангас)

source: If you previously adjusted <varname>checkpoint_segments</varname>, the following formula will give you an approximately equivalent setting: <placeholder-1/> Note that the default setting for <varname>max_wal_size</varname> is much higher than the default <varname>checkpoint_segments</varname> used to be, so adjusting it might no longer be necessary.
ru: Если вы ранее настраивали <varname>checkpoint_segments</varname>, следующая формула даст вам приблизительно эквивалентное значение: <placeholder-1/> Заметьте, что значение по умолчанию параметра <varname>max_wal_size</varname> стало гораздо больше, чем раньше имел параметр <varname>checkpoint_segments</varname>, так что возможно, что корректировать этот параметр больше не потребуется.

source: Control the Linux <acronym>OOM</acronym> killer via new environment variables <link linkend="linux-memory-overcommit"><envar>PG_OOM_ADJUST_FILE</envar></link> and <link linkend="linux-memory-overcommit"><envar>PG_OOM_ADJUST_VALUE</envar></link>, instead of compile-time options <literal>LINUX_OOM_SCORE_ADJ</literal> and <literal>LINUX_OOM_ADJ</literal> (Gurjeet Singh)
ru: Регулирование снятия процессов при нехватке памяти в Linux через новые переменные окружения <link linkend="linux-memory-overcommit"><envar>PG_OOM_ADJUST_FILE</envar></link> и <link linkend="linux-memory-overcommit"><envar>PG_OOM_ADJUST_VALUE</envar></link>, вместо параметров времени компиляции <literal>LINUX_OOM_SCORE_ADJ</literal> и <literal>LINUX_OOM_ADJ</literal> (Гуржит Сингх)

source: Decommission server configuration parameter <varname>ssl_renegotiation_limit</varname>, which was deprecated in earlier releases (Andres Freund)
ru: Списание параметра конфигурации сервера <varname>ssl_renegotiation_limit</varname>, который стал устаревшим в предыдущих выпусках (Андрес Фройнд)

source: While SSL renegotiation is a good idea in theory, it has caused enough bugs to be considered a net negative in practice, and it is due to be removed from future versions of the relevant standards. We have therefore removed support for it from <productname>PostgreSQL</productname>. The <varname>ssl_renegotiation_limit</varname> parameter still exists, but cannot be set to anything but zero (disabled). It's not documented anymore, either.
ru: Хотя возможность повторного согласования SSL — хорошая вещь в теории, с ней связано достаточно ошибок, чтобы считать её скорее отрицательной на практике, и поэтому она будет исключена в будущих версиях соответствующих стандартов. Учитывая это, мы убрали поддержку этой возможности из <productname>PostgreSQL</productname>. Параметр <varname>ssl_renegotiation_limit</varname> сохранился, но ему нельзя присвоить ничего, кроме нуля (то есть он всегда отключён). Также он больше не описывается в документации.

source: Remove server configuration parameter <varname>autocommit</varname>, which was already deprecated and non-operational (Tom Lane)
ru: Удаление параметра конфигурации сервера <varname>autocommit</varname>, который уже был устаревшим и не работал (Том Лейн)

source: Remove the <link linkend="catalog-pg-authid"><structname>pg_authid</structname></link> catalog's <structfield>rolcatupdate</structfield> field, as it had no usefulness (Adam Brightwell)
ru: Удаление из каталога <link linkend="catalog-pg-authid"><structname>pg_authid</structname></link> поля <structfield>rolcatupdate</structfield>, так как оно было бесполезным (Адам Брайтвелл)

source: The <link linkend="monitoring-stats-views-table"><structname>pg_stat_replication</structname></link> system view's <structfield>sent</structfield> field is now NULL, not zero, when it has no valid value (Magnus Hagander)
ru: В системном представлении <link linkend="monitoring-stats-views-table"><structname>pg_stat_replication</structname></link> в поле <structfield>sent</structfield> теперь NULL, а не 0, представляет недействительное значение (Магнус Хагандер)

source: Allow <type>json</type> and <type>jsonb</type> array extraction operators to accept negative subscripts, which count from the end of JSON arrays (Peter Geoghegan, Andrew Dunstan)
ru: Операторы извлечения элементов массивов <type>json</type> и <type>jsonb</type> теперь могут принимать отрицательные позиции, которые отсчитываются от конца массивов JSON (Питер Геохеган, Эндрю Дунстан)

source: Previously, these operators returned <literal>NULL</literal> for negative subscripts.
ru: Ранее эти операторы возвращали <literal>NULL</literal> для отрицательных позиций.

source: Below you will find a detailed account of the changes between <productname>PostgreSQL</productname> 9.5 and the previous major release.
ru: Ниже вы найдёте подробный список изменений, произошедших между предыдущим основным выпуском и выпуском <productname>PostgreSQL</productname> 9.5.

source: Server
ru: Сервер

source: Indexes
ru: Индексы

source: Add <link linkend="brin">Block Range Indexes</link> (<acronym>BRIN</acronym>) (&Aacute;lvaro Herrera)
ru: Добавление <link linkend="brin">блочно-зональных индексов</link> (<acronym>BRIN</acronym>) (Альваро Эррера)

source: <acronym>BRIN</acronym> indexes store only summary data (such as minimum and maximum values) for ranges of heap blocks. They are therefore very compact and cheap to update; but if the data is naturally clustered, they can still provide substantial speedup of searches.
ru: Индексы <acronym>BRIN</acronym> хранят только сводные данные (например, минимальные и максимальные значения) по зонам блоков в куче. Поэтому они очень компактны и легко обновляются; при этом, если данные кластеризованы натуральным образом, такие индексы позволяют очень существенно ускорить операции поиска.

source: Allow queries to perform accurate distance filtering of bounding-box-indexed objects (polygons, circles) using <link linkend="gist">GiST</link> indexes (Alexander Korotkov, Heikki Linnakangas)
ru: Реализация возможности выполнять в запросах точную фильтрацию по дистанции для объектов (многоугольников, кругов), индексируемых по описанным прямоугольникам с использованием <link linkend="gist">GiST</link> (Александр Коротков, Хейкки Линнакангас)

source: Previously, to exploit such an index a subquery had to be used to select a large number of rows ordered by bounding-box distance, and the result then had to be filtered further with a more accurate distance calculation.
ru: Ранее, для использования такого индекса требовалось применять подзапрос, выбирающий большое количество строк, упорядоченных по дистанции до окружающего прямоугольника, а затем дополнительно отфильтровывать результат, рассчитывая расстояние точнее.

source: Allow <link linkend="gist">GiST</link> indexes to perform index-only scans (Anastasia Lubennikova, Heikki Linnakangas, Andreas Karlsson)
ru: Возможность использования индексов <link linkend="gist">GiST</link> в сканировании только по индексу (Анастасия Лубенникова, Хейкки Линнакангас, Андреас Карлсон)

source: Add configuration parameter <xref linkend="guc-gin-pending-list-limit"/> to control the size of <acronym>GIN</acronym> pending lists (Fujii Masao)
ru: Добавление параметра конфигурации <xref linkend="guc-gin-pending-list-limit"/>, управляющего размером очередей <acronym>GIN</acronym> (Фудзии Масао)

source: This value can also be set on a per-index basis as an index storage parameter. Previously the pending-list size was controlled by <xref linkend="guc-work-mem"/>, which was awkward because appropriate values for <varname>work_mem</varname> are often much too large for this purpose.
ru: Это значение можно также задать на уровне индекса как параметр хранения индекса. Ранее размер очереди зависел от параметра <xref linkend="guc-work-mem"/>, что было неудобно, так как подходящие значения <varname>work_mem</varname> обычно оказывались слишком большими для данной цели.

source: Issue a warning during the creation of <link linkend="indexes-types">hash</link> indexes because they are not crash-safe (Bruce Momjian)
ru: Выдача при создании <link linkend="indexes-types">хеш-индексов</link> предупреждения о том, что они не защищены от сбоев (Брюс Момджян)

source: General Performance
ru: Общая производительность

source: Improve the speed of sorting of <type>varchar</type>, <type>text</type>, and <type>numeric</type> fields via <quote>abbreviated</quote> keys (Peter Geoghegan, Andrew Gierth, Robert Haas)
ru: Ускорение сортировки полей <type>varchar</type>, <type>text</type> и <type>numeric</type> за счёт использования <quote>сокращённых</quote> ключей (Питер Геохеган, Эндрю Гирт, Роберт Хаас)

source: Extend the infrastructure that allows sorting to be performed by inlined, non-<acronym>SQL</acronym>-callable comparison functions to cover <command>CREATE INDEX</command>, <command>REINDEX</command>, and <command>CLUSTER</command> (Peter Geoghegan)
ru: Расширение инфраструктуры, позволяющее производить сортировку, вызывая встроенные, не вызываемые из <acronym>SQL</acronym> функции сравнения, для выполнения команд <command>CREATE INDEX</command>, <command>REINDEX</command> и <command>CLUSTER</command> (Питер Геохеган)

source: Improve performance of hash joins (Tomas Vondra, Robert Haas)
ru: Улучшение производительности соединений по хешу (Томас Вондра, Роберт Хаас)

source: Improve concurrency of shared buffer replacement (Robert Haas, Amit Kapila, Andres Freund)
ru: Улучшение параллелизма операции замены разделяемого буфера (Роберт Хаас, Амит Капила, Андрес Фройнд)

source: Reduce the number of page locks and pins during index scans (Kevin Grittner)
ru: Уменьшение количества блокировок и закреплений страниц при сканировании индексов (Кевин Гриттнер)

source: The primary benefit of this is to allow index vacuums to be blocked less often.
ru: Прежде всего это полезно тем, что позволяет реже блокировать процедуру очистки индексов.

source: Make per-backend tracking of buffer pins more memory-efficient (Andres Freund)
ru: Оптимизация использования памяти при отслеживании закреплений буферов в серверных процессах (Андрес Фройнд)

source: Improve lock scalability (Andres Freund)
ru: Улучшение масштабируемости блокировок (Андрес Фройнд)

source: This particularly addresses scalability problems when running on systems with multiple <acronym>CPU</acronym> sockets.
ru: В особенности это снимает проблемы масштабируемости в системах с несколькими раздельными процессорами.

source: Allow the optimizer to remove unnecessary references to left-joined subqueries (David Rowley)
ru: Оптимизатор теперь может удалить ненужные ссылки на соединяемые слева подзапросы (Дэвид Роули)

source: Allow pushdown of query restrictions into subqueries with <link linkend="tutorial-window">window functions</link>, where appropriate (David Rowley)
ru: Возможность вынесения ограничений запроса в подзапросы с <link linkend="tutorial-window">оконными функциями</link>, где это уместно (Дэвид Роули)

source: Allow a non-leakproof function to be pushed down into a security barrier view if the function does not receive any view output columns (Dean Rasheed)
ru: Возможность вынесения вызова негерметичной функции за представление с барьером безопасности, если функция не получает никакие выходные столбцы представления (Дин Рашид)

source: Teach the planner to use statistics obtained from an expression index on a boolean-returning function, when a matching function call appears in <literal>WHERE</literal> (Tom Lane)
ru: Доработка планировщика, чтобы он использовал статистику, полученную из индекса по выражению с булевской функцией, когда соответствующий вызов функции присутствует в <literal>WHERE</literal> (Том Лейн)

source: Make <command>ANALYZE</command> compute basic statistics (null fraction and average column width) even for columns whose data type lacks an equality function (Oleksandr Shulgin)
ru: <command>ANALYZE</command> теперь вычисляет основную статистику (процент значений NULL и среднюю ширину столбцов) даже для столбцов, тип данных которых лишён функции равенства (Олександр Шульгин)

source: Speed up <acronym>CRC</acronym> (cyclic redundancy check) computations and switch to CRC-32C (Abhijit Menon-Sen, Heikki Linnakangas)
ru: Ускорение расчёта <acronym>CRC</acronym> (циклического избыточного кода) и переход к CRC-32C (Абхиджит Менон-Сен, Хейкки Линнакангас)

source: Improve bitmap index scan performance (Teodor Sigaev, Tom Lane)
ru: Улучшение производительности сканирования индексов по битовой карте (Фёдор Сигаев, Том Лейн)

source: Speed up <command>CREATE INDEX</command> by avoiding unnecessary memory copies (Robert Haas)
ru: Ускорение команды <command>CREATE INDEX</command> за счёт исключения лишнего копирования в памяти (Роберт Хаас)

source: Increase the number of buffer mapping partitions (Amit Kapila, Andres Freund, Robert Haas)
ru: Увеличение числа разделов отображений буферов (Амит Капила, Андрес Фройнд, Роберт Хаас)

source: This improves performance for highly concurrent workloads.
ru: Это увеличивает производительность при многопоточной нагрузке.

source: Monitoring
ru: Наблюдение

source: Add per-table autovacuum logging control via new <varname>log_autovacuum_min_duration</varname> storage parameter (Michael Paquier)
ru: Добавление параметра хранения <varname>log_autovacuum_min_duration</varname> для управления протоколированием автоочистки на уровне таблиц (Мишель Пакье)

source: Add new configuration parameter <xref linkend="guc-cluster-name"/> (Thomas Munro)
ru: Добавление нового параметра конфигурации <xref linkend="guc-cluster-name"/> (Томас Мунро)

source: This string, typically set in <link linkend="config-setting-configuration-file"><filename>postgresql.conf</filename></link>, allows clients to identify the cluster. This name also appears in the process title of all server processes, allowing for easier identification of processes belonging to the same cluster.
ru: Эта строка, обычно задаваемая в <link linkend="config-setting-configuration-file"><filename>postgresql.conf</filename></link>, позволяет клиентам идентифицировать кластер. Это имя также выводится в заголовке всех серверных процессов, что упрощает выделение всех процессов, принадлежащих одному кластеру.

source: Prevent non-superusers from changing <xref linkend="guc-log-disconnections"/> on connection startup (Fujii Masao)
ru: Недопущение изменения <xref linkend="guc-log-disconnections"/> простыми пользователями при установлении соединения (Фудзии Масао)

source: Check <link linkend="libpq-ssl"><quote>Subject Alternative Names</quote></link> in <acronym>SSL</acronym> server certificates, if present (Alexey Klyukin)
ru: Проверка <link linkend="libpq-ssl"><quote>Альтернативных имён субъекта</quote></link> (Subject Alternative Names) (при наличии) в <acronym>SSL</acronym>-сертификатах серверов (Алексей Клюкин)
