Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.6.po
Languages: ru

source: Teach <filename>contrib/dblink</filename> to ignore irrelevant server options when it uses a <filename>contrib/postgres_fdw</filename> foreign server as the source of connection options (Corey Huinker)
ru: Реализация <filename>contrib/dblink</filename> должна игнорировать невоспринимаемые ей параметры сервера, когда в качестве источника параметров подключения используется сторонний сервер <filename>contrib/postgres_fdw</filename> (Кори Хаинкер)

source: Previously, if the foreign server object had options that were not also <application>libpq</application> connection options, an error occurred.
ru: Ранее, если объект стороннего сервера имел параметры, которые не относились к параметрам подключения <application>libpq</application>, происходила ошибка.

source: Fix portability problems in <filename>contrib/pageinspect</filename>'s functions for GIN indexes (Peter Eisentraut, Tom Lane)
ru: Исправление проблем с переносимостью в функциях <filename>contrib/pageinspect</filename>, связанных с индексами GIN (Питер Эйзентраут, Том Лейн)

source: Fix possible miss of socket read events while waiting on Windows (Amit Kapila)
ru: Устранение возможной потери событий чтения сокета при ожидании в Windows (Амит Капила)

source: This error was harmless for most uses, but it is known to cause hangs when trying to use the pldebugger extension.
ru: Эта ошибка была безвредной при обычном использовании, но, как оказалось, она приводила к повисаниям при попытке воспользоваться расширением pldebugger.

source: On Windows, ensure that environment variable changes are propagated to DLLs built with debug options (Christian Ullrich)
ru: В Windows изменённые переменные окружения должны передаваться и отладочным DLL (Кристина Ульрих)

source: Sync our copy of the timezone library with IANA release tzcode2016j (Tom Lane)
ru: Синхронизация нашей копии библиотеки timezone с выпущенной IANA версией tzcode2016j (Том Лейн)

source: This fixes various issues, most notably that timezone data installation failed if the target directory didn't support hard links.
ru: Это решило ряд проблем; в частности, проблему при установке данных о часовых поясах в каталог, в котором не поддерживаются жёсткие ссылки.

source: Update time zone data files to <application>tzdata</application> release 2016j for DST law changes in northern Cyprus (adding a new zone Asia/Famagusta), Russia (adding a new zone Europe/Saratov), Tonga, and Antarctica/Casey. Historical corrections for Italy, Kazakhstan, Malta, and Palestine. Switch to preferring numeric zone abbreviations for Tonga.
ru: Обновление данных часовых поясов до версии <application>tzdata</application> 2016j, включающее изменения правил перехода на летнее время на Северном Кипре (добавление нового пояса Asia/Famagusta), в России (добавление нового пояса Europe/Saratov), в Тонга и в Антарктике/Кейси, плюс корректировку исторических данных для Италии, Казахстана, Мальты и Палестины. Переход к предпочитаемому числовому обозначению пояса для Тонга.

source: Release 9.6.1
ru: Выпуск 9.6.1

source: This release contains a variety of fixes from 9.6.0. For information about new features in the 9.6 major release, see <xref linkend="release-9-6"/>.
ru: В этот выпуск вошли различные исправления, внесённые после версии 9.6.1. За информацией о нововведениях версии 9.6 обратитесь к <xref remap="3" linkend="release-9-6"/>.

source: Migration to Version 9.6.1
ru: Миграция на версию 9.6.1

source: However, if your installation has been affected by the bugs described in the first two changelog entries below, then after updating you may need to take action to repair corrupted free space maps and/or visibility maps.
ru: Однако, если в вашей инсталляции проявились ошибки, описанные в двух первых записях следующего списка изменений, после обновления вам может потребоваться предпринять дополнительные действия для исправления испорченных карт свободного места и/или видимости.

source: Fix WAL-logging of truncation of relation free space maps and visibility maps (Pavan Deolasee, Heikki Linnakangas)
ru: Корректировка записи в WAL отметки об очистке карт свободного пространства и видимости (Паван Деоласи, Хейкки Линнакангас)

source: It was possible for these files to not be correctly restored during crash recovery, or to be written incorrectly on a standby server. Bogus entries in a free space map could lead to attempts to access pages that have been truncated away from the relation itself, typically producing errors like <quote>could not read block <replaceable>XXX</replaceable>: read only 0 of 8192 bytes</quote>. Checksum failures in the visibility map are also possible, if checksumming is enabled.
ru: Ранее могло получаться так, что эти файлы не восстанавливались корректно при восстановлении после сбоя или оказывались неправильными на резервном сервере. Обращение к недействительному содержимому карты свободного пространства могло повлечь попытки использовать страницы, которые были стёрты из самого отношения, что обычно приводило к ошибкам типа <quote>не удалось прочитать блок <replaceable>XXX</replaceable>: прочитано только 0 из 8192 байт</quote>. Также были возможны нарушения контрольных сумм в карте видимости, при включённом механизме контрольных сумм.

source: Procedures for determining whether there is a problem and repairing it if so are discussed at <ulink url="https://wiki.postgresql.org/wiki/Free_Space_Map_Problems"/>.
ru: Процедуры для определения наличия проблемы и её исправления рассматриваются в <ulink url="https://wiki.postgresql.org/wiki/Free_Space_Map_Problems"/>.

source: Fix possible data corruption when <application>pg_upgrade</application> rewrites a relation visibility map into 9.6 format (Tom Lane)
ru: Предупреждение возможного повреждения данных в процессе преобразования программой <application>pg_upgrade</application> карты видимости отношения в формат 9.6 (Том Лейн)

source: On big-endian machines, bytes of the new visibility map were written in the wrong order, leading to a completely incorrect map. On Windows, the old map was read using text mode, leading to incorrect results if the map happened to contain consecutive bytes that matched a carriage return/line feed sequence. The latter error would almost always lead to a <application>pg_upgrade</application> failure due to the map file appearing to be the wrong length.
ru: На машинах с порядком байт от старшего, байты новой карты видимости записывались в неправильном порядке, в результате чего карта оказывалась абсолютно некорректной. В Windows старая карта считывалась в текстовом режиме, что приводило к некорректным результатам, если в карте рядом оказывались байты, представляющие последовательность символов возврат каретки/перевод строки. Последняя ошибка практически всегда должна была приводить к сбою <application>pg_upgrade</application> из-за того, что длина файла с картой оказывалась неверной.

source: If you are using a big-endian machine (many non-Intel architectures are big-endian) and have used <application>pg_upgrade</application> to upgrade from a pre-9.6 release, you should assume that all visibility maps are incorrect and need to be regenerated. It is sufficient to truncate each relation's visibility map with <filename>contrib/pg_visibility</filename>'s <function>pg_truncate_visibility_map()</function> function. For more information see <ulink url="https://wiki.postgresql.org/wiki/Visibility_Map_Problems"/>.
ru: Если вы используете компьютер с порядок байт от старшего (таковы многие архитектуры не Intel) и применяли <application>pg_upgrade</application> для обновления баз с версии до 9.6, вы должны принять, что все карты видимости некорректны и должны быть перестроены. Для этого достаточно аннулировать карты видимости всех отношений с помощью функции <function>pg_truncate_visibility_map()</function> расширения <filename>contrib/pg_visibility</filename>. Более подробную информацию вы можете найти в <ulink url="https://wiki.postgresql.org/wiki/Visibility_Map_Problems"/>.

source: Don't throw serialization errors for self-conflicting insertions in <command>INSERT ... ON CONFLICT</command> (Thomas Munro, Peter Geoghegan)
ru: Предотвращение ошибок сериализации при операции добавлении данных, конфликтующей с собой же, в <command>INSERT ... ON CONFLICT</command> (Томас Мунро, Питер Геохеган)

source: Fix use-after-free hazard in execution of aggregate functions using <literal>DISTINCT</literal> (Peter Geoghegan)
ru: Ликвидация риска использования после освобождения при выполнении агрегатных функций с <literal>DISTINCT</literal> (Питер Геохеган)

source: This could lead to a crash or incorrect query results.
ru: Это могло приводить к отказам или некорректным результатам запросов.

source: Fix incorrect handling of polymorphic aggregates used as window functions (Tom Lane)
ru: Исправление обработки полиморфных агрегатных функций, используемых в качестве оконных (Том Лейн)

source: The aggregate's transition function was told that its first argument and result were of the aggregate's output type, rather than the state type. This led to errors or crashes with polymorphic transition functions.
ru: Функции перехода агрегата сообщалось, что её первый аргумент и результат имеют выходной тип агрегата, а не тип состояния. Это приводило к ошибкам или сбоям в функциях перехода, связанных с полиморфными агрегатами.

source: Fix <command>COPY</command> with a column name list from a table that has row-level security enabled (Adam Brightwell)
ru: Исправление <command>COPY</command> со списком имён столбцов из таблицы, в которой включена защита на уровне строк (Адам Брайтвелл)

source: Fix <command>EXPLAIN</command> to emit valid XML when <xref linkend="guc-track-io-timing"/> is on (Markus Winand)
ru: Исправление <command>EXPLAIN</command>, чтобы она выдавала корректный XML, когда параметр <xref linkend="guc-track-io-timing"/> включён (Маркус Винанд)

source: Previously the XML output-format option produced syntactically invalid tags such as <literal>&lt;I/O-Read-Time&gt;</literal>. That is now rendered as <literal>&lt;I-O-Read-Time&gt;</literal>.
ru: Ранее вывод в формате XML содержал синтаксически некорректные теги, как например <literal>&lt;I/O-Read-Time&gt;</literal>. Сейчас выдаётся такой тег: <literal>&lt;I-O-Read-Time&gt;</literal>.

source: Fix statistics update for <command>TRUNCATE</command> in a prepared transaction (Stas Kelvich)
ru: Исправление обновления статистики при <command>TRUNCATE</command> в подготовленной транзакции (Стас Кельвич)

source: Fix bugs in merging inherited <literal>CHECK</literal> constraints while creating or altering a table (Tom Lane, Amit Langote)
ru: Исправление ошибок при объединении наследуемых ограничений <literal>CHECK</literal> в процессе создания или изменения структуры таблицы (Том Лейн, Амит Ланготе)

source: Allow identical <literal>CHECK</literal> constraints to be added to a parent and child table in either order. Prevent merging of a valid constraint from the parent table with a <literal>NOT VALID</literal> constraint on the child. Likewise, prevent merging of a <literal>NO INHERIT</literal> child constraint with an inherited constraint.
ru: Теперь одинаковые ограничения <literal>CHECK</literal> могут добавляться в родительскую и дочернюю таблицу в любом порядке. С другой стороны, слияние проверенного ограничения из родительской таблицы с непроверенным (<literal>NOT VALID</literal>) ограничением в дочерней не должно допускаться. Подобным образом, не должно допускаться слияние дочернего ненаследуемого (<literal>NO INHERIT</literal>) ограничения с наследуемым.

source: Show a sensible value in <structname>pg_settings</structname>.<structfield>unit</structfield> for <varname>min_wal_size</varname> and <varname>max_wal_size</varname> (Tom Lane)
ru: Вывод разумного значения в <structname>pg_settings</structname>.<structfield>unit</structfield> для параметров <varname>min_wal_size</varname> и <varname>max_wal_size</varname> (Том Лейн)

source: Fix replacement of array elements in <function>jsonb_set()</function> (Tom Lane)
ru: Исправление замены элементов массива в <function>jsonb_set()</function> (Том Лейн)

source: If the target is an existing JSON array element, it got deleted instead of being replaced with a new value.
ru: Если целью замены был существующий элемент массива JSON, он удалялся, а не заменялся новым.

source: Avoid very-low-probability data corruption due to testing tuple visibility without holding buffer lock (Thomas Munro, Peter Geoghegan, Tom Lane)
ru: Предотвращение очень маловероятного повреждения данных в результате проверки видимости кортежа без удержания блокировки буфера (Томас Мунро, Питер Геохеган, Том Лейн)

source: Preserve commit timestamps across server restart (Julien Rouhaud, Craig Ringer)
ru: Сохранение времени фиксирования транзакций после перезагрузки сервера (Жульен Рохо, Крейг Рингер)

source: With <xref linkend="guc-track-commit-timestamp"/> turned on, old commit timestamps became inaccessible after a clean server restart.
ru: При включённом параметре <xref linkend="guc-track-commit-timestamp"/> старые метки времени фиксации становились недоступными после полной перезагрузки сервера.

source: Fix logical WAL decoding to work properly when a subtransaction's WAL output is large enough to spill to disk (Andres Freund)
ru: Исправление логического декодирования WAL в случаях, когда вывод WAL из подтранзакции оказывался слишком большим и вымещался на диск (Андрес Фройнд)

source: Fix dangling-pointer problem in logical WAL decoding (Stas Kelvich)
ru: Ликвидация проблемы с недействительным указателем в механизме логического декодирования WAL (Стас Кельвич)

source: Round shared-memory allocation request to a multiple of the actual huge page size when attempting to use huge pages on Linux (Tom Lane)
ru: Округление размера запроса разделяемой памяти до числа, кратного размеру огромной страницы, когда огромные страницы используются в Linux (Том Лейн)

source: This avoids possible failures during <function>munmap()</function> on systems with atypical default huge page sizes. Except in crash-recovery cases, there were no ill effects other than a log message.
ru: Это позволяет избежать возможных сбоев в <function>munmap()</function> в системах с нетипичными размерами огромных страниц. За исключением случаев краха, эти сбои проявлялись только в сообщениях в журнале.

source: Don't try to share SSL contexts across multiple connections in <application>libpq</application> (Heikki Linnakangas)
ru: Не пытаться разделять контекст SSL между несколькими подключениями в <application>libpq</application> (Хейкки Линнакангас)

source: This led to assorted corner-case bugs, particularly when trying to use different SSL parameters for different connections.
ru: Такое разделение приводило к разнообразным ошибкам, особенно при попытке использования различных параметров SSL для разных соединений.

source: Avoid corner-case memory leak in <application>libpq</application> (Tom Lane)
ru: Предотвращение утечек памяти в особых случаях в <application>libpq</application> (Том Лейн)

source: The reported problem involved leaking an error report during <function>PQreset()</function>, but there might be related cases.
ru: Поступило сообщение об утечке в процессе <function>PQreset()</function>, но были возможны проявления и в связанных случаях.

source: In <application>pg_upgrade</application>, check library loadability in name order (Tom Lane)
ru: В <application>pg_upgrade</application> проверка загружаемости библиотек должна производиться по порядку имён (Том Лейн)

source: This is a workaround to deal with cross-extension dependencies from language transform modules to their base language and data type modules.
ru: Это обходное решение проблемы зависимостей между расширениями, образуемых связями модулей трансформации языков с базовыми модулями самих языков и типов данных.

source: Fix <application>pg_upgrade</application> to work correctly for extensions containing index access methods (Tom Lane)
ru: Исправление <application>pg_upgrade</application> для корректной работы с расширениями, содержащими методы доступа индексов (Том Лейн)

source: To allow this, the server has been extended to support <command>ALTER EXTENSION ADD/DROP ACCESS METHOD</command>. That functionality should have been included in the original patch to support dynamic creation of access methods, but it was overlooked.
ru: Чтобы это было возможно, для сервера была добавлена поддержка команды <command>ALTER EXTENSION ADD/DROP ACCESS METHOD</command>. Эта функциональность должна была добавляться в изначальной доработке, реализующей динамическое создание методов доступа, но этого не произошло по упущению.

source: Improve error reporting in <application>pg_upgrade</application>'s file copying/linking/rewriting steps (Tom Lane, &Aacute;lvaro Herrera)
ru: Улучшение вывода ошибок в <application>pg_upgrade</application> при копировании/создании ссылок/перезаписи (Том Лейн, Альваро Эррера)

source: Fix <application>pg_dump</application> to work against pre-7.4 servers (Amit Langote, Tom Lane)
ru: Исправление <application>pg_dump</application> для поддержки серверов версий до 7.4 (Амит Ланготе, Том Лейн)

source: Disallow specifying both <option>--source-server</option> and <option>--source-target</option> options to <application>pg_rewind</application> (Michael Banck)
ru: Недопущение одновременного указания аргументов <option>--source-server</option> и <option>--source-target</option> для <application>pg_rewind</application> (Михаэль Банк)

source: Make <application>pg_rewind</application> turn off <varname>synchronous_commit</varname> in its session on the source server (Michael Banck, Michael Paquier)
ru: Программа <application>pg_rewind</application> должна отключать <varname>synchronous_commit</varname> в своём сеансе на исходном сервере (Михаэль Банк, Мишель Пакье)

source: This allows <application>pg_rewind</application> to work even when the source server is using synchronous replication that is not working for some reason.
ru: При этом <application>pg_rewind</application> сможет работать, даже когда на исходном сервере настроена синхронная репликация, но она по какой-то причине не функционирует.

source: In <application>pg_xlogdump</application>, retry opening new WAL segments when using <option>--follow</option> option (Magnus Hagander)
ru: В <application>pg_xlogdump</application> нужно повторять попытку открыть новый сегмент WAL, когда используется параметр <option>--follow</option> (Магнус Хагандер)

source: This allows for a possible delay in the server's creation of the next segment.
ru: Это позволяет справиться с возможной задержкой при создании сервером следующего сегмента.

source: Fix <filename>contrib/pg_visibility</filename> to report the correct TID for a corrupt tuple that has been the subject of a rolled-back update (Tom Lane)
ru: Исправление в <filename>contrib/pg_visibility</filename>, чтобы выдавался корректный TID испорченного кортежа (ранее TID мог выдаваться некорректно вследствие изменения, впоследствии отменённого) (Том Лейн)

source: Fix makefile dependencies so that parallel make of <application>PL/Python</application> by itself will succeed reliably (Pavel Raiskup)
ru: Исправление зависимостей в makefile, чтобы параллельная сборка <application>PL/Python</application> сама по себе выполнялась надёжно (Павел Райскуп)

source: Update time zone data files to <application>tzdata</application> release 2016h for DST law changes in Palestine and Turkey, plus historical corrections for Turkey and some regions of Russia. Switch to numeric abbreviations for some time zones in Antarctica, the former Soviet Union, and Sri Lanka.
ru: Обновление данных часовых поясов до версии <application>tzdata</application> 2016h, включающее изменение правил перехода на летнее время в Палестине и Турции, а также исторические изменения для Турции и некоторых регионов России. Переход к числовым аббревиатурам для некоторых часовых поясов в Антарктике, бывшем Советском Союзе и на Шри-Ланке.

source: In this update, <literal>AMT</literal> is no longer shown as being in use to mean Armenia Time. Therefore, we have changed the <literal>Default</literal> abbreviation set to interpret it as Amazon Time, thus UTC-4 not UTC+4.
ru: Начиная с этого выпуска, аббревиатура <literal>AMT</literal> более не считается занятой часовым поясом Армении. Поэтому мы изменили значение этой аббревиатуры по умолчанию, чтобы она обозначала Амазонское время (Amazon Time), так что теперь она означает UTC-4, а не UTC+4.

source: Release 9.6
ru: Выпуск 9.6

source: Overview
ru: Обзор

source: Major enhancements in <productname>PostgreSQL</productname> 9.6 include:
ru: В число ключевых усовершенствований <productname>PostgreSQL</productname> 9.6 входят:

source: Parallel execution of sequential scans, joins and aggregates
ru: Параллельное выполнение последовательного сканирования, соединений и агрегатных вычислений

source: Avoid scanning pages unnecessarily during vacuum freeze operations
ru: Предупреждение излишнего сканирования страниц при операциях очистки с заморозкой

source: Synchronous replication now allows multiple standby servers for increased reliability
ru: При синхронной репликации стало возможным использовать несколько резервных серверов для увеличения надёжности

source: Full-text search can now search for phrases (multiple adjacent words)
ru: Полнотекстовый поиск теперь позволяет находить фразы (несколько соседних слов)

source: <filename>postgres_fdw</filename> now supports remote joins, sorts, <command>UPDATE</command>s, and <command>DELETE</command>s
ru: <filename>postgres_fdw</filename> теперь может выполнять на удалённой стороне соединение, сортировку, <command>UPDATE</command> и <command>DELETE</command>

source: Substantial performance improvements, especially in the area of scalability on multi-<acronym>CPU</acronym>-socket servers
ru: Существенное увеличение производительности, особенно в части масштабируемости на многопроцессорных серверах

source: The above items are explained in more detail in the sections below.
ru: Предыдущие пункты более подробно описаны в следующих разделах.

source: Migration to Version 9.6
ru: Миграция на версию 9.6

source: A dump/restore using <xref linkend="app-pg-dumpall"/>, or use of <xref linkend="pgupgrade"/>, is required for those wishing to migrate data from any previous release.
ru: Тем, кто хочет мигрировать данные из любой предыдущей версии, необходимо выполнить выгрузку/загрузку данных с помощью <xref linkend="app-pg-dumpall"/> или воспользоваться <xref linkend="pgupgrade"/>.

source: Version 9.6 contains a number of changes that may affect compatibility with previous releases. Observe the following incompatibilities:
ru: В версии 9.6 реализован ряд изменений, которые могут повлиять на совместимость с предыдущими выпусками. Рассмотрите следующие несовместимые аспекты:

source: Improve the <link linkend="pg-stat-activity-view"><structname>pg_stat_activity</structname></link> view's information about what a process is waiting for (Amit Kapila, Ildus Kurbangaliev)
ru: Добавление в <link linkend="pg-stat-activity-view"><structname>pg_stat_activity</structname></link> информации о том, чего ждёт процесс (Амит Капила, Ильдус Курбангалиев)
