Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.6.po
Languages: ru

source: In <application>PL/Tcl</application>, make database-reported errors return additional information in Tcl's <varname>errorCode</varname> global variable (Jim Nasby, Tom Lane)
ru: В <application>PL/Tcl</application> при возникновении ошибок базы данных теперь возвращается дополнительная информация в глобальной переменной Tcl <varname>errorCode</varname> (Джим Нэсби, Том Лейн)

source: This feature follows the Tcl convention for returning auxiliary data about an error.
ru: Это реализовано в соответствии с принятым Tcl соглашением о выдаче дополнительных сведений об ошибке.

source: Fix <application>PL/Tcl</application> to perform encoding conversion between the database encoding and <literal>UTF-8</literal>, which is what Tcl expects (Tom Lane)
ru: Исправление логики преобразования кодировки в <application>PL/Tcl</application>; строки в кодировке базы данных должны преобразовываться в <literal>UTF-8</literal> (кодировку, ожидаемую в Tcl) и обратно (Том Лейн)

source: Previously, strings were passed through without conversion, leading to misbehavior with non-<literal>ASCII</literal> characters when the database encoding was not <literal>UTF-8</literal>.
ru: Ранее строки передавались без преобразования, что приводило к проблемам с символами вне <literal>ASCII</literal>, когда кодировка базы была не <literal>UTF-8</literal>.

source: Client Interfaces
ru: Клиентские интерфейсы

source: Add a nonlocalized version of the <link linkend="protocol-error-fields">severity field</link> in error and notice messages (Tom Lane)
ru: Добавление нелокализуемой версии <link linkend="protocol-error-fields">поля серьёзности</link> в сообщения об ошибках и уведомления (Том Лейн)

source: This change allows client code to determine severity of an error or notice without having to worry about localized variants of the severity strings.
ru: Благодаря этому изменению клиентский код может определить уровень серьёзности ошибки или замечания, не имея дела с локализованными вариантами строки важности.

source: Introduce a feature in <application>libpq</application> whereby the <literal>CONTEXT</literal> field of messages can be suppressed, either always or only for non-error messages (Pavel Stehule)
ru: Введение в <application>libpq</application> средства подавления поля <literal>КОНТЕКСТ</literal> в сообщениях об ошибках, либо для всех, либо только для информационных сообщений (Павел Стехуле)

source: The default behavior of <link linkend="libpq-pqerrormessage"><function>PQerrorMessage()</function></link> is now to print <literal>CONTEXT</literal> only for errors. The new function <link linkend="libpq-pqseterrorcontextvisibility"><function>PQsetErrorContextVisibility()</function></link> can be used to adjust this.
ru: По умолчанию <link linkend="libpq-pqerrormessage"><function>PQerrorMessage()</function></link> теперь выводит <literal>КОНТЕКСТ</literal> только для ошибок. Для корректировки её поведения предназначена новая функция <link linkend="libpq-pqseterrorcontextvisibility"><function>PQsetErrorContextVisibility()</function></link>.

source: Add support in <application>libpq</application> for regenerating an error message with a different verbosity level (Alex Shulgin)
ru: Добавление в <application>libpq</application> возможности переформировать сообщение об ошибке с другим уровнем важности (Алексей Шульгин)

source: This is done with the new function <link linkend="libpq-pqresultverboseerrormessage"><function>PQresultVerboseErrorMessage()</function></link>. This supports <application>psql</application>'s new <literal>\errverbose</literal> feature, and may be useful for other clients as well.
ru: Данную возможность реализует новая функция <link linkend="libpq-pqresultverboseerrormessage"><function>PQresultVerboseErrorMessage()</function></link>. Это поддерживается новой командой <application>psql</application> <literal>\errverbose</literal> и может быть также полезно для других клиентов.

source: Improve <application>libpq</application>'s <link linkend="libpq-pqhost"><function>PQhost()</function></link> function to return useful data for default Unix-socket connections (Tom Lane)
ru: Усовершенствование функции <link linkend="libpq-pqhost"><function>PQhost()</function></link> в <application>libpq</application>, чтобы она возвращала полезную информацию при подключении к сокету Unix по умолчанию (Том Лейн)

source: Previously it would return <literal>NULL</literal> if no explicit host specification had been given; now it returns the default socket directory path.
ru: Ранее она возвращала <literal>NULL</literal> в отсутствие явного указания адреса узла; теперь она возвращает путь каталога сокетов по умолчанию.

source: Fix <application>ecpg</application>'s lexer to handle line breaks within comments starting on preprocessor directive lines (Michael Meskes)
ru: Исправление лексического анализатора <application>ecpg</application>, чтобы он корректно обрабатывал разрывы строк в комментариях, начинающихся в строках с директивами препроцессора (Михаэль Мескес)

source: Client Applications
ru: Клиентские приложения

source: Add a <option>--strict-names</option> option to <link linkend="app-pgdump"><application>pg_dump</application></link> and <link linkend="app-pgrestore"><application>pg_restore</application></link> (Pavel Stehule)
ru: Добавление флага <option>--strict-names</option> в <link linkend="app-pgdump"><application>pg_dump</application></link> и <link linkend="app-pgrestore"><application>pg_restore</application></link> (Павел Стехуле)

source: This option causes the program to complain if there is no match for a <option>-t</option> or <option>-n</option> option, rather than silently doing nothing.
ru: С этим флагом программа выдаст ошибку, не найдя объектов, заданных параметрами <option>-t</option> или <option>-n</option>, а не просто не будет ничего делать.

source: In <application>pg_dump</application>, dump locally-made changes of privilege assignments for system objects (Stephen Frost)
ru: В <application>pg_dump</application> реализована выгрузка локально изменённых назначений прав на системные объекты (Стивен Фрост)

source: While it has always been possible for a superuser to change the privilege assignments for built-in or extension-created objects, such changes were formerly lost in a dump and reload. Now, <application>pg_dump</application> recognizes and dumps such changes. (This works only when dumping from a 9.6 or later server, however.)
ru: Хотя суперпользователь всегда мог изменить назначения прав для встроенных или созданных расширениями объектов, после выгрузки/загрузки базы эти изменения терялись. Теперь <application>pg_dump</application> распознаёт такие назначения и выгружает их. (Однако это работает только при выгрузке данных с сервера 9.6 или новее.)

source: Allow <application>pg_dump</application> to dump non-extension-owned objects that are within an extension-owned schema (Mart&iacute;n Marqu&eacute;s)
ru: Теперь <application>pg_dump</application> может выгружать объекты, не принадлежащие расширениям, но находящиеся в принадлежащих им схемах (Мартин Маркиз)

source: Previously such objects were ignored because they were mistakenly assumed to belong to the extension owning their schema.
ru: Ранее такие объекты игнорировались, так как ошибочно считались принадлежащими расширению, которому принадлежала их схема.

source: In <application>pg_dump</application> output, include the table name in object tags for object types that are only uniquely named per-table (for example, triggers) (Peter Eisentraut)
ru: В выводе <application>pg_dump</application> добавлено имя таблицы в метки тех объектов, которые являются уникальными только в рамках таблицы (как, например, триггеры) (Питер Эйзентраут)

source: Support multiple <option>-c</option> and <option>-f</option> command-line options (Pavel Stehule, Catalin Iacob)
ru: Поддержка нескольких параметров командной строки <option>-c</option> и <option>-f</option> (Павел Стехуле, Каталин Якоб)

source: The specified operations are carried out in the order in which the options are given, and then <application>psql</application> terminates.
ru: Эти операции выполняются в том порядке, в каком передаются параметры, а затем <application>psql</application> завершается.

source: Add a <command>\crosstabview</command> command that prints the results of a query in a cross-tabulated display (Daniel V&eacute;rit&eacute;)
ru: Добавление команды <command>\crosstabview</command>, выводящей результаты запроса в виде перекрёстной таблицы (Даниэль Верите)

source: In the crosstab display, data values from one query result column are placed in a grid whose column and row headers come from other query result columns.
ru: В этом виде значения из одного столбца результата запроса располагаются в клетках таблицы, заголовки строк и столбцов которой поступают из других столбцов результата.

source: Add an <literal>\errverbose</literal> command that shows the last server error at full verbosity (Alex Shulgin)
ru: Добавление команды <literal>\errverbose</literal>, выводящей последнюю ошибку сервера с максимальной детализацией (Александр Шульгин)

source: This is useful after getting an unexpected error &mdash; you no longer need to adjust the <varname>VERBOSITY</varname> variable and recreate the failure in order to see error fields that are not shown by default.
ru: Этим удобно пользоваться при возникновении неожиданной ошибки &mdash; больше не нужно корректировать переменную <varname>VERBOSITY</varname> и повторно воспроизводить проблему, чтобы увидеть поля ошибки, которые не показываются по умолчанию.

source: Add <literal>\ev</literal> and <literal>\sv</literal> commands for editing and showing view definitions (Petr Korobeinikov)
ru: Добавление команд <literal>\ev</literal> и <literal>\sv</literal> для редактирования и просмотра определений представлений (Пётр Коробейников)

source: These are parallel to the existing <literal>\ef</literal> and <literal>\sf</literal> commands for functions.
ru: Эти команды соответствуют существующим командам <literal>\ef</literal> и <literal>\sf</literal> для функций.

source: Add a <command>\gexec</command> command that executes a query and re-submits the result(s) as new queries (Corey Huinker)
ru: Добавление команды <command>\gexec</command>, выполняющей запрос и передающей полученный результат на выполнение как тело нового запроса (Кори Хаинкер)

source: Allow <literal>\pset C <replaceable>string</replaceable></literal> to set the table title, for consistency with <literal>\C <replaceable>string</replaceable></literal> (Bruce Momjian)
ru: Команда <literal>\pset C <replaceable>строка</replaceable></literal> должна устанавливать заголовок таблицы, как это делает <literal>\C <replaceable>строка</replaceable></literal> (Брюс Момджян)

source: In <literal>\pset expanded auto</literal> mode, do not use expanded format for query results with only one column (Andreas Karlsson, Robert Haas)
ru: В режиме автоматического расширения (<literal>\pset expanded auto</literal>) не нужно применять широкий формат для запросов результата с всего одним столбцом (Андреас Карлсон, Роберт Хаас)

source: Improve the headers output by the <command>\watch</command> command (Michael Paquier, Tom Lane)
ru: Улучшение заголовков, выводимых командой <command>\watch</command> (Мишель Пакье, Том Лейн)

source: Include the <command>\pset title</command> string if one has been set, and shorten the prefabricated part of the header to be <literal><replaceable>timestamp</replaceable> (every <replaceable>N</replaceable>s)</literal>. Also, the timestamp format now obeys <application>psql</application>'s locale environment.
ru: Добавление названия, если оно было задано командой <command>\pset title</command>, и сокращение предустановленной части заголовка до <literal><replaceable>время</replaceable> (каждые <replaceable>N</replaceable> с)</literal>. При этом формат времени теперь определяется локалью из окружения <application>psql</application>.

source: Improve tab-completion logic to consider the entire input query, not only the current line (Tom Lane)
ru: Усовершенствование логики дополнения табуляцией, чтобы в рассмотрение принимался весь введённый запрос, а не только текущая строка (Том Лейн)

source: Previously, breaking a command into multiple lines defeated any tab completion rules that needed to see words on earlier lines.
ru: Ранее разбиение команды на несколько строк ломало все правила дополнения табуляцией, которым нужно было видеть слова в предыдущих строках.

source: Numerous minor improvements in tab-completion behavior (Peter Eisentraut, Vik Fearing, Kevin Grittner, Kyotaro Horiguchi, Jeff Janes, Andreas Karlsson, Fujii Masao, Thomas Munro, Masahiko Sawada, Pavel Stehule)
ru: Многочисленные улучшения механизма завершения табуляцией (Питер Эйзентраут, Вик Фиринг, Кевин Гриттнер, Киотаро Хоригучи, Джефф Джейнс, Андреас Карлсон, Фудзии Масао, Томас Мунро, Масахико Савада, Павел Стехуле)

source: Add a <literal>PROMPT</literal> option <literal>%p</literal> to insert the process ID of the connected backend (Julien Rouhaud)
ru: Добавление в формат приглашения <literal>PROMPT</literal> спецкода <literal>%p</literal> для отображения ID текущего обслуживающего процесса (Жульен Рохо)

source: Introduce a feature whereby the <literal>CONTEXT</literal> field of messages can be suppressed, either always or only for non-error messages (Pavel Stehule)
ru: Введение средства подавления поля <literal>КОНТЕКСТ</literal> в сообщения об ошибках, либо для всех, либо только для информационных сообщений (Павел Стехуле)

source: Printing <literal>CONTEXT</literal> only for errors is now the default behavior. This can be changed by setting the special variable <varname>SHOW_CONTEXT</varname>.
ru: Теперь по умолчанию <literal>КОНТЕКСТ</literal> выводится только для ошибок. И это можно изменить с помощью специальной переменной <varname>SHOW_CONTEXT</varname>.

source: Make <command>\df+</command> show function access privileges and parallel-safety attributes (Michael Paquier)
ru: Добавление в вывод <command>\df+</command> прав доступа к функции и характеристик распараллеливания (Мишель Пакье)

source: SQL commands in <application>pgbench</application> scripts are now ended by semicolons, not newlines (Kyotaro Horiguchi, Tom Lane)
ru: Команды SQL в <application>pgbench</application> теперь завершаются точкой с запятой, а не переводом строки (Киотаро Хоригучи, Том Лейн)

source: This change allows SQL commands in scripts to span multiple lines. Existing custom scripts will need to be modified to add a semicolon at the end of each line that does not have one already. (Doing so does not break the script for use with older versions of <application>pgbench</application>.)
ru: Благодаря этому изменению, команды SQL в скриптах могут располагаться на нескольких строках. Существующие нестандартные скрипты придётся подредактировать и добавить точку с запятой в конце каждой строки, если это не было сделано ранее. (Это не помешает использовать тот же скрипт со старыми версиями <application>pgbench</application>.)

source: Support floating-point arithmetic, as well as some <link linkend="pgbench-builtin-functions">built-in functions</link>, in expressions in backslash commands (Fabien Coelho)
ru: Поддержка арифметики с плавающей точкой, а также некоторых <link linkend="pgbench-builtin-functions">встроенных функций</link>, в выражениях команд с обратной косой чертой (Фабьен Коэльо)

source: Replace <command>\setrandom</command> with built-in functions (Fabien Coelho)
ru: Замена <command>\setrandom</command> встроенными функциями (Фабьен Коэльо)

source: The new built-in functions include <link linkend="pgbench-functions"><function>random()</function></link>, <function>random_exponential()</function>, and <function>random_gaussian()</function>, which perform the same work as <command>\setrandom</command>, but are easier to use since they can be embedded in larger expressions. Since these additions have made <command>\setrandom</command> obsolete, remove it.
ru: Новые встроенные функции <link linkend="pgbench-functions"><function>random()</function></link>, <function>random_exponential()</function> и <function>random_gaussian()</function> делают то же, что и <command>\setrandom</command>, но проще в использовании, так как их можно задействовать в более сложных выражениях. Так как в результате этого добавления команда <command>\setrandom</command> стала ненужной, она была ликвидирована.

source: Allow invocation of multiple copies of the built-in scripts, not only custom scripts (Fabien Coelho)
ru: Возможность многократно запускать и встроенные, а не только нестандартные скрипты (Фабьен Коэльо)

source: This is done with the new <option>-b</option> switch, which works similarly to <option>-f</option> for custom scripts.
ru: Для этого введён ключ <option>-b</option>, работающий подобно ключу <option>-f</option> для нестандартных скриптов.

source: Allow changing the selection probabilities (weights) for scripts (Fabien Coelho)
ru: Возможность изменения вероятностей выбора (весов) скриптов (Фабьен Коэльо)

source: When multiple scripts are specified, each <application>pgbench</application> transaction randomly chooses one to execute. Formerly this was always done with uniform probability, but now different selection probabilities can be specified for different scripts.
ru: Когда указывается несколько скриптов, какой из них будет выполняться, для каждой транзакции <application>pgbench</application> выбирается случайным образом. Ранее выбор каждого было равновероятен, но теперь для разных скриптов можно задать разные вероятности выбора.

source: Collect statistics for each script in a multi-script run (Fabien Coelho)
ru: Сбор статистики по каждому скрипту при запуске нескольких скриптов (Фабьен Коэльо)

source: This feature adds an intermediate level of detail to existing global and per-command statistics printouts.
ru: Это добавляет промежуточный уровень детализации к существующим двум — глобальной статистике и статистике в разрезе команд.

source: Add a <option>--progress-timestamp</option> option to report progress with Unix epoch timestamps, instead of time since the run started (Fabien Coelho)
ru: Добавление параметра <option>--progress-timestamp</option> для вывода текущего времени эпохи Unix вместо времени с момента запуска теста (Фабьен Коэльо)

source: Allow the number of client connections (<option>-c</option>) to not be an exact multiple of the number of threads (<option>-j</option>) (Fabien Coelho)
ru: Возможность устанавливать число клиентских соединений (<option>-c</option>), не кратное количеству потоков (<option>-j</option>) (Фабьен Коэльо)

source: When the <option>-T</option> option is used, stop promptly at the end of the specified time (Fabien Coelho)
ru: Когда задаётся параметр <option>-T</option>, завершать работу именно по истечении заданного времени (Фабьен Коэльо)

source: Previously, specifying a low transaction rate could cause <application>pgbench</application> to wait significantly longer than specified.
ru: Ранее, если выбиралась низкая частота транзакций, программа <application>pgbench</application> могла ждать значительно дольше заданного времени.

source: Server Applications
ru: Серверные приложения

source: Improve error reporting during <application>initdb</application>'s post-bootstrap phase (Tom Lane)
ru: Улучшение вывода ошибок в <application>initdb</application> на стадии после начальной инициализации (Том Лейн)

source: Previously, an error here led to reporting the entire input file as the <quote>failing query</quote>; now just the current query is reported. To get the desired behavior, queries in <application>initdb</application>'s input files must be separated by blank lines.
ru: Ранее при возникновении ошибок в качестве <quote>ошибочного запроса</quote> выдавался весь входной файл; теперь выдаётся только текущий запрос. Чтобы получить желаемое поведение, теперь запросы во входных файлах <application>initdb</application> нужно разделять пустыми строками.

source: Speed up <application>initdb</application> by using just one standalone-backend session for all the post-bootstrap steps (Tom Lane)
ru: Ускорение <application>initdb</application> благодаря использованию только одного серверного сеанса для всех операций после инициализации (Том Лейн)

source: Improve <link linkend="app-pgrewind"><application>pg_rewind</application></link> so that it can work when the target timeline changes (Alexander Korotkov)
ru: Усовершенствование программы <link linkend="app-pgrewind"><application>pg_rewind</application></link>, чтобы она могла работать при изменении целевой линии времени (Александр Коротков)

source: This allows, for example, rewinding a promoted standby back to some state of the old master's timeline.
ru: Это позволяет, например, перемотать повышенный резервный сервер к какому-то предыдущему состоянию на линии времени прежнего главного сервера.

source: Source Code
ru: Исходный код

source: Remove obsolete <function>heap_formtuple</function>/<function>heap_modifytuple</function>/<function>heap_deformtuple</function> functions (Peter Geoghegan)
ru: Удаление устаревших функций <function>heap_formtuple</function>/<function>heap_modifytuple</function>/<function>heap_deformtuple</function> (Питер Геохеган)

source: Add macros to make <function>AllocSetContextCreate()</function> calls simpler and safer (Tom Lane)
ru: Добавление макросов, призванных сделать вызовы <function>AllocSetContextCreate()</function> проще и безопаснее (Том Лейн)

source: Writing out the individual sizing parameters for a memory context is now deprecated in favor of using one of the new macros <symbol>ALLOCSET_DEFAULT_SIZES</symbol>, <symbol>ALLOCSET_SMALL_SIZES</symbol>, or <symbol>ALLOCSET_START_SMALL_SIZES</symbol>. Existing code continues to work, however.
ru: Теперь указание индивидуальных параметров размера для контекста памяти считается устаревшим в пользу использования одного из новых макросов <symbol>ALLOCSET_DEFAULT_SIZES</symbol>, <symbol>ALLOCSET_SMALL_SIZES</symbol> или <symbol>ALLOCSET_START_SMALL_SIZES</symbol>. Однако существующий код будет работать по-прежнему.

source: Unconditionally use <literal>static inline</literal> functions in header files (Andres Freund)
ru: Безусловное использование функций <literal>static inline</literal> в заголовочных файлах (Андрес Фройнд)

source: This may result in warnings and/or wasted code space with very old compilers, but the notational improvement seems worth it.
ru: Это может привести к предупреждениям или генерации лишнего кода с очень старыми компиляторами, но упрощение записи стоит того.

source: Improve <application>TAP</application> testing infrastructure (Michael Paquier, Craig Ringer, &Aacute;lvaro Herrera, Stephen Frost)
ru: Усовершенствование инфраструктуры тестирования <application>TAP</application> (Мишель Пакье, Крейг Рингер, Альваро Эррера, Стивен Фрост)

source: Notably, it is now possible to test recovery scenarios using this infrastructure.
ru: А именно, теперь эта инфраструктура позволяет тестировать сценарии восстановления.

source: Make <varname>trace_lwlocks</varname> identify individual locks by name (Robert Haas)
ru: Когда используется <varname>trace_lwlocks</varname>, идентифицировать отдельные блокировки по имени (Роберт Хаас)

source: Improve <application>psql</application>'s tab-completion code infrastructure (Thomas Munro, Michael Paquier)
ru: Улучшение инфраструктуры <application>psql</application>, обеспечивающей дополнение кода табуляцией (Томас Мунро, Мишель Пакье)

source: Tab-completion rules are now considerably easier to write, and more compact.
ru: Правила дополнения табуляцией стали компактнее и писать их стало легче.
