Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.5.po
Languages: ru

source: Reduce lock levels of some create and alter trigger and foreign key commands (Simon Riggs, Andreas Karlsson)
ru: Снижение уровней блокировки для некоторых команд, управляющих триггерами и сторонними ключами (Саймон Риггс, Андреас Карлсон)

source: Allow <link linkend="sql-lock"><command>LOCK TABLE ... ROW EXCLUSIVE MODE</command></link> for those with <command>INSERT</command> privileges on the target table (Stephen Frost)
ru: Разрешение использовать <link linkend="sql-lock"><command>LOCK TABLE ... ROW EXCLUSIVE MODE</command></link> тем, кто имеет право <command>INSERT</command> в целевой таблице (Стивен Фрост)

source: Previously this command required <command>UPDATE</command>, <command>DELETE</command>, or <command>TRUNCATE</command> privileges.
ru: Ранее для этой команды требовалось право <command>UPDATE</command>, <command>DELETE</command> или <command>TRUNCATE</command>.

source: Apply table and domain <literal>CHECK</literal> constraints in order by name (Tom Lane)
ru: Применение ограничений <literal>CHECK</literal> для таблицы и домена в алфавитном порядке имён (Том Лейн)

source: The previous ordering was indeterminate.
ru: Ранее порядок был недетерминированным.

source: Allow <link linkend="sql-createdatabase"><command>CREATE</command></link>/<link linkend="sql-alterdatabase"><command>ALTER DATABASE</command></link> to manipulate <structname>datistemplate</structname> and <structname>datallowconn</structname> (Vik Fearing)
ru: Добавление в <link linkend="sql-createdatabase"><command>CREATE</command></link>/<link linkend="sql-alterdatabase"><command>ALTER DATABASE</command></link> возможности управлять свойствами <structname>datistemplate</structname> и <structname>datallowconn</structname> (Вик Фиринг)

source: This allows these per-database settings to be changed without manually modifying the <link linkend="catalog-pg-database"><structname>pg_database</structname></link> system catalog.
ru: Это позволяет задавать/изменять эти параметры, не модифицируя вручную системный каталог <link linkend="catalog-pg-database"><structname>pg_database</structname></link>.

source: <link linkend="ddl-foreign-data">Foreign Tables</link>
ru: <link linkend="ddl-foreign-data">Сторонние таблицы</link>

source: Add support for <xref linkend="sql-importforeignschema"/> (Ronan Dunklau, Michael Paquier, Tom Lane)
ru: Добавление поддержки <xref linkend="sql-importforeignschema"/> (Ронан Данклау, Мишель Пакье, Том Лейн)

source: This command allows automatic creation of local foreign tables that match the structure of existing tables on a remote server.
ru: Эта команда позволяет автоматически создать локальные сторонние таблицы с той же структурой, что имеют таблицы на удалённом сервере.

source: Allow <literal>CHECK</literal> constraints to be placed on foreign tables (Shigeru Hanada, Etsuro Fujita)
ru: Возможность определения ограничений <literal>CHECK</literal> для сторонних таблиц (Шигеру Ханада, Эцуро Фудзита)

source: Such constraints are assumed to be enforced on the remote server, and are not enforced locally. However, they are assumed to hold for purposes of query optimization, such as <link linkend="ddl-partitioning-constraint-exclusion">constraint exclusion</link>.
ru: Такие ограничения считаются контролируемыми на удалённом сервере, а не локально. Однако для оптимизации запросов предполагается, что они удовлетворяются, как например при <link linkend="ddl-partitioning-constraint-exclusion">исключении по ограничению</link>.

source: Allow foreign tables to participate in inheritance (Shigeru Hanada, Etsuro Fujita)
ru: Возможность включать сторонние таблицы в иерархии наследования (Шигеру Ханада, Эцуро Фудзита)

source: To let this work naturally, foreign tables are now allowed to have check constraints marked as not valid, and to set storage and <type>OID</type> characteristics, even though these operations are effectively no-ops for a foreign table.
ru: Чтобы это работало естественным образом, в сторонних таблицах теперь допускаются ограничения-проверки, помечаемые как недействительные, и могут задаваться характеристики хранения и <type>OID</type>, хотя по сути это никак не влияет на стороннюю таблицу.

source: Allow foreign data wrappers and custom scans to implement join pushdown (KaiGai Kohei)
ru: Обёртки сторонних данных и методы нестандартного сканирования обрели возможность выносить соединения наружу (КайГай Кохей)

source: <link linkend="event-triggers">Event Triggers</link>
ru: <link linkend="event-triggers">Событийные триггеры</link>

source: Whenever a <literal>ddl_command_end</literal> event trigger is installed, capture details of <acronym>DDL</acronym> activity for it to inspect (&Aacute;lvaro Herrera)
ru: Для устанавливаемого событийного триггера <literal>ddl_command_end</literal> собираются сведения об активности <acronym>DDL</acronym>, которые могут быть ему полезны (Альваро Эррера)

source: This information is available through a set-returning function <link linkend="pg-event-trigger-ddl-command-end-functions"><function>pg_event_trigger_ddl_commands()</function></link>, or by inspection of C data structures if that function doesn't provide enough detail.
ru: Эти сведения можно получить через возвращающую множество функцию <link linkend="pg-event-trigger-ddl-command-end-functions"><function>pg_event_trigger_ddl_commands()</function></link> или через структуры данных C, если результат этой функции недостаточно детализирован.

source: Allow event triggers on table rewrites caused by <link linkend="sql-altertable"><command>ALTER TABLE</command></link> (Dimitri Fontaine)
ru: Возможность реагирования в событийных триггерах на перезапись таблицы, вызываемую операцией <link linkend="sql-altertable"><command>ALTER TABLE</command></link> (Димитри Фонтейн)

source: Add event trigger support for database-level <link linkend="sql-comment"><command>COMMENT</command></link>, <link linkend="sql-security-label"><command>SECURITY LABEL</command></link>, and <link linkend="sql-grant"><command>GRANT</command></link>/<link linkend="sql-revoke"><command>REVOKE</command></link> (&Aacute;lvaro Herrera)
ru: Добавление поддержки событийных триггеров для команд <link linkend="sql-comment"><command>COMMENT</command></link>, <link linkend="sql-security-label"><command>SECURITY LABEL</command></link> и <link linkend="sql-grant"><command>GRANT</command></link>/<link linkend="sql-revoke"><command>REVOKE</command></link> уровня базы данных (Альваро Эррера)

source: Add columns to the output of <link linkend="pg-event-trigger-sql-drop-functions"><function>pg_event_trigger_dropped_objects</function></link> (&Aacute;lvaro Herrera)
ru: Добавление столбцов в вывод <link linkend="pg-event-trigger-sql-drop-functions"><function>pg_event_trigger_dropped_objects</function></link> (Альваро Эррера)

source: This allows simpler processing of delete operations.
ru: Это позволяет упростить обработку операций удаления.

source: Data Types
ru: Типы данных

source: Allow the <link linkend="datatype-xml"><type>xml</type></link> data type to accept empty or all-whitespace content values (Peter Eisentraut)
ru: Возможность записать в тип <link linkend="datatype-xml"><type>xml</type></link> пустое или состоящее только из пробельных символов значение (Питер Эйзентраут)

source: This is required by the <acronym>SQL</acronym>/<acronym>XML</acronym> specification.
ru: Это требуется стандартом <acronym>SQL</acronym>/<acronym>XML</acronym>.

source: Allow <link linkend="datatype-macaddr"><type>macaddr</type></link> input using the format <literal>xxxx-xxxx-xxxx</literal> (Herwin Weststrate)
ru: Возможность ввода в <link linkend="datatype-macaddr"><type>macaddr</type></link> значений в формате <literal>xxxx-xxxx-xxxx</literal> (Хервин Вестстрате)

source: Disallow non-SQL-standard syntax for <link linkend="datatype-interval-input"><type>interval</type></link> with both precision and field specifications (Bruce Momjian)
ru: Запрещение несоответствующего стандарту SQL синтаксиса <link linkend="datatype-interval-input"><type>interval</type></link> с указанием одновременно полей и точности (Брюс Момджян)

source: Per the standard, such type specifications should be written as, for example, <literal>INTERVAL MINUTE TO SECOND(2)</literal>. <productname>PostgreSQL</productname> formerly allowed this to be written as <literal>INTERVAL(2) MINUTE TO SECOND</literal>, but it must now be written in the standard way.
ru: Пр стандарту такие значения этого типа должны записываться, например, как <literal>INTERVAL MINUTE TO SECOND(2)</literal>. В <productname>PostgreSQL</productname> ранее допускалась запись <literal>INTERVAL(2) MINUTE TO SECOND</literal>, но теперь принимается только стандартный способ.

source: Add selectivity estimators for <link linkend="datatype-inet"><type>inet</type></link>/<link linkend="datatype-cidr"><type>cidr</type></link> operators and improve estimators for text search functions (Emre Hasegeli, Tom Lane)
ru: Добавление оценки избирательности для операторов <link linkend="datatype-inet"><type>inet</type></link>/<link linkend="datatype-cidr"><type>cidr</type></link> и улучшение оценки для функций текстового поиска (Эмре Хасегели, Том Лейн)

source: Add data types <link linkend="datatype-oid-table"><type>regrole</type></link> and <link linkend="datatype-oid-table"><type>regnamespace</type></link> to simplify entering and pretty-printing the <type>OID</type> of a role or namespace (Kyotaro Horiguchi)
ru: Добавление типов данных <link linkend="datatype-oid-table"><type>regrole</type></link> и <link linkend="datatype-oid-table"><type>regnamespace</type></link> для упрощения ввода и улучшенного вывода <type>OID</type> ролей и пространств имён (Киотаро Хоригучи)

source: Add <type>jsonb</type> functions <link linkend="functions-json-processing-table"><function>jsonb_set()</function></link> and <link linkend="functions-json-processing-table"><function>jsonb_pretty()</function></link> (Dmitry Dolgov, Andrew Dunstan, Petr Jel&iacute;nek)
ru: Добавление для типа <type>jsonb</type> функций <link linkend="functions-json-processing-table"><function>jsonb_set()</function></link> и <link linkend="functions-json-processing-table"><function>jsonb_pretty()</function></link> (Дмитрий Долгов, Эндрю Дунстан, Петр Желинек)

source: Add <type>jsonb</type> generator functions <link linkend="functions-json-creation-table"><function>to_jsonb()</function></link>, <link linkend="functions-json-creation-table"><function>jsonb_object()</function></link>, <link linkend="functions-json-creation-table"><function>jsonb_build_object()</function></link>, <link linkend="functions-json-creation-table"><function>jsonb_build_array()</function></link>, <link linkend="functions-aggregate-table"><function>jsonb_agg()</function></link>, and <link linkend="functions-aggregate-table"><function>jsonb_object_agg()</function></link> (Andrew Dunstan)
ru: Добавление функций, формирующих <type>jsonb</type>: <link linkend="functions-json-creation-table"><function>to_jsonb()</function></link>, <link linkend="functions-json-creation-table"><function>jsonb_object()</function></link>, <link linkend="functions-json-creation-table"><function>jsonb_build_object()</function></link>, <link linkend="functions-json-creation-table"><function>jsonb_build_array()</function></link>, <link linkend="functions-aggregate-table"><function>jsonb_agg()</function></link> и <link linkend="functions-aggregate-table"><function>jsonb_object_agg()</function></link> (Эндрю Дунстан)

source: Equivalent functions already existed for type <type>json</type>.
ru: Аналогичные функции уже имелись для типа <type>json</type>.

source: Reduce casting requirements to/from <link linkend="datatype-json"><type>json</type></link> and <link linkend="datatype-json"><type>jsonb</type></link> (Tom Lane)
ru: Снижение требований для преобразований в/из <link linkend="datatype-json"><type>json</type></link> и <link linkend="datatype-json"><type>jsonb</type></link> (Том Лейн)

source: Allow <type>text</type>, <type>text</type> array, and <type>integer</type> values to be <link linkend="functions-jsonb-op-table">subtracted</link> from <type>jsonb</type> documents (Dmitry Dolgov, Andrew Dunstan)
ru: Возможность <link linkend="functions-jsonb-op-table">вычитать</link> из документов <type>jsonb</type> значения типов <type>integer</type>, <type>text</type> и массивы <type>text</type> (Дмитрий Долгов, Эндрю Дунстан)

source: Add <type>jsonb</type> <link linkend="functions-jsonb-op-table"><literal>||</literal></link> operator (Dmitry Dolgov, Andrew Dunstan)
ru: Добавление для типа <type>jsonb</type> оператора <link linkend="functions-jsonb-op-table"><literal>||</literal></link> (Дмитрий Долгов, Эндрю Дунстан)

source: Add <link linkend="functions-json-processing-table"><function>json_strip_nulls()</function></link> and <link linkend="functions-json-processing-table"><function>jsonb_strip_nulls()</function></link> functions to remove JSON null values from documents (Andrew Dunstan)
ru: Добавление функций <link linkend="functions-json-processing-table"><function>json_strip_nulls()</function></link> и <link linkend="functions-json-processing-table"><function>jsonb_strip_nulls()</function></link> для удаления значений null из документов JSON (Эндрю Дунстан)

source: Functions
ru: Функции

source: Add <link linkend="functions-srf"><function>generate_series()</function></link> for <type>numeric</type> values (Plato Malugin)
ru: Добавление <link linkend="functions-srf"><function>generate_series()</function></link> для значений <type>numeric</type> (Плато Малугин)

source: Allow <link linkend="functions-aggregate-table"><function>array_agg()</function></link> and <function>ARRAY()</function> to take arrays as inputs (Ali Akbar, Tom Lane)
ru: Возможность передавать массив на вход <link linkend="functions-aggregate-table"><function>array_agg()</function></link> и <function>ARRAY()</function> (Али Акбар, Том Лейн)

source: Add functions <link linkend="array-functions-table"><function>array_position()</function></link> and <link linkend="array-functions-table"><function>array_positions()</function></link> to return subscripts of array values (Pavel Stehule)
ru: Добавление функций <link linkend="array-functions-table"><function>array_position()</function></link> и <link linkend="array-functions-table"><function>array_positions()</function></link>, возвращающих позиции значений в массиве (Павел Стехуле)

source: Add a <type>point</type>-to-<type>polygon</type> distance operator <link linkend="functions-geometry-op-table">&lt;-&gt;</link> (Alexander Korotkov)
ru: Добавление оператора дистанции от точки до многоугольника (<type>point</type>-<type>polygon</type>) <link linkend="functions-geometry-op-table">&lt;-&gt;</link> (Александр Коротков)

source: Allow multibyte characters as escapes in <link linkend="functions-similarto-regexp"><literal>SIMILAR TO</literal></link> and <link linkend="functions-string-sql"><literal>SUBSTRING</literal></link> (Jeff Davis)
ru: Возможность использовать в качестве спецсимволов в <link linkend="functions-similarto-regexp"><literal>SIMILAR TO</literal></link> и <link linkend="functions-string-sql"><literal>SUBSTRING</literal></link> многобайтовых символов (Джефф Девис)

source: Previously, only a single-byte character was allowed as an escape.
ru: Ранее в качестве спецсимвола можно было выбрать только однобайтовый символ.

source: Add a <link linkend="functions-math-func-table"><function>width_bucket()</function></link> variant that supports any sortable data type and non-uniform bucket widths (Petr Jel&iacute;nek)
ru: Добавление вариации <link linkend="functions-math-func-table"><function>width_bucket()</function></link>, поддерживающей любой упорядочиваемый тип данных и группы неодинаковой ширины (Петр Желинек)

source: Add an optional <replaceable>missing_ok</replaceable> argument to <link linkend="functions-admin-genfile-table"><function>pg_read_file()</function></link> and related functions (Michael Paquier, Heikki Linnakangas)
ru: Добавление необязательного аргумента <replaceable>missing_ok</replaceable> в <link linkend="functions-admin-genfile-table"><function>pg_read_file()</function></link> и связанные функции (Мишель Пакье, Хейкки Линнакангас)

source: Allow <link linkend="sql-syntax-calling-funcs"><literal>=&gt;</literal></link> to specify named parameters in function calls (Pavel Stehule)
ru: Введение конструкции <link linkend="sql-syntax-calling-funcs"><literal>=&gt;</literal></link>, позволяющей задать значения именованных параметров в вызовах функций (Павел Стехуле)

source: Previously only <literal>:=</literal> could be used. This requires removing the possibility for <literal>=&gt;</literal> to be a user-defined operator. Creation of user-defined <literal>=&gt;</literal> operators has been issuing warnings since PostgreSQL 9.0.
ru: Ранее присвоение значения записывалось только с конструкцией <literal>:=</literal>. Это потребовало запретить создание пользовательского оператора <literal>=&gt;</literal>. При создании пользовательских операторов <literal>=&gt;</literal> до этого выдавались предупреждения (начиная с PostgreSQL 9.0).

source: Add <acronym>POSIX</acronym>-compliant rounding for platforms that use PostgreSQL-supplied rounding functions (Pedro Gimeno Fortea)
ru: Добавление <acronym>POSIX</acronym>-совместимого округления для платформ, где используются функции округления, предоставляемые PostgreSQL (Педро Химено Фортеа)

source: System Information Functions and Views
ru: Системные информационные функции и представления

source: Add function <link linkend="functions-info-object-table"><function>pg_get_object_address()</function></link> to return <type>OID</type>s that uniquely identify an object, and function <link linkend="functions-info-object-table"><function>pg_identify_object_as_address()</function></link> to return object information based on <type>OID</type>s (&Aacute;lvaro Herrera)
ru: Добавление функции <link linkend="functions-info-object-table"><function>pg_get_object_address()</function></link>, возвращающей набор <type>OID</type>, однозначно идентифицирующих объект, и функции <link linkend="functions-info-object-table"><function>pg_identify_object_as_address()</function></link>, возвращающей информацию об объекте по этим <type>OID</type> (Альваро Эррера)

source: Loosen security checks for viewing queries in <link linkend="pg-stat-activity-view"><structname>pg_stat_activity</structname></link>, executing <link linkend="functions-admin-signal-table"><function>pg_cancel_backend()</function></link>, and executing <link linkend="functions-admin-signal-table"><function>pg_terminate_backend()</function></link> (Stephen Frost)
ru: Ослабление ограничений безопасности при просмотре запросов в <link linkend="pg-stat-activity-view"><structname>pg_stat_activity</structname></link> и вызове функций <link linkend="functions-admin-signal-table"><function>pg_cancel_backend()</function></link> и <link linkend="functions-admin-signal-table"><function>pg_terminate_backend()</function></link> (Стивен Фрост)

source: Previously, only the specific role owning the target session could perform these operations; now membership in that role is sufficient.
ru: Ранее эти операции могли выполнять только роли, которым непосредственно принадлежит целевой сеанс; теперь достаточно быть членом такой роли.

source: Add <link linkend="monitoring-stats-funcs-table"><function>pg_stat_get_snapshot_timestamp()</function></link> to output the time stamp of the statistics snapshot (Matt Kelly)
ru: Добавление функции <link linkend="monitoring-stats-funcs-table"><function>pg_stat_get_snapshot_timestamp()</function></link>, выдающей время снимка статистики (Мэтт Келли)

source: This represents the last time the snapshot file was written to the file system.
ru: Это время показывает, когда в последний раз файл снимка записывался в файловую систему.

source: Add <link linkend="vacuum-for-multixact-wraparound"><function>mxid_age()</function></link> to compute multi-xid age (Bruce Momjian)
ru: Добавление функции <link linkend="vacuum-for-multixact-wraparound"><function>mxid_age()</function></link>, вычисляющей возраст мультитранзакций (Брюс Момджян)

source: Aggregates
ru: Агрегатные функции

source: Add <function>min()</function>/<function>max()</function> aggregates for <link linkend="datatype-inet"><type>inet</type></link>/<link linkend="datatype-cidr"><type>cidr</type></link> data types (Haribabu Kommi)
ru: Добавление агрегатных функций <function>min()</function>/<function>max()</function> для типов данных <link linkend="datatype-inet"><type>inet</type></link>/<link linkend="datatype-cidr"><type>cidr</type></link> (Харибабу Комми)

source: Use 128-bit integers, where supported, as accumulators for some aggregate functions (Andreas Karlsson)
ru: Использование 128-битных целых, где они поддерживаются, для накопления значений в некоторых агрегатных функциях (Андреас Карлсон)

source: Server-Side Languages
ru: Языки программирования на стороне сервера

source: Improve support for composite types in <link linkend="plpython"><application>PL/Python</application></link> (Ed Behn, Ronan Dunklau)
ru: Улучшение поддержки составных типов в <link linkend="plpython"><application>PL/Python</application></link> (Эд Бен, Ронан Данклау)

source: This allows <application>PL/Python</application> functions to return arrays of composite types.
ru: Это позволяет возвращать из функций на <application>PL/Python</application> массивы составных типов.

source: Reduce lossiness of <link linkend="plpython"><application>PL/Python</application></link> floating-point value conversions (Marko Kreen)
ru: Уменьшение неточности при преобразовании значений с плавающей точкой в <link linkend="plpython"><application>PL/Python</application></link> (Марко Крин)

source: Allow specification of conversion routines between <acronym>SQL</acronym> data types and data types of procedural languages (Peter Eisentraut)
ru: Возможность определения функций преобразования между типами данных <acronym>SQL</acronym> и типами данных процедурных языков (Питер Эйзентраут)

source: This change adds new commands <link linkend="sql-createtransform"><command>CREATE</command></link>/<link linkend="sql-droptransform"><command>DROP TRANSFORM</command></link>. This also adds optional transformations between the <link linkend="hstore"><application>hstore</application></link> and <link linkend="ltree"><application>ltree</application></link> types to/from <link linkend="plperl"><application>PL/Perl</application></link> and <link linkend="plpython"><application>PL/Python</application></link>.
ru: Это изменение привносит команды <link linkend="sql-createtransform"><command>CREATE</command></link>/<link linkend="sql-droptransform"><command>DROP TRANSFORM</command></link>. Также с ним добавлены дополнительные трансформации типов <link linkend="hstore"><application>hstore</application></link> и <link linkend="ltree"><application>ltree</application></link> из/в типы языков <link linkend="plperl"><application>PL/Perl</application></link> и <link linkend="plpython"><application>PL/Python</application></link>.

source: <link linkend="plpgsql">PL/pgSQL</link> Server-Side Language
ru: Серверный язык <link linkend="plpgsql">PL/pgSQL</link>

source: Improve <link linkend="plpgsql"><application>PL/pgSQL</application></link> array performance (Tom Lane)
ru: Улучшение производительности массивов <link linkend="plpgsql"><application>PL/pgSQL</application></link> (Том Лейн)

source: Add an <link linkend="plpgsql-statements-assert"><command>ASSERT</command></link> statement in <application>PL/pgSQL</application> (Pavel Stehule)
ru: Добавление оператора <link linkend="plpgsql-statements-assert"><command>ASSERT</command></link> в <application>PL/pgSQL</application> (Павел Стехуле)
