Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.5.po
Languages: ru

source: Release 9.5.7
ru: Выпуск 9.5.7

source: Release Date
ru: Дата выпуска

source: This release contains a variety of fixes from 9.5.6. For information about new features in the 9.5 major release, see <xref linkend="release-9-5"/>.
ru: В этот выпуск вошли различные исправления, внесённые после версии 9.5.6. За информацией о нововведениях версии 9.5 обратитесь к <xref remap="3" linkend="release-9-5"/>.

source: Migration to Version 9.5.7
ru: Миграция на версию 9.5.7

source: A dump/restore is not required for those running 9.5.X.
ru: Если используется версия 9.5.X, выгрузка/восстановление базы не требуется.

source: However, if you use foreign data servers that make use of user passwords for authentication, see the first changelog entry below.
ru: Однако, если вы используете сторонние серверы данных, на которых для проверки подлинности применяются пароли, прочитайте ниже первую запись в списке изменений.

source: Also, if you are using third-party replication tools that depend on <quote>logical decoding</quote>, see the fourth changelog entry below.
ru: А если вы используете сторонние средства репликации, основанные на <quote>логическом декодировании</quote>, обратите внимание на четвёртую запись в списке изменений.

source: Also, if you are upgrading from a version earlier than 9.5.6, see <xref linkend="release-9-5-6"/>.
ru: Также, если вы обновляете сервер с версии, более ранней, чем 9.5.6, см. <xref remap="4" linkend="release-9-5-6"/>.

source: Changes
ru: Изменения

source: Restrict visibility of <structname>pg_user_mappings</structname>.<structfield>umoptions</structfield>, to protect passwords stored as user mapping options (Michael Paquier, Feike Steenbergen)
ru: Ограничение видимости <structname>pg_user_mappings</structname>.<structfield>umoptions</structfield> для защиты паролей, сохранённых в свойствах сопоставлений пользователей (Мишель Пакье, Фейке Стинберген)

source: The previous coding allowed the owner of a foreign server object, or anyone he has granted server <literal>USAGE</literal> permission to, to see the options for all user mappings associated with that server. This might well include passwords for other users. Adjust the view definition to match the behavior of <structname>information_schema.user_mapping_options</structname>, namely that these options are visible to the user being mapped, or if the mapping is for <literal>PUBLIC</literal> and the current user is the server owner, or if the current user is a superuser. (CVE-2017-7486)
ru: Предыдущая реализация позволяла владельцу объекта стороннего сервера или любому, кто получил право <literal>USAGE</literal>, видеть свойства всех сопоставлений, связанных с этим сервером. В том числе это могли быть и пароли других пользователей. Теперь определение данного представления изменено для соответствия поведению <structname>information_schema.user_mapping_options</structname>, так что эти свойства может прочитать только собственно пользователь сопоставления либо, если это сопоставление роли <literal>PUBLIC</literal>, владелец сервера, либо суперпользователь. (CVE-2017-7486)

source: By itself, this patch will only fix the behavior in newly initdb'd databases. If you wish to apply this change in an existing database, you will need to do the following:
ru: Само по себе это исправление корректирует поведение только в новых базах данных, создаваемых initdb. Если вы хотите применить это исправление к существующей базе данных, вам нужно будет проделать следующие действия:

source: Restart the postmaster after adding <literal>allow_system_table_mods = true</literal> to <filename>postgresql.conf</filename>. (In versions supporting <command>ALTER SYSTEM</command>, you can use that to make the configuration change, but you'll still need a restart.)
ru: Добавьте <literal>allow_system_table_mods = true</literal> в <filename>postgresql.conf</filename> и перезапустите сервер. (В версиях, поддерживающих <command>ALTER SYSTEM</command>, вы можете воспользоваться этой командой для изменения конфигурации, но перезапустить сервер потребуется всё равно.)

source: In <emphasis>each</emphasis> database of the cluster, run the following commands as superuser: <placeholder-1/>
ru: В <emphasis>каждой</emphasis> базе данных кластера выполните от имени суперпользователя следующие команды: <placeholder-1/>

source: Do not forget to include the <literal>template0</literal> and <literal>template1</literal> databases, or the vulnerability will still exist in databases you create later. To fix <literal>template0</literal>, you'll need to temporarily make it accept connections. In <productname>PostgreSQL</productname> 9.5 and later, you can use <placeholder-1/> and then after fixing <literal>template0</literal>, undo that with <placeholder-2/> In prior versions, instead use <placeholder-3/>
ru: Не забудьте внести коррективы в базах данных <literal>template0</literal> и <literal>template1</literal>, в противном случае уязвимость сохранится в базах, которые будут создаваться впоследствии. Чтобы поправить <literal>template0</literal>, вам потребуется временно разрешить подключения к ней. В <productname>PostgreSQL</productname> 9.5 и новее вы можете выполнить <placeholder-1/>, а внеся поправку в <literal>template0</literal>, восстановить прежнее состояние командой <placeholder-2/> В более ранних версиях вместо этого используйте пару команд <placeholder-3/>

source: Finally, remove the <literal>allow_system_table_mods</literal> configuration setting, and again restart the postmaster.
ru: В заключение удалите параметр конфигурации <literal>allow_system_table_mods</literal> и ещё раз перезапустите postmaster.

source: Prevent exposure of statistical information via leaky operators (Peter Eisentraut)
ru: Предотвращение утечки статистической информации через негерметичные операторы (Питер Эйзентраут)

source: Some selectivity estimation functions in the planner will apply user-defined operators to values obtained from <structname>pg_statistic</structname>, such as most common values and histogram entries. This occurs before table permissions are checked, so a nefarious user could exploit the behavior to obtain these values for table columns he does not have permission to read. To fix, fall back to a default estimate if the operator's implementation function is not certified leak-proof and the calling user does not have permission to read the table column whose statistics are needed. At least one of these criteria is satisfied in most cases in practice. (CVE-2017-7484)
ru: Некоторые функции оценки избирательности в планировщике применяют пользовательские операторы к значениям, получаемым из <structname>pg_statistic</structname>, например, к наиболее частым значениям и элементам гистограммы. Это происходит до проверки прав доступа к таблице, так что злонамеренный пользователь может воспользоваться этим и получить подобные значения из столбцов таблицы, чтение которых ему запрещено. Для устранения этой уязвимости следует переходить к общим оценкам, если функция, реализующая оператор, не считается герметичной и вызывающий её пользователь не имеет права на чтение столбца, статистика по которому требуется планировщику. На практике в большинстве случаев одно из этих условий выполняется. (CVE-2017-7484)

source: Restore <application>libpq</application>'s recognition of the <envar>PGREQUIRESSL</envar> environment variable (Daniel Gustafsson)
ru: Восстановление восприятия библиотекой <application>libpq</application> переменной окружения <envar>PGREQUIRESSL</envar> (Даниэль Густафсон)

source: Processing of this environment variable was unintentionally dropped in <productname>PostgreSQL</productname> 9.3, but its documentation remained. This creates a security hazard, since users might be relying on the environment variable to force SSL-encrypted connections, but that would no longer be guaranteed. Restore handling of the variable, but give it lower priority than <envar>PGSSLMODE</envar>, to avoid breaking configurations that work correctly with post-9.3 code. (CVE-2017-7485)
ru: Поддержка этой переменной окружения была непреднамеренно ликвидирована в <productname>PostgreSQL</productname> 9.3, но в документации она осталась. Это создало угрозу безопасности, так как пользователи могли рассчитывать на то, что она будет требовать SSL-шифрования подключений, но на самом деле этого не происходило. Теперь эта переменная воспринимается как и раньше, но имеет меньший приоритет, чем <envar>PGSSLMODE</envar>, во избежание нарушения конфигураций, работающих корректно с версиями после 9.3. (CVE-2017-7485)

source: Fix possibly-invalid initial snapshot during logical decoding (Petr Jelinek, Andres Freund)
ru: Исправление потенциально некорректного начального снимка при логическом декодировании (Петр Желинек, Андрес Фройнд)

source: The initial snapshot created for a logical decoding replication slot was potentially incorrect. This could cause third-party tools that use logical decoding to copy incomplete/inconsistent initial data. This was more likely to happen if the source server was busy at the time of slot creation, or if another logical slot already existed.
ru: Изначальный снимок, создаваемый для слота репликации с логическим декодированием, мог быть некорректным. В результате сторонние средства, использующие логическое декодирование, могли получать неполные/несогласованные начальные данные. Вероятность такого сбоя увеличивалась, если при создании слота исходный сервер был загружен либо уже существовал другой логический слот.

source: If you are using a replication tool that depends on logical decoding, and it should have copied a nonempty data set at the start of replication, it is advisable to recreate the replica after installing this update, or to verify its contents against the source server.
ru: Если вы используете средство репликации, основанное на логическом декодировании, и копировали непустой набор данных в начале репликации, имеет смысл пересоздать реплику после установления этого обновления либо сверить содержимое базы с исходным сервером.

source: Fix possible corruption of <quote>init forks</quote> of unlogged indexes (Robert Haas, Michael Paquier)
ru: Исправление потенциального повреждения <quote>слоёв инициализации</quote> нежурналируемых индексов (Роберт Хаас, Мишель Пакье)

source: This could result in an unlogged index being set to an invalid state after a crash and restart. Such a problem would persist until the index was dropped and rebuilt.
ru: Это повреждение могло приводить к переходу нежурналируемого индекса в ошибочное состояние после сбоя и перезапуска сервера. Устранить возникшую проблему можно было, только удалив и перестроив индекс.

source: Fix incorrect reconstruction of <structname>pg_subtrans</structname> entries when a standby server replays a prepared but uncommitted two-phase transaction (Tom Lane)
ru: Исправление ошибочного восстановления записей <structname>pg_subtrans</structname> при воспроизведении резервным сервером подготовленных, но не зафиксированных двухфазных транзакций (Том Лейн)

source: In most cases this turned out to have no visible ill effects, but in corner cases it could result in circular references in <structname>pg_subtrans</structname>, potentially causing infinite loops in queries that examine rows modified by the two-phase transaction.
ru: В большинстве случаев это не имело никаких болезненных последствий, но в особых ситуациях могло приводить к зацикливанию ссылок в <structname>pg_subtrans</structname>, что, в свою очередь, провоцировало бесконечные циклы в запросах, обращающимся к строкам, изменённым двухфазной транзакцией.

source: Avoid possible crash in <application>walsender</application> due to failure to initialize a string buffer (Stas Kelvich, Fujii Masao)
ru: Предотвращение возможного сбоя в <application>walsender</application> при ошибке инициализации буфера строки (Стас Кельвич, Фудзии Масао)

source: Fix possible crash when rescanning a nearest-neighbor index-only scan on a GiST index (Tom Lane)
ru: Предупреждение возможного сбоя при повторном сканировании индекса GiST с использованием только индекса и поиском ближайших соседей (Том Лейн)

source: Fix postmaster's handling of <function>fork()</function> failure for a background worker process (Tom Lane)
ru: Исправление поведения postmaster при обработке сбоя <function>fork()</function> для фонового рабочего процесса (Том Лейн)

source: Previously, the postmaster updated portions of its state as though the process had been launched successfully, resulting in subsequent confusion.
ru: Ранее postmaster модифицировал элементы своего состояния так, как будто процесс был запущен успешно, что впоследствии приводило к замешательству.

source: Fix crash or wrong answers when a <literal>GROUPING SETS</literal> column's data type is hashable but not sortable (Pavan Deolasee)
ru: Устранение сбоев или неверных ответов в случаях, когда тип данных столбца в <literal>GROUPING SETS</literal> является хешируемым, но не сортируемым (Паван Деоласи)

source: Avoid applying <quote>physical targetlist</quote> optimization to custom scans (Dmitry Ivanov, Tom Lane)
ru: Исключение применения оптимизации <quote>физического целевого списка</quote> к нестандартным сканированиям (Дмитрий Иванов, Том Лейн)

source: This optimization supposed that retrieving all columns of a tuple is inexpensive, which is true for ordinary Postgres tuples; but it might not be the case for a custom scan provider.
ru: Эта оптимизация предполагала, что получить все столбцы кортежа можно недорого, что действительно верно для обычных кортежей Postgres, но с нестандартными провайдерами сканирования это может быть не так.

source: Use the correct sub-expression when applying a <literal>FOR ALL</literal> row-level-security policy (Stephen Frost)
ru: Использование правильного подвыражения при применении политики защиты на уровне строк <literal>FOR ALL</literal> (Стивен Фрост)

source: In some cases the <literal>WITH CHECK</literal> restriction would be applied when the <literal>USING</literal> restriction is more appropriate.
ru: В некоторых случаях применялось ограничение <literal>WITH CHECK</literal>, хотя более уместным было бы ограничение <literal>USING</literal>.

source: Ensure parsing of queries in extension scripts sees the results of immediately-preceding DDL (Julien Rouhaud, Tom Lane)
ru: Обеспечение видимости результатов непосредственно предшествующих DDL при разборе запросов в скриптах расширений (Жульен Рохо, Том Лейн)

source: Due to lack of a cache flush step between commands in an extension script file, non-utility queries might not see the effects of an immediately preceding catalog change, such as <command>ALTER TABLE ... RENAME</command>.
ru: Из-за того, что кеш между командами в скрипте расширения не сбрасывался, запрос к данным мог не наблюдать эффектов непосредственно предшествующего ему изменения каталога, например результатов <command>ALTER TABLE ... RENAME</command>.

source: Skip tablespace privilege checks when <command>ALTER TABLE ... ALTER COLUMN TYPE</command> rebuilds an existing index (Noah Misch)
ru: Ликвидация проверки прав доступа к табличному пространству при перестроении существующего индекса командой <command>ALTER TABLE ... ALTER COLUMN TYPE</command> (Ной Миш)

source: The command failed if the calling user did not currently have <literal>CREATE</literal> privilege for the tablespace containing the index. That behavior seems unhelpful, so skip the check, allowing the index to be rebuilt where it is.
ru: Это команда выдавала ошибку, если вызывающий пользователь не имел права <literal>CREATE</literal> для табличного пространства, содержащего индекс. Такое поведение малополезно, так что стоит исключить эту проверку и разрешить перестраивать индекс там, где он находился.

source: Fix <command>ALTER TABLE ... VALIDATE CONSTRAINT</command> to not recurse to child tables when the constraint is marked <literal>NO INHERIT</literal> (Amit Langote)
ru: Предотвращение рекурсивного обращения команды <command>ALTER TABLE ... VALIDATE CONSTRAINT</command> к дочерним таблицам когда ограничение помечено как <literal>NO INHERIT</literal> (Амит Ланготе)

source: This fix prevents unwanted <quote>constraint does not exist</quote> failures when no matching constraint is present in the child tables.
ru: Это предупреждает нежелательные сбои типа <quote>constraint does not exist</quote> (ограничение не существует) в случаях, когда в дочерних таблицах нет соответствующего ограничения.

source: Avoid dangling pointer in <command>COPY ... TO</command> when row-level security is active for the source table (Tom Lane)
ru: Устранение потери указателя в <command>COPY ... TO</command> когда для исходной таблицы активна защита на уровне строк (Том Лейн)

source: Usually this had no ill effects, but sometimes it would cause unexpected errors or crashes.
ru: Обычно это не имело болезненных последствий, но иногда всё же приводило к неожиданным ошибкам и сбоям.

source: Avoid accessing an already-closed relcache entry in <command>CLUSTER</command> and <command>VACUUM FULL</command> (Tom Lane)
ru: Предупреждение обращения к уже закрытому элементу relcache в <command>CLUSTER</command> и <command>VACUUM FULL</command> (Том Лейн)

source: With some bad luck, this could lead to indexes on the target relation getting rebuilt with the wrong persistence setting.
ru: При особом стечении обстоятельств это могло приводить к тому, что индексы в целевом отношении перестраивались с неправильным режимом сохранения.

source: Fix <command>VACUUM</command> to account properly for pages that could not be scanned due to conflicting page pins (Andrew Gierth)
ru: Исправление ошибки команды <command>VACUUM</command>, когда она неправильно учитывала страницы, которые не могла прочитать из-за конфликтующих закреплений страниц (Эндрю Гирт)

source: This tended to lead to underestimation of the number of tuples in the table. In the worst case of a small heavily-contended table, <command>VACUUM</command> could incorrectly report that the table contained no tuples, leading to very bad planning choices.
ru: Это провоцировало недооценивание количества кортежей в таблице. В худшем случае с чрезвычайно востребованной таблицей команда <command>VACUUM</command> могла ошибочно сообщить, что таблица вовсе не содержит кортежей, что приводило к очень плохим решениям при планировании.

source: Ensure that bulk-tuple-transfer loops within a hash join are interruptible by query cancel requests (Tom Lane, Thomas Munro)
ru: Обеспечение возможности прерывания циклов массовой передачи кортежей в соединении по хешу при попытке отмены запроса (Том Лейн, Томас Мунро)

source: Fix integer-overflow problems in <type>interval</type> comparison (Kyotaro Horiguchi, Tom Lane)
ru: Исправление проблем с переполнением целочисленных значений при сравнении типов <type>interval</type> (Киотаро Хоригучи, Том Лейн)

source: The comparison operators for type <type>interval</type> could yield wrong answers for intervals larger than about 296000 years. Indexes on columns containing such large values should be reindexed, since they may be corrupt.
ru: Операторы сравнения для типа <type>interval</type> могли выдавать неверные ответы для интервалов, превышающих 296000 лет. Индексы по столбцам с такими большими значениями следует перестроить, так как они могут быть испорчены.

source: Fix <function>cursor_to_xml()</function> to produce valid output with <replaceable>tableforest</replaceable> = false (Thomas Munro, Peter Eisentraut)
ru: Исправление функции <function>cursor_to_xml()</function>, чтобы она выдавала правильный результат с <replaceable>tableforest</replaceable> = false (Томас Мунро, Питер Эйзентраут)

source: Previously it failed to produce a wrapping <literal>&lt;table&gt;</literal> element.
ru: Ранее она не добавляла внешний элемент <literal>&lt;table&gt;</literal>.

source: Fix roundoff problems in <function>float8_timestamptz()</function> and <function>make_interval()</function> (Tom Lane)
ru: Устранение проблем с округлением в функциях <function>float8_timestamptz()</function> и <function>make_interval()</function> (Том Лейн)

source: These functions truncated, rather than rounded, when converting a floating-point value to integer microseconds; that could cause unexpectedly off-by-one results.
ru: Эти функции отбрасывали дробную часть, а не округляли числа при преобразовании значения с плавающей точкой к целому числу микросекунд; это могло приводить к неожиданным сдвигам результатов на единицу.

source: Fix <function>pg_get_object_address()</function> to handle members of operator families correctly (&Aacute;lvaro Herrera)
ru: Исправление функции <function>pg_get_object_address()</function> для членов семейств операторов (Альваро Эррера)

source: Improve performance of <structname>pg_timezone_names</structname> view (Tom Lane, David Rowley)
ru: Улучшение производительности представления <structname>pg_timezone_names</structname> (Том Лейн, Дэвид Роули)

source: Reduce memory management overhead for contexts containing many large blocks (Tom Lane)
ru: Уменьшение издержек при управлении памятью для контекстов, содержащих множество больших блоков (Том Лейн)

source: Fix sloppy handling of corner-case errors from <function>lseek()</function> and <function>close()</function> (Tom Lane)
ru: Исправление неаккуратной обработки редких ошибок в <function>lseek()</function> и <function>close()</function> (Том Лейн)

source: Neither of these system calls are likely to fail in typical situations, but if they did, <filename>fd.c</filename> could get quite confused.
ru: В типичных ситуациях эти системные вызовы отрабатывают без ошибок, но в случае ошибки код <filename>fd.c</filename> мог повести себя некорректно.

source: Fix incorrect check for whether postmaster is running as a Windows service (Michael Paquier)
ru: Исправление некорректной проверки факта работы postmaster в виде службы Windows (Мишель Пакье)

source: This could result in attempting to write to the event log when that isn't accessible, so that no logging happens at all.
ru: Вследствие ошибки для вывода сообщений мог выбираться системный журнал событий (там где его на самом деле не было), так что запись сообщений фактически не производилась.

source: Fix <application>ecpg</application> to support <command>COMMIT PREPARED</command> and <command>ROLLBACK PREPARED</command> (Masahiko Sawada)
ru: Исправление в <application>ecpg</application> поддержки <command>COMMIT PREPARED</command> и <command>ROLLBACK PREPARED</command> (Масахико Савада)

source: Fix a double-free error when processing dollar-quoted string literals in <application>ecpg</application> (Michael Meskes)
ru: Исправление ошибки двойного освобождения при обработке строковых констант, заключённых в доллары, в <application>ecpg</application> (Михаэль Мескес)

source: In <application>pg_dump</application>, fix incorrect schema and owner marking for comments and security labels of some types of database objects (Giuseppe Broccolo, Tom Lane)
ru: В <application>pg_dump</application> исправлена пометка схемы и владельца для комментариев и меток безопасности некоторых типов объектов БД (Джузеппе Брокколо, Том Лейн)

source: In simple cases this caused no ill effects; but for example, a schema-selective restore might omit comments it should include, because they were not marked as belonging to the schema of their associated object.
ru: В простых случаях это не проявлялось никак, но например, при восстановлении с выбором схемы, могли потеряться комментарии, которые в ней должны быть, из-за того, что они не были помечены как принадлежащие схеме своего объекта.
