Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.5.po
Languages: ru

source: When they are present, this replaces checks against the certificate's <quote>Common Name</quote>.
ru: Когда такое поле присутствует, оно проверяется вместо поля <quote>Общее имя</quote> (Common Name) в сертификате.

source: Add system view <link linkend="pg-stat-ssl-view"><structname>pg_stat_ssl</structname></link> to report <acronym>SSL</acronym> connection information (Magnus Hagander)
ru: Добавление системного представления <link linkend="pg-stat-ssl-view"><structname>pg_stat_ssl</structname></link>, выдающего информацию о <acronym>SSL</acronym>-подключениях (Магнус Хагандер)

source: Add <application>libpq</application> functions to return <acronym>SSL</acronym> information in an implementation-independent way (Heikki Linnakangas)
ru: Добавление в <application>libpq</application> функций, возвращающих информацию об <acronym>SSL</acronym> независящим от реализации способом (Хейкки Линнакангас)

source: While <link linkend="libpq-pqgetssl"><function>PQgetssl()</function></link> can still be used to call <productname>OpenSSL</productname> functions, it is now considered deprecated because future versions of <application>libpq</application> might support other <acronym>SSL</acronym> implementations. When possible, use the new functions <link linkend="libpq-pqsslattribute"><function>PQsslAttribute()</function></link>, <link linkend="libpq-pqsslattributenames"><function>PQsslAttributeNames()</function></link>, and <link linkend="libpq-pqsslinuse"><function>PQsslInUse()</function></link> to obtain <acronym>SSL</acronym> information in an <acronym>SSL</acronym>-implementation-independent way.
ru: Хотя <link linkend="libpq-pqgetssl"><function>PQgetssl()</function></link> по-прежнему можно применять для обращений к функциям <productname>OpenSSL</productname>, теперь это считается устаревшим вариантом, так как будущие версии <application>libpq</application> могут поддерживать и другие реализации <acronym>SSL</acronym>. По возможности используйте новые функции <link linkend="libpq-pqsslattribute"><function>PQsslAttribute()</function></link>, <link linkend="libpq-pqsslattributenames"><function>PQsslAttributeNames()</function></link> и <link linkend="libpq-pqsslinuse"><function>PQsslInUse()</function></link>, чтобы получать информацию об <acronym>SSL</acronym> независящим от реализации <acronym>SSL</acronym> способом.

source: Make <application>libpq</application> honor any <productname>OpenSSL</productname> thread callbacks (Jan Urbanski)
ru: В <application>libpq</application> должны сохраняться установленные многопоточные обработчики вызовов <productname>OpenSSL</productname> (Ян Урбански)

source: Previously they were overwritten.
ru: Ранее они перезаписывались.

source: Server Settings
ru: Параметры сервера

source: This change allows the allocation of a large number of <acronym>WAL</acronym> files without keeping them after they are no longer needed. Therefore the default for <varname>max_wal_size</varname> has been set to <literal>1GB</literal>, much larger than the old default for <varname>checkpoint_segments</varname>. Also note that standby servers perform restartpoints to try to limit their WAL space consumption to <varname>max_wal_size</varname>; previously they did not pay any attention to <varname>checkpoint_segments</varname>.
ru: Это изменение позволяет разместить большое количество файлов <acronym>WAL</acronym>, но при этом не сохранять их, когда они будут уже не нужны. Как следствие, значение <varname>max_wal_size</varname> по умолчанию увеличено до <literal>1GB</literal>, что намного больше старой величины по умолчанию, устанавливаемой параметром <varname>checkpoint_segments</varname>. Также заметьте, что резервные серверы теперь производят точки перезапуска, стараясь ограничить использование пространства WAL значением <varname>max_wal_size</varname>; ранее они не учитывали параметр <varname>checkpoint_segments</varname>.

source: Control the Linux <acronym>OOM</acronym> killer via new environment variables <link linkend="linux-memory-overcommit"><envar>PG_OOM_ADJUST_FILE</envar></link> and <link linkend="linux-memory-overcommit"><envar>PG_OOM_ADJUST_VALUE</envar></link> (Gurjeet Singh)
ru: Регулирование снятия процессов при нехватке памяти в Linux через новые переменные окружения <link linkend="linux-memory-overcommit"><envar>PG_OOM_ADJUST_FILE</envar></link> и <link linkend="linux-memory-overcommit"><envar>PG_OOM_ADJUST_VALUE</envar></link> (Гуржит Сингх)

source: The previous <acronym>OOM</acronym> control infrastructure involved compile-time options <literal>LINUX_OOM_SCORE_ADJ</literal> and <literal>LINUX_OOM_ADJ</literal>, which are no longer supported. The new behavior is available in all builds.
ru: Предыдущая инфраструктура управления механизмом <acronym>OOM</acronym> зависела от параметров времени компиляции <literal>LINUX_OOM_SCORE_ADJ</literal> и <literal>LINUX_OOM_ADJ</literal>, которые теперь не поддерживаются. Новое поведение распространяется на все сборки.

source: Allow recording of transaction commit time stamps when configuration parameter <xref linkend="guc-track-commit-timestamp"/> is enabled (&Aacute;lvaro Herrera, Petr Jel&iacute;nek)
ru: Осуществление записи времени фиксации транзакции, когда включён параметр <xref linkend="guc-track-commit-timestamp"/> (Альваро Эррера, Петр Желинек)

source: Time stamp information can be accessed using functions <link linkend="functions-commit-timestamp"><function>pg_xact_commit_timestamp()</function></link> and <function>pg_last_committed_xact()</function>.
ru: Прочитать записанное время можно, воспользовавшись функциями <link linkend="functions-commit-timestamp"><function>pg_xact_commit_timestamp()</function></link> и <function>pg_last_committed_xact()</function>.

source: Allow <xref linkend="guc-local-preload-libraries"/> to be set by <command>ALTER ROLE SET</command> (Peter Eisentraut, Kyotaro Horiguchi)
ru: Возможность устанавливать <xref linkend="guc-local-preload-libraries"/> в команде <command>ALTER ROLE SET</command> (Питер Эйзентраут, Киотаро Хоригучи)

source: Allow <link linkend="autovacuum">autovacuum workers</link> to respond to configuration parameter changes during a run (Michael Paquier)
ru: <link linkend="autovacuum">Рабочие процессы автоочистки</link> теперь реагируют на изменения параметров конфигурации в процессе работы (Мишель Пакье)

source: Make configuration parameter <xref linkend="guc-debug-assertions"/> read-only (Andres Freund)
ru: Параметр конфигурации <xref linkend="guc-debug-assertions"/> стал доступен только для чтения (Андрес Фройнд)

source: This means that assertions can no longer be turned off if they were enabled at compile time, allowing for more efficient code optimization. This change also removes the <link linkend="app-postgres-options">postgres</link> <option>-A</option> option.
ru: Это значит, что утверждения теперь нельзя выключить, если они были включены на этапе компиляции, что позволяет дополнительно оптимизировать код. При этом изменении также был удалён ключ <link linkend="app-postgres-options">postgres</link> <option>-A</option>.

source: Allow setting <xref linkend="guc-effective-io-concurrency"/> on systems where it has no effect (Peter Eisentraut)
ru: Возможность установления параметра <xref linkend="guc-effective-io-concurrency"/> в системах, где он не играет роли (Питер Эйзентраут)

source: Add system view <link linkend="view-pg-file-settings"><structname>pg_file_settings</structname></link> to show the contents of the server's configuration files (Sawada Masahiko)
ru: Добавление системного представления <link linkend="view-pg-file-settings"><structname>pg_file_settings</structname></link>, показывающего содержимое файлов конфигурации сервера (Савада Масахико)

source: Add <structname>pending_restart</structname> to the system view <link linkend="view-pg-settings"><structname>pg_settings</structname></link> to indicate a change has been made but will not take effect until a database restart (Peter Eisentraut)
ru: Добавление поля <structname>pending_restart</structname> в системное представление <link linkend="view-pg-settings"><structname>pg_settings</structname></link>, показывающего, что изменение было внесено, но не вступит в силу до перезапуска базы данных (Питер Эйзентраут)

source: Allow <link linkend="sql-altersystem"><command>ALTER SYSTEM</command></link> values to be reset with <command>ALTER SYSTEM RESET</command> (Vik Fearing)
ru: Возможность сбросить значения <link linkend="sql-altersystem"><command>ALTER SYSTEM</command></link> командой <command>ALTER SYSTEM RESET</command> (Вик Фиринг)

source: This command removes the specified setting from <filename>postgresql.auto.conf</filename>.
ru: Эта команда удаляет заданный параметр из <filename>postgresql.auto.conf</filename>.

source: Replication and Recovery
ru: Репликация и восстановление

source: Create mechanisms for tracking the <link linkend="replication-origins">progress of replication</link>, including methods for identifying the origin of individual changes during logical replication (Andres Freund)
ru: Создание механизмов для отслеживания <link linkend="replication-origins">прогресса репликации</link>, включая средства идентификации источника отдельных изменений при логической репликации (Андрес Фройнд)

source: This is helpful when implementing replication solutions.
ru: Эти механизмы полезны при создании решений репликации.

source: Rework truncation of the multixact commit log to be properly WAL-logged (Andres Freund)
ru: Переработка операции усечения мультитранзакций, чтобы она корректно фиксировалась в журнале (Андрес Фройнд)

source: This makes things substantially simpler and more robust.
ru: В результате этот механизм становится проще и надёжнее.

source: Add <link linkend="recovery-config"><filename>recovery.conf</filename></link> parameter <link linkend="recovery-target-action"><varname>recovery_target_action</varname></link> to control post-recovery activity (Petr Jel&iacute;nek)
ru: Добавление в <link linkend="recovery-config"><filename>recovery.conf</filename></link> параметра <link linkend="recovery-target-action"><varname>recovery_target_action</varname></link>, управляющего действиями после восстановления (Петр Желинек)

source: This replaces the old parameter <varname>pause_at_recovery_target</varname>.
ru: Этот параметр пришёл на замену <varname>pause_at_recovery_target</varname>.

source: Add new <xref linkend="guc-archive-mode"/> value <literal>always</literal> to allow standbys to always archive received <acronym>WAL</acronym> files (Fujii Masao)
ru: Добавление для <xref linkend="guc-archive-mode"/> нового значения <literal>always</literal>, позволяющего архивировать получаемые файлы <acronym>WAL</acronym> (Фудзии Масао)

source: Add configuration parameter <xref linkend="guc-wal-retrieve-retry-interval"/> to control <acronym>WAL</acronym> read retry after failure (Alexey Vasiliev, Michael Paquier)
ru: Добавление параметра конфигурации <xref linkend="guc-wal-retrieve-retry-interval"/> для управления повторными попытками чтения <acronym>WAL</acronym> после сбоя (Алексей Васильев, Мишель Пакье)

source: This is particularly helpful for warm standbys.
ru: Это особенно полезно для тёплого резерва.

source: Allow compression of full-page images stored in <acronym>WAL</acronym> (Rahila Syed, Michael Paquier)
ru: Возможность сжатия образов полных страниц в <acronym>WAL</acronym> (Рахила Сьед, Мишель Пакье)

source: This feature reduces WAL volume, at the cost of more CPU time spent on WAL logging and WAL replay. It is controlled by a new configuration parameter <xref linkend="guc-wal-compression"/>, which currently is off by default.
ru: Это позволяет сократить объём WAL, за счёт дополнительной нагрузки на процессор при записи и воспроизведении WAL. Эта возможность управляется новым параметром конфигурации <xref linkend="guc-wal-compression"/> (по умолчанию он отключён).

source: Archive <acronym>WAL</acronym> files with suffix <literal>.partial</literal> during standby promotion (Heikki Linnakangas)
ru: Архивация файлов <acronym>WAL</acronym> с расширением <literal>.partial</literal> при повышении резервного сервера (Хейкки Линнакангас)

source: Add configuration parameter <xref linkend="guc-log-replication-commands"/> to log replication commands (Fujii Masao)
ru: Добавление параметра конфигурации <xref linkend="guc-log-replication-commands"/> для протоколирования команд репликации (Фудзии Масао)

source: By default, replication commands, e.g. <link linkend="protocol-replication"><literal>IDENTIFY_SYSTEM</literal></link>, are not logged, even when <xref linkend="guc-log-statement"/> is set to <literal>all</literal>.
ru: По умолчанию команды репликации, в частности <link linkend="protocol-replication"><literal>IDENTIFY_SYSTEM</literal></link>, не записываются в протокол, даже когда <xref linkend="guc-log-statement"/> имеет значение <literal>all</literal>.

source: Report the processes holding replication slots in <link linkend="view-pg-replication-slots"><structname>pg_replication_slots</structname></link> (Craig Ringer)
ru: Добавление в <link linkend="view-pg-replication-slots"><structname>pg_replication_slots</structname></link> отображения процессов, занимающих слоты репликации (Крейг Рингер)

source: The new output column is <structname>active_pid</structname>.
ru: Эта информация выводится в новом столбце <structname>active_pid</structname>.

source: Allow <filename>recovery.conf</filename>'s <link linkend="primary-conninfo"><varname>primary_conninfo</varname></link> setting to use connection <acronym>URI</acronym>s, e.g. <literal>postgres://</literal> (Alexander Shulgin)
ru: Возможность использовать в задаваемом в <filename>recovery.conf</filename> параметре <link linkend="primary-conninfo"><varname>primary_conninfo</varname></link> идентификаторы соединений в формате <acronym>URI</acronym>, например, <literal>postgres://</literal> (Александр Шульгин)

source: Queries
ru: Запросы

source: Allow <link linkend="sql-on-conflict"><command>INSERT</command></link>s that would generate constraint conflicts to be turned into <command>UPDATE</command>s or ignored (Peter Geoghegan, Heikki Linnakangas, Andres Freund)
ru: Возможность превращать команды <link linkend="sql-on-conflict"><command>INSERT</command></link>, вызывающие конфликты ограничений, в команды <command>UPDATE</command>, либо игнорировать их (Питер Геохеган, Хейкки Линнакангас, Андрес Фройнд)

source: The syntax is <command>INSERT ... ON CONFLICT DO NOTHING/UPDATE</command>. This is the Postgres implementation of the popular <command>UPSERT</command> command.
ru: Для этого введён синтаксис <command>INSERT ... ON CONFLICT DO NOTHING/UPDATE</command>. Таким образом в Postgres реализована популярная команда <command>UPSERT</command>.

source: Add <literal>GROUP BY</literal> analysis features <link linkend="queries-grouping-sets"><literal>GROUPING SETS</literal></link>, <link linkend="queries-grouping-sets"><literal>CUBE</literal></link> and <link linkend="queries-grouping-sets"><literal>ROLLUP</literal></link> (Andrew Gierth, Atri Sharma)
ru: Добавление в <literal>GROUP BY</literal> аналитической функциональности: <link linkend="queries-grouping-sets"><literal>GROUPING SETS</literal></link>, <link linkend="queries-grouping-sets"><literal>CUBE</literal></link> и <link linkend="queries-grouping-sets"><literal>ROLLUP</literal></link> (Эндрю Гирт, Атри Шарма)

source: Allow setting multiple target columns in an <link linkend="sql-update"><command>UPDATE</command></link> from the result of a single sub-SELECT (Tom Lane)
ru: Возможность присвоения результатов одного вложенного SELECT нескольким целевым столбцам в <link linkend="sql-update"><command>UPDATE</command></link> (Том Лейн)

source: This is accomplished using the syntax <command>UPDATE tab SET (col1, col2, ...) = (SELECT ...)</command>.
ru: Для этого применяется синтаксис <command>UPDATE tab SET (col1, col2, ...) = (SELECT ...)</command>.

source: Add <link linkend="sql-select"><command>SELECT</command></link> option <literal>SKIP LOCKED</literal> to skip locked rows (Thomas Munro)
ru: Добавление в <link linkend="sql-select"><command>SELECT</command></link> указания <literal>SKIP LOCKED</literal> для пропуска заблокированных строк (Томас Мунро)

source: This does not throw an error for locked rows like <literal>NOWAIT</literal> does.
ru: При этом не выдаётся ошибка, как в случае с <literal>NOWAIT</literal>.

source: Add <link linkend="sql-select"><command>SELECT</command></link> option <literal>TABLESAMPLE</literal> to return a subset of a table (Petr Jel&iacute;nek)
ru: Добавление в <link linkend="sql-select"><command>SELECT</command></link> указания <literal>TABLESAMPLE</literal>, что позволяет получать подмножество строк таблицы (Петр Желинек)

source: This feature supports the SQL-standard table sampling methods. In addition, there are provisions for <link linkend="tablesample-method">user-defined table sampling methods</link>.
ru: Благодаря этому теперь поддерживаются описанные в стандарте SQL методы извлечения выборки. Кроме того, представлены средства для создания <link linkend="tablesample-method">пользовательских методов извлечения выборки</link>.

source: Suggest possible matches for mistyped column names (Peter Geoghegan, Robert Haas)
ru: Предложение возможных исправлений при опечатках в именах столбцов (Питер Геохеган, Роберт Хаас)

source: Utility Commands
ru: Служебные команды

source: Add more details about sort ordering in <link linkend="sql-explain"><command>EXPLAIN</command></link> output (Marius Timmer, Lukas Kreft, Arne Scheffer)
ru: Добавление более подробной информации о порядке сортировки в вывод <link linkend="sql-explain"><command>EXPLAIN</command></link> (Мариус Тиммер, Лукас Крефт, Арне Шеффер)

source: Details include <literal>COLLATE</literal>, <literal>DESC</literal>, <literal>USING</literal>, and <literal>NULLS FIRST</literal><literal>/LAST</literal>.
ru: Эта информация включает свойства <literal>COLLATE</literal>, <literal>DESC</literal>, <literal>USING</literal> и <literal>NULLS FIRST</literal><literal>/LAST</literal>.

source: Make <link linkend="sql-vacuum"><command>VACUUM</command></link> log the number of pages skipped due to pins (Jim Nasby)
ru: Добавление в вывод <link linkend="sql-vacuum"><command>VACUUM</command></link> количества страниц, пропущенных из-за закреплений (Джим Нэсби)

source: Make <link linkend="sql-truncate"><command>TRUNCATE</command></link> properly update the <literal>pg_stat</literal>* tuple counters (Alexander Shulgin)
ru: Команда <link linkend="sql-truncate"><command>TRUNCATE</command></link> теперь корректно обновляет счётчики кортежей в <literal>pg_stat</literal> (Александр Шульгин)

source: Allow <command>REINDEX</command> to reindex an entire schema using the <literal>SCHEMA</literal> option (Sawada Masahiko)
ru: Добавление в <command>REINDEX</command> возможности переиндексировать всю схему с новым указанием <literal>SCHEMA</literal> (Савада Масахико)

source: Add <literal>VERBOSE</literal> option to <command>REINDEX</command> (Sawada Masahiko)
ru: Добавление в <command>REINDEX</command> указания <literal>VERBOSE</literal> (Савада Масахико)

source: Prevent <command>REINDEX DATABASE</command> and <command>SCHEMA</command> from outputting object names, unless <literal>VERBOSE</literal> is used (Simon Riggs)
ru: Исключение из вывода <command>REINDEX DATABASE</command> и <command>SCHEMA</command> имён столбцов в случае отсутствия указания <literal>VERBOSE</literal> (Саймон Риггс)

source: Remove obsolete <literal>FORCE</literal> option from <command>REINDEX</command> (Fujii Masao)
ru: Удаление устаревшего указания <literal>FORCE</literal> команды <command>REINDEX</command> (Фудзии Масао)

source: Object Manipulation
ru: Манипуляции с объектами

source: Add <link linkend="ddl-rowsecurity">row-level security control</link> (Craig Ringer, KaiGai Kohei, Adam Brightwell, Dean Rasheed, Stephen Frost)
ru: Добавление <link linkend="ddl-rowsecurity">механизма защиты на уровне строк</link> (Крейг Рингер, КайГай Кохей, Адам Брайтвелл, Дин Рашид, Стивен Фрост)

source: This feature allows row-by-row control over which users can add, modify, or even see rows in a table. This is controlled by new commands <link linkend="sql-createpolicy"><command>CREATE</command></link>/<link linkend="sql-alterpolicy"><command>ALTER</command></link>/<link linkend="sql-droppolicy"><command>DROP POLICY</command></link> and <link linkend="sql-altertable"><command>ALTER TABLE ... ENABLE/DISABLE ROW SECURITY</command></link>.
ru: Этот механизм позволяет на уровне строк определять, какие строки пользователи смогут добавлять, изменять и даже видеть в таблице. Для управления им введены новые команды <link linkend="sql-createpolicy"><command>CREATE</command></link>/<link linkend="sql-alterpolicy"><command>ALTER</command></link>/<link linkend="sql-droppolicy"><command>DROP POLICY</command></link> и <link linkend="sql-altertable"><command>ALTER TABLE ... ENABLE/DISABLE ROW SECURITY</command></link>.

source: Allow changing of the <acronym>WAL</acronym> logging status of a table after creation with <link linkend="sql-altertable"><command>ALTER TABLE ... SET LOGGED / UNLOGGED</command></link> (Fabr&iacute;zio de Royes Mello)
ru: Возможность изменения режима журналирования таблицы в <acronym>WAL</acronym> с применением команды <link linkend="sql-altertable"><command>ALTER TABLE ... SET LOGGED / UNLOGGED</command></link> (Фабрицио де Ройес Мелло)

source: Add <literal>IF NOT EXISTS</literal> clause to <link linkend="sql-createtableas"><command>CREATE TABLE AS</command></link>, <link linkend="sql-createindex"><command>CREATE INDEX</command></link>, <link linkend="sql-createsequence"><command>CREATE SEQUENCE</command></link>, and <link linkend="sql-creatematerializedview"><command>CREATE MATERIALIZED VIEW</command></link> (Fabr&iacute;zio de Royes Mello)
ru: Добавление предложения <literal>IF NOT EXISTS</literal> в <link linkend="sql-createtableas"><command>CREATE TABLE AS</command></link>, <link linkend="sql-createindex"><command>CREATE INDEX</command></link>, <link linkend="sql-createsequence"><command>CREATE SEQUENCE</command></link> и <link linkend="sql-creatematerializedview"><command>CREATE MATERIALIZED VIEW</command></link> (Фабрицио де Ройес Мелло)

source: Add support for <literal>IF EXISTS</literal> to <link linkend="sql-altertable"><command>ALTER TABLE ... RENAME CONSTRAINT</command></link> (Bruce Momjian)
ru: Добавление поддержки <literal>IF EXISTS</literal> в <link linkend="sql-altertable"><command>ALTER TABLE ... RENAME CONSTRAINT</command></link> (Брюс Момджян)

source: Allow some DDL commands to accept <literal>CURRENT_USER</literal> or <literal>SESSION_USER</literal>, meaning the current user or session user, in place of a specific user name (Kyotaro Horiguchi, &Aacute;lvaro Herrera)
ru: Возможность передать некоторым командам DDL вместо имени конкретного пользователя идентификаторы <literal>CURRENT_USER</literal> и <literal>SESSION_USER</literal>, обозначающие текущего пользователя и пользователя сеанса (Киотаро Хоригучи, Альваро Эррера)

source: This feature is now supported in <xref linkend="sql-alteruser"/>, <xref linkend="sql-altergroup"/>, <xref linkend="sql-alterrole"/>, <xref linkend="sql-grant"/>, and <command>ALTER <replaceable>object</replaceable> OWNER TO</command> commands.
ru: Это поддерживают команды <xref linkend="sql-alteruser"/>, <xref linkend="sql-altergroup"/>, <xref linkend="sql-alterrole"/>, <xref linkend="sql-grant"/> и <command>ALTER <replaceable>объект</replaceable> OWNER TO</command>.

source: Support comments on <link linkend="sql-createdomain">domain constraints</link> (&Aacute;lvaro Herrera)
ru: Поддержка комментариев в <link linkend="sql-createdomain">ограничениях домена</link> (Альваро Эррера)
