Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.5.po
Languages: ru

source: Fix TAP tests and MSVC scripts to work when build directory's path name contains spaces (Michael Paquier, Kyotaro Horiguchi)
ru: Исправление тестов TAP и скриптов MSVC для работы с каталогом сборки, путь к которому содержит пробелы (Мишель Пакье, Киотаро Хоригучи)

source: Be more predictable about reporting <quote>statement timeout</quote> versus <quote>lock timeout</quote> (Tom Lane)
ru: Более предсказуемое поведение в выборе ошибки <quote>statement timeout</quote> (тайм-аут оператора) или <quote>lock timeout</quote> (тайм-аут блокировки) (Том Лейн)

source: On heavily loaded machines, the regression tests sometimes failed due to reporting <quote>lock timeout</quote> even though the statement timeout should have occurred first.
ru: В сильно загруженных системах регрессионные тесты иногда выдавали ошибку <quote>lock timeout</quote> (тайм-аут блокировки), хотя прежде этого должен был случиться тайм-аут оператора.

source: Make regression tests safe for Danish and Welsh locales (Jeff Janes, Tom Lane)
ru: Адаптация регрессионных тестов к датской и валлийской локалям (Джефф Джейнс, Том Лейн)

source: Change some test data that triggered the unusual sorting rules of these locales.
ru: Изменены некоторые тестовые данные, с которыми в этих локалях действовали необычные правила сортировки.

source: Update our copy of the timezone code to match IANA's <application>tzcode</application> release 2016c (Tom Lane)
ru: Приведение нашей копии кодов часовых поясов в соответствие с выпущенной IANA версией <application>tzcode</application> 2016c (Том Лейн)

source: This is needed to cope with anticipated future changes in the time zone data files. It also fixes some corner-case bugs in coping with unusual time zones.
ru: Это необходимо для принятия ожидаемых в будущем изменений в файлах данных часовых поясов. Также это решает некоторые редкие проблемы при работе с необычными часовыми поясами.

source: Update time zone data files to <application>tzdata</application> release 2016f for DST law changes in Kemerovo and Novosibirsk, plus historical corrections for Azerbaijan, Belarus, and Morocco.
ru: Обновление данных часовых поясов до версии <application>tzdata</application> 2016f, включающее новые правила перехода на летнее время в Кемерове и Новосибирске, а также корректировку исторических данных для Азербайджана, Белоруссии и Марокко.

source: Release 9.5.3
ru: Выпуск 9.5.3

source: This release contains a variety of fixes from 9.5.2. For information about new features in the 9.5 major release, see <xref linkend="release-9-5"/>.
ru: В этот выпуск вошли различные исправления, внесённые после версии 9.5.2. За информацией о нововведениях версии 9.5 обратитесь к <xref remap="3" linkend="release-9-5"/>.

source: Migration to Version 9.5.3
ru: Миграция на версию 9.5.3

source: Clear the OpenSSL error queue before OpenSSL calls, rather than assuming it's clear already; and make sure we leave it clear afterwards (Peter Geoghegan, Dave Vitek, Peter Eisentraut)
ru: Очередь ошибок OpenSSL должна очищаться перед вызовом функций OpenSSL (не следует полагать, что она уже очищена); мы также должны обязательно очищать её после вызова (Питер Геохеган, Дэйв Витек, Питер Эйзентраут)

source: This change prevents problems when there are multiple connections using OpenSSL within a single process and not all the code involved follows the same rules for when to clear the error queue. Failures have been reported specifically when a client application uses SSL connections in <application>libpq</application> concurrently with SSL connections using the PHP, Python, or Ruby wrappers for OpenSSL. It's possible for similar problems to arise within the server as well, if an extension module establishes an outgoing SSL connection.
ru: Это изменение предотвращает проблемы, возникающие, когда несколько подключений используют OpenSSL в одном процессе и не весь участвующий в этом код очищает очередь ошибок по одним правилам. В частности, возникали ошибки, когда клиентское приложение использовало SSL-подключения через <application>libpq</application> одновременно с SSL-подключениями, устанавливаемыми обёртками PHP, Python или Ruby для OpenSSL. Подобные проблемы могли иметь место и на сервере, если модуль расширения устанавливал исходящее SSL-подключение.

source: Fix <quote>failed to build any <replaceable>N</replaceable>-way joins</quote> planner error with a full join enclosed in the right-hand side of a left join (Tom Lane)
ru: Исправление ошибки планировщика <quote>не удалось построить <replaceable>N</replaceable>-стороннее соединение</quote> с полным соединением, заключённым в правой части левого соединения (Том Лейн)

source: Fix incorrect handling of equivalence-class tests in multilevel nestloop plans (Tom Lane)
ru: Исправление некорректной обработки проверок класса эквивалентности в планах с многоуровневыми вложенными циклами (Том Лейн)

source: Given a three-or-more-way equivalence class of variables, such as <literal>X.X = Y.Y = Z.Z</literal>, it was possible for the planner to omit some of the tests needed to enforce that all the variables are actually equal, leading to join rows being output that didn't satisfy the <literal>WHERE</literal> clauses. For various reasons, erroneous plans were seldom selected in practice, so that this bug has gone undetected for a long time.
ru: С классом эквивалентности переменных с тремя или более элементами, например <literal>X.X = Y.Y = Z.Z</literal>, планировщик мог опустить некоторые проверки, необходимые, чтобы удостовериться, что все переменные действительно равны, в результате чего выдавались строки соединения, не удовлетворяющие предложениям <literal>WHERE</literal>. По ряду причин некорректные планы редко выбирались на практике, поэтому эта ошибка оставалась необнаруженной долгое время.

source: Fix corner-case parser failures occurring when <xref linkend="guc-operator-precedence-warning"/> is turned on (Tom Lane)
ru: Исправление ошибок анализатора запроса в особых случаях при включённом параметре <xref linkend="guc-operator-precedence-warning"/> (Том Лейн)

source: An example is that <literal>SELECT (ARRAY[])::text[]</literal> gave an error, though it worked without the parentheses.
ru: Например, запрос <literal>SELECT (ARRAY[])::text[]</literal> давал ошибку, хотя без скобок он работал.

source: Fix query-lifespan memory leak in GIN index scans (Julien Rouhaud)
ru: Ликвидирована утечка памяти на протяжении запроса при сканировании индекса GIN (Жульен Рохо)

source: Fix query-lifespan memory leak and potential index corruption hazard in GIN index insertion (Tom Lane)
ru: Ликвидирована утечка памяти на протяжении запроса и угроза повреждения индекса при добавлении в индекс GIN (Том Лейн)

source: The memory leak would typically not amount to much in simple queries, but it could be very substantial during a large GIN index build with high <varname>maintenance_work_mem</varname>.
ru: Эта утечка памяти обычно ни на что не влияла в простых запросах, но могла быть очень существенной при построении большого индекса GIN с большим значением <varname>maintenance_work_mem</varname>.

source: Fix possible misbehavior of <literal>TH</literal>, <literal>th</literal>, and <literal>Y,YYY</literal> format codes in <function>to_timestamp()</function> (Tom Lane)
ru: Исправление возможного некорректного поведения кодов формата <literal>TH</literal>, <literal>th</literal> и <literal>Y,YYY</literal> в <function>to_timestamp()</function> (Том Лейн)

source: These could advance off the end of the input string, causing subsequent format codes to read garbage.
ru: С этими кодами был возможен выход за конец строки, в результате чего последующие коды формата читали мусор.

source: Fix dumping of rules and views in which the <replaceable>array</replaceable> argument of a <literal><replaceable>value</replaceable> <replaceable>operator</replaceable> ANY (<replaceable>array</replaceable>)</literal> construct is a sub-SELECT (Tom Lane)
ru: Исправление вывода правил и представлений, в которых аргумент <replaceable>массив</replaceable> в конструкции <literal><replaceable>значение</replaceable> <replaceable>оператор</replaceable> ANY (<replaceable>массив</replaceable>)</literal> представляет собой вложенный SELECT (Том Лейн)

source: Disallow newlines in <command>ALTER SYSTEM</command> parameter values (Tom Lane)
ru: Запрет на использование символов новой строки в значениях параметров <command>ALTER SYSTEM</command> (Том Лейн)

source: The configuration-file parser doesn't support embedded newlines in string literals, so we mustn't allow them in values to be inserted by <command>ALTER SYSTEM</command>.
ru: При разборе файла конфигурации строки, содержащие символы новой строки, не принимаются, поэтому мы не должны допускать их в значениях, вставляемых командой <command>ALTER SYSTEM</command>.

source: Fix <command>ALTER TABLE ... REPLICA IDENTITY USING INDEX</command> to work properly if an index on OID is selected (David Rowley)
ru: Исправление поведения <command>ALTER TABLE ... REPLICA IDENTITY USING INDEX</command> в случае, когда выбирается индекс по OID (Дэвид Роули)

source: Avoid possible misbehavior after failing to remove a tablespace symlink (Tom Lane)
ru: Исключение возможного некорректного поведения в случае неудачи при удалении символической ссылки табличного пространства (Том Лейн)

source: Fix crash in logical decoding on alignment-picky platforms (Tom Lane, Andres Freund)
ru: Исправление сбоя при логическом декодировании на платформах, чувствительных к выравниванию (Том Лейн, Андрес Фройнд)

source: The failure occurred only with a transaction large enough to spill to disk and a primary-key change within that transaction.
ru: Этот сбой происходил, когда транзакция была достаточно большой, чтобы оказаться на диске, и в ней происходило изменение первичного ключа.

source: Avoid repeated requests for feedback from receiver while shutting down walsender (Nick Cleaton)
ru: Исключение повторных обращений за ответом к приёмнику журнала при завершении процесса walsender (Ник Клитон)

source: Make <application>pg_regress</application> use a startup timeout from the <envar>PGCTLTIMEOUT</envar> environment variable, if that's set (Tom Lane)
ru: Использование в <application>pg_regress</application> тайм-аута запуска из переменной окружения <envar>PGCTLTIMEOUT</envar>, если она задана (Том Лейн)

source: This is for consistency with a behavior recently added to <application>pg_ctl</application>; it eases automated testing on slow machines.
ru: Это поведение согласуется с тем, что было недавно введено в <application>pg_ctl</application>; возможность задать тайм-аут облегчает автоматизированное тестирование на медленных машинах.

source: Fix <application>pg_upgrade</application> to correctly restore extension membership for operator families containing only one operator class (Tom Lane)
ru: Исправление ошибки в <application>pg_upgrade</application>, из-за которой не восстанавливалось членство семейства операторов, содержащего всего один класс операторов, в расширении (Том Лейн)

source: In such a case, the operator family was restored into the new database, but it was no longer marked as part of the extension. This had no immediate ill effects, but would cause later <application>pg_dump</application> runs to emit output that would cause (harmless) errors on restore.
ru: В таких случаях семейство операторов восстанавливалось в новую базу, но переставало быть частью расширения. Это не приводило немедленно к негативным эффектам, но с выводом, выдаваемым впоследствии утилитой <application>pg_dump</application>, при восстановлении возникали ошибки (безвредные).

source: Fix <application>pg_upgrade</application> to not fail when new-cluster TOAST rules differ from old (Tom Lane)
ru: Исправление ошибки в <application>pg_upgrade</application>, приводившей к сбою, когда правила TOAST в новом кластере отличались от старых (Том Лейн)

source: <application>pg_upgrade</application> had special-case code to handle the situation where the new <productname>PostgreSQL</productname> version thinks that a table should have a TOAST table while the old version did not. That code was broken, so remove it, and instead do nothing in such cases; there seems no reason to believe that we can't get along fine without a TOAST table if that was okay according to the old version's rules.
ru: В <application>pg_upgrade</application> был специальный код для обработки ситуации, когда новая версия <productname>PostgreSQL</productname> считала, что у таблицы должна быть дополнительная таблица TOAST, а старая версия считала по-другому. Этот код был нерабочим, поэтому его следует удалить и ничего не делать в таких случаях; похоже, что нет никаких причин полагать, что мы не сможем обойтись без таблицы TOAST, если это было возможно по правилам старой версии.

source: Fix atomic operations for PPC when using IBM's XLC compiler (Noah Misch)
ru: Исправление атомарных операций в коде для PPC, генерируемом компилятором IBM XLC (Ной Миш)

source: Reduce the number of SysV semaphores used by a build configured with <option>--disable-spinlocks</option> (Tom Lane)
ru: Уменьшение числа семафоров SysV, задействуемых сборкой, полученной с ключом <option>--disable-spinlocks</option> (Том Лейн)

source: Rename internal function <function>strtoi()</function> to <function>strtoint()</function> to avoid conflict with a NetBSD library function (Thomas Munro)
ru: Переименование внутренней функции <function>strtoi()</function> в <function>strtoint()</function> во избежание конфликта с библиотечной функцией NetBSD (Томас Мунро)

source: Fix reporting of errors from <function>bind()</function> and <function>listen()</function> system calls on Windows (Tom Lane)
ru: Исправление кодов ошибок, получаемых из системных вызовов <function>bind()</function> и <function>listen()</function> в Windows (Том Лейн)

source: Reduce verbosity of compiler output when building with Microsoft Visual Studio (Christian Ullrich)
ru: Уменьшение детализации вывода компилятора при сборке с Microsoft Visual Studio (Кристиан Ульрих)

source: Support building with Visual Studio 2015 (Michael Paquier, Petr Jel&iacute;nek)
ru: Поддержка сборки с Visual Studio 2015 (Мишель Пакье, Петр Желинек)

source: Note that builds made with VS2015 will not run on Windows versions before Windows Vista.
ru: Учтите, что сборки, произведённые с VS2015, не будут работать в версиях Windows, более ранних чем Windows Vista.

source: Fix <function>putenv()</function> to work properly with Visual Studio 2013 (Michael Paquier)
ru: Исправление <function>putenv()</function> для корректной работы с Visual Studio 2013 (Мишель Пакье)

source: Avoid possibly-unsafe use of Windows' <function>FormatMessage()</function> function (Christian Ullrich)
ru: Исключение потенциально небезопасного использования функции <function>FormatMessage()</function> в Windows (Кристиан Ульрих)

source: Use the <literal>FORMAT_MESSAGE_IGNORE_INSERTS</literal> flag where appropriate. No live bug is known to exist here, but it seems like a good idea to be careful.
ru: Использование флага <literal>FORMAT_MESSAGE_IGNORE_INSERTS</literal>, где это уместно. Сообщений о конкретных связанных с этим ошибками не было, но проявить осторожность представляется хорошей идеей.

source: Update time zone data files to <application>tzdata</application> release 2016d for DST law changes in Russia and Venezuela. There are new zone names <literal>Europe/Kirov</literal> and <literal>Asia/Tomsk</literal> to reflect the fact that these regions now have different time zone histories from adjacent regions.
ru: Обновление данных часовых поясов до версии <application>tzdata</application> 2016d, включающее изменения правил перехода на летнее время в России и Венесуэле. Появились новые названия часовых поясов <literal>Europe/Kirov</literal> и <literal>Asia/Tomsk</literal>, отражающие тот факт, что в этих регионах история изменения часовых поясов отличается от соседних.

source: Release 9.5.2
ru: Выпуск 9.5.2

source: This release contains a variety of fixes from 9.5.1. For information about new features in the 9.5 major release, see <xref linkend="release-9-5"/>.
ru: В этот выпуск вошли различные исправления, внесённые после версии 9.5.1. За информацией о нововведениях версии 9.5 обратитесь к <xref remap="3" linkend="release-9-5"/>.

source: Migration to Version 9.5.2
ru: Миграция на версию 9.5.2

source: However, you may need to <command>REINDEX</command> some indexes after applying the update, as per the first changelog entry below.
ru: Однако вследствие изменения, идущего первым в следующем списке, для некоторых индексов может потребоваться выполнить <command>REINDEX</command>.

source: Disable abbreviated keys for string sorting in non-<literal>C</literal> locales (Robert Haas)
ru: Отключены сокращённые ключи при сортировке строк в локалях, отличных от <literal>C</literal> (Роберт Хаас)

source: <productname>PostgreSQL</productname> 9.5 introduced logic for speeding up comparisons of string data types by using the standard C library function <function>strxfrm()</function> as a substitute for <function>strcoll()</function>. It now emerges that most versions of glibc (Linux's implementation of the C library) have buggy implementations of <function>strxfrm()</function> that, in some locales, can produce string comparison results that do not match <function>strcoll()</function>. Until this problem can be better characterized, disable the optimization in all non-<literal>C</literal> locales. (<literal>C</literal> locale is safe since it uses neither <function>strcoll()</function> nor <function>strxfrm()</function>.)
ru: В <productname>PostgreSQL</productname> 9.5 появилась логика ускорения сравнения строковых типов данных с применением стандартной функции библиотеки C <function>strxfrm()</function> вместо <function>strcoll()</function>. Сейчас обнаружилось, что в большинстве версий glibc (реализации библиотеки С для Linux) функция <function>strxfrm()</function> реализована с ошибками, то есть для некоторых локалей с ней получаются результаты сравнения строк, отличающиеся от <function>strcoll()</function>. Пока эта проблема не будет изучена глубже, такая оптимизация для всех локалей, отличных от <literal>C</literal>, отключается. (Локаль <literal>C</literal> от этого не зависит, так как она не использует ни <function>strcoll()</function>, ни <function>strxfrm()</function>.)

source: Unfortunately, this problem affects not only sorting but also entry ordering in B-tree indexes, which means that B-tree indexes on <type>text</type>, <type>varchar</type>, or <type>char</type> columns may now be corrupt if they sort according to an affected locale and were built or modified under <productname>PostgreSQL</productname> 9.5.0 or 9.5.1. Users should <command>REINDEX</command> indexes that might be affected.
ru: К сожалению, данная проблема затрагивает не только сортировку, но и упорядочивание записей в B-деревьях, а значит, индексы-B-деревья по столбцам типов <type>text</type>, <type>varchar</type> или <type>char</type> могут оказаться испорченными, если они сортировались с проблемной локалью и были построены или модифицированы версией <productname>PostgreSQL</productname> 9.5.0 или 9.5.1. Индексы, которые могли пострадать вследствие этой проблемы, следует перестроить (выполнив <command>REINDEX</command>) .

source: It is not possible at this time to give an exhaustive list of known-affected locales. <literal>C</literal> locale is known safe, and there is no evidence of trouble in English-based locales such as <literal>en_US</literal>, but some other popular locales such as <literal>de_DE</literal> are affected in most glibc versions.
ru: В данный момент невозможно определить исчерпывающий список проблемных локалей. Известно, что с локалью <literal>C</literal> всё в порядке, и с локалями английского языка, например, <literal>en_US</literal>, тоже не замечено никаких проблем, но с некоторыми другими популярными локалями, например <literal>de_DE</literal>, поведение некорректно в большинстве версий glibc.

source: Maintain row-security status properly in cached plans (Stephen Frost)
ru: Корректное сохранение статуса защиты на уровне строк в кешируемых планах (Стивен Фрост)

source: In a session that performs queries as more than one role, the plan cache might incorrectly re-use a plan that was generated for another role ID, thus possibly applying the wrong set of policies when row-level security (RLS) is in use. (CVE-2016-2193)
ru: В сеансе, выполняющем запросы с разными ролями, из кеша планов может быть некорректно взят план, построенный для другой роли, что может привести к применению ошибочного набора политик, когда активна защита на уровне строк (RLS). (CVE-2016-2193)

source: Add must-be-superuser checks to some new <filename>contrib/pageinspect</filename> functions (Andreas Seltenreich)
ru: В некоторые новые функции <filename>contrib/pageinspect</filename> добавлены проверки суперпользователя (Андреас Сельтенрейх)

source: Most functions in the <filename>pageinspect</filename> extension that inspect <type>bytea</type> values disallow calls by non-superusers, but <function>brin_page_type()</function> and <function>brin_metapage_info()</function> failed to do so. Passing contrived <type>bytea</type> values to them might crash the server or disclose a few bytes of server memory. Add the missing permissions checks to prevent misuse. (CVE-2016-3065)
ru: Большинство функций в расширении <filename>pageinspect</filename>, исследующие значения <type>bytea</type>, не допускают вызова обычными пользователями, но в <function>brin_page_type()</function> и <function>brin_metapage_info()</function> такие ограничения отсутствуют. Однако, передав им изощрённо сформированные значения <type>bytea</type>, можно вызвать крах сервера или прочитать несколько байт памяти сервера. Поэтому были добавлены недостающие проверки во избежание подобных злоупотреблений. (CVE-2016-3065)

source: Fix incorrect handling of indexed <literal>ROW()</literal> comparisons (Simon Riggs)
ru: Исправлено некорректное сравнение <literal>ROW()</literal> с применением индексов (Саймон Риггс)

source: Flaws in a minor optimization introduced in 9.5 caused incorrect results if the <literal>ROW()</literal> comparison matches the index ordering partially but not exactly (for example, differing column order, or the index contains both <literal>ASC</literal> and <literal>DESC</literal> columns). Pending a better solution, the optimization has been removed.
ru: Ошибки в небольшой оптимизации, введённой в 9.5, приводили к некорректным результатам, если при сравнении <literal>ROW()</literal> имело место частичное соответствие индексу, но не точное (например, когда порядок столбцов другой или в индексе есть столбцы с сортировкой и <literal>ASC</literal>, и <literal>DESC</literal>). Пока лучшее решение не найдено, эта оптимизация отключена.

source: Fix incorrect handling of NULL index entries in indexed <literal>ROW()</literal> comparisons (Tom Lane)
ru: Исправлена некорректная обработка NULL в сравнениях <literal>ROW()</literal> с применением индексов (Том Лейн)

source: An index search using a row comparison such as <literal>ROW(a, b) &gt; ROW('x', 'y')</literal> would stop upon reaching a NULL entry in the <structfield>b</structfield> column, ignoring the fact that there might be non-NULL <structfield>b</structfield> values associated with later values of <structfield>a</structfield>.
ru: Поиск по индексу со сравнением строк вида <literal>ROW(a, b) &gt; ROW('x', 'y')</literal> останавливался, доходя до элемента NULL в столбце <structfield>b</structfield>, игнорируя тот факт, что с последующими значениями <structfield>a</structfield> могут быть связаны значения <structfield>b</structfield>, отличные от NULL.
