Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.5.po
Languages: ru

source: Ensure that a purely negative text search query, such as <literal>!foo</literal>, matches empty <type>tsvector</type>s (Tom Dunstan)
ru: Определённо отрицательному поисковому запросу, например, <literal>!foo</literal>, должны удовлетворять пустые значения <type>tsvector</type> (Том Дунстан)

source: Such matches were found by GIN index searches, but not by sequential scans or GiST index searches.
ru: Такие соответствия находились при поиске по индексу GIN, но не при последовательном сканировании или поиске по индексу GiST.

source: Prevent crash when <function>ts_rewrite()</function> replaces a non-top-level subtree with an empty query (Artur Zakirov)
ru: Предотвращение сбоя в ситуации, когда <function>ts_rewrite()</function> заменяет поддерево не верхнего уровня пустым запросом (Артур Закиров)

source: Fix performance problems in <function>ts_rewrite()</function> (Tom Lane)
ru: Устранение проблем с производительностью в <function>ts_rewrite()</function> (Том Лейн)

source: Fix <function>ts_rewrite()</function>'s handling of nested NOT operators (Tom Lane)
ru: Исправление обработки в <function>ts_rewrite()</function> вложенных операторов NOT (Том Лейн)

source: Improve speed of user-defined aggregates that use <function>array_append()</function> as transition function (Tom Lane)
ru: Увеличение скорости пользовательских агрегатов, использующих в качестве перехода функцию <function>array_append()</function> (Том Лейн)

source: Fix <function>array_fill()</function> to handle empty arrays properly (Tom Lane)
ru: Исправление <function>array_fill()</function> для корректной обработки пустых массивов (Том Лейн)

source: Fix possible crash in <function>array_position()</function> or <function>array_positions()</function> when processing arrays of records (Junseok Yang)
ru: Предупреждение возможных сбоев в функциях <function>array_position()</function> и <function>array_positions()</function> при обработке массивов записей (Джун-сок Янг)

source: Fix one-byte buffer overrun in <function>quote_literal_cstr()</function> (Heikki Linnakangas)
ru: Устранение выхода на один байт за границу буфера в функции <function>quote_literal_cstr()</function> (Хейкки Линнакангас)

source: The overrun occurred only if the input consisted entirely of single quotes and/or backslashes.
ru: Этот выход имел место только если входная строка содержала исключительно апострофы и/или обратные косые черты.

source: Prevent multiple calls of <function>pg_start_backup()</function> and <function>pg_stop_backup()</function> from running concurrently (Michael Paquier)
ru: Предотвращение одновременного выполнения вызовов <function>pg_start_backup()</function> и <function>pg_stop_backup()</function> (Мишель Пакье)

source: This avoids an assertion failure, and possibly worse things, if someone tries to run these functions in parallel.
ru: Это предупреждает сбой проверки истинности и, вероятно, худшие последствия, в случае, если кто-то попытается запустить эти функции параллельно.

source: Disable transform that attempted to remove no-op <literal>AT TIME ZONE</literal> conversions (Tom Lane)
ru: Отключение трансформации, которая пыталась оптимизировать бесполезные преобразования <literal>AT TIME ZONE</literal> (Том Лейн)

source: This resulted in wrong answers when the simplified expression was used in an index condition.
ru: Вследствие этого выдавались неверные результаты, когда упрощённое выражение использовалось в условии индекса.

source: Avoid discarding <type>interval</type>-to-<type>interval</type> casts that aren't really no-ops (Tom Lane)
ru: Сохранение приведений <type>interval</type>-в-<type>interval</type>, которые на самом деле несут смысловую нагрузку (Том Лейн)

source: In some cases, a cast that should result in zeroing out low-order <type>interval</type> fields was mistakenly deemed to be a no-op and discarded. An example is that casting from <type>INTERVAL MONTH</type> to <type>INTERVAL YEAR</type> failed to clear the months field.
ru: В некоторых случаях приведения, которые должны были обнулять младшие поля значений <type>interval</type>, ошибочно считались бессмысленными и просто убирались. В результате, например, при приведении значения типа <type>INTERVAL MONTH</type> к <type>INTERVAL YEAR</type> поле месяцев не обнулялось.

source: Fix bugs in transmitting GUC parameter values to parallel workers (Michael Paquier, Tom Lane)
ru: Исправление ошибок при передаче значений параметров GUC параллельным исполнителям (Мишель Пакье, Том Лейн)

source: Ensure that cached plans are invalidated by changes in foreign-table options (Amit Langote, Etsuro Fujita, Ashutosh Bapat)
ru: Аннулирование кешированных планов при изменениях в параметрах сторонних таблиц (Амит Ланготе, Эцуро Фудзита, Ашутош Бапат)

source: Fix <application>pg_dump</application> to dump user-defined casts and transforms that use built-in functions (Stephen Frost)
ru: Исправление <application>pg_dump</application> для корректной выгрузки пользовательских приведений и преобразований, использующих встроенные функции (Стивен Фрост)

source: Fix <application>pg_restore</application> with <option>--create --if-exists</option> to behave more sanely if an archive contains unrecognized <command>DROP</command> commands (Tom Lane)
ru: Реализация более разумного поведения <application>pg_restore</application> с <option>--create --if-exists</option> в случаях, когда архив содержит нераспознанные команды <command>DROP</command> (Том Лейн)

source: This doesn't fix any live bug, but it may improve the behavior in future if <application>pg_restore</application> is used with an archive generated by a later <application>pg_dump</application> version.
ru: Это не устраняет никакую наблюдаемую ошибку, но может улучшить поведение в будущем, при использовании <application>pg_restore</application> с архивом, созданным предыдущей версией <application>pg_dump</application>.

source: Fix <application>pg_basebackup</application>'s rate limiting in the presence of slow I/O (Antonin Houska)
ru: Исправление ограничения нагрузки <application>pg_basebackup</application> при низкой скорости ввода/вывода (Антонин Хоуска)

source: If disk I/O was transiently much slower than the specified rate limit, the calculation overflowed, effectively disabling the rate limit for the rest of the run.
ru: Если скорость диска на время оказывалась ниже заданного ограничения, в вычислении происходило переполнение, и в результате ограничение отключалось до конца операции.

source: Fix <application>pg_basebackup</application>'s handling of symlinked <filename>pg_stat_tmp</filename> and <filename>pg_replslot</filename> subdirectories (Magnus Hagander, Michael Paquier)
ru: Обеспечение корректной работы <application>pg_basebackup</application> с подкаталогами <filename>pg_stat_tmp</filename> и <filename>pg_replslot</filename>, являющимися символическими ссылками (Магнус Хагандер, Мишель Пакье)

source: Fix possible <application>pg_basebackup</application> failure on standby server when including WAL files (Amit Kapila, Robert Haas)
ru: Предотвращение возможного сбоя <application>pg_basebackup</application> на резервном сервере при задействовании файлов WAL (Амит Капила, Роберт Хаас)

source: Fix possible mishandling of expanded arrays in domain check constraints and <literal>CASE</literal> execution (Tom Lane)
ru: Исправление возможного дефекта при обработке развёрнутых массивов в ограничениях-проверках доменов и в конструкциях <literal>CASE</literal> (Том Лейн)

source: It was possible for a PL/pgSQL function invoked in these contexts to modify or even delete an array value that needs to be preserved for additional operations.
ru: Существовала вероятность, что функция PL/pgSQL, вызванная в этих контекстах, изменит или даже удалит значение массива, которое должно сохраняться для дополнительных операций.

source: Fix nested uses of PL/pgSQL functions in contexts such as domain check constraints evaluated during assignment to a PL/pgSQL variable (Tom Lane)
ru: Исправление рекурсивного вызова функций PL/pgSQL в таких контекстах, как проверки ограничений домена, выполняемые при присвоении значения переменной PL/pgSQL (Том Лейн)

source: Ensure that the Python exception objects we create for PL/Python are properly reference-counted (Rafa de la Torre, Tom Lane)
ru: Обеспечение правильного учёта объектов исключений Python, создаваемых нами для PL/Python, счётчиками использования (Рафа де ла Торре, Том Лейн)

source: This avoids failures if the objects are used after a Python garbage collection cycle has occurred.
ru: Это предотвращает ошибки, возникавшие при использовании объектов после цикла уборки мусора в Python.

source: Fix PL/Tcl to support triggers on tables that have <literal>.tupno</literal> as a column name (Tom Lane)
ru: Исправление в PL/Tcl поддержки триггеров для таблиц, в которых имеется столбец <literal>.tupno</literal> (Том Лейн)

source: This matches the (previously undocumented) behavior of PL/Tcl's <command>spi_exec</command> and <command>spi_execp</command> commands, namely that a magic <literal>.tupno</literal> column is inserted only if there isn't a real column named that.
ru: Это соответствует (ранее недокументированному) поведению команд PL/Tcl <command>spi_exec</command> и <command>spi_execp</command>, в том, что особый столбец <literal>.tupno</literal> добавляется, только если отсутствует настоящий с таким именем.

source: Allow DOS-style line endings in <filename>~/.pgpass</filename> files, even on Unix (Vik Fearing)
ru: В файлах <filename>~/.pgpass</filename> должны допускаться завершения строк в стиле DOS, даже на Unix-платформах (Вик Фиринг)

source: This change simplifies use of the same password file across Unix and Windows machines.
ru: Это изменение упрощает использование одних и тех же файлов паролей на машинах с Unix и Windows.

source: Fix one-byte buffer overrun if <application>ecpg</application> is given a file name that ends with a dot (Takayuki Tsunakawa)
ru: Устранение выхода на один байт за границу буфера, когда <application>ecpg</application> передаётся имя файла, которое заканчивается точкой (Такаюки Цунакава)

source: Fix <application>psql</application>'s tab completion for <command>ALTER DEFAULT PRIVILEGES</command> (Gilles Darold, Stephen Frost)
ru: Исправление в <application>psql</application> дополнения табуляцией для команды <command>ALTER DEFAULT PRIVILEGES</command> (Жиль Даролд, Стивен Фрост)

source: In <application>psql</application>, treat an empty or all-blank setting of the <envar>PAGER</envar> environment variable as meaning <quote>no pager</quote> (Tom Lane)
ru: В <application>psql</application> пустое или содержащее только пробелы значение переменной окружения <envar>PAGER</envar> должно означать <quote>без постраничника</quote> (Том Лейн)

source: Previously, such a setting caused output intended for the pager to vanish entirely.
ru: Ранее с таким значением вывод, предназначенный для постраничника, просто исчезал.

source: Improve <filename>contrib/dblink</filename>'s reporting of low-level <application>libpq</application> errors, such as out-of-memory (Joe Conway)
ru: Улучшение в <filename>contrib/dblink</filename> передачи сообщений о низкоуровневых ошибках <application>libpq</application>, например, о нехватке памяти (Джо Конвей)

source: Teach <filename>contrib/dblink</filename> to ignore irrelevant server options when it uses a <filename>contrib/postgres_fdw</filename> foreign server as the source of connection options (Corey Huinker)
ru: Реализация <filename>contrib/dblink</filename> должна игнорировать невоспринимаемые ей параметры сервера, когда в качестве источника параметров подключения используется сторонний сервер <filename>contrib/postgres_fdw</filename> (Кори Хаинкер)

source: Previously, if the foreign server object had options that were not also <application>libpq</application> connection options, an error occurred.
ru: Ранее, если объект стороннего сервера имел параметры, которые не относились к параметрам подключения <application>libpq</application>, происходила ошибка.

source: Fix portability problems in <filename>contrib/pageinspect</filename>'s functions for GIN indexes (Peter Eisentraut, Tom Lane)
ru: Исправление проблем с переносимостью в функциях <filename>contrib/pageinspect</filename>, связанных с индексами GIN (Питер Эйзентраут, Том Лейн)

source: On Windows, ensure that environment variable changes are propagated to DLLs built with debug options (Christian Ullrich)
ru: В Windows изменённые переменные окружения должны передаваться и отладочным DLL (Кристина Ульрих)

source: Sync our copy of the timezone library with IANA release tzcode2016j (Tom Lane)
ru: Синхронизация нашей копии библиотеки timezone с выпущенной IANA версией tzcode2016j (Том Лейн)

source: This fixes various issues, most notably that timezone data installation failed if the target directory didn't support hard links.
ru: Это решило ряд проблем; в частности, проблему при установке данных о часовых поясах в каталог, в котором не поддерживаются жёсткие ссылки.

source: Update time zone data files to <application>tzdata</application> release 2016j for DST law changes in northern Cyprus (adding a new zone Asia/Famagusta), Russia (adding a new zone Europe/Saratov), Tonga, and Antarctica/Casey. Historical corrections for Italy, Kazakhstan, Malta, and Palestine. Switch to preferring numeric zone abbreviations for Tonga.
ru: Обновление данных часовых поясов до версии <application>tzdata</application> 2016j, включающее изменения правил перехода на летнее время на Северном Кипре (добавление нового пояса Asia/Famagusta), в России (добавление нового пояса Europe/Saratov), в Тонга и в Антарктике/Кейси, плюс корректировку исторических данных для Италии, Казахстана, Мальты и Палестины. Переход к предпочитаемому числовому обозначению пояса для Тонга.

source: Release 9.5.5
ru: Выпуск 9.5.5

source: This release contains a variety of fixes from 9.5.4. For information about new features in the 9.5 major release, see <xref linkend="release-9-5"/>.
ru: В этот выпуск вошли различные исправления, внесённые после версии 9.5.4. За информацией о нововведениях версии 9.5 обратитесь к <xref remap="3" linkend="release-9-5"/>.

source: Migration to Version 9.5.5
ru: Миграция на версию 9.5.5

source: However, if your installation has been affected by the bug described in the first changelog entry below, then after updating you may need to take action to repair corrupted free space maps.
ru: Однако, если в вашей инсталляции проявилась ошибка, описанная в первой записи следующего списка изменений, после обновления вам может потребоваться предпринять дополнительные действия для исправления испорченных карт свободного места.

source: Also, if you are upgrading from a version earlier than 9.5.2, see <xref linkend="release-9-5-2"/>.
ru: Также, если вы обновляете сервер с версии, более ранней, чем 9.5.2, см. <xref remap="4" linkend="release-9-5-2"/>.

source: Fix WAL-logging of truncation of relation free space maps and visibility maps (Pavan Deolasee, Heikki Linnakangas)
ru: Корректировка записи в WAL отметки об очистке карт свободного пространства и видимости (Паван Деоласи, Хейкки Линнакангас)

source: It was possible for these files to not be correctly restored during crash recovery, or to be written incorrectly on a standby server. Bogus entries in a free space map could lead to attempts to access pages that have been truncated away from the relation itself, typically producing errors like <quote>could not read block <replaceable>XXX</replaceable>: read only 0 of 8192 bytes</quote>. Checksum failures in the visibility map are also possible, if checksumming is enabled.
ru: Ранее могло получаться так, что эти файлы не восстанавливались корректно при восстановлении после сбоя или оказывались неправильными на резервном сервере. Обращение к недействительному содержимому карты свободного пространства могло повлечь попытки использовать страницы, которые были стёрты из самого отношения, что обычно приводило к ошибкам типа <quote>не удалось прочитать блок <replaceable>XXX</replaceable>: прочитано только 0 из 8192 байт</quote>. Также были возможны нарушения контрольных сумм в карте видимости, при включённом механизме контрольных сумм.

source: Procedures for determining whether there is a problem and repairing it if so are discussed at <ulink url="https://wiki.postgresql.org/wiki/Free_Space_Map_Problems"/>.
ru: Процедуры для определения наличия проблемы и её исправления рассматриваются в <ulink url="https://wiki.postgresql.org/wiki/Free_Space_Map_Problems"/>.

source: Fix incorrect creation of GIN index WAL records on big-endian machines (Tom Lane)
ru: Исправление некорректного создания в WAL записей, относящихся к индексам GIN, на машинах с порядком байт от старшего (Том Лейн)

source: The typical symptom was <quote>unexpected GIN leaf action</quote> errors during WAL replay.
ru: Типичным симптомом данной проблемы были ошибки <quote>unexpected GIN leaf action</quote> (неожиданное действие на уровне листьев GIN) при воспроизведении WAL.

source: Fix <command>SELECT FOR UPDATE/SHARE</command> to correctly lock tuples that have been updated by a subsequently-aborted transaction (&Aacute;lvaro Herrera)
ru: Исправление команды <command>SELECT FOR UPDATE/SHARE</command>, чтобы кортежи, изменённые впоследствии прерванной транзакцией, блокировались корректно (Альваро Эррера)

source: In 9.5 and later, the <command>SELECT</command> would sometimes fail to return such tuples at all. A failure has not been proven to occur in earlier releases, but might be possible with concurrent updates.
ru: Начиная с версии 9.5, команда <command>SELECT</command> иногда могла вообще не выдавать такие кортежи. Подтверждений того, что это могло иметь место в предыдущих версиях, не было, но теоретически при одновременных изменениях это возможно.

source: Fix EvalPlanQual rechecks involving CTE scans (Tom Lane)
ru: Исправление перепроверок EvalPlanQual в ситуациях со сканированием CTE (Том Лейн)

source: The recheck would always see the CTE as returning no rows, typically leading to failure to update rows that were recently updated.
ru: Перепроверка всегда воспринимала такие CTE, как не возвращающие строки, в результате чего обычно не удавалось изменить строки, которые были изменены недавно.

source: Fix deletion of speculatively inserted TOAST tuples when backing out of <command>INSERT ... ON CONFLICT</command> (Oskari Saarenmaa)
ru: Исправлено удаление спекулятивно добавленных кортежей TOAST при выходе из <command>INSERT ... ON CONFLICT</command> (Оскари Сааренмаа)

source: In the race condition where two transactions try to insert conflicting tuples at about the same time, the loser would fail with an <quote>attempted to delete invisible tuple</quote> error if its insertion included any TOAST'ed fields.
ru: В условиях гонки, когда две транзакции пытаются вставить конфликтующие кортежи, в проигравшей транзакции происходила ошибка <quote>попытка удаления невидимого кортежа</quote>, если при добавлении вставлялись поля TOAST.

source: Don't throw serialization errors for self-conflicting insertions in <command>INSERT ... ON CONFLICT</command> (Thomas Munro, Peter Geoghegan)
ru: Предотвращение ошибок сериализации при операции добавлении данных, конфликтующей с собой же, в <command>INSERT ... ON CONFLICT</command> (Томас Мунро, Питер Геохеган)

source: Fix improper repetition of previous results from hashed aggregation in a subquery (Andrew Gierth)
ru: Исправление некорректного повторения предыдущих результатов агрегирования по хешу в подзапросе (Эндрю Гирт)

source: The test to see if we can reuse a previously-computed hash table of the aggregate state values neglected the possibility of an outer query reference appearing in an aggregate argument expression. A change in the value of such a reference should lead to recalculating the hash table, but did not.
ru: Проверка возможности повторного использования ранее вычисленной хеш-таблицы со значениями состояния агрегата не учитывала то, что в выражении агрегируемого аргумента могла фигурировать ссылка на внешний запрос. В этом случае изменение в значении этой ссылки должно было приводить к пересчёту хеш-таблицы, но этого не происходило.

source: Fix query-lifespan memory leak in a bulk <command>UPDATE</command> on a table with a <literal>PRIMARY KEY</literal> or <literal>REPLICA IDENTITY</literal> index (Tom Lane)
ru: Ликвидирована утечка памяти на протяжении запроса в массовой команде <command>UPDATE</command> для таблицы с индексом <literal>PRIMARY KEY</literal> или <literal>REPLICA IDENTITY</literal> (Том Лейн)

source: Fix <command>COPY</command> with a column name list from a table that has row-level security enabled (Adam Brightwell)
ru: Исправление <command>COPY</command> со списком имён столбцов из таблицы, в которой включена защита на уровне строк (Адам Брайтвелл)

source: Fix <command>EXPLAIN</command> to emit valid XML when <xref linkend="guc-track-io-timing"/> is on (Markus Winand)
ru: Исправление <command>EXPLAIN</command>, чтобы она выдавала корректный XML, когда параметр <xref linkend="guc-track-io-timing"/> включён (Маркус Винанд)

source: Previously the XML output-format option produced syntactically invalid tags such as <literal>&lt;I/O-Read-Time&gt;</literal>. That is now rendered as <literal>&lt;I-O-Read-Time&gt;</literal>.
ru: Ранее вывод в формате XML содержал синтаксически некорректные теги, как например <literal>&lt;I/O-Read-Time&gt;</literal>. Сейчас выдаётся такой тег: <literal>&lt;I-O-Read-Time&gt;</literal>.

source: Suppress printing of zeroes for unmeasured times in <command>EXPLAIN</command> (Maksim Milyutin)
ru: Подавление вывода нулей для неизмеренного времени в <command>EXPLAIN</command> (Максим Милютин)

source: Certain option combinations resulted in printing zero values for times that actually aren't ever measured in that combination. Our general policy in <command>EXPLAIN</command> is not to print such fields at all, so do that consistently in all cases.
ru: При определённом сочетании параметров команда <command>EXPLAIN</command> выдавала нулевые значения для того времени, которое на самом деле даже не замеряется при этих параметрах. Мы придерживаемся политики не выдавать такие поля в выводе <command>EXPLAIN</command>, так что нужно обеспечить согласованность во всех случаях.

source: Fix statistics update for <command>TRUNCATE</command> in a prepared transaction (Stas Kelvich)
ru: Исправление обновления статистики при <command>TRUNCATE</command> в подготовленной транзакции (Стас Кельвич)

source: Fix timeout length when <command>VACUUM</command> is waiting for exclusive table lock so that it can truncate the table (Simon Riggs)
ru: Исправление длительности таймаута, установленного для ожидания командой <command>VACUUM</command> исключительной блокировки, чтобы она могла опустошить таблицу (Саймон Риггс)

source: The timeout was meant to be 50 milliseconds, but it was actually only 50 microseconds, causing <command>VACUUM</command> to give up on truncation much more easily than intended. Set it to the intended value.
ru: Длительность таймаута должна была составлять 50 миллисекунд, но на самом деле это было лишь 50 микросекунд, в результате чего команда <command>VACUUM</command> оставляла попытку опустошить таблицу гораздо раньше, чем планировалось. Теперь устанавливается запланированное значение.

source: Fix bugs in merging inherited <literal>CHECK</literal> constraints while creating or altering a table (Tom Lane, Amit Langote)
ru: Исправление ошибок при объединении наследуемых ограничений <literal>CHECK</literal> в процессе создания или изменения структуры таблицы (Том Лейн, Амит Ланготе)
