Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/release-9.5.po
Languages: ru

source: Avoid unlikely data-loss scenarios due to renaming files without adequate <function>fsync()</function> calls before and after (Michael Paquier, Tomas Vondra, Andres Freund)
ru: Предотвращение маловероятных сценариев потери данных в случае переименования файлов без соответствующих вызовов <function>fsync()</function> до и после (Мишель Пакье, Томас Вондра, Андрес Фройнд)

source: Fix incorrect behavior when rechecking a just-modified row in a query that does <command>SELECT FOR UPDATE/SHARE</command> and contains some relations that need not be locked (Tom Lane)
ru: Исправлено некорректное поведение при перепроверке только что изменённой строки в запросе, выполняющем <command>SELECT FOR UPDATE/SHARE</command> и обращающемся к отношениям, которые не нужно блокировать (Том Лейн)

source: Rows from non-locked relations were incorrectly treated as containing all NULLs during the recheck, which could result in incorrectly deciding that the updated row no longer passes the <literal>WHERE</literal> condition, or in incorrectly outputting NULLs.
ru: Строки из незаблокированных отношений некорректно воспринимались во время перепроверки как полностью содержащие NULL, что могло привести к неправильному выводу о том, что изменённая строка больше не удовлетворяет условию <literal>WHERE</literal>, или к выдаче NULL в результате.

source: Fix bug in <function>json_to_record()</function> when a field of its input object contains a sub-object with a field name matching one of the requested output column names (Tom Lane)
ru: Исправлена ошибка в <function>json_to_record()</function>, возникавшая, когда поле входного объекта содержало вложенный объект с полем, имя которого совпадало с именем одного из запрошенных выходных столбцов (Том Лейн)

source: Fix nonsense result from two-argument form of <function>jsonb_object()</function> when called with empty arrays (Michael Paquier, Andrew Dunstan)
ru: Исправлен бессмысленный результат функции <function>jsonb_object()</function> в форме с двумя аргументами при вызове с пустыми массивами (Мишель Пакье, Эндрю Дунстан)

source: Fix misbehavior in <function>jsonb_set()</function> when converting a path array element into an integer for use as an array subscript (Michael Paquier)
ru: Исправлено некорректное поведение в <function>jsonb_set()</function> при преобразовании элемента массива путей в целое значение для использования в качестве индекса массива (Мишель Пакье)

source: Fix misformatting of negative time zone offsets by <function>to_char()</function>'s <literal>OF</literal> format code (Thomas Munro, Tom Lane)
ru: Исправлено некорректное форматирование отрицательных смещений часовых поясов в функции <function>to_char()</function> с применением кода формата <literal>OF</literal> (Томас Мунро, Том Лейн)

source: Fix possible incorrect logging of waits done by <command>INSERT ... ON CONFLICT</command> (Peter Geoghegan)
ru: Исправлена некорректное протоколирование событий ожидания, имеющих место в <command>INSERT ... ON CONFLICT</command> (Питер Геохеган)

source: Log messages would sometimes claim that the wait was due to an exclusion constraint although no such constraint was responsible.
ru: В выводимых сообщениях иногда отмечалось, что ожидание было вызвано ограничением-исключением, хотя такое ограничение было не при чём.

source: Ignore <xref linkend="recovery-min-apply-delay"/> parameter until recovery has reached a consistent state (Michael Paquier)
ru: Параметр <xref linkend="recovery-min-apply-delay"/> игнорируется, пока восстановление не достигло согласованного состояния (Мишель Пакье)

source: Previously, standby servers would delay application of WAL records in response to <varname>recovery_min_apply_delay</varname> even while replaying the initial portion of WAL needed to make their database state valid. Since the standby is useless until it's reached a consistent database state, this was deemed unhelpful.
ru: Ранее, резервные серверы откладывали применение записей WAL, учитывая <varname>recovery_min_apply_delay</varname>, даже при воспроизведении начальной порции WAL, необходимой для приведения базы данных в рабочее состояние. Так как резервный сервер бесполезен, пока он не достиг согласованного состояния базы данных, это кажется напрасным.

source: Correctly handle cases where <literal>pg_subtrans</literal> is close to XID wraparound during server startup (Jeff Janes)
ru: Корректная обработка ситуаций, когда <literal>pg_subtrans</literal> на грани зацикливания XID при запуске сервера (Джефф Джейнс)

source: Fix assorted bugs in logical decoding (Andres Freund)
ru: Исправление разнообразных ошибок в логическом декодировании (Андрес Фройнд)

source: Trouble cases included tuples larger than one page when replica identity is <literal>FULL</literal>, <command>UPDATE</command>s that change a primary key within a transaction large enough to be spooled to disk, incorrect reports of <quote>subxact logged without previous toplevel record</quote>, and incorrect reporting of a transaction's commit time.
ru: Проблемы возникали с кортежами больше одной страницы с вариантом идентификации реплики <literal>FULL</literal>, при выполнении команд <command>UPDATE</command>, изменяющих первичный ключ в транзакции, достаточно большой для выгрузки на диск, а также с некорректными ошибками <quote>subxact logged without previous toplevel record</quote> (транзакция внесена в журнал без предыдущей записи верхнего уровня) и с некорректным выводом времени фиксирования транзакций.

source: Fix planner error with nested security barrier views when the outer view has a <literal>WHERE</literal> clause containing a correlated subquery (Dean Rasheed)
ru: Исправлена ошибка планировщика, возникавшая с вложенными представлениями с барьерами безопасности, когда внешнее представление содержит предложение <literal>WHERE</literal> с коррелирующим подзапросом (Дин Рашид)

source: Fix memory leak in GIN index searches (Tom Lane)
ru: Ликвидирована утечка памяти при поиске по индексу GIN (Том Лейн)

source: Fix corner-case crash due to trying to free <function>localeconv()</function> output strings more than once (Tom Lane)
ru: Предотвращён крах в исключительной ситуации при попытке повторно освободить строки, выводимые <function>localeconv()</function> (Том Лейн)

source: Fix parsing of affix files for <literal>ispell</literal> dictionaries (Tom Lane)
ru: Исправлен разбор файлов аффиксов для словарей <literal>ispell</literal> (Том Лейн)

source: The code could go wrong if the affix file contained any characters whose byte length changes during case-folding, for example <literal>I</literal> in Turkish UTF8 locales.
ru: Код разбора мог работать неправильно, если файл аффиксов содержит символы, которые могут менять размер в байтах при преобразовании регистра, как например, символ <literal>I</literal> в турецких локалях UTF8.

source: Avoid use of <function>sscanf()</function> to parse <literal>ispell</literal> dictionary files (Artur Zakirov)
ru: Исключено использование <function>sscanf()</function> при разборе файлов словарей <literal>ispell</literal> (Артур Закиров)

source: This dodges a portability problem on FreeBSD-derived platforms (including macOS).
ru: Это устраняет проблему переносимости на платформы на базе FreeBSD (включая macOS).

source: Fix atomic-operations code used on PPC with IBM's xlc compiler (Noah Misch)
ru: Исправление кода атомарных операций, генерируемого на PPC компилятором IBM xlc (Ной Миш)

source: This error led to rare failures of concurrent operations on that platform.
ru: Эта ошибка приводила к редким сбоям при параллельных операциях на этой платформе.

source: Avoid a crash on old Windows versions (before 7SP1/2008R2SP1) with an AVX2-capable CPU and a Postgres build done with Visual Studio 2013 (Christian Ullrich)
ru: Предотвращение сбоя на старых версиях Windows (до 7SP1/2008R2SP1) с процессором с поддержкой AVX2 и с Postgres, собранным компилятором Visual Studio 2013 (Кристиан Ульрих)

source: This is a workaround for a bug in Visual Studio 2013's runtime library, which Microsoft have stated they will not fix in that version.
ru: Это обходное решение проблемы в библиотеки выполнения Visual Studio 2013, которая, как заявили в Microsoft, не будет исправляться в этой версии.

source: Fix <application>psql</application>'s tab completion logic to handle multibyte characters properly (Kyotaro Horiguchi, Robert Haas)
ru: В <application>psql</application> исправлена логика завершения команд табуляцией с учётом особенностей многобайтных символов (Киотаро Хоригучи, Роберт Хаас)

source: Fix <application>psql</application>'s tab completion for <literal>SECURITY LABEL</literal> (Tom Lane)
ru: В <application>psql</application> исправлено завершение табуляцией команды <literal>SECURITY LABEL</literal> (Том Лейн)

source: Pressing TAB after <literal>SECURITY LABEL</literal> might cause a crash or offering of inappropriate keywords.
ru: При нажатии TAB после ввода <literal>SECURITY LABEL</literal> мог произойти сбой или выдавались посторонние ключевые слова.

source: Make <application>pg_ctl</application> accept a wait timeout from the <envar>PGCTLTIMEOUT</envar> environment variable, if none is specified on the command line (Noah Misch)
ru: Команда <application>pg_ctl</application> теперь принимает тайм-аут ожидания из переменной среды <envar>PGCTLTIMEOUT</envar>, если этот тайм-аут не задан в командной строке (Ной Миш)

source: This eases testing of slower buildfarm members by allowing them to globally specify a longer-than-normal timeout for postmaster startup and shutdown.
ru: Это упрощает тестирование более медленных узлов на ферме сборки, позволяя индивидуально задавать время, превышающее обычное, для запуска и завершения главного процесса (postmaster).

source: Fix incorrect test for Windows service status in <application>pg_ctl</application> (Manuel Mathar)
ru: Исправление ошибочной проверки состояния службы Windows в <application>pg_ctl</application> (Мануэль Матар)

source: The previous set of minor releases attempted to fix <application>pg_ctl</application> to properly determine whether to send log messages to Window's Event Log, but got the test backwards.
ru: В предыдущих корректирующих выпусках были попытки исправить <application>pg_ctl</application>, чтобы он правильно определял, нужно ли отправлять сообщения в журнал событий Window, но в итоге проверка оказалась противоположной.

source: Fix <application>pgbench</application> to correctly handle the combination of <literal>-C</literal> and <literal>-M prepared</literal> options (Tom Lane)
ru: Исправлено поведение <application>pgbench</application>, чтобы сочетание параметров <literal>-C</literal> и <literal>-M prepared</literal> обрабатывалось корректно (Том Лейн)

source: In <application>pg_upgrade</application>, skip creating a deletion script when the new data directory is inside the old data directory (Bruce Momjian)
ru: В <application>pg_upgrade</application> теперь пропускается создание скрипта удаления, когда новый каталог данных находится внутри старого (Брюс Момджян)

source: Blind application of the script in such cases would result in loss of the new data directory.
ru: Выполнение этого скрипта «вслепую» в таких случаях приводило к потере нового каталога данных.

source: In PL/Perl, properly translate empty Postgres arrays into empty Perl arrays (Alex Hunsaker)
ru: В PL/Perl пустые массивы Postgres стали корректно переводиться в пустые массивы Perl (Алекс Хансакер)

source: Make PL/Python cope with function names that aren't valid Python identifiers (Jim Nasby)
ru: Код PL/Python адаптирован для работы с именами функций, не подходящими для идентификаторов Python (Джим Нэсби)

source: Fix multiple mistakes in the statistics returned by <filename>contrib/pgstattuple</filename>'s <function>pgstatindex()</function> function (Tom Lane)
ru: Исправление ряда ошибок в статистике, возвращаемой функцией <function>pgstatindex()</function> из <filename>contrib/pgstattuple</filename> (Том Лейн)

source: Remove dependency on <literal>psed</literal> in MSVC builds, since it's no longer provided by core Perl (Michael Paquier, Andrew Dunstan)
ru: Ликвидация зависимости от <literal>psed</literal> в сборках с MSVC, так как ядро Perl больше не предоставляет её (Мишель Пакье, Эндрю Дунстан)

source: Update time zone data files to <application>tzdata</application> release 2016c for DST law changes in Azerbaijan, Chile, Haiti, Palestine, and Russia (Altai, Astrakhan, Kirov, Sakhalin, Ulyanovsk regions), plus historical corrections for Lithuania, Moldova, and Russia (Kaliningrad, Samara, Volgograd).
ru: Обновление данных часовых поясов до версии <application>tzdata</application> 2016c, включающее изменения правил перехода на летнее время в Азербайджане, Чили, на Гаити, в Палестине и России (в Алтайском крае, Астраханской, Кировской и Ульяновской областях, а также на Сахалине), плюс корректировку исторических данных для Литвы, Молдавии и России (для Калининграда, Самары и Волгограда).

source: Release 9.5.1
ru: Выпуск 9.5.1

source: This release contains a variety of fixes from 9.5.0. For information about new features in the 9.5 major release, see <xref linkend="release-9-5"/>.
ru: В этот выпуск вошли различные исправления, внесённые после версии 9.5.0. За информацией о нововведениях версии 9.5 обратитесь к <xref remap="3" linkend="release-9-5"/>.

source: Migration to Version 9.5.1
ru: Миграция на версию 9.5.1

source: Fix infinite loops and buffer-overrun problems in regular expressions (Tom Lane)
ru: Исправлены проблемы с бесконечными циклами и переполнениями буфера в регулярных выражениях (Том Лейн)

source: Very large character ranges in bracket expressions could cause infinite loops in some cases, and memory overwrites in other cases. (CVE-2016-0773)
ru: С очень большими диапазонами символов в некоторых случаях можно было добиться бесконечного цикла, а в других — переполнения памяти. (CVE-2016-0773)

source: Fix an oversight that caused hash joins to miss joining to some tuples of the inner relation in rare cases (Tomas Vondra, Tom Lane)
ru: Исправлено упущение, из-за которого в редких случаях при соединениях по хешу пропускалось соединение некоторых кортежей внутреннего отношения (Томас Вондра, Том Лейн)

source: Avoid pushdown of <literal>HAVING</literal> clauses when grouping sets are used (Andrew Gierth)
ru: Предотвращено проталкивание предложений <literal>HAVING</literal> в подзапросы, когда применяются наборы группирования (Эндрю Гирт)

source: Fix deparsing of <literal>ON CONFLICT</literal> arbiter <literal>WHERE</literal> clauses (Peter Geoghegan)
ru: Исправление пересборки арбитра <literal>ON CONFLICT</literal> в предложении <literal>WHERE</literal> (Питер Геохеган)

source: Make <literal>%h</literal> and <literal>%r</literal> escapes in <varname>log_line_prefix</varname> work for messages emitted due to <varname>log_connections</varname> (Tom Lane)
ru: Спецкоды <literal>%h</literal> и <literal>%r</literal> в <varname>log_line_prefix</varname> стали работать в сообщениях, выдаваемых в режиме <varname>log_connections</varname> (Том Лейн)

source: Previously, <literal>%h</literal>/<literal>%r</literal> started to work just after a new session had emitted the <quote>connection received</quote> log message; now they work for that message too.
ru: Ранее <literal>%h</literal>/<literal>%r</literal> начинали работать только после того, как новый сеанс выдавал сообщение <quote>connection received</quote> (соединение получено); теперь они работают и для этого сообщения.

source: Avoid leaking a token handle during SSPI authentication (Christian Ullrich)
ru: Ликвидация утечки маркера в процессе аутентификации SSPI (Кристиан Ульрих)

source: Fix <application>psql</application>'s <literal>\det</literal> command to interpret its pattern argument the same way as other <literal>\d</literal> commands with potentially schema-qualified patterns do (Reece Hart)
ru: Исправлена команда <literal>\det</literal> в <application>psql</application>, чтобы она воспринимала шаблон, передаваемый ей в аргументе, так же, как другие команды <literal>\d</literal> с шаблонами, которые могут дополняться схемами (Рис Харт)

source: In <application>pg_ctl</application> on Windows, check service status to decide where to send output, rather than checking if standard output is a terminal (Michael Paquier)
ru: Программа <application>pg_ctl</application> в Windows должна выбирать, куда направлять вывод, проверяя состояние службы, а не то, что устройство стандартного вывода является терминалом (Мишель Пакье)

source: Fix assorted corner-case bugs in <application>pg_dump</application>'s processing of extension member objects (Tom Lane)
ru: Исправление разнообразных ошибок в исключительных случаях при обработке объектов-членов расширений в <application>pg_dump</application> (Том Лейн)

source: Fix improper quoting of domain constraint names in <application>pg_dump</application> (Elvis Pranskevichus)
ru: Исправлено некорректное заключение в кавычки имён ограничений доменов в <application>pg_dump</application> (Элвис Пранскевичус)

source: Make <application>pg_dump</application> mark a view's triggers as needing to be processed after its rule, to prevent possible failure during parallel <application>pg_restore</application> (Tom Lane)
ru: Теперь <application>pg_dump</application> помечает триггеры представления, чтобы они обрабатывались после правил, во избежание ошибок при параллельном <application>pg_restore</application> (Том Лейн)

source: Install guards in <application>pgbench</application> against corner-case overflow conditions during evaluation of script-specified division or modulo operators (Fabien Coelho, Michael Paquier)
ru: Внедрение в <application>pgbench</application> защиты от переполнения в исключительных случаях при вычислении заданных в скрипте операторов деления или взятия остатка (Фабьен Коэльо, Мишель Пакье)

source: Suppress useless warning message when <application>pg_receivexlog</application> connects to a pre-9.4 server (Marco Nenciarini)
ru: Подавление бесполезного предупреждения при подключении <application>pg_receivexlog</application> к серверу версии до 9.4 (Марко Ненчарини)

source: Avoid dump/reload problems when using both <application>plpython2</application> and <application>plpython3</application> (Tom Lane)
ru: Решение проблем с выгрузкой/перезагрузкой данных при одновременном использовании <application>plpython2</application> и <application>plpython3</application> (Том Лейн)

source: In principle, both versions of <application>PL/Python</application> can be used in the same database, though not in the same session (because the two versions of <application>libpython</application> cannot safely be used concurrently). However, <application>pg_restore</application> and <application>pg_upgrade</application> both do things that can fall foul of the same-session restriction. Work around that by changing the timing of the check.
ru: В принципе можно использовать обе версии <application>PL/Python</application> в одной базе данных, но не в одном сеансе (так как две версии <application>libpython</application> нельзя безопасно использовать одновременно). Однако и <application>pg_restore</application>, и <application>pg_upgrade</application> в своей работе нарушают это ограничение одного сеанса. В качестве обходного решения изменено время проверки версий.

source: Fix <application>PL/Python</application> regression tests to pass with Python 3.5 (Peter Eisentraut)
ru: Исправление регрессионных тестов <application>PL/Python</application> для совместимости с Python 3.5 (Питер Эйзентраут)

source: Prevent certain <application>PL/Java</application> parameters from being set by non-superusers (Noah Misch)
ru: Недопущение установки определённых параметров <application>PL/Java</application> непривилегированными пользователями (Ной Миш)

source: This change mitigates a <application>PL/Java</application> security bug (CVE-2016-0766), which was fixed in <application>PL/Java</application> by marking these parameters as superuser-only. To fix the security hazard for sites that update <productname>PostgreSQL</productname> more frequently than <application>PL/Java</application>, make the core code aware of them also.
ru: Это изменение ликвидирует угрозу, связанную с уязвимостью в <application>PL/Java</application> (CVE-2016-0766), исправленной в <application>PL/Java</application> (эти параметры теперь доступны только суперпользователю). Чтобы ликвидировать угрозу безопасности для тех серверов <productname>PostgreSQL</productname>, которые обновляются чаще, чем <application>PL/Java</application>, это изменение внесено также в код ядра сервера.

source: Fix <application>ecpg</application>-supplied header files to not contain comments continued from a preprocessor directive line onto the next line (Michael Meskes)
ru: Исправление заголовочных файлов, поставляемых с <application>ecpg</application>: в директиву препроцессора не должен включаться комментарий, продолжающийся в следующей строке (Михаэль Мескес)

source: Such a comment is rejected by <application>ecpg</application>. It's not yet clear whether <application>ecpg</application> itself should be changed.
ru: Такой комментарий не принимается препроцессором <application>ecpg</application>. Пока не вполне ясно, следует ли скорректировать сам <application>ecpg</application>.

source: Fix <function>hstore_to_json_loose()</function>'s test for whether an <type>hstore</type> value can be converted to a JSON number (Tom Lane)
ru: Исправление в <function>hstore_to_json_loose()</function> проверки, можно ли преобразовать значение <type>hstore</type> в число JSON (Том Лейн)

source: Previously this function could be fooled by non-alphanumeric trailing characters, leading to emitting syntactically-invalid JSON.
ru: Ранее эту функцию можно было ввести в заблуждение не алфавитно-цифровыми замыкающими символами, что приводило к формированию синтаксически некорректного JSON.

source: In <filename>contrib/postgres_fdw</filename>, fix bugs triggered by use of <literal>tableoid</literal> in data-modifying commands (Etsuro Fujita, Robert Haas)
ru: В <filename>contrib/postgres_fdw</filename> исправлены ошибки, вызванные использованием <literal>tableoid</literal> в командах, модифицирующих данные (Эцуро Фудзита, Роберт Хаас)

source: Fix ill-advised restriction of <literal>NAMEDATALEN</literal> to be less than 256 (Robert Haas, Tom Lane)
ru: Исправлено некорректно введённое ограничение <literal>NAMEDATALEN</literal> 256 байтами (Роберт Хаас, Том Лейн)

source: Improve reproducibility of build output by ensuring filenames are given to the linker in a fixed order (Christoph Berg)
ru: Улучшение воспроизводимости сборки путём обеспечения фиксированного порядка имён файлов, передаваемых компоновщику (Кристоф Берг)

source: This avoids possible bitwise differences in the produced executable files from one build to the next.
ru: Это устраняет возможные двоичные различия создаваемых исполняемых файлов от сборки к сборке.

source: Ensure that <filename>dynloader.h</filename> is included in the installed header files in MSVC builds (Bruce Momjian, Michael Paquier)
ru: Включение <filename>dynloader.h</filename> в список устанавливаемых заголовочных файлов при сборке с MSVC (Брюс Момджян, Мишель Пакье)

source: Update time zone data files to <application>tzdata</application> release 2016a for DST law changes in Cayman Islands, Metlakatla, and Trans-Baikal Territory (Zabaykalsky Krai), plus historical corrections for Pakistan.
ru: Обновление данных часовых поясов до версии <application>tzdata</application> 2016a, включающее изменения правил перехода на летнее время на Каймановых островах, в Метлакалте и Забайкальском крае, плюс корректировку исторических данных для Пакистана.

source: Release 9.5
ru: Выпуск 9.5

source: Overview
ru: Обзор
