Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/sourcerepo.po
Languages: ru

source: The Source Code Repository
ru: Репозиторий исходного кода

source: The <productname>PostgreSQL</productname> source code is stored and managed using the <productname>Git</productname> version control system. A public mirror of the master repository is available; it is updated within a minute of any change to the master repository.
ru: Исходный код <productname>PostgreSQL</productname> хранится и управляется системой управления версиями <productname>Git</productname>. В Интернете доступно открытое зеркало главного репозитория, которое обновляется в течение минуты после изменения в главном репозитории.

source: Our wiki, <ulink url="https://wiki.postgresql.org/wiki/Working_with_Git"/>, has some discussion on working with Git.
ru: Работа с Git описывается в нашей вики, на странице <ulink url="https://wiki.postgresql.org/wiki/Working_with_Git"/>.

source: Note that building <productname>PostgreSQL</productname> from the source repository requires reasonably up-to-date versions of <application>bison</application>, <application>flex</application>, and <application>Perl</application>. These tools are not needed to build from a distribution tarball, because the files that these tools are used to build are included in the tarball. Other tool requirements are the same as shown in <xref linkend="install-requirements"/>.
ru: Заметьте, что для сборки <productname>PostgreSQL</productname> из репозитория исходного кода требуются достаточно современные версии программ <application>bison</application>, <application>flex</application> и <application>Perl</application>. Эти программы не требуются для сборки из дистрибутивного архива, так как в этот архив уже включены файлы, создаваемые указанными программами. Остальные требования к программному обеспечению не отличаются от описанных в <xref remap="6" linkend="installation"/>.

source: Getting The Source via <productname>Git</productname>
ru: Получение исходного кода из <productname>Git</productname>

source: With <productname>Git</productname> you will make a copy of the entire code repository on your local machine, so you will have access to all history and branches offline. This is the fastest and most flexible way to develop or test patches.
ru: С <productname>Git</productname> вы получаете на своём компьютере копию всего репозитория кода, так что вы будете иметь автономный доступ ко всем ветвям и истории разработки. Это позволяет максимально быстро и гибко разрабатывать или тестировать правки кода.

source: You will need an installed version of <productname>Git</productname>, which you can get from <ulink url="http://git-scm.com"/>. Many systems already have a recent version of <application>Git</application> installed by default, or available in their package distribution system.
ru: Вам потребуется установленная версия <productname>Git</productname> (её можно получить, обратившись к сайту <ulink url="http://git-scm.com"/>). Во многих системах последняя версия <application>Git</application> устанавливается по умолчанию, либо имеется в системе распространения пакетов.

source: To begin using the Git repository, make a clone of the official mirror: <placeholder-1/> This will copy the full repository to your local machine, so it may take a while to complete, especially if you have a slow Internet connection. The files will be placed in a new subdirectory <filename>postgresql</filename> of your current directory.
ru: Чтобы начать работу с репозиторием Git, сделайте копию официального зеркала: <placeholder-1/> При этом на ваш компьютер будет скопирован весь репозиторий, так что это может занять некоторое время, особенно при медленном подключении к Интернету. Загруженные файлы будут помещены в новый подкаталог <filename>postgresql</filename> внутри текущего каталога.

source: The Git mirror can also be reached via the HTTP protocol, if for example a firewall is blocking access to the Git protocol. Just change the URL prefix to <literal>https</literal>, as in: <placeholder-1/> The HTTP protocol is less efficient than the Git protocol, so it will be slower to use.
ru: К зеркалу Git также можно обратиться по протоколу HTTP, если, например сетевой фильтр блокирует доступ по протоколу Git. Просто смените префикс в адресе на <literal>https</literal>: <placeholder-1/> Протокол HTTP не так эффективен, как Git, так что эта операция будет медленнее.

source: Whenever you want to get the latest updates in the system, <command>cd</command> into the repository, and run: <placeholder-1/>
ru: Когда вы захотите получить последние обновления, перейдите в каталог репозитория (выполнив <command>cd</command>) и запустите: <placeholder-1/>

source: <productname>Git</productname> can do a lot more things than just fetch the source. For more information, consult the <productname>Git</productname> man pages, or see the website at <ulink url="http://git-scm.com"/>.
ru: <productname>Git</productname> может гораздо больше, нежели просто получить исходный код. За дополнительными сведениями обратитесь к страницам руководства man <productname>Git</productname> или к сайту <ulink url="http://git-scm.com"/>.
