Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/sources.po
Languages: ru

source: Error messages like <quote>bad result</quote> are really hard to interpret intelligently. It's better to write why the result is <quote>bad</quote>, e.g., <quote>invalid format</quote>.
ru: Сообщения об ошибках типа <quote>bad result</quote> (плохой результат) трудно воспринять осмысленно. Лучше написать, почему результат <quote>плохой</quote>, например, <quote>invalid format</quote> (неверный формат).

source: Illegal
ru: Illegal (Нелегальное)

source: <quote>Illegal</quote> stands for a violation of the law, the rest is <quote>invalid</quote>. Better yet, say why it's invalid.
ru: <quote>Illegal</quote> (нелегально) — то, что нарушает закон, всё остальное можно называть <quote>invalid</quote> (неверным). Опять же лучше сказать, почему что-то неверное.

source: Unknown
ru: Unknown (Неизвестное)

source: BAD: unknown node type BETTER: unrecognized node type: 42
ru: ПЛОХО: неизвестный тип узла ЛУЧШЕ: нераспознанный тип узла: 42

source: Try to avoid <quote>unknown</quote>. Consider <quote>error: unknown response</quote>. If you don't know what the response is, how do you know it's erroneous? <quote>Unrecognized</quote> is often a better choice. Also, be sure to include the value being complained of. <placeholder-1/>
ru: Постарайтесь исключить <quote>unknown</quote> (неизвестное). Взгляните на сообщение: <quote>error: unknown response</quote> (ошибка: неизвестный ответ). Если вы не знаете, что за ответ получен, как вы поняли, что он ошибочный? Вместо этого часто лучше сказать <quote>unrecognized</quote> (нераспознанный). Также обязательно добавьте значение, которое не было воспринято. <placeholder-1/>

source: Find vs. Exists
ru: &laquo;Не найдено&raquo; или &laquo;не существует&raquo;

source: If the program uses a nontrivial algorithm to locate a resource (e.g., a path search) and that algorithm fails, it is fair to say that the program couldn't <quote>find</quote> the resource. If, on the other hand, the expected location of the resource is known but the program cannot access it there then say that the resource doesn't <quote>exist</quote>. Using <quote>find</quote> in this case sounds weak and confuses the issue.
ru: Если программа выполняет поиск ресурса, используя нетривиальный алгоритм (например, поиск по пути), и этот алгоритм не срабатывает, лучше честно сказать, что программа не смогла <quote>найти</quote> ресурс. С другой стороны, если ожидаемое расположение ресурса точно известно, но программа не может обратиться к нему, скажите, что этот ресурс не <quote>существует</quote>. Формулировка с глаголом <quote>найти</quote> в данном случае звучит слабо и затрудняет понимание.

source: May vs. Can vs. Might
ru: Разрешено, могу или возможно

source: <quote>May</quote> suggests permission (e.g., "You may borrow my rake."), and has little use in documentation or error messages. <quote>Can</quote> suggests ability (e.g., "I can lift that log."), and <quote>might</quote> suggests possibility (e.g., "It might rain today."). Using the proper word clarifies meaning and assists translation.
ru: <quote>May</quote> (разрешено) подразумевает разрешение (например, &laquo;Вам разрешено воспользоваться моими граблями.&raquo;) и этому практически нет применения в документации или сообщениях об ошибках. <quote>Can</quote> (могу) подразумевает способность (например, &laquo;Я могу поднять это бревно.&raquo;), а <quote>might</quote> (возможно) подразумевает возможность (например, &laquo;Сегодня возможен дождь.&raquo;). Использование подходящего слова проясняет значение и облегчает перевод.

source: Contractions
ru: Сокращения

source: Avoid contractions, like <quote>can't</quote>; use <quote>cannot</quote> instead.
ru: Избегайте сокращений, например <quote>can't</quote>; вместо это напишите <quote>cannot</quote>.

source: Proper Spelling
ru: Правильное написание

source: Spell out words in full. For instance, avoid: <placeholder-1/>
ru: Пишите слова полностью. Например, избегайте (в английском): <placeholder-1/>

source: Rationale: This will improve consistency.
ru: Объяснение: так сообщения будут единообразными.

source: Localization
ru: Локализация

source: Keep in mind that error message texts need to be translated into other languages. Follow the guidelines in <xref linkend="nls-guidelines"/> to avoid making life difficult for translators.
ru: Помните, что текст сообщений должен переводиться на другие языки. Следуйте советам, приведённым в <xref remap="6" linkend="nls-guidelines"/>, чтобы излишне не усложнять жизнь переводчикам.

source: Miscellaneous Coding Conventions
ru: Различные соглашения по оформлению кода

source: C Standard
ru: Стандарт C

source: Code in <productname>PostgreSQL</productname> should only rely on language features available in the C89 standard. That means a conforming C89 compiler has to be able to compile postgres, at least aside from a few platform dependent pieces. Features from later revision of the C standard or compiler specific features can be used, if a fallback is provided.
ru: Код в <productname>PostgreSQL</productname> должен использовать только те возможности языка, что описаны в стандарте C89. Это означает, что код postgres должен успешно компилироваться компилятором, поддерживающим C89, возможно, за исключением нескольких платформозависимых мест. Возможности более поздних ревизий стандарта C или специфические особенности компилятора могут использоваться, только если предусмотрен и вариант компиляции без них.

source: For example <literal>static inline</literal> and <literal>_StaticAssert()</literal> are currently used, even though they are from newer revisions of the C standard. If not available we respectively fall back to defining the functions without inline, and to using a C89 compatible replacement that performs the same checks, but emits rather cryptic messages.
ru: Например, в настоящее время используются конструкции <literal>static inline</literal> и <literal>_StaticAssert()</literal>, хотя они относятся к более новым ревизиям стандарта C. Но если они недоступны, мы соответственно переходим к определению функций без inline, и к использованию альтернативы, которая совместима с C89 и выполняет те же проверки, но выдаёт довольно непонятные сообщения.

source: Function-Like Macros and Inline Functions
ru: Внедрённые функции и макросы, подобные функциям

source: Both, macros with arguments and <literal>static inline</literal> functions, may be used. The latter are preferable if there are multiple-evaluation hazards when written as a macro, as e.g. the case with <placeholder-1/> or when the macro would be very long. In other cases it's only possible to use macros, or at least easier. For example because expressions of various types need to be passed to the macro.
ru: Допускается использование и макросов с аргументами, и функций <literal>static inline</literal>. Последний вариант предпочтительнее, если возникает риск множественного вычисления выражений в макросе, как например в случае с <placeholder-1/> или когда макрос может быть слишком объёмным. В других случаях использовать макросы — единственный, или как минимум более простой вариант. Например, может быть полезна возможность передавать макросу выражения различных типов.

source: Writing Signal Handlers
ru: Написание обработчиков сигналов

source: To be suitable to run inside a signal handler code has to be written very carefully. The fundamental problem is that, unless blocked, a signal handler can interrupt code at any time. If code inside the signal handler uses the same state as code outside chaos may ensue. As an example consider what happens if a signal handler tries to acquire a lock that's already held in the interrupted code.
ru: Чтобы код мог выполняться внутри обработчика сигналов, его нужно написать очень аккуратно. Фундаментальная сложность состоит в том, что обработчик сигнала может прервать код в любой момент, если он не отключён. Если код внутри обработчика сигнала использует то же состояние, что и внешний основной код, это может привести к хаосу. В качестве примера представьте, что произойдёт, если обработчик сигнала попытается получить ту же блокировку, которой уже владеет прерванный код.

source: Barring special arrangements code in signal handlers may only call async-signal safe functions (as defined in POSIX) and access variables of type <literal>volatile sig_atomic_t</literal>. A few functions in <command>postgres</command> are also deemed signal safe, importantly <function>SetLatch()</function>.
ru: Если не предпринимать специальных мер, код в обработчиках сигналов может вызывать только безопасные с точки зрения асинхронных сигналов функции (как это определяется в POSIX) и обращаться к переменным типа <literal>volatile sig_atomic_t</literal>. Также безопасными для обработчиков сигналов считаются несколько функций в <command>postgres</command>, в том числе, что важно, <function>SetLatch()</function>.

source: In most cases signal handlers should do nothing more than note that a signal has arrived, and wake up code running outside of the handler using a latch. An example of such a handler is the following: <placeholder-1/> <varname>errno</varname> is saved and restored because <function>SetLatch()</function> might change it. If that were not done interrupted code that's currently inspecting <varname>errno</varname> might see the wrong value.
ru: В большинстве случаев обработчики событий должны только сообщить о поступлении сигнала и пробудить код снаружи обработчика, используя защёлку. Например, обработчик может быть таким: <placeholder-1/> Переменная <varname>errno</varname> сохраняется и восстанавливается, так как её может изменить <function>SetLatch()</function>. Если этого не сделать, прерванный код, считывая <varname>errno</varname>, мог бы получить некорректное значение.
