Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/sources.po
Languages: ru

source: PostgreSQL Coding Conventions
ru: Соглашения по оформлению кода PostgreSQL

source: Formatting
ru: Форматирование

source: Source code formatting uses 4 column tab spacing, with tabs preserved (i.e., tabs are not expanded to spaces). Each logical indentation level is one additional tab stop.
ru: Исходный код форматируется с отступом на 4 позиции, с сохранением табуляции (т. е. символы табуляции не разворачиваются в пробелы). Для каждого логического уровня отступа добавляется одна табуляция.

source: Layout rules (brace positioning, etc) follow BSD conventions. In particular, curly braces for the controlled blocks of <literal>if</literal>, <literal>while</literal>, <literal>switch</literal>, etc go on their own lines.
ru: Правила оформления (расположения скобок и т. д.) следуют соглашениям BSD. В частности, фигурные скобки для управляемых ими блоков <literal>if</literal>, <literal>while</literal>, <literal>switch</literal> и т. д. размещаются в отдельных строках.

source: Limit line lengths so that the code is readable in an 80-column window. (This doesn't mean that you must never go past 80 columns. For instance, breaking a long error message string in arbitrary places just to keep the code within 80 columns is probably not a net gain in readability.)
ru: Ограничьте размеры строк, чтобы код можно было читать в окне шириной 80 символов. (Это не значит, что никогда нельзя заходить за 80 символов. Например, не стоит разбивать длинную строку сообщения в произвольных местах, просто чтобы код умещался в 80 символов, так как это в результате скорее всего не сделает код более читабельным.)

source: Do not use C++ style comments (<literal>//</literal> comments). Strict ANSI C compilers do not accept them. For the same reason, do not use C++ extensions such as declaring new variables mid-block.
ru: Не используйте комментарии в стиле C++ (комментарии <literal>//</literal>). Строгие компиляторы ANSI C их не принимают. По этой же причине не используйте расширения C++, например, не объявляйте новые переменные в середине блока.

source: /* * comment text begins here * and continues here */
ru: /* * текст комментария начинается здесь * и продолжается здесь */

source: /*---------- * comment text begins here * and continues here *---------- */
ru: /*---------- * текст комментария начинается здесь * и продолжается здесь *---------- */

source: The preferred style for multi-line comment blocks is <placeholder-1/> Note that comment blocks that begin in column 1 will be preserved as-is by <application>pgindent</application>, but it will re-flow indented comment blocks as though they were plain text. If you want to preserve the line breaks in an indented block, add dashes like this: <placeholder-2/>
ru: Предпочитаемый стиль многострочных блоков выглядит так: <placeholder-1/> Заметьте, что блоки комментариев, начинающиеся с первого символа, будут сохраняться утилитой <application>pgindent</application> как есть, но содержимое блоков комментариев с отступами будет переразбито по строкам как обычный текст. Если вы хотите сохранить разрывы строк в блоке с отступом, добавьте минусы следующим образом: <placeholder-2/>

source: While submitted patches do not absolutely have to follow these formatting rules, it's a good idea to do so. Your code will get run through <application>pgindent</application> before the next release, so there's no point in making it look nice under some other set of formatting conventions. A good rule of thumb for patches is <quote>make the new code look like the existing code around it</quote>.
ru: Хотя предлагаемые правки кода не обязательно должны следовать этим правилам форматирования, лучше их придерживаться. Ваш код будет пропущен через <application>pgindent</application> перед следующим выпуском, поэтому нет смысла наводить в нём красоту по другим правилам. Для правок есть хорошее правило: <quote>оформляйте новый код так же, как выглядит существующий код вокруг</quote>.

source: The <filename>src/tools</filename> directory contains sample settings files that can be used with the <productname>emacs</productname>, <productname>xemacs</productname> or <productname>vim</productname> editors to help ensure that they format code according to these conventions.
ru: В каталоге <filename>src/tools</filename> содержатся примеры файлов настройки, которые можно использовать с редакторами <productname>emacs</productname>, <productname>xemacs</productname> или <productname>vim</productname> для упрощения задачи форматирования кода в соответствии с описанными соглашениями.

source: The text browsing tools <application>more</application> and <application>less</application> can be invoked as: <placeholder-1/> to make them show tabs appropriately.
ru: Чтобы табуляция показывалась должным образом в средствах просмотра текста <application>more</application> и <application>less</application>, их можно вызвать так: <placeholder-1/>

source: Reporting Errors Within the Server
ru: Вывод сообщений об ошибках в коде сервера

source: Error, warning, and log messages generated within the server code should be created using <function>ereport</function>, or its older cousin <function>elog</function>. The use of this function is complex enough to require some explanation.
ru: Сообщения об ошибках, предупреждения и обычные сообщения, выдаваемые в коде сервера должны создаваться функцией <function>ereport</function> или родственной её предшественницей <function>elog</function>. Использование этой функции достаточно сложно и требует дополнительного объяснения.

source: There are two required elements for every message: a severity level (ranging from <literal>DEBUG</literal> to <literal>PANIC</literal>) and a primary message text. In addition there are optional elements, the most common of which is an error identifier code that follows the SQL spec's SQLSTATE conventions. <function>ereport</function> itself is just a shell function, that exists mainly for the syntactic convenience of making message generation look like a function call in the C source code. The only parameter accepted directly by <function>ereport</function> is the severity level. The primary message text and any optional message elements are generated by calling auxiliary functions, such as <function>errmsg</function>, within the <function>ereport</function> call.
ru: У каждого сообщения есть два обязательных элемента: уровень важности (от <literal>DEBUG</literal> до <literal>PANIC</literal>) и основной текст сообщения. В дополнение к ним есть необязательные элементы, из которых часто используется код идентификатора ошибки, соответствующий определению SQLSTATE в спецификации SQL. Функция <function>ereport</function> сама по себе является просто оболочкой, которая существует в основном для синтаксического удобства, чтобы выдача сообщения выглядела как вызов функции в коде C. Единственный параметр, который принимает непосредственно функция <function>ereport</function>, это уровень важности. Основной текст и любые дополнительные элементы сообщения генерируются в результате вызова вспомогательных функций, таких как <function>errmsg</function>, в вызове <function>ereport</function>.

source: A typical call to <function>ereport</function> might look like this: <placeholder-1/> This specifies error severity level <literal>ERROR</literal> (a run-of-the-mill error). The <function>errcode</function> call specifies the SQLSTATE error code using a macro defined in <filename>src/include/utils/errcodes.h</filename>. The <function>errmsg</function> call provides the primary message text. Notice the extra set of parentheses surrounding the auxiliary function calls &mdash; these are annoying but syntactically necessary.
ru: Типичный вызов <function>ereport</function> выглядит примерно так: <placeholder-1/> В нём задаётся уровень важности <literal>ERROR</literal> (заурядная ошибка). В вызове <function>errcode</function> указывается код ошибки SQLSTATE по макросу, определённому в <filename>src/include/utils/errcodes.h</filename>. Вызов <function>errmsg</function> даёт текст основного сообщения. Обратите внимание на дополнительный набор скобок, окружающих вызовы вспомогательных функций &mdash; они загромождают код, но требуются синтаксисом.

source: Here is a more complex example: <placeholder-1/> This illustrates the use of format codes to embed run-time values into a message text. Also, an optional <quote>hint</quote> message is provided.
ru: Более сложный пример: <placeholder-1/> В нём демонстрируется использование кодов форматирования для включения значений времени выполнения в текст сообщения. Также в нём добавляется дополнительное сообщение <quote>подсказки</quote>.

source: If the severity level is <literal>ERROR</literal> or higher, <function>ereport</function> aborts the execution of the user-defined function and does not return to the caller. If the severity level is lower than <literal>ERROR</literal>, <function>ereport</function> returns normally.
ru: При уровне важности <literal>ERROR</literal> или более высоком, <function>ereport</function> прерывает выполнение пользовательской функции и не возвращает управление в вызывающий код. Если уровень важности ниже <literal>ERROR</literal>, <function>ereport</function> завершается обычным способом.

source: <function>errcode(sqlerrcode)</function> specifies the SQLSTATE error identifier code for the condition. If this routine is not called, the error identifier defaults to <literal>ERRCODE_INTERNAL_ERROR</literal> when the error severity level is <literal>ERROR</literal> or higher, <literal>ERRCODE_WARNING</literal> when the error level is <literal>WARNING</literal>, otherwise (for <literal>NOTICE</literal> and below) <literal>ERRCODE_SUCCESSFUL_COMPLETION</literal>. While these defaults are often convenient, always think whether they are appropriate before omitting the <function>errcode()</function> call.
ru: <function>errcode(sqlerrcode)</function> задаёт код идентификатора ошибки SQLSTATE для данной ошибки. Если эта функция не вызывается, подразумевается идентификатор ошибки <literal>ERRCODE_INTERNAL_ERROR</literal> при уровне важности <literal>ERROR</literal> или выше, либо <literal>ERRCODE_WARNING</literal> при уровне важности <literal>WARNING</literal>, иначе (при уровне <literal>NOTICE</literal> или ниже) — <literal>ERRCODE_SUCCESSFUL_COMPLETION</literal>. Хотя эти значения по умолчанию довольно разумны, всегда стоит подумать, насколько они уместны, прежде чем опустить вызов <function>errcode()</function>.

source: That is, the value that was current when the <function>ereport</function> call was reached; changes of <literal>errno</literal> within the auxiliary reporting routines will not affect it. That would not be true if you were to write <literal>strerror(errno)</literal> explicitly in <function>errmsg</function>'s parameter list; accordingly, do not do so.
ru: То есть значение, которое было текущим, когда была вызвана <function>ereport</function>; изменения <literal>errno</literal> во вспомогательных функциях выдачи сообщений на него не повлияют. Это будет не так, если вы запишете <literal>strerror(errno)</literal> явно в списке параметров <function>errmsg</function>; поэтому делать так не нужно.

source: <function>errmsg(const char *msg, ...)</function> specifies the primary error message text, and possibly run-time values to insert into it. Insertions are specified by <function>sprintf</function>-style format codes. In addition to the standard format codes accepted by <function>sprintf</function>, the format code <literal>%m</literal> can be used to insert the error message returned by <function>strerror</function> for the current value of <literal>errno</literal>. <placeholder-1/> <literal>%m</literal> does not require any corresponding entry in the parameter list for <function>errmsg</function>. Note that the message string will be run through <function>gettext</function> for possible localization before format codes are processed.
ru: <function>errmsg(const char *msg, ...)</function> задаёт основной текст сообщения об ошибке и, возможно, значения времени выполнения, которые будут в него включаться. Эти включения записываются кодами формата в стиле <function>sprintf</function>. В дополнение к стандартным кодам формата, принимаемым функцией <function>sprintf</function>, можно использовать код формата <literal>%m</literal>, который вставит сообщение об ошибке, возвращённое строкой <function>strerror</function> для текущего значения <literal>errno</literal>. <placeholder-1/> Для <literal>%m</literal> не требуется соответствующая запись в списке параметров <function>errmsg</function>. Заметьте, что эта строка будет пропущена через <function>gettext</function>, то есть может быть локализована, до обработки кодов формата.

source: <function>errmsg_internal(const char *msg, ...)</function> is the same as <function>errmsg</function>, except that the message string will not be translated nor included in the internationalization message dictionary. This should be used for <quote>cannot happen</quote> cases that are probably not worth expending translation effort on.
ru: <function>errmsg_internal(const char *msg, ...)</function> действует как <function>errmsg</function>, но её строка сообщения не будет переводиться и включаться в словарь сообщений для интернационализации. Это следует использовать для случаев, которые <quote>не происходят никогда</quote>, так что тратить силы на их перевод не стоит.

source: <function>errmsg_plural(const char *fmt_singular, const char *fmt_plural, unsigned long n, ...)</function> is like <function>errmsg</function>, but with support for various plural forms of the message. <replaceable>fmt_singular</replaceable> is the English singular format, <replaceable>fmt_plural</replaceable> is the English plural format, <replaceable>n</replaceable> is the integer value that determines which plural form is needed, and the remaining arguments are formatted according to the selected format string. For more information see <xref linkend="nls-guidelines"/>.
ru: <function>errmsg_plural(const char *fmt_singular, const char *fmt_plural, unsigned long n, ...)</function> действует подобно <function>errmsg</function>, но поддерживает различные формы сообщения с множественными числами. Параметр <replaceable>fmt_singular</replaceable> задаёт строку формата на английском для единственного числа, <replaceable>fmt_plural</replaceable> — формат для множественного числа, <replaceable>n</replaceable> задаёт целое число, определяющее, какая именно форма множественного числа требуется, а остальные аргументы форматируются согласно выбранной строке формата. За дополнительными сведениями обратитесь к <xref remap="3" linkend="nls-guidelines"/>.

source: <function>errdetail(const char *msg, ...)</function> supplies an optional <quote>detail</quote> message; this is to be used when there is additional information that seems inappropriate to put in the primary message. The message string is processed in just the same way as for <function>errmsg</function>.
ru: <function>errdetail(const char *msg, ...)</function> задаёт дополнительное <quote>подробное</quote> сообщение; оно должно использоваться, когда есть дополнительная информация, которую неуместно включать в основное сообщение. Строка сообщения обрабатывается так же, как и для <function>errmsg</function>.

source: <function>errdetail_internal(const char *msg, ...)</function> is the same as <function>errdetail</function>, except that the message string will not be translated nor included in the internationalization message dictionary. This should be used for detail messages that are not worth expending translation effort on, for instance because they are too technical to be useful to most users.
ru: <function>errdetail_internal(const char *msg, ...)</function> действует как <function>errdetail</function>, но её строка сообщения не будет переводиться и включаться в словарь сообщений для интернационализации. Это следует использовать для подробных сообщений, на перевод которых не стоит тратить силы, например, когда это техническая информация, непонятная большинству пользователей.

source: <function>errdetail_plural(const char *fmt_singular, const char *fmt_plural, unsigned long n, ...)</function> is like <function>errdetail</function>, but with support for various plural forms of the message. For more information see <xref linkend="nls-guidelines"/>.
ru: <function>errdetail_plural(const char *fmt_singular, const char *fmt_plural, unsigned long n, ...)</function> действует подобно <function>errdetail</function>, но поддерживает различные формы сообщения с множественными числами. За дополнительными сведениями обратитесь к <xref remap="3" linkend="nls-guidelines"/>.

source: <function>errdetail_log(const char *msg, ...)</function> is the same as <function>errdetail</function> except that this string goes only to the server log, never to the client. If both <function>errdetail</function> (or one of its equivalents above) and <function>errdetail_log</function> are used then one string goes to the client and the other to the log. This is useful for error details that are too security-sensitive or too bulky to include in the report sent to the client.
ru: <function>errdetail_log(const char *msg, ...)</function> подобна <function>errdetail</function>, но выводимая строка попадает только в журнал сервера, и никогда не передаётся клиенту. Если используется и <function>errdetail</function> (или один из её эквивалентов), и <function>errdetail_log</function>, тогда одна строка передаётся клиенту, а другая отправляется в журнал. Это полезно для вывода подробных сообщений, имеющих конфиденциальный характер или большой размер, так что передавать их клиенту нежелательно.

source: <function>errdetail_log_plural(const char *fmt_singular, const char *fmt_plural, unsigned long n, ...)</function> is like <function>errdetail_log</function>, but with support for various plural forms of the message. For more information see <xref linkend="nls-guidelines"/>.
ru: <function>errdetail_log_plural(const char *fmt_singular, const char *fmt_plural, unsigned long n, ...)</function> действует подобно <function>errdetail_log</function>, но поддерживает различные формы сообщения с множественными числами. За дополнительными сведениями обратитесь к <xref remap="3" linkend="nls-guidelines"/>.

source: <function>errhint(const char *msg, ...)</function> supplies an optional <quote>hint</quote> message; this is to be used when offering suggestions about how to fix the problem, as opposed to factual details about what went wrong. The message string is processed in just the same way as for <function>errmsg</function>.
ru: <function>errhint(const char *msg, ...)</function> передаёт дополнительное сообщение <quote>подсказки</quote>; это позволяет предложить решение проблемы, а не просто сообщить факты, связанные с ней. Строка сообщения обрабатывается так же, как и для <function>errmsg</function>.

source: <function>errcontext(const char *msg, ...)</function> is not normally called directly from an <function>ereport</function> message site; rather it is used in <literal>error_context_stack</literal> callback functions to provide information about the context in which an error occurred, such as the current location in a PL function. The message string is processed in just the same way as for <function>errmsg</function>. Unlike the other auxiliary functions, this can be called more than once per <function>ereport</function> call; the successive strings thus supplied are concatenated with separating newlines.
ru: <function>errcontext(const char *msg, ...)</function> обычно не вызывается непосредственно с места вызова <function>ereport</function>, а используется в функциях обратного вызова <literal>error_context_stack</literal> и выдаёт информацию о контексте, в котором произошла ошибка, например, о текущем положении в функции PL. Строка сообщения обрабатывается так же, как и для <function>errmsg</function>. В отличие от других вспомогательных функций, внутри вызова <function>ereport</function> её можно вызывать неоднократно; добавляемые таким образом последовательные сообщения складываются через символы перевода строк.

source: <function>errposition(int cursorpos)</function> specifies the textual location of an error within a query string. Currently it is only useful for errors detected in the lexical and syntactic analysis phases of query processing.
ru: <function>errposition(int cursorpos)</function> задаёт положение ошибки в тексте запроса. В настоящее время это полезно только для ошибок, выявляемых на этапах лексического и синтаксического анализа запроса.

source: <function>errtable(Relation rel)</function> specifies a relation whose name and schema name should be included as auxiliary fields in the error report.
ru: <function>errtable(Relation rel)</function> определяет отношение, имя и схема которого должны быть включены во вспомогательные поля сообщения об ошибке.

source: <function>errtablecol(Relation rel, int attnum)</function> specifies a column whose name, table name, and schema name should be included as auxiliary fields in the error report.
ru: <function>errtablecol(Relation rel, int attnum)</function> определяет столбец, имя которого, вместе с именем таблицы и схемы, должно быть включено во вспомогательные поля сообщения об ошибке.

source: <function>errtableconstraint(Relation rel, const char *conname)</function> specifies a table constraint whose name, table name, and schema name should be included as auxiliary fields in the error report. Indexes should be considered to be constraints for this purpose, whether or not they have an associated <structname>pg_constraint</structname> entry. Be careful to pass the underlying heap relation, not the index itself, as <literal>rel</literal>.
ru: <function>errtableconstraint(Relation rel, const char *conname)</function> задаёт имя ограничения таблицы, которое вместе с именем таблицы и схемы должно быть включено во вспомогательные поля сообщения об ошибке. В данном контексте индекс считается ограничением, независимо от того, имеется ли для него запись в <structname>pg_constraint</structname>. Заметьте, что при этом в качестве <literal>rel</literal> нужно передавать нижележащее отношение, а не сам индекс.

source: <function>errdatatype(Oid datatypeOid)</function> specifies a data type whose name and schema name should be included as auxiliary fields in the error report.
ru: <function>errdatatype(Oid datatypeOid)</function> задаёт тип данных, имя которого, вместе с именем схемы, должно включаться во вспомогательные поля сообщения об ошибке.

source: <function>errdomainconstraint(Oid datatypeOid, const char *conname)</function> specifies a domain constraint whose name, domain name, and schema name should be included as auxiliary fields in the error report.
ru: <function>errdomainconstraint(Oid datatypeOid, const char *conname)</function> задаёт имя ограничения домена, которое вместе с именем домена и схемы должно включаться во вспомогательные поля сообщения об ошибке.

source: <function>errcode_for_file_access()</function> is a convenience function that selects an appropriate SQLSTATE error identifier for a failure in a file-access-related system call. It uses the saved <literal>errno</literal> to determine which error code to generate. Usually this should be used in combination with <literal>%m</literal> in the primary error message text.
ru: <function>errcode_for_file_access()</function> — вспомогательная функция, выбирающая подходящий идентификатор SQLSTATE при сбое в системном вызове, в котором происходит обращение к файловой системе. Какой код ошибки генерировать, она определяет по сохранённому значению <literal>errno</literal>. Обычно это используется в сочетании с <literal>%m</literal> в основном сообщении об ошибке.
