Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/sources.po
Languages: ru

source: <function>errcode_for_socket_access()</function> is a convenience function that selects an appropriate SQLSTATE error identifier for a failure in a socket-related system call.
ru: <function>errcode_for_socket_access()</function> — вспомогательная функция, выбирающая подходящий идентификатор SQLSTATE при сбое в системном вызове, в котором происходит обращение к сокетам.

source: <function>errhidestmt(bool hide_stmt)</function> can be called to specify suppression of the <literal>STATEMENT:</literal> portion of a message in the postmaster log. Generally this is appropriate if the message text includes the current statement already.
ru: <function>errhidestmt(bool hide_stmt)</function> может быть вызвана для подавления вывода поля <literal>ОПЕРАТОР:</literal> (<literal>STATEMENT:</literal>) в журнал сервера. Обычно это уместно, когда само сообщение включает текст текущего оператора.

source: <function>errhidecontext(bool hide_ctx)</function> can be called to specify suppression of the <literal>CONTEXT:</literal> portion of a message in the postmaster log. This should only be used for verbose debugging messages where the repeated inclusion of context would bloat the log volume too much.
ru: <function>errhidecontext(bool hide_ctx)</function> может быть вызвана для подавления вывода поля <literal>КОНТЕКСТ:</literal> (<literal>CONTEXT:</literal>) в журнал сервера. Это следует использовать только для подробных отладочных сообщений, в которых одна и та же информация о контексте, выводимая в журнал, будет только чрезмерно замусоривать его.

source: The available auxiliary routines for <function>ereport</function> are: <placeholder-1/>
ru: Для <function>ereport</function> предлагаются следующие вспомогательные функции: <placeholder-1/>

source: At most one of the functions <function>errtable</function>, <function>errtablecol</function>, <function>errtableconstraint</function>, <function>errdatatype</function>, or <function>errdomainconstraint</function> should be used in an <function>ereport</function> call. These functions exist to allow applications to extract the name of a database object associated with the error condition without having to examine the potentially-localized error message text. These functions should be used in error reports for which it's likely that applications would wish to have automatic error handling. As of <productname>PostgreSQL</productname> 9.3, complete coverage exists only for errors in SQLSTATE class 23 (integrity constraint violation), but this is likely to be expanded in future.
ru: В вызове <function>ereport</function> следует использовать максимум одну из функций <function>errtable</function>, <function>errtablecol</function>, <function>errtableconstraint</function>, <function>errdatatype</function> или <function>errdomainconstraint</function>. Данные функции существуют для того, чтобы приложения могли извлечь имя объекта базы данных, связанного с условием ошибки, так, чтобы для этого им не требовалось разбирать текст ошибки, возможно локализованный. Эти функции должны использоваться в случае ошибок, для которых может быть желательной автоматическая обработка. Для версии <productname>PostgreSQL</productname> 9.3 этот подход распространяется полностью только на ошибки класса SQLSTATE 23 (нарушение целостности ограничения), но в будущем область его применения может быть расширена.

source: There is an older function <function>elog</function> that is still heavily used. An <function>elog</function> call: <placeholder-1/> is exactly equivalent to: <placeholder-2/> Notice that the SQLSTATE error code is always defaulted, and the message string is not subject to translation. Therefore, <function>elog</function> should be used only for internal errors and low-level debug logging. Any message that is likely to be of interest to ordinary users should go through <function>ereport</function>. Nonetheless, there are enough internal <quote>cannot happen</quote> error checks in the system that <function>elog</function> is still widely used; it is preferred for those messages for its notational simplicity.
ru: Существует также более старая, но тем не менее активно используемая функция <function>elog</function>. Вызов <function>elog</function>: <placeholder-1/> полностью равнозначен вызову: <placeholder-2/> Заметьте, что код ошибки SQLSTATE всегда определяется неявно, а строка сообщения не подлежит переводу. Таким образом, <function>elog</function> следует использовать только для внутренних ошибок и отладки на низком уровне. Любое сообщение, которое может представлять интерес для обычных пользователей, должно проходить через <function>ereport</function>. Тем не менее, в системе есть достаточно много внутренних проверок для случаев, <quote>которые не должны происходить</quote>, и в них по-прежнему широко используется <function>elog</function>; для таких сообщений эта функция предпочитается из-за простоты записи.

source: Advice about writing good error messages can be found in <xref linkend="error-style-guide"/>.
ru: Советы по написанию хороших сообщений об ошибках можно найти в <xref remap="6" linkend="error-style-guide"/>.

source: Error Message Style Guide
ru: Руководство по стилю сообщений об ошибках

source: This style guide is offered in the hope of maintaining a consistent, user-friendly style throughout all the messages generated by <productname>PostgreSQL</productname>.
ru: Это руководство по стилю предлагается в надежде обеспечить единообразный и понятный пользователю стиль для всех сообщений, которые выдаёт <productname>PostgreSQL</productname>.

source: What Goes Where
ru: Что и куда выводить

source: The primary message should be short, factual, and avoid reference to implementation details such as specific function names. <quote>Short</quote> means <quote>should fit on one line under normal conditions</quote>. Use a detail message if needed to keep the primary message short, or if you feel a need to mention implementation details such as the particular system call that failed. Both primary and detail messages should be factual. Use a hint message for suggestions about what to do to fix the problem, especially if the suggestion might not always be applicable.
ru: Основное сообщение должно быть кратким, фактологическим и, по возможности, не говорить о тонкостях реализации, например, не упоминать конкретные имена функций. Под <quote>кратким</quote> понимается <quote>должно умещаться в одной строке при обычных условиях</quote>. Дополнительное подробное сообщение добавляется, когда краткого сообщения недостаточно, или вы считаете, что нужно упомянуть какие-то внутренние детали, например, конкретный системный вызов, в котором произошла ошибка. И основное, и подробное сообщения должны сообщать исключительно факты. Чтобы предложить решение проблемы, особенно, если это решение может быть применимо не всегда, передайте его в сообщении-подсказке.

source: IpcMemoryCreate: shmget(key=%d, size=%u, 0%o) failed: %m (plus a long addendum that is basically a hint)
ru: IpcMemoryCreate: ошибка в shmget(ключ=%d, размер=%u, 0%o): %m (плюс длинное дополнение, по сути представляющее собой подсказку)

source: Primary: could not create shared memory segment: %m Detail: Failed syscall was shmget(key=%d, size=%u, 0%o). Hint: the addendum
ru: Основное: не удалось создать сегмент разделяемой памяти: %m Подробное: Ошибка в системном вызове shmget(key=%d, size=%u, 0%o). Подсказка: дополнительный текст

source: For example, instead of: <placeholder-1/> write: <placeholder-2/>
ru: Например, вместо: <placeholder-1/> следует записать: <placeholder-2/>

source: Rationale: keeping the primary message short helps keep it to the point, and lets clients lay out screen space on the assumption that one line is enough for error messages. Detail and hint messages can be relegated to a verbose mode, or perhaps a pop-up error-details window. Also, details and hints would normally be suppressed from the server log to save space. Reference to implementation details is best avoided since users aren't expected to know the details.
ru: Объяснение: когда основное сообщение достаточно краткое, клиенты могут выделить для него место на экране в предположении, что одной строки будет достаточно. Подробное сообщение и подсказка могут выводиться в режиме дополнительных сведений или, возможно, в разворачивающемся окне &laquo;ошибка-подробности&raquo;. Кроме того, подробности и подсказки обычно не записываются в журнал сервера для сокращения его объёма. Детали реализации лучше опускать, так как пользователи не должны в них разбираться.

source: Don't put any specific assumptions about formatting into the message texts. Expect clients and the server log to wrap lines to fit their own needs. In long messages, newline characters (\n) can be used to indicate suggested paragraph breaks. Don't end a message with a newline. Don't use tabs or other formatting characters. (In error context displays, newlines are automatically added to separate levels of context such as function calls.)
ru: Не полагайтесь на какое-либо определённое форматирование в тексте сообщений. Следует ожидать, что в клиентском интерфейсе и в журнале сервера длинные строки будут переноситься в зависимости от ситуации. В длинных сообщениях можно обозначить предполагаемые места разрыва абзацев символами новой строки (\n). Завершать сообщение этим символом не нужно. Также не используйте табуляции или другие символы форматирования. (При выводе контекста ошибок автоматически добавляются символы перевода строки для разделения уровней контекста, например, вызовов функций.)

source: Rationale: Messages are not necessarily displayed on terminal-type displays. In GUI displays or browsers these formatting instructions are at best ignored.
ru: Объяснение: сообщение не обязательно будет выводиться в интерфейсе терминального типа. В графических интерфейсах или браузерах эти инструкции форматирования в лучшем случае игнорируются.

source: Quotation Marks
ru: Символы кавычек

source: English text should use double quotes when quoting is appropriate. Text in other languages should consistently use one kind of quotes that is consistent with publishing customs and computer output of other programs.
ru: В тексте на английском языке везде, где это уместно, следует использовать двойные кавычки. В тексте на других языках следует единообразно использовать тот тип кавычек, который принят для печати вывода других программ.

source: Rationale: The choice of double quotes over single quotes is somewhat arbitrary, but tends to be the preferred use. Some have suggested choosing the kind of quotes depending on the type of object according to SQL conventions (namely, strings single quoted, identifiers double quoted). But this is a language-internal technical issue that many users aren't even familiar with, it won't scale to other kinds of quoted terms, it doesn't translate to other languages, and it's pretty pointless, too.
ru: Объяснение: выбор двойных кавычек вместо апострофов несколько своевольный, но ему сейчас отдаётся предпочтение. Некоторые разработчики предлагали выбирать тип кавычек в зависимости от типа объекта, следуя соглашениям SQL (а именно, строки заключать в апострофы, а идентификаторы в кавычки). Но это внутренняя техническая особенность языка, о которой многие пользователи даже не догадываются; кроме того, это нельзя распространить на другие типы сущностей в кавычках, не всегда можно перевести на другие языки и к тому же довольно бессмысленно.

source: Use of Quotes
ru: Использование кавычек

source: Use quotes always to delimit file names, user-supplied identifiers, and other variables that might contain words. Do not use them to mark up variables that will not contain words (for example, operator names).
ru: Всегда используйте кавычки для заключения имён файлов, задаваемых пользователем идентификаторов и других переменных, которые могут содержать слова. Не заключайте в кавычки переменные, которые никогда не будут содержать слова (например, имена операторов).

source: There are functions in the backend that will double-quote their own output at need (for example, <function>format_type_be()</function>). Do not put additional quotes around the output of such functions.
ru: В коде сервера есть функции, которые при необходимости сами заключают выводимый результат в кавычки (например, <function>format_type_be()</function>). Дополнительные кавычки вокруг результата таких функций добавлять не следует.

source: Rationale: Objects can have names that create ambiguity when embedded in a message. Be consistent about denoting where a plugged-in name starts and ends. But don't clutter messages with unnecessary or duplicate quote marks.
ru: Объяснение: у объектов могут быть имена, создающие двусмысленность, когда они появляются в сообщении. Всегда одинаково обозначайте, где начинается и где заканчивается встроенное имя. Но не загромождайте сообщения ненужными или повторными знаками кавычек.

source: Grammar and Punctuation
ru: Грамматика и пунктуация

source: The rules are different for primary error messages and for detail/hint messages:
ru: Правила для основного сообщения и дополнительного сообщения/подсказки различаются:

source: Primary error messages: Do not capitalize the first letter. Do not end a message with a period. Do not even think about ending a message with an exclamation point.
ru: Основное сообщение об ошибке: не делайте первую букву заглавной. Не завершайте сообщение точкой. Даже не думайте о том, чтобы завершить сообщение восклицательным знаком!

source: Detail and hint messages: Use complete sentences, and end each with a period. Capitalize the first word of sentences. Put two spaces after the period if another sentence follows (for English text; might be inappropriate in other languages).
ru: Подробное сообщение и подсказка: пишите полные предложения и завершайте каждое точкой. Начинайте первое слово предложения с большой буквы. Добавляйте два пробела после точки, если за одним предложением следует другое (для английского текста; может не подходить для других языков).

source: Error context strings: Do not capitalize the first letter and do not end the string with a period. Context strings should normally not be complete sentences.
ru: Строка с контекстом ошибки: не делайте первую букву заглавной и не завершайте строку точкой. Строки контекста обычно не должны быть полными предложениями.

source: Rationale: Avoiding punctuation makes it easier for client applications to embed the message into a variety of grammatical contexts. Often, primary messages are not grammatically complete sentences anyway. (And if they're long enough to be more than one sentence, they should be split into primary and detail parts.) However, detail and hint messages are longer and might need to include multiple sentences. For consistency, they should follow complete-sentence style even when there's only one sentence.
ru: Объяснение: при отсутствии знаков пунктуации клиентским приложениям проще вставить сообщение в самые разные грамматические контексты. Часто основные сообщения всё равно не являются грамматически полными предложениями. (Если сообщение настолько длинное, что занимает не одно предложение, его следует поделить на основную и дополнительную часть.) Однако подробные сообщения и подсказки по определению длиннее и могут содержать несколько предложений. Единообразия ради, они должны следовать стилю полного предложения, даже если предложение всего одно.

source: Upper Case vs. Lower Case
ru: Верхний регистр или нижний регистр

source: Use lower case for message wording, including the first letter of a primary error message. Use upper case for SQL commands and key words if they appear in the message.
ru: Пишите сообщение в нижнем регистре, включая первую букву основного сообщения об ошибке. Используйте верхний регистр для команд SQL и ключевых слов, если они выводятся в сообщении.

source: Rationale: It's easier to make everything look more consistent this way, since some messages are complete sentences and some not.
ru: Объяснение: так проще сделать, чтобы всё выглядело единообразно, так как некоторые сообщения могут быть полными предложениями, а другие нет.

source: Avoid Passive Voice
ru: Избегайте пассивного залога

source: Use the active voice. Use complete sentences when there is an acting subject (<quote>A could not do B</quote>). Use telegram style without subject if the subject would be the program itself; do not use <quote>I</quote> for the program.
ru: Используйте активный залог. Когда есть действующий субъект, формулируйте полные предложения (<quote>A не удалось сделать B</quote>). Используйте телеграфный стиль без субъекта, если субъект — сама программа; не пишите <quote>я</quote> от имени программы.

source: Rationale: The program is not human. Don't pretend otherwise.
ru: Объяснение: программа — не человек. Не создавайте впечатление, что это не так.

source: Present vs. Past Tense
ru: Настоящее или прошедшее время

source: Use past tense if an attempt to do something failed, but could perhaps succeed next time (perhaps after fixing some problem). Use present tense if the failure is certainly permanent.
ru: Используйте прошедшее время, если попытка сделать что-то не удалась, но может быть успешной в следующий раз (возможно, после устранения некоторой проблемы). Используйте настоящее время, если ошибка, определённо, постоянная.

source: could not open file "%s": %m
ru: не удалось открыть файл "%s": %m

source: cannot open file "%s"
ru: нельзя открыть файл "%s"

source: There is a nontrivial semantic difference between sentences of the form: <placeholder-1/> and: <placeholder-2/> The first one means that the attempt to open the file failed. The message should give a reason, such as <quote>disk full</quote> or <quote>file doesn't exist</quote>. The past tense is appropriate because next time the disk might not be full anymore or the file in question might exist.
ru: Есть нетривиальное смысловое различие между предложениями вида: <placeholder-1/> и: <placeholder-2/> Первое означает, что попытка открыть файл не удалась. Сообщение должно сообщать причину, например, <quote>переполнение диска</quote> или <quote>файл не существует</quote>. Прошедшее время уместно, потому что в следующий раз диск может быть не переполнен или запрошенный файл будет найден.

source: The second form indicates that the functionality of opening the named file does not exist at all in the program, or that it's conceptually impossible. The present tense is appropriate because the condition will persist indefinitely.
ru: Вторая форма показывает, что функциональность открытия файла с заданным именем полностью отсутствует в программе, либо это невозможно в принципе. Настоящее время в этом случае уместно, так как это условие будет сохраняться неопределённое время.

source: Rationale: Granted, the average user will not be able to draw great conclusions merely from the tense of the message, but since the language provides us with a grammar we should use it correctly.
ru: Объяснение: конечно, средний пользователь не сможет сделать глубокие выводы, проанализировав синтаксическое время, но если язык даёт нам возможность такого выражения, мы должны использовать это корректно.

source: Type of the Object
ru: Тип объекта

source: When citing the name of an object, state what kind of object it is.
ru: Цитируя имя объекта, указывайте также его тип.

source: Rationale: Otherwise no one will know what <quote>foo.bar.baz</quote> refers to.
ru: Объяснение: иначе никто не поймёт, к чему относится <quote>foo.bar.baz</quote>.

source: Brackets
ru: Скобки

source: Square brackets are only to be used (1) in command synopses to denote optional arguments, or (2) to denote an array subscript.
ru: Квадратные скобки должны использоваться только (1) в описаниях команд и обозначать необязательные аргументы, либо (2) для обозначения индекса массива.

source: Rationale: Anything else does not correspond to widely-known customary usage and will confuse people.
ru: Объяснение: все другие варианты их использования не являются общепринятыми и будут вводить в заблуждение.

source: Assembling Error Messages
ru: Сборка сообщений об ошибках

source: could not open file %s: %m
ru: не удалось открыть файл %s: %m

source: When a message includes text that is generated elsewhere, embed it in this style: <placeholder-1/>
ru: Когда сообщение включает текст, сгенерированный в другом месте, внедряйте его следующим образом: <placeholder-1/>

source: Rationale: It would be difficult to account for all possible error codes to paste this into a single smooth sentence, so some sort of punctuation is needed. Putting the embedded text in parentheses has also been suggested, but it's unnatural if the embedded text is likely to be the most important part of the message, as is often the case.
ru: Объяснение: довольно сложно учесть все возможные варианты ошибок, которые будут вставляться в предложение, чтобы оно при этом оставалось складным, поэтому требуется какая-то пунктуация. Было предложение заключать включаемый текст в скобки, но это не вполне естественно, если этот текст содержит наиболее важную часть сообщения, что часто имеет место.

source: Reasons for Errors
ru: Причины ошибок

source: BAD: could not open file %s BETTER: could not open file %s (I/O failure)
ru: ПЛОХО: не удалось открыть файл %s ЛУЧШЕ: не удалось открыть файл %s (ошибка ввода/вывода)

source: Messages should always state the reason why an error occurred. For example: <placeholder-1/> If no reason is known you better fix the code.
ru: Сообщения должны всегда сообщать о причине произошедшей ошибки. Например: <placeholder-1/> Если причина неизвестна, лучше исправить код.

source: Function Names
ru: Имена функций

source: BAD: pg_atoi: error in "z": cannot parse "z" BETTER: invalid input syntax for integer: "z"
ru: ПЛОХО: pg_atoi: ошибка в "z": не удалось разобрать "z" ЛУЧШЕ: неверное значение для целого числа: "z"

source: Don't include the name of the reporting routine in the error text. We have other mechanisms for finding that out when needed, and for most users it's not helpful information. If the error text doesn't make as much sense without the function name, reword it. <placeholder-1/>
ru: Не включайте в текст ошибки имя функции, в которой возникла ошибка. У нас есть другие механизмы, позволяющие узнать его, когда требуется, а для большинства пользователей это бесполезная информация. Если текст ошибки оказывается бессвязным без имени функции, перефразируйте его. <placeholder-1/>

source: BAD: open() failed: %m BETTER: could not open file %s: %m
ru: ПЛОХО: ошибка в open(): %m ЛУЧШЕ: не удалось открыть файл %s: %m

source: Avoid mentioning called function names, either; instead say what the code was trying to do: <placeholder-1/> If it really seems necessary, mention the system call in the detail message. (In some cases, providing the actual values passed to the system call might be appropriate information for the detail message.)
ru: Избегайте упоминания имён вызываемых функций; вместо этого скажите, что пытается делать код: <placeholder-1/> Если это действительно кажется необходимым, упомяните системный вызов в подробном сообщении. (В некоторых случаях в подробном сообщении стоит показать фактические значения, передаваемые системному вызову.)

source: Rationale: Users don't know what all those functions do.
ru: Объяснение: пользователи не знают, что делают все эти функции.

source: Tricky Words to Avoid
ru: Скользкие слова, которых следует избегать

source: Unable
ru: Unable (Неспособен)

source: <quote>Unable</quote> is nearly the passive voice. Better use <quote>cannot</quote> or <quote>could not</quote>, as appropriate.
ru: <quote>Unable</quote> — это почти пассивный залог. Лучше использовать <quote>cannot</quote> (нельзя) или <quote>could not</quote> (не удалось), в зависимости от ситуации.

source: Bad
ru: Bad (Плохое)
