Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/storage.po
Languages: ru

source: Database Physical Storage
ru: Физическое хранение базы данных

source: This chapter provides an overview of the physical storage format used by <productname>PostgreSQL</productname> databases.
ru: В данной главе рассматривается формат физического хранения, используемый базами данных <productname>PostgreSQL</productname>.

source: Database File Layout
ru: Размещение файлов базы данных

source: This section describes the storage format at the level of files and directories.
ru: Этот раздел описывает формат хранения на уровне файлов и каталогов.

source: Traditionally, the configuration and data files used by a database cluster are stored together within the cluster's data directory, commonly referred to as <varname>PGDATA</varname> (after the name of the environment variable that can be used to define it). A common location for <varname>PGDATA</varname> is <filename>/var/lib/pgsql/data</filename>. Multiple clusters, managed by different server instances, can exist on the same machine.
ru: Файлы конфигурации и файлы данных, используемые кластером базы данных, традиционно хранятся вместе в каталоге данных кластера, который обычно называют <varname>PGDATA</varname> (по имени переменной среды, которую можно использовать для его определения). Обычно <varname>PGDATA</varname> находится в <filename>/var/lib/pgsql/data</filename>. На одной и той же машине может находиться множество кластеров, управляемых различными экземплярами сервера.

source: The <varname>PGDATA</varname> directory contains several subdirectories and control files, as shown in <xref linkend="pgdata-contents-table"/>. In addition to these required items, the cluster configuration files <filename>postgresql.conf</filename>, <filename>pg_hba.conf</filename>, and <filename>pg_ident.conf</filename> are traditionally stored in <varname>PGDATA</varname>, although it is possible to place them elsewhere.
ru: В каталоге <varname>PGDATA</varname> содержится несколько подкаталогов и управляющих файлов, как показано в <xref remap="6" linkend="pgdata-contents-table"/>. В дополнение к этим обязательным элементам конфигурационные файлы кластера <filename>postgresql.conf</filename>, <filename>pg_hba.conf</filename> и <filename>pg_ident.conf</filename> традиционно хранятся в <varname>PGDATA</varname>, хотя их можно разместить и в другом месте.

source: Contents of <varname>PGDATA</varname>
ru: Содержание <varname>PGDATA</varname>

source: Item
ru: Элемент

source: Description
ru: Описание

source: A file containing the major version number of <productname>PostgreSQL</productname>
ru: Файл, содержащий номер основной версии <productname>PostgreSQL</productname>

source: Subdirectory containing per-database subdirectories
ru: Подкаталог, содержащий подкаталоги для каждой базы данных

source: Subdirectory containing cluster-wide tables, such as <structname>pg_database</structname>
ru: Подкаталог, содержащий общие таблицы кластера, такие как <structname>pg_database</structname>

source: Subdirectory containing transaction commit timestamp data
ru: Подкаталог, содержащий данные о времени фиксации транзакций

source: Subdirectory containing transaction commit status data
ru: Подкаталог, содержащий данные о состоянии транзакции

source: Subdirectory containing files used by the dynamic shared memory subsystem
ru: Подкаталог, содержащий файлы, используемые подсистемой динамически разделяемой памяти

source: Subdirectory containing status data for logical decoding
ru: Подкаталог, содержащий данные о состоянии для логического декодирования

source: Subdirectory containing multitransaction status data (used for shared row locks)
ru: Подкаталог, содержащий данные о состоянии мультитранзакций (используемые для разделяемой блокировки строк)

source: Subdirectory containing LISTEN/NOTIFY status data
ru: Подкаталог, содержащий данные состояния прослушивания и нотификации (LISTEN/NOTIFY)

source: Subdirectory containing replication slot data
ru: Подкаталог, содержащий данные слота репликации

source: Subdirectory containing information about committed serializable transactions
ru: Подкаталог, содержащий информацию о выполненных сериализуемых транзакциях.

source: Subdirectory containing exported snapshots
ru: Подкаталог, содержащий экспортированные снимки (snapshots)

source: Subdirectory containing permanent files for the statistics subsystem
ru: Подкаталог, содержащий постоянные файлы для подсистемы статистики.

source: Subdirectory containing temporary files for the statistics subsystem
ru: Подкаталог, содержащий временные файлы для подсистемы статистики

source: Subdirectory containing subtransaction status data
ru: Подкаталог, содержащий данные о состоянии подтранзакций

source: Subdirectory containing symbolic links to tablespaces
ru: Подкаталог, содержащий символические ссылки на табличные пространства

source: Subdirectory containing state files for prepared transactions
ru: Подкаталог, содержащий файлы состояний для подготовленных транзакций

source: Subdirectory containing WAL (Write Ahead Log) files
ru: Подкаталог, содержащий файлы WAL (журнал упреждающей записи)

source: A file used for storing configuration parameters that are set by <command>ALTER SYSTEM</command>
ru: Файл, используемый для хранения параметров конфигурации, которые устанавливаются при помощи <command>ALTER SYSTEM</command>

source: A file recording the command-line options the server was last started with
ru: Файл, записывающий параметры командной строки, с которыми сервер был запущен в последний раз

source: A lock file recording the current postmaster process ID (PID), cluster data directory path, postmaster start timestamp, port number, Unix-domain socket directory path (empty on Windows), first valid listen_address (IP address or <literal>*</literal>, or empty if not listening on TCP), and shared memory segment ID (this file is not present after server shutdown)
ru: Файл блокировки, записывающий идентификатор (ID) текущего управляющего процесса (PID), путь к каталогу данных кластера, временную метку запуска управляющего процесса, номер порта, путь к каталогу сокетов Unix (пустой для Windows), первый корректный адрес прослушивания (listen_address) (IP-адрес или <literal>*</literal>, либо пустое значение в случае отсутствия прослушивания по TCP), и ID сегмента разделяемой памяти (этот файл отсутствует после остановки сервера).

source: For each database in the cluster there is a subdirectory within <varname>PGDATA</varname><filename>/base</filename>, named after the database's OID in <structname>pg_database</structname>. This subdirectory is the default location for the database's files; in particular, its system catalogs are stored there.
ru: Для каждой базы данных в кластере существует подкаталог внутри <varname>PGDATA</varname><filename>/base</filename>, названный по OID базы данных в <structname>pg_database</structname>. Этот подкаталог по умолчанию является местом хранения файлов базы данных; в частности, там хранятся её системные каталоги.

source: Each table and index is stored in a separate file. For ordinary relations, these files are named after the table or index's <firstterm>filenode</firstterm> number, which can be found in <structname>pg_class</structname>.<structfield>relfilenode</structfield>. But for temporary relations, the file name is of the form <literal>t<replaceable>BBB</replaceable>_<replaceable>FFF</replaceable></literal>, where <replaceable>BBB</replaceable> is the backend ID of the backend which created the file, and <replaceable>FFF</replaceable> is the filenode number. In either case, in addition to the main file (a/k/a main fork), each table and index has a <firstterm>free space map</firstterm> (see <xref linkend="storage-fsm"/>), which stores information about free space available in the relation. The free space map is stored in a file named with the filenode number plus the suffix <literal>_fsm</literal>. Tables also have a <firstterm>visibility map</firstterm>, stored in a fork with the suffix <literal>_vm</literal>, to track which pages are known to have no dead tuples. The visibility map is described further in <xref linkend="storage-vm"/>. Unlogged tables and indexes have a third fork, known as the initialization fork, which is stored in a fork with the suffix <literal>_init</literal> (see <xref linkend="storage-init"/>).
ru: Каждая таблица и индекс хранятся в отдельном файле. Для обычных отношений, эти файлы получают имя по номеру <firstterm>файлового узла</firstterm> таблицы или индекса, который содержится в <structname>pg_class</structname>.<structfield>relfilenode</structfield>. Но для временных отношений, имя файла имеет форму <literal>t<replaceable>BBB</replaceable>_<replaceable>FFF</replaceable></literal>, где <replaceable>BBB</replaceable> - идентификатор серверного процесса сервера, который создал данный файл, а <replaceable>FFF</replaceable> — номер файлового узла. В обоих случаях, помимо главного файла (также называемого основным слоем), у каждой таблицы и индекса есть <firstterm>карта свободного пространства</firstterm> (см. <xref remap="4" linkend="storage-fsm"/>), в которой хранится информация о свободном пространстве в данном отношении. Имя файла карты свободного пространства образуется из номера файлового узла с суффиксом <literal>_fsm</literal>. Также таблицы имеют <firstterm>карту видимости</firstterm>, хранящуюся в слое с суффиксом <literal>_vm</literal>, для отслеживания страниц, не содержащих мёртвых записей. Карта видимости подробнее описана в <xref remap="6" linkend="storage-vm"/>. Нежурналируемые таблицы и индексы имеют третий слой, так называемый слой инициализации, имя которого содержит суффикс <literal>_init</literal> (см. <xref remap="4" linkend="storage-init"/>).

source: Note that while a table's filenode often matches its OID, this is <emphasis>not</emphasis> necessarily the case; some operations, like <command>TRUNCATE</command>, <command>REINDEX</command>, <command>CLUSTER</command> and some forms of <command>ALTER TABLE</command>, can change the filenode while preserving the OID. Avoid assuming that filenode and table OID are the same. Also, for certain system catalogs including <structname>pg_class</structname> itself, <structname>pg_class</structname>.<structfield>relfilenode</structfield> contains zero. The actual filenode number of these catalogs is stored in a lower-level data structure, and can be obtained using the <function>pg_relation_filenode()</function> function.
ru: Заметьте, что хотя номер файла таблицы часто совпадает с её OID, так бывает <emphasis>не</emphasis> всегда; некоторые операции, например, <command>TRUNCATE</command>, <command>REINDEX</command>, <command>CLUSTER</command> и некоторые формы команды <command>ALTER TABLE</command> могут изменить номер файла, но при этом сохранят OID. Не следует рассчитывать, что номер файлового узла и OID таблицы совпадают. Кроме того, для некоторых системных каталогов, включая и <structname>pg_class</structname>, в <structname>pg_class</structname>.<structfield>relfilenode</structfield> содержится ноль. Фактический номер файлового узла для них хранится в низкоуровневой структуре данных, и его можно получить при помощи функции <function>pg_relation_filenode()</function>.

source: When a table or index exceeds 1 GB, it is divided into gigabyte-sized <firstterm>segments</firstterm>. The first segment's file name is the same as the filenode; subsequent segments are named filenode.1, filenode.2, etc. This arrangement avoids problems on platforms that have file size limitations. (Actually, 1 GB is just the default segment size. The segment size can be adjusted using the configuration option <option>--with-segsize</option> when building <productname>PostgreSQL</productname>.) In principle, free space map and visibility map forks could require multiple segments as well, though this is unlikely to happen in practice.
ru: Когда объём таблицы или индекса превышает 1 GB, они делятся на <firstterm>сегменты</firstterm> размером в один гигабайт. Файл первого сегмента называется по номеру файлового узла (filenode); последующие сегменты получают имена filenode.1, filenode.2 и т. д. При такой организации хранения не возникает проблем на платформах, имеющих ограничения по размеру файлов. (На самом деле, 1 GB является лишь стандартным размером сегмента. Размер сегмента можно изменить, используя параметр конфигурации <option>--with-segsize</option> при создании <productname>PostgreSQL</productname>.) В принципе, карты свободного пространства и карты видимости также могут занимать нескольких сегментов, хотя на практике это маловероятно.

source: A table that has columns with potentially large entries will have an associated <firstterm>TOAST</firstterm> table, which is used for out-of-line storage of field values that are too large to keep in the table rows proper. <structname>pg_class</structname>.<structfield>reltoastrelid</structfield> links from a table to its <acronym>TOAST</acronym> table, if any. See <xref linkend="storage-toast"/> for more information.
ru: У таблицы, столбцы которой могут содержать данные большого объёма, будет иметься собственная таблица <firstterm>TOAST</firstterm>, предназначенная для отдельного хранения значений, которые слишком велики для хранения в строках самой таблицы. Основная таблица связывается с её таблицей <acronym>TOAST</acronym> (если таковая имеется) через <structname>pg_class</structname>.<structfield>reltoastrelid</structfield>. За подробной информацией обратитесь к <xref remap="3" linkend="storage-toast"/>.

source: The contents of tables and indexes are discussed further in <xref linkend="storage-page-layout"/>.
ru: Содержание таблиц и индексов рассматривается ниже (см. <xref remap="4" linkend="storage-page-layout"/>).

source: Tablespaces make the scenario more complicated. Each user-defined tablespace has a symbolic link inside the <varname>PGDATA</varname><filename>/pg_tblspc</filename> directory, which points to the physical tablespace directory (i.e., the location specified in the tablespace's <command>CREATE TABLESPACE</command> command). This symbolic link is named after the tablespace's OID. Inside the physical tablespace directory there is a subdirectory with a name that depends on the <productname>PostgreSQL</productname> server version, such as <literal>PG_9.0_201008051</literal>. (The reason for using this subdirectory is so that successive versions of the database can use the same <command>CREATE TABLESPACE</command> location value without conflicts.) Within the version-specific subdirectory, there is a subdirectory for each database that has elements in the tablespace, named after the database's OID. Tables and indexes are stored within that directory, using the filenode naming scheme. The <literal>pg_default</literal> tablespace is not accessed through <filename>pg_tblspc</filename>, but corresponds to <varname>PGDATA</varname><filename>/base</filename>. Similarly, the <literal>pg_global</literal> tablespace is not accessed through <filename>pg_tblspc</filename>, but corresponds to <varname>PGDATA</varname><filename>/global</filename>.
ru: Табличное пространство делает сценарий более сложным. Каждое пользовательское табличное пространство имеет символическую ссылку внутри каталога <varname>PGDATA</varname><filename>/pg_tblspc</filename>, указывающую на физический каталог табличного пространства (т. е., положение, указанное в команде табличного пространства <command>CREATE TABLESPACE</command>). Эта символическая ссылка получает имя по OID табличного пространства. Внутри физического каталога табличного пространства имеется подкаталог, имя которого зависит от версии сервера <productname>PostgreSQL</productname>, как например <literal>PG_9.0_201008051</literal>. (Этот подкаталог используется для того, чтобы последующие версии базы данных могли свободно использовать одно и то местоположение, заданное в <command>CREATE TABLESPACE</command>.) Внутри каталога конкретной версии находится подкаталог для каждой базы данных, которая имеет элементы в табличном пространстве, названный по OID базы данных. Таблицы и индексы хранятся внутри этого каталога, используя схему именования файловых узлов. Табличное пространство <literal>pg_default</literal> недоступно через <filename>pg_tblspc</filename>, но соответствует <varname>PGDATA</varname><filename>/base</filename>. Подобным же образом, табличное пространство <literal>pg_global</literal> недоступно через <filename>pg_tblspc</filename>, но соответствует <varname>PGDATA</varname><filename>/global</filename>.

source: The <function>pg_relation_filepath()</function> function shows the entire path (relative to <varname>PGDATA</varname>) of any relation. It is often useful as a substitute for remembering many of the above rules. But keep in mind that this function just gives the name of the first segment of the main fork of the relation &mdash; you may need to append a segment number and/or <literal>_fsm</literal>, <literal>_vm</literal>, or <literal>_init</literal> to find all the files associated with the relation.
ru: Функция <function>pg_relation_filepath()</function> показывает полный путь (относительно <varname>PGDATA</varname>) для любого отношения. Часто это избавляет от необходимости запоминать многие из приведённых выше правил. Но следует помнить, что эта функция выдаёт лишь имя первого сегмента основного слоя отношения, т. е. возможно, понадобится добавить номер сегмента и/или <literal>_fsm</literal>, <literal>_vm</literal> или <literal>_init</literal>, чтобы найти все файлы, связанные с отношением.

source: Temporary files (for operations such as sorting more data than can fit in memory) are created within <varname>PGDATA</varname><filename>/base/pgsql_tmp</filename>, or within a <filename>pgsql_tmp</filename> subdirectory of a tablespace directory if a tablespace other than <literal>pg_default</literal> is specified for them. The name of a temporary file has the form <filename>pgsql_tmp<replaceable>PPP</replaceable>.<replaceable>NNN</replaceable></filename>, where <replaceable>PPP</replaceable> is the PID of the owning backend and <replaceable>NNN</replaceable> distinguishes different temporary files of that backend.
ru: Временные файлы (для таких операций, как сортировка объёма данных большего, чем может уместиться в памяти) создаются внутри <varname>PGDATA</varname><filename>/base/pgsql_tmp</filename> или внутри подкаталога <filename>pgsql_tmp</filename> каталога табличного пространства, если для них определено табличное пространство, отличное от <literal>pg_default</literal>. Имя временного файла имеет форму <filename>pgsql_tmp<replaceable>PPP</replaceable>.<replaceable>NNN</replaceable></filename>, где <replaceable>PPP</replaceable> — PID серверного процесса, а <replaceable>NNN</replaceable> служит для разделения различных временных файлов этого серверного процесса.

source: <primary>sliced bread</primary><see>TOAST</see>
ru: <primary>нарезанный хлеб</primary> <see>TOAST</see>

source: This section provides an overview of <acronym>TOAST</acronym> (The Oversized-Attribute Storage Technique).
ru: В данном разделе рассматривается <acronym>TOAST</acronym> (The Oversized-Attribute Storage Technique, Методика хранения сверхбольших атрибутов).

source: <productname>PostgreSQL</productname> uses a fixed page size (commonly 8 kB), and does not allow tuples to span multiple pages. Therefore, it is not possible to store very large field values directly. To overcome this limitation, large field values are compressed and/or broken up into multiple physical rows. This happens transparently to the user, with only small impact on most of the backend code. The technique is affectionately known as <acronym>TOAST</acronym> (or <quote>the best thing since sliced bread</quote>). The <acronym>TOAST</acronym> infrastructure is also used to improve handling of large data values in-memory.
ru: <productname>PostgreSQL</productname> использует фиксированный размер страницы (обычно 8 КБ), и не позволяет кортежам занимать несколько страниц. Поэтому непосредственно хранить очень большие значения полей невозможно. Для преодоления этого ограничения большие значения полей сжимаются и/или разбиваются на несколько физических строк. Это происходит незаметно для пользователя и на большую часть кода сервера влияет незначительно. Этот метод известен как <acronym>TOAST</acronym> (тост, или <quote>лучшее после изобретения нарезанного хлеба</quote>). Инфраструктура <acronym>TOAST</acronym> также применяется для оптимизации обработки больших значений данных в памяти.

source: Only certain data types support <acronym>TOAST</acronym> &mdash; there is no need to impose the overhead on data types that cannot produce large field values. To support <acronym>TOAST</acronym>, a data type must have a variable-length (<firstterm>varlena</firstterm>) representation, in which, ordinarily, the first four-byte word of any stored value contains the total length of the value in bytes (including itself). <acronym>TOAST</acronym> does not constrain the rest of the data type's representation. The special representations collectively called <firstterm><acronym>TOAST</acronym>ed values</firstterm> work by modifying or reinterpreting this initial length word. Therefore, the C-level functions supporting a <acronym>TOAST</acronym>-able data type must be careful about how they handle potentially <acronym>TOAST</acronym>ed input values: an input might not actually consist of a four-byte length word and contents until after it's been <firstterm>detoasted</firstterm>. (This is normally done by invoking <function>PG_DETOAST_DATUM</function> before doing anything with an input value, but in some cases more efficient approaches are possible. See <xref linkend="xtypes-toast"/> for more detail.)
ru: Лишь определённые типы данных поддерживают <acronym>TOAST</acronym> &mdash; нет смысла производить дополнительные действия с типами данных, размер которых не может быть большим. Чтобы поддерживать <acronym>TOAST</acronym>, тип данных должен представлять значение переменной длины (<firstterm>varlena</firstterm>), в котором первое четырёхбайтовое слово любого хранящегося значения содержит общую длину значения в байтах (включая само это слово). Содержание оставшейся части значения <acronym>TOAST</acronym> не ограничивает. Специальные представления, в целом называемые <firstterm>значениями в формате <acronym>TOAST</acronym></firstterm>, работают, манипулируя этим начальным словом длины и интерпретируя его по-своему. Таким образом, функции уровня C, работающие с типом данных, поддерживающим <acronym>TOAST</acronym>, должны аккуратно обращаться со входными значениями, которые могут быть в формате <acronym>TOAST</acronym>: входные данные могут и не содержать четырёхбайтовое слово длины и содержимое после него, пока не будут <firstterm>распакованы</firstterm>. (Обычно в таких ситуациях нужно использовать макрос <function>PG_DETOAST_DATUM</function> прежде чем что-либо делать с входным значением, но в некоторых случаях возможны и более эффективные подходы. За подробностями обратитесь к <xref remap="3" linkend="xtypes-toast"/>.)
