Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/storage.po
Languages: ru

source: XID for VACUUM operation moving a row version
ru: XID для операции VACUUM, которая перемещает версию строки

source: 6 bytes
ru: 6 байт

source: current TID of this or newer row version
ru: текущее значение TID этой или более новой версии строки

source: number of attributes, plus various flag bits
ru: количество атрибутов плюс различные биты флагов

source: various flag bits
ru: различные биты флагов

source: 1 byte
ru: 1 байт

source: offset to user data
ru: отступ до пользовательских данных

source: All the details can be found in <filename>src/include/access/htup_details.h</filename>.
ru: Всю подробную информацию можно найти в <filename>src/include/access/htup_details.h</filename>.

source: Interpreting the actual data can only be done with information obtained from other tables, mostly <structname>pg_attribute</structname>. The key values needed to identify field locations are <structfield>attlen</structfield> and <structfield>attalign</structfield>. There is no way to directly get a particular attribute, except when there are only fixed width fields and no null values. All this trickery is wrapped up in the functions <firstterm>heap_getattr</firstterm>, <firstterm>fastgetattr</firstterm> and <firstterm>heap_getsysattr</firstterm>.
ru: Интерпретация текущих данных может быть проведена с помощью информации, полученной из других таблиц, в основном из <structname>pg_attribute</structname>. Ключевые значения, необходимые для определения расположения полей <structfield>attlen</structfield> и <structfield>attalign</structfield>. Не существует способа непосредственного получения заданного атрибута кроме случая, когда имеются только поля фиксированной длины, и при этом нет пустых значений. Все эти особенности учитываются в функциях <firstterm>heap_getattr</firstterm>, <firstterm>fastgetattr</firstterm> и <firstterm>heap_getsysattr</firstterm>.

source: To read the data you need to examine each attribute in turn. First check whether the field is NULL according to the null bitmap. If it is, go to the next. Then make sure you have the right alignment. If the field is a fixed width field, then all the bytes are simply placed. If it's a variable length field (attlen = -1) then it's a bit more complicated. All variable-length data types share the common header structure <type>struct varlena</type>, which includes the total length of the stored value and some flag bits. Depending on the flags, the data can be either inline or in a <acronym>TOAST</acronym> table; it might be compressed, too (see <xref linkend="storage-toast"/>).
ru: Чтобы прочитать данные, необходимо просмотреть каждый атрибут по очереди. В первую очередь нужно проверить, является ли значение поля пустым согласно битовой карте пустых значений. Если это так, можно переходить к следующему полю. Затем следует убедиться, что выравнивание является верным. Если это поле фиксированной ширины, берутся просто все его байты. Если это поле переменной длины (attlen = -1), всё несколько сложнее. Все типы данных с переменной длиной имеют общую структуру заголовка <type>struct varlena</type>, которая включает общую длину сохранённого значения и некоторые биты флагов. В зависимости от установленных флагов, данные могут храниться либо локально, либо в таблице <acronym>TOAST</acronym>. Также, возможно сжатие данных (см. <xref remap="4" linkend="storage-toast"/>).
