Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/storage.po
Languages: ru

source: <acronym>TOAST</acronym> pointers to expanded values are further broken down into <firstterm>read-write</firstterm> and <firstterm>read-only</firstterm> pointers. The pointed-to representation is the same either way, but a function that receives a read-write pointer is allowed to modify the referenced value in-place, whereas one that receives a read-only pointer must not; it must first create a copy if it wants to make a modified version of the value. This distinction and some associated conventions make it possible to avoid unnecessary copying of expanded values during query execution.
ru: Указатели <acronym>TOAST</acronym> на развёрнутые значения далее подразделяются на указатели <firstterm>для чтения/записи</firstterm> и указатели <firstterm>только для чтения</firstterm>. Представление, на которое они указывают, в любом случае одинаковое, но функции, получающей указатель для чтения/записи, разрешается модифицировать целевые данные прямо на месте, тогда как функция, получающая указатель только для чтения, не должна этого делать; если ей нужно получить изменённую версию значения, она должна сначала сделать копию. Это отличие и связанные с ним соглашения позволяют избежать излишнего копирования развёрнутых значений при выполнении запросов.

source: For all types of in-memory <acronym>TOAST</acronym> pointer, the <acronym>TOAST</acronym> management code ensures that no such pointer datum can accidentally get stored on disk. In-memory <acronym>TOAST</acronym> pointers are automatically expanded to normal in-line varlena values before storage &mdash; and then possibly converted to on-disk <acronym>TOAST</acronym> pointers, if the containing tuple would otherwise be too big.
ru: Для всех типов указателей <acronym>TOAST</acronym> на данные в памяти, код обработки <acronym>TOAST</acronym> гарантирует, что такие данные не окажутся случайно сохранены на диске. Указатели <acronym>TOAST</acronym> в памяти автоматически сворачиваются в обычные значения varlena перед сохранением &mdash; а затем могут преобразоваться в указатели <acronym>TOAST</acronym> на диске, если без этого не смогут уместиться в содержащем их кортеже.

source: Free Space Map
ru: Карта свободного пространства

source: <primary>Free Space Map</primary>
ru: <primary>Карта свободного пространства</primary>

source: <primary>FSM</primary><see>Free Space Map</see>
ru: <primary>FSM</primary> <see>Карта свободного пространства</see>

source: Each heap and index relation, except for hash indexes, has a Free Space Map (FSM) to keep track of available space in the relation. It's stored alongside the main relation data in a separate relation fork, named after the filenode number of the relation, plus a <literal>_fsm</literal> suffix. For example, if the filenode of a relation is 12345, the FSM is stored in a file called <filename>12345_fsm</filename>, in the same directory as the main relation file.
ru: Каждое табличное и индексное отношение, за исключением хеш-индексов, имеет карту свободного пространства (Free Space Map, FSM) для отслеживания доступного места. Она хранится рядом с данными главного отношения в отдельном слое, имя которого образуется номером файлового узла отношения с суффиксом <literal>_fsm</literal>. Например, если файловый узел отношения — 12345, FSM хранится в файле с именем <filename>12345_fsm</filename> в том же каталоге, что и основной файл отношения.

source: The Free Space Map is organized as a tree of <acronym>FSM</acronym> pages. The bottom level <acronym>FSM</acronym> pages store the free space available on each heap (or index) page, using one byte to represent each such page. The upper levels aggregate information from the lower levels.
ru: Карта свободного пространства представляет собой дерево страниц <acronym>FSM</acronym>. Страницы <acronym>FSM</acronym> нижнего уровня хранят информацию о свободном пространстве, доступном на каждой странице таблицы (или индекса), используя один байт для представления каждой такой страницы. Верхние уровни агрегируют информацию нижних уровней.

source: Within each <acronym>FSM</acronym> page is a binary tree, stored in an array with one byte per node. Each leaf node represents a heap page, or a lower level <acronym>FSM</acronym> page. In each non-leaf node, the higher of its children's values is stored. The maximum value in the leaf nodes is therefore stored at the root.
ru: Внутри каждой страницы <acronym>FSM</acronym> имеется двоичное дерево, хранящееся в массиве, где один байт выделяется на каждый узел дерева. Каждый листовой узел представляет страницу таблицы или страницу <acronym>FSM</acronym> нижнего уровня. В каждом узле выше листовых хранится наибольшее из значений его узлов-потомков. Поэтому максимальное из значений листовых узлов хранится в корневом узле.

source: See <filename>src/backend/storage/freespace/README</filename> for more details on how the <acronym>FSM</acronym> is structured, and how it's updated and searched. The <xref linkend="pgfreespacemap"/> module can be used to examine the information stored in free space maps.
ru: Более подробную информацию о структуре <acronym>FSM</acronym> и о том, как выполняется обновление и поиск, вы найдёте в <filename>src/backend/storage/freespace/README</filename>. Модуль <xref linkend="pgfreespacemap"/> может быть использован для просмотра информации, хранящейся в картах свободного пространства.

source: Visibility Map
ru: Карта видимости

source: <primary>Visibility Map</primary>
ru: <primary>Карта видимости</primary>

source: <primary>VM</primary><see>Visibility Map</see>
ru: <primary>VM</primary> <see>Карта видимости</see>

source: The visibility map stores two bits per heap page. The first bit, if set, indicates that the page is all-visible, or in other words that the page does not contain any tuples that need to be vacuumed. This information can also be used by <link linkend="indexes-index-only-scans"><firstterm>index-only scans</firstterm></link> to answer queries using only the index tuple. The second bit, if set, means that all tuples on the page have been frozen. That means that even an anti-wraparound vacuum need not revisit the page.
ru: Карта видимости хранит по два бита на страницу таблицы. Первый бит, если он установлен, показывает, что вся страница видна или, другими словами, не содержит кортежей, которые необходимо очистить. Эта информация может также использоваться при <link linkend="indexes-index-only-scans"><firstterm>сканировании только индекса</firstterm></link> для поиска ответов только в данных индекса. Установленный второй бит показывает, что все кортежи на этой странице заморожены. Это означает, что процесс очистки для предотвращения зацикливания не должен больше посещать эту страницу.

source: The map is conservative in the sense that we make sure that whenever a bit is set, we know the condition is true, but if a bit is not set, it might or might not be true. Visibility map bits are only set by vacuum, but are cleared by any data-modifying operations on a page.
ru: Карта может отражать реальные данные с запаздыванием в том смысле, что мы уверены, что в случаях, когда установлен бит, известно, что условие верно, но если бит не установлен, оно может быть верным или неверным. Биты карты видимости устанавливаются только при очистке, а сбрасываются при любых операциях, изменяющих данные на странице.

source: The <xref linkend="pgvisibility"/> module can be used to examine the information stored in the visibility map.
ru: Для изучения информации, хранящейся в карте видимости, можно воспользоваться модулем <xref linkend="pgvisibility"/>.

source: The Initialization Fork
ru: Слой инициализации

source: <primary>Initialization Fork</primary>
ru: <primary>Слой инициализации</primary>

source: Each unlogged table, and each index on an unlogged table, has an initialization fork. The initialization fork is an empty table or index of the appropriate type. When an unlogged table must be reset to empty due to a crash, the initialization fork is copied over the main fork, and any other forks are erased (they will be recreated automatically as needed).
ru: Каждая нежурналируемая таблица, и каждый индекс такой таблицы имеет файл инициализации. Файл инициализации представляет собой пустую таблицу или индекс соответствующего типа. Когда нежурналируемая таблица должна быть заново очищена по причине сбоя, файл инициализации копируется поверх главного файла, а все прочие файлы удаляются (при необходимости они будут автоматически созданы заново).

source: Database Page Layout
ru: Компоновка страницы базы данных

source: Actually, index access methods need not use this page format. All the existing index methods do use this basic format, but the data kept on index metapages usually doesn't follow the item layout rules.
ru: Фактически индексные методы доступа не нуждаются в этом формате страниц. Все существующие индексные методы в действительности используют этот основной формат, но данные, хранящиеся в индексных метастраницах обычно не следуют правилам компоновки.

source: This section provides an overview of the page format used within <productname>PostgreSQL</productname> tables and indexes.<placeholder-1/> Sequences and <acronym>TOAST</acronym> tables are formatted just like a regular table.
ru: В данном разделе рассматривается формат страницы, используемый в таблицах и индексах <productname>PostgreSQL</productname>.<placeholder-1/> Последовательности и таблицы <acronym>TOAST</acronym> форматируются как обычные таблицы.

source: In the following explanation, a <firstterm>byte</firstterm> is assumed to contain 8 bits. In addition, the term <firstterm>item</firstterm> refers to an individual data value that is stored on a page. In a table, an item is a row; in an index, an item is an index entry.
ru: В дальнейшем подразумевается, что <firstterm>байт</firstterm> содержит 8 бит. В дополнение, термин <firstterm>элемент</firstterm> относится к индивидуальному значению данных, которое хранится на странице. В таблице элемент — это строка; в индексе — элемент индекса.

source: Every table and index is stored as an array of <firstterm>pages</firstterm> of a fixed size (usually 8 kB, although a different page size can be selected when compiling the server). In a table, all the pages are logically equivalent, so a particular item (row) can be stored in any page. In indexes, the first page is generally reserved as a <firstterm>metapage</firstterm> holding control information, and there can be different types of pages within the index, depending on the index access method.
ru: Каждая таблица и индекс хранятся как массив <firstterm>страниц</firstterm> фиксированного размера (обычно 8 kB, хотя можно выбрать другой размер страницы при компиляции сервера). В таблице все страницы логически эквивалентны, поэтому конкретный элемент (строка) может храниться на любой странице. В индексах первая страница обычно резервируется как <firstterm>метастраница</firstterm>, хранящая контрольную информацию, а внутри индекса могут быть разные типы страниц, в зависимости от метода доступа индекса.

source: <xref linkend="page-table"/> shows the overall layout of a page. There are five parts to each page.
ru: <xref linkend="page-table"/> показывает общую компоновку страницы. Каждая страница имеет пять частей.

source: Overall Page Layout
ru: Общая компоновка страницы

source: Page Layout
ru: Компоновка страницы

source: PageHeaderData
ru: Данные заголовка страницы

source: 24 bytes long. Contains general information about the page, including free space pointers.
ru: Длина — 24 байта. Содержит общую информацию о странице, включая указатели свободного пространства.

source: ItemIdData
ru: Данные идентификаторов элементов

source: Array of (offset,length) pairs pointing to the actual items. 4 bytes per item.
ru: Массив пар (смещение, длина), указывающих на фактические элементы. Для каждого элемента выделяется 4 байта.

source: Free space
ru: Свободное пространство

source: The unallocated space. New item pointers are allocated from the start of this area, new items from the end.
ru: Незанятое пространство. Новые указатели элементов размещаются с начала этой области, сами новые элементы — с конца.

source: Items
ru: Элементы

source: The actual items themselves.
ru: Сами элементы данных как таковые.

source: Special space
ru: Специальное пространство

source: Index access method specific data. Different methods store different data. Empty in ordinary tables.
ru: Специфические данные метода доступа. Для различных методов хранятся различные данные. Для обычных таблиц таких данных нет.

source: The first 24 bytes of each page consists of a page header (<structname>PageHeaderData</structname>). Its format is detailed in <xref linkend="pageheaderdata-table"/>. The first field tracks the most recent WAL entry related to this page. The second field contains the page checksum if <xref linkend="app-initdb-data-checksums"/> are enabled. Next is a 2-byte field containing flag bits. This is followed by three 2-byte integer fields (<structfield>pd_lower</structfield>, <structfield>pd_upper</structfield>, and <structfield>pd_special</structfield>). These contain byte offsets from the page start to the start of unallocated space, to the end of unallocated space, and to the start of the special space. The next 2 bytes of the page header, <structfield>pd_pagesize_version</structfield>, store both the page size and a version indicator. Beginning with <productname>PostgreSQL</productname> 8.3 the version number is 4; <productname>PostgreSQL</productname> 8.1 and 8.2 used version number 3; <productname>PostgreSQL</productname> 8.0 used version number 2; <productname>PostgreSQL</productname> 7.3 and 7.4 used version number 1; prior releases used version number 0. (The basic page layout and header format has not changed in most of these versions, but the layout of heap row headers has.) The page size is basically only present as a cross-check; there is no support for having more than one page size in an installation. The last field is a hint that shows whether pruning the page is likely to be profitable: it tracks the oldest un-pruned XMAX on the page.
ru: Первые 24 байта каждой страницы образуют заголовок страницы (<structname>PageHeaderData</structname>). Его формат подробно описан в <xref remap="6" linkend="pageheaderdata-table"/>. В первом поле отслеживается самая последняя запись в WAL, связанная с этой страницей. Второе поле содержит контрольную сумму страницы, если включён режим <xref linkend="app-initdb-data-checksums"/>. Затем идёт двухбайтовое поле, содержащее биты флагов. За ним следуют три двухбайтовых целочисленных поля (<structfield>pd_lower</structfield>, <structfield>pd_upper</structfield> и <structfield>pd_special</structfield>). Они содержат смещения в байтах от начала страницы до начала незанятого пространства, до конца незанятого пространства и до начала специального пространства. В следующих 2 байтах заголовка страницы, в поле <structfield>pd_pagesize_version</structfield>, хранится размер страницы и индикатор версии. Начиная с <productname>PostgreSQL</productname> 8.3, используется версия 4; в <productname>PostgreSQL</productname> 8.1 и 8.2 использовалась версия 3; в <productname>PostgreSQL</productname> 8.0 — версия 2; в <productname>PostgreSQL</productname> 7.3 и 7.4 — версия 1; а в предыдущих выпусках — версия 0. (Основная структура страницы и формат заголовка почти во всех этих версиях одни и те же, но структура заголовка строк в куче изменялась.) Размер страницы присутствует, в основном, только для перекрёстной проверки; возможность использовать в одной инсталляции разные размеры страниц не поддерживается. Последнее поле подсказывает, насколько вероятна возможность получить выигрыш, произведя очистку страницы: оно отслеживает самый старый XMAX на странице, не подвергавшийся очистке.

# title
source: PageHeaderData Layout
ru: Данные заголовка страницы (PageHeaderData)

# titleabbrev
source: PageHeaderData Layout
ru: Данные заголовка страницы

source: Field
ru: Поле

source: Type
ru: Тип

source: Length
ru: Длина

source: 8 bytes
ru: 8 байт

source: LSN: next byte after last byte of xlog record for last change to this page
ru: LSN: Следующий байт после последнего байта записи xlog для последнего изменения на этой странице

source: 2 bytes
ru: 2 байта

source: Page checksum
ru: Контрольная сумма страницы

source: Flag bits
ru: Биты признаков

source: Offset to start of free space
ru: Смещение до начала свободного пространства

source: Offset to end of free space
ru: Смещение до конца свободного пространства

source: Offset to start of special space
ru: Смещение до начала специального пространства

source: Page size and layout version number information
ru: Информация о размере страницы и номере версии компоновки

source: 4 bytes
ru: 4 байта

source: Oldest unpruned XMAX on page, or zero if none
ru: Самый старый неочищенный идентификатор XMAX на странице или ноль при отсутствии такового

source: All the details can be found in <filename>src/include/storage/bufpage.h</filename>.
ru: Всю подробную информацию можно найти в <filename>src/include/storage/bufpage.h</filename>.

source: Following the page header are item identifiers (<type>ItemIdData</type>), each requiring four bytes. An item identifier contains a byte-offset to the start of an item, its length in bytes, and a few attribute bits which affect its interpretation. New item identifiers are allocated as needed from the beginning of the unallocated space. The number of item identifiers present can be determined by looking at <structfield>pd_lower</structfield>, which is increased to allocate a new identifier. Because an item identifier is never moved until it is freed, its index can be used on a long-term basis to reference an item, even when the item itself is moved around on the page to compact free space. In fact, every pointer to an item (<type>ItemPointer</type>, also known as <type>CTID</type>) created by <productname>PostgreSQL</productname> consists of a page number and the index of an item identifier.
ru: За заголовком страницы следуют идентификаторы элемента (<type>ItemIdData</type>), каждому из которых требуется 4 байта. Идентификатор элемента содержит байтовое смещение до начала элемента, его длину в байтах и несколько битов атрибутов, которые влияют на его интерпретацию. Новые идентификаторы элементов размещаются по мере необходимости от начала свободного пространства. Количество имеющихся идентификаторов элементов можно определить через значение <structfield>pd_lower</structfield>, которое увеличивается при добавлении нового идентификатора. Поскольку идентификатор элемента никогда не перемещается до тех пор, пока он не освобождается, его индекс можно использовать в течение длительного периода времени, чтобы ссылаться на элемент, даже когда сам элемент перемещается по странице для уплотнения свободного пространства. Фактически каждый указатель на элемент (<type>ItemPointer</type>, также известный как <type>CTID</type>), созданный <productname>PostgreSQL</productname>, состоит из номера страницы и индекса идентификатора элемента.

source: The items themselves are stored in space allocated backwards from the end of unallocated space. The exact structure varies depending on what the table is to contain. Tables and sequences both use a structure named <type>HeapTupleHeaderData</type>, described below.
ru: Сами элементы хранятся в пространстве, выделяемом в направлении от конца к началу незанятого пространства. Точная структура меняется в зависимости от того, каким будет содержание таблицы. Как таблицы, так и последовательности используют структуру под названием <type>HeapTupleHeaderData</type>, которая описывается ниже.

source: The final section is the <quote>special section</quote> which can contain anything the access method wishes to store. For example, b-tree indexes store links to the page's left and right siblings, as well as some other data relevant to the index structure. Ordinary tables do not use a special section at all (indicated by setting <structfield>pd_special</structfield> to equal the page size).
ru: Последний раздел является <quote>особым разделом</quote>, который может содержать всё, что необходимо методу доступа для хранения. Например, индексы-B-деревья хранят ссылки на страницы слева и справа, равно как и некоторые другие данные, соответствующие структуре индекса. Обычные таблицы не используют особый раздел вовсе (что указывается установкой значения <structfield>pd_special</structfield> равным размеру страницы).

source: All table rows are structured in the same way. There is a fixed-size header (occupying 23 bytes on most machines), followed by an optional null bitmap, an optional object ID field, and the user data. The header is detailed in <xref linkend="heaptupleheaderdata-table"/>. The actual user data (columns of the row) begins at the offset indicated by <structfield>t_hoff</structfield>, which must always be a multiple of the MAXALIGN distance for the platform. The null bitmap is only present if the <firstterm>HEAP_HASNULL</firstterm> bit is set in <structfield>t_infomask</structfield>. If it is present it begins just after the fixed header and occupies enough bytes to have one bit per data column (that is, <structfield>t_natts</structfield> bits altogether). In this list of bits, a 1 bit indicates not-null, a 0 bit is a null. When the bitmap is not present, all columns are assumed not-null. The object ID is only present if the <firstterm>HEAP_HASOID</firstterm> bit is set in <structfield>t_infomask</structfield>. If present, it appears just before the <structfield>t_hoff</structfield> boundary. Any padding needed to make <structfield>t_hoff</structfield> a MAXALIGN multiple will appear between the null bitmap and the object ID. (This in turn ensures that the object ID is suitably aligned.)
ru: Все строки таблицы структурированы одним и тем же образом. Они включают заголовок фиксированного размера (занимающий 23 байта на большинстве машин), за которым следует необязательная битовая карта пустых значений, необязательное поле идентификатора объекта и данные пользователя. Подробное описание заголовка представлено в <xref linkend="heaptupleheaderdata-table"/>. Актуальные пользовательские данные (столбцы строки) начинаются после смещения, заданного в <structfield>t_hoff</structfield>, которое должно всегда быть кратным величине MAXALIGN для платформы. Битовая карта пустых значений имеется тогда, когда бит <firstterm>HEAP_HASNULL</firstterm> установлен в значении <structfield>t_infomask</structfield>. В случае наличия, она начинается сразу после фиксированного заголовка и занимает достаточно байтов, чтобы иметь один бит на столбец (т. е. <structfield>t_natts</structfield> битов всего). В этом списке битов установленный в единицу бит означает непустое значение, а установленный в ноль соответствует пустому значению. Когда битовая карта отсутствует, все столбцы считаются непустыми. Идентификатор объекта присутствует, если только бит <firstterm>HEAP_HASOID</firstterm> установлен в значении <structfield>t_infomask</structfield>. Если он есть, он расположен сразу перед началом <structfield>t_hoff</structfield>. Любое заполнение, необходимое для того, чтобы сделать <structfield>t_hoff</structfield> кратным MAXALIGN, будет расположено между битовой картой пустых значений и идентификатором объекта. (Это в свою очередь гарантирует, что идентификатор объекта будет правильно выровнен.)

# title
source: HeapTupleHeaderData Layout
ru: Данные заголовка строки таблицы (HeapTupleHeaderData)

# titleabbrev
source: HeapTupleHeaderData Layout
ru: Данные заголовка строки таблицы

source: insert XID stamp
ru: значение XID вставки

source: delete XID stamp
ru: значение XID удаления

source: insert and/or delete CID stamp (overlays with t_xvac)
ru: значение CID для вставки и/или удаления (пересекается с t_xvac)
