Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/storage.po
Languages: ru

source: <acronym>TOAST</acronym> usurps two bits of the varlena length word (the high-order bits on big-endian machines, the low-order bits on little-endian machines), thereby limiting the logical size of any value of a <acronym>TOAST</acronym>-able data type to 1 GB (2<superscript>30</superscript> - 1 bytes). When both bits are zero, the value is an ordinary un-<acronym>TOAST</acronym>ed value of the data type, and the remaining bits of the length word give the total datum size (including length word) in bytes. When the highest-order or lowest-order bit is set, the value has only a single-byte header instead of the normal four-byte header, and the remaining bits of that byte give the total datum size (including length byte) in bytes. This alternative supports space-efficient storage of values shorter than 127 bytes, while still allowing the data type to grow to 1 GB at need. Values with single-byte headers aren't aligned on any particular boundary, whereas values with four-byte headers are aligned on at least a four-byte boundary; this omission of alignment padding provides additional space savings that is significant compared to short values. As a special case, if the remaining bits of a single-byte header are all zero (which would be impossible for a self-inclusive length), the value is a pointer to out-of-line data, with several possible alternatives as described below. The type and size of such a <firstterm>TOAST pointer</firstterm> are determined by a code stored in the second byte of the datum. Lastly, when the highest-order or lowest-order bit is clear but the adjacent bit is set, the content of the datum has been compressed and must be decompressed before use. In this case the remaining bits of the four-byte length word give the total size of the compressed datum, not the original data. Note that compression is also possible for out-of-line data but the varlena header does not tell whether it has occurred &mdash; the content of the <acronym>TOAST</acronym> pointer tells that, instead.
ru: <acronym>TOAST</acronym> занимает два бита слова длины varlena (старшие биты на машинах с порядком байт от старшего к младшему, или младшие биты — при другом порядке байт), таким образом, логический размер любого значения в формате <acronym>TOAST</acronym> ограничивается 1 Гигабайтом (2<superscript>30</superscript> - 1 байт). Когда оба бита равны нулю, значение является обычным, не в формате <acronym>TOAST</acronym>, и оставшиеся биты слова длины задают общий размер элемента данных (включая слово длины) в байтах. Когда установлен старший (или младший, в зависимости от архитектуры) бит, значение имеет однобайтовый заголовок вместо обычного четырёхбайтового, а оставшиеся биты этого байта задают общий размер элемента данных (включая байт длины) в байтах. Этот вариант позволяет экономно хранить значения короче 127 байт и при этом допускает расширение значения этого типа данных до 1 Гбайта при необходимости. Значения с однобайтовыми заголовками не выравниваются по какой-либо определённой границе, тогда как значения с четырёхбайтовыми заголовками выравниваются по границе минимум четырёх байт; это избавление от выравнивания даёт дополнительный выигрыш в объёме, очень ощутимый для коротких значений. В качестве особого случая, если все оставшиеся биты однобайтового заголовка равны нулю (что в принципе невозможно с учётом включения размера длины), значением является указатель на отдельно размещённые данные, с несколькими возможными вариантами, описанными ниже. Тип и размер такого <firstterm>указателя TOAST</firstterm> определяется кодом, хранящимся во втором байте значения. Наконец, когда старший (или младший, в зависимости от архитектуры) бит очищен, а соседний бит установлен, содержимое данных хранится в упакованном виде и должно быть распаковано перед использованием. В этом случае оставшиеся биты четырёхбайтового слова длины задают общий размер сжатых, а не исходных данных. Заметьте, что сжатие также возможно и для отделённых данных, но заголовок varlena не говорит, имеет ли оно место &mdash; это определяется содержимым, на которое указывает указатель <acronym>TOAST</acronym>.

source: As mentioned, there are multiple types of <acronym>TOAST</acronym> pointer datums. The oldest and most common type is a pointer to out-of-line data stored in a <firstterm><acronym>TOAST</acronym> table</firstterm> that is separate from, but associated with, the table containing the <acronym>TOAST</acronym> pointer datum itself. These <firstterm>on-disk</firstterm> pointer datums are created by the <acronym>TOAST</acronym> management code (in <filename>access/heap/tuptoaster.c</filename>) when a tuple to be stored on disk is too large to be stored as-is. Further details appear in <xref linkend="storage-toast-ondisk"/>. Alternatively, a <acronym>TOAST</acronym> pointer datum can contain a pointer to out-of-line data that appears elsewhere in memory. Such datums are necessarily short-lived, and will never appear on-disk, but they are very useful for avoiding copying and redundant processing of large data values. Further details appear in <xref linkend="storage-toast-inmemory"/>.
ru: Как уже было сказано, существуют разные варианты использования указателя <acronym>TOAST</acronym>. Самый старый и наиболее популярный вариант — когда он указывает на отделённые данные, размещённые в <firstterm>таблице <acronym>TOAST</acronym></firstterm>, которая отделена, но связана с таблицей, содержащей собственно указатель данных <acronym>TOAST</acronym>. Такой указатель на данные <firstterm>на диске</firstterm> создаётся кодом обработки <acronym>TOAST</acronym> (в <filename>access/heap/tuptoaster.c</filename>), когда кортеж, сохраняемый на диск, оказывается слишком большим. Дополнительные подробности описаны в <xref remap="6" linkend="storage-toast-ondisk"/>. Кроме того, указатель <acronym>TOAST</acronym> может указывать на отделённые данные, размещённые где-то в памяти. Такие данные обязательно недолговременные и никогда не оказываются на диске, но этот механизм очень полезен для исключения копирования и избыточной обработки данные большого размера. Дополнительные подробности описаны в <xref remap="6" linkend="storage-toast-inmemory"/>.

source: The compression technique used for either in-line or out-of-line compressed data is a fairly simple and very fast member of the LZ family of compression techniques. See <filename>src/common/pg_lzcompress.c</filename> for the details.
ru: В качестве метода сжатия внутренних и отделённых данных применяется довольно простой и очень быстрый представитель семейства алгоритмов LZ. Подробнее см. <filename>src/common/pg_lzcompress.c</filename>.

source: Out-of-line, on-disk TOAST storage
ru: Отдельное размещение TOAST на диске

source: If any of the columns of a table are <acronym>TOAST</acronym>-able, the table will have an associated <acronym>TOAST</acronym> table, whose OID is stored in the table's <structname>pg_class</structname>.<structfield>reltoastrelid</structfield> entry. On-disk <acronym>TOAST</acronym>ed values are kept in the <acronym>TOAST</acronym> table, as described in more detail below.
ru: Если какие-либо столбцы таблицы хранятся в формате <acronym>TOAST</acronym>, у таблицы будет связанная с ней таблица <acronym>TOAST</acronym>, OID которой хранится в значении <structname>pg_class</structname>.<structfield>reltoastrelid</structfield> для данной таблицы. Размещаемые на диске <acronym>TOAST</acronym>-значения содержатся в таблице <acronym>TOAST</acronym>, что подробнее описано ниже.

source: Out-of-line values are divided (after compression if used) into chunks of at most <symbol>TOAST_MAX_CHUNK_SIZE</symbol> bytes (by default this value is chosen so that four chunk rows will fit on a page, making it about 2000 bytes). Each chunk is stored as a separate row in the <acronym>TOAST</acronym> table belonging to the owning table. Every <acronym>TOAST</acronym> table has the columns <structfield>chunk_id</structfield> (an OID identifying the particular <acronym>TOAST</acronym>ed value), <structfield>chunk_seq</structfield> (a sequence number for the chunk within its value), and <structfield>chunk_data</structfield> (the actual data of the chunk). A unique index on <structfield>chunk_id</structfield> and <structfield>chunk_seq</structfield> provides fast retrieval of the values. A pointer datum representing an out-of-line on-disk <acronym>TOAST</acronym>ed value therefore needs to store the OID of the <acronym>TOAST</acronym> table in which to look and the OID of the specific value (its <structfield>chunk_id</structfield>). For convenience, pointer datums also store the logical datum size (original uncompressed data length) and physical stored size (different if compression was applied). Allowing for the varlena header bytes, the total size of an on-disk <acronym>TOAST</acronym> pointer datum is therefore 18 bytes regardless of the actual size of the represented value.
ru: Отделённые значения делятся на порции (после сжатия, если оно применяется) размером не более <symbol>TOAST_MAX_CHUNK_SIZE</symbol> байт (по умолчанию это значение выбирается таким образом, чтобы на странице помещались четыре строки порций, то есть размер одной составляет порядка 2000 байт). Каждая порция хранится как отдельная строка в таблице <acronym>TOAST</acronym>, принадлежащей исходной таблице-владельцу. Каждая таблица <acronym>TOAST</acronym> имеет столбцы <structfield>chunk_id</structfield> (OID, идентифицирующий конкретное <acronym>TOAST</acronym>-значение), <structfield>chunk_seq</structfield> (последовательный номер для порции внутри значения) и <structfield>chunk_data</structfield> (фактические данные порции). Уникальный индекс по <structfield>chunk_id</structfield> и <structfield>chunk_seq</structfield> обеспечивает быструю выдачу значений. Таким образом, в указателе, представляющем отдельно размещаемое на диске значение <acronym>TOAST</acronym>, должно храниться OID таблицы <acronym>TOAST</acronym>, к которой нужно обращаться, и OID определённого значения (его <structfield>chunk_id</structfield>). Для удобства в данных указателя также хранится логический размер элемента данных (исходных данных без сжатия) и фактический размер хранимых данных (отличающийся, если было применено сжатие). Учитывая байты заголовка varlena, общий размер указателя на хранимое на диске значение <acronym>TOAST</acronym> составляет 18 байт, независимо от фактического размера собственно значения.

source: The <acronym>TOAST</acronym> management code is triggered only when a row value to be stored in a table is wider than <symbol>TOAST_TUPLE_THRESHOLD</symbol> bytes (normally 2 kB). The <acronym>TOAST</acronym> code will compress and/or move field values out-of-line until the row value is shorter than <symbol>TOAST_TUPLE_TARGET</symbol> bytes (also normally 2 kB) or no more gains can be had. During an UPDATE operation, values of unchanged fields are normally preserved as-is; so an UPDATE of a row with out-of-line values incurs no <acronym>TOAST</acronym> costs if none of the out-of-line values change.
ru: Код обработки <acronym>TOAST</acronym> срабатывает, только когда значение строки, которое должно храниться в таблице, по размеру больше, чем <symbol>TOAST_TUPLE_THRESHOLD</symbol> байт (обычно это 2 Кб). Код <acronym>TOAST</acronym> будет сжимать и/или выносить значения поля за пределы таблицы до тех пор, пока значение строки не станет меньше <symbol>TOAST_TUPLE_TARGET</symbol> байт (также обычно 2 Кб) или уменьшить объём станет невозможно. Во время операции UPDATE значения неизменённых полей обычно сохраняются как есть, поэтому модификация строки с отдельно хранимыми значениями не несёт издержек, связанных с <acronym>TOAST</acronym>, если все такие значения остаются без изменений.

source: <literal>PLAIN</literal> prevents either compression or out-of-line storage; furthermore it disables use of single-byte headers for varlena types. This is the only possible strategy for columns of non-<acronym>TOAST</acronym>-able data types.
ru: <literal>PLAIN</literal> не допускает ни сжатие, ни отдельное хранение; кроме того, отключается использование однобайтовых заголовков для типов varlena. Это единственно возможная стратегия для столбцов типов данных, которые несовместимы с <acronym>TOAST</acronym>.

source: <literal>EXTENDED</literal> allows both compression and out-of-line storage. This is the default for most <acronym>TOAST</acronym>-able data types. Compression will be attempted first, then out-of-line storage if the row is still too big.
ru: <literal>EXTENDED</literal> допускает как сжатие, так и отдельное хранение. Это стандартный вариант для большинства типов данных, совместимых с <acronym>TOAST</acronym>. Сначала происходит попытка выполнить сжатие, затем — сохранение вне таблицы, если строка всё ещё слишком велика.

source: <literal>EXTERNAL</literal> allows out-of-line storage but not compression. Use of <literal>EXTERNAL</literal> will make substring operations on wide <type>text</type> and <type>bytea</type> columns faster (at the penalty of increased storage space) because these operations are optimized to fetch only the required parts of the out-of-line value when it is not compressed.
ru: <literal>EXTERNAL</literal> допускает отдельное хранение, но не сжатие. Использование <literal>EXTERNAL</literal> ускорит операции над частями строк в больших столбцах <type>text</type> и <type>bytea</type> (ценой увеличения объёма памяти для хранения), так как эти операции оптимизированы для извлечения только требуемых частей отделённого значения, когда оно не сжато.

source: <literal>MAIN</literal> allows compression but not out-of-line storage. (Actually, out-of-line storage will still be performed for such columns, but only as a last resort when there is no other way to make the row small enough to fit on a page.)
ru: <literal>MAIN</literal> допускает сжатие, но не отдельное хранение. (Фактически, отдельное хранение, тем не менее, будет выполнено для таких столбцов, но лишь как крайняя мера, когда нет другого способа уменьшить строку так, чтобы она помещалась на странице.)

source: The <acronym>TOAST</acronym> management code recognizes four different strategies for storing <acronym>TOAST</acronym>-able columns on disk: <placeholder-1/> Each <acronym>TOAST</acronym>-able data type specifies a default strategy for columns of that data type, but the strategy for a given table column can be altered with <command>ALTER TABLE SET STORAGE</command>.
ru: Код обработки <acronym>TOAST</acronym> распознаёт четыре различные стратегии хранения столбцов, совместимых с <acronym>TOAST</acronym>, на диске: <placeholder-1/> Каждый тип данных, совместимый с <acronym>TOAST</acronym>, определяет стандартную стратегию для столбцов этого типа данных, но стратегия для заданного столбца таблицы может быть изменена с помощью <command>ALTER TABLE SET STORAGE</command>.

source: This scheme has a number of advantages compared to a more straightforward approach such as allowing row values to span pages. Assuming that queries are usually qualified by comparisons against relatively small key values, most of the work of the executor will be done using the main row entry. The big values of <acronym>TOAST</acronym>ed attributes will only be pulled out (if selected at all) at the time the result set is sent to the client. Thus, the main table is much smaller and more of its rows fit in the shared buffer cache than would be the case without any out-of-line storage. Sort sets shrink also, and sorts will more often be done entirely in memory. A little test showed that a table containing typical HTML pages and their URLs was stored in about half of the raw data size including the <acronym>TOAST</acronym> table, and that the main table contained only about 10% of the entire data (the URLs and some small HTML pages). There was no run time difference compared to an un-<acronym>TOAST</acronym>ed comparison table, in which all the HTML pages were cut down to 7 kB to fit.
ru: Эта схема имеет ряд преимуществ по сравнению с более простым подходом, когда значения строк могут занимать несколько страниц. Если предположить, что обычно запросы характеризуются выполнением сравнения с относительно маленькими значениями ключа, большая часть работы будет выполняться с использованием главной записи строки. Большие значения атрибутов в формате <acronym>TOAST</acronym> будут просто передаваться (если будут выбраны) в тот момент, когда результирующий набор отправляется клиенту. Таким образом, главная таблица получается гораздо меньше, и в общий кеш буферов помещается больше её строк, чем их было бы без использования отдельного хранения. Наборы данных для сортировок также уменьшаются, а сортировки чаще будут выполняться исключительно в памяти. Небольшой тест показал, что таблица, содержащая типичные HTML-страницы и их URL после сжатия занимала примерно половину объёма исходных данных, включая таблицу <acronym>TOAST</acronym>, и что главная таблица содержала лишь около 10% всех данных (URL и некоторые маленькие HTML-страницы). Время обработки не отличалось от времени, необходимого для обработки таблицы без использования <acronym>TOAST</acronym>, в которой размер всех HTML-страниц был уменьшен до 7 Кб, чтобы они уместились в строках.

source: Out-of-line, in-memory TOAST storage
ru: Отдельное размещение TOAST в памяти

source: <acronym>TOAST</acronym> pointers can point to data that is not on disk, but is elsewhere in the memory of the current server process. Such pointers obviously cannot be long-lived, but they are nonetheless useful. There are currently two sub-cases: pointers to <firstterm>indirect</firstterm> data and pointers to <firstterm>expanded</firstterm> data.
ru: Указатели <acronym>TOAST</acronym> могут указывать на данные, размещённые не на диске, а где-либо в памяти текущего серверного процесса. Очевидно, что такие указатель не могут быть долговременными, но они, тем не менее, полезны. В настоящее время поддерживаются два подварианта: <firstterm>косвенные</firstterm> указатели на данные и указатели на <firstterm>развёрнутые</firstterm> данные.

source: Indirect <acronym>TOAST</acronym> pointers simply point at a non-indirect varlena value stored somewhere in memory. This case was originally created merely as a proof of concept, but it is currently used during logical decoding to avoid possibly having to create physical tuples exceeding 1 GB (as pulling all out-of-line field values into the tuple might do). The case is of limited use since the creator of the pointer datum is entirely responsible that the referenced data survives for as long as the pointer could exist, and there is no infrastructure to help with this.
ru: Косвенный указатель <acronym>TOAST</acronym> просто указывает на значение varlena, хранящееся где-то в памяти. Этот вариант изначально был реализован просто как подтверждение концепции, но в настоящее время он применяется при логическом декодировании, чтобы не приходилось создавать физические кортежи больше одного 1 ГБ (что может потребоваться при консолидации всех отделённых значений полей в одном кортеже). Данный вариант имеет ограниченное применение, так как создатель такого указателя должен полностью понимать, что целевые данные будут существовать, только пока существует указатель, и никакой инфраструктуры для сохранения их нет.

source: Expanded <acronym>TOAST</acronym> pointers are useful for complex data types whose on-disk representation is not especially suited for computational purposes. As an example, the standard varlena representation of a <productname>PostgreSQL</productname> array includes dimensionality information, a nulls bitmap if there are any null elements, then the values of all the elements in order. When the element type itself is variable-length, the only way to find the <replaceable>N</replaceable>'th element is to scan through all the preceding elements. This representation is appropriate for on-disk storage because of its compactness, but for computations with the array it's much nicer to have an <quote>expanded</quote> or <quote>deconstructed</quote> representation in which all the element starting locations have been identified. The <acronym>TOAST</acronym> pointer mechanism supports this need by allowing a pass-by-reference Datum to point to either a standard varlena value (the on-disk representation) or a <acronym>TOAST</acronym> pointer that points to an expanded representation somewhere in memory. The details of this expanded representation are up to the data type, though it must have a standard header and meet the other API requirements given in <filename>src/include/utils/expandeddatum.h</filename>. C-level functions working with the data type can choose to handle either representation. Functions that do not know about the expanded representation, but simply apply <function>PG_DETOAST_DATUM</function> to their inputs, will automatically receive the traditional varlena representation; so support for an expanded representation can be introduced incrementally, one function at a time.
ru: Указатели на развёрнутые данные <acronym>TOAST</acronym> полезны для сложных типов, представление которых на диске плохо приспособлено для вычислительных целей. Например, стандартное представление в виде varlena массива <productname>PostgreSQL</productname> включает информацию о размерности, битовую карту элементов NULL (если они в нём содержатся), а затем значения всех элементов по порядку. Когда элемент сам по себе имеет переменную длину, единственный способ найти <replaceable>N</replaceable>-ный элемент — просканировать все предыдущие элементы. Это представление компактно, и поэтому подходит для хранения на диске, но для вычислительной обработки массива гораздо удобнее иметь <quote>развёрнутое</quote> или <quote>деконструированное</quote> представление, в котором можно определить начальные адреса всех элементов. Механизм указателей <acronym>TOAST</acronym> способствует решению этой задачи, допуская передачу по ссылке элемента Datum как указателя на стандартное значение varlena (представление на диске) или указателя <acronym>TOAST</acronym> на развёрнутое представление где-то в памяти. Детали развёрнутого представление определяются самим типом данных, хотя оно может иметь стандартный заголовок и удовлетворять другим требованиям API, описанным в <filename>src/include/utils/expandeddatum.h</filename>. Функции уровня C, работающие с этим типом, могут реализовать поддержку любого из этих представлений. Функции, не знающие о развёрнутом представлении, а просто применяющие <function>PG_DETOAST_DATUM</function> к своим входным данным, будут автоматически получать традиционное представление varlena; так что поддержка развёрнутого представления может вводиться постепенно, по одной функции.
