Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/syntax.po
Languages: ru

source: CREATE TABLE mytable(f1 int, f2 float, f3 text); CREATE FUNCTION getf1(mytable) RETURNS int AS 'SELECT $1.f1' LANGUAGE SQL; -- No cast needed since only one getf1() exists SELECT getf1(ROW(1,2.5,'this is a test')); getf1 ------- 1 (1 row) CREATE TYPE myrowtype AS (f1 int, f2 text, f3 numeric); CREATE FUNCTION getf1(myrowtype) RETURNS int AS 'SELECT $1.f1' LANGUAGE SQL; -- Now we need a cast to indicate which function to call: SELECT getf1(ROW(1,2.5,'this is a test')); ERROR: function getf1(record) is not unique SELECT getf1(ROW(1,2.5,'this is a test')::mytable); getf1 ------- 1 (1 row) SELECT getf1(CAST(ROW(11,'this is a test',2.5) AS myrowtype)); getf1 ------- 11 (1 row)
ru: CREATE TABLE mytable(f1 int, f2 float, f3 text); CREATE FUNCTION getf1(mytable) RETURNS int AS 'SELECT $1.f1' LANGUAGE SQL; -- Приведение не требуется, так как существует только одна getf1() SELECT getf1(ROW(1,2.5,'this is a test')); getf1 ------- 1 (1 row) CREATE TYPE myrowtype AS (f1 int, f2 text, f3 numeric); CREATE FUNCTION getf1(myrowtype) RETURNS int AS 'SELECT $1.f1' LANGUAGE SQL; -- Теперь приведение необходимо для однозначного выбора функции: SELECT getf1(ROW(1,2.5,'this is a test')); ОШИБКА: функция getf1(record) не уникальна SELECT getf1(ROW(1,2.5,'this is a test')::mytable); getf1 ------- 1 (1 row) SELECT getf1(CAST(ROW(11,'this is a test',2.5) AS myrowtype)); getf1 ------- 11 (1 row)

source: By default, the value created by a <literal>ROW</literal> expression is of an anonymous record type. If necessary, it can be cast to a named composite type &mdash; either the row type of a table, or a composite type created with <command>CREATE TYPE AS</command>. An explicit cast might be needed to avoid ambiguity. For example: <placeholder-1/>
ru: По умолчанию значение, созданное выражением <literal>ROW</literal>, имеет тип анонимной записи. Если необходимо, его можно привести к именованному составному типу &mdash; либо к типу строки таблицы, либо составному типу, созданному оператором <command>CREATE TYPE AS</command>. Явное приведение может потребоваться для достижения однозначности. Например: <placeholder-1/>

source: SELECT ROW(1,2.5,'this is a test') = ROW(1, 3, 'not the same'); SELECT ROW(table.*) IS NULL FROM table; -- detect all-null rows
ru: SELECT ROW(1,2.5,'this is a test') = ROW(1, 3, 'not the same'); -- выбрать все строки, содержащие только NULL SELECT ROW(table.*) IS NULL FROM table;

source: Row constructors can be used to build composite values to be stored in a composite-type table column, or to be passed to a function that accepts a composite parameter. Also, it is possible to compare two row values or test a row with <literal>IS NULL</literal> or <literal>IS NOT NULL</literal>, for example: <placeholder-1/> For more detail see <xref linkend="functions-comparisons"/>. Row constructors can also be used in connection with subqueries, as discussed in <xref linkend="functions-subquery"/>.
ru: Используя конструктор строк (кортежей), можно создавать составное значение для сохранения в столбце составного типа или для передачи функции, принимающей составной параметр. Также вы можете сравнить два составных значения или проверить их с помощью <literal>IS NULL</literal> или <literal>IS NOT NULL</literal>, например: <placeholder-1/> Подробнее см. <xref remap="4" linkend="functions-comparisons"/>. Конструкторы строк также могут использоваться в сочетании с подзапросами, как описано в <xref remap="6" linkend="functions-subquery"/>.

source: Expression Evaluation Rules
ru: Правила вычисления выражений

source: <primary>expression</primary> <secondary>order of evaluation</secondary>
ru: <primary>выражение</primary> <secondary>порядок вычисления</secondary>

source: The order of evaluation of subexpressions is not defined. In particular, the inputs of an operator or function are not necessarily evaluated left-to-right or in any other fixed order.
ru: Порядок вычисления подвыражений не определён. В частности, аргументы оператора или функции не обязательно вычисляются слева направо или в любом другом фиксированном порядке.

source: Furthermore, if the result of an expression can be determined by evaluating only some parts of it, then other subexpressions might not be evaluated at all. For instance, if one wrote: <placeholder-1/> then <literal>somefunc()</literal> would (probably) not be called at all. The same would be the case if one wrote: <placeholder-2/> Note that this is not the same as the left-to-right <quote>short-circuiting</quote> of Boolean operators that is found in some programming languages.
ru: Более того, если результат выражения можно получить, вычисляя только некоторые его части, тогда другие подвыражения не будут вычисляться вовсе. Например, если написать: <placeholder-1/> тогда функция <literal>somefunc()</literal> не будет вызываться (возможно). То же самое справедливо для записи: <placeholder-2/> Заметьте, что это отличается от <quote>оптимизации</quote> вычисления логических операторов слева направо, реализованной в некоторых языках программирования.

source: As a consequence, it is unwise to use functions with side effects as part of complex expressions. It is particularly dangerous to rely on side effects or evaluation order in <literal>WHERE</literal> and <literal>HAVING</literal> clauses, since those clauses are extensively reprocessed as part of developing an execution plan. Boolean expressions (<literal>AND</literal>/<literal>OR</literal>/<literal>NOT</literal> combinations) in those clauses can be reorganized in any manner allowed by the laws of Boolean algebra.
ru: Как следствие, в сложных выражениях не стоит использовать функции с побочными эффектами. Особенно опасно рассчитывать на порядок вычисления или побочные эффекты в предложениях <literal>WHERE</literal> и <literal>HAVING</literal>, так как эти предложения тщательно оптимизируются при построении плана выполнения. Логические выражения (сочетания <literal>AND</literal>/<literal>OR</literal>/<literal>NOT</literal>) в этих предложениях могут быть видоизменены любым способом, допустимым законами Булевой алгебры.

source: When it is essential to force evaluation order, a <literal>CASE</literal> construct (see <xref linkend="functions-conditional"/>) can be used. For example, this is an untrustworthy way of trying to avoid division by zero in a <literal>WHERE</literal> clause: <placeholder-1/> But this is safe: <placeholder-2/> A <literal>CASE</literal> construct used in this fashion will defeat optimization attempts, so it should only be done when necessary. (In this particular example, it would be better to sidestep the problem by writing <literal>y &gt; 1.5*x</literal> instead.)
ru: Когда порядок вычисления важен, его можно зафиксировать с помощью конструкции <literal>CASE</literal> (см. <xref remap="4" linkend="functions-conditional"/>). Например, такой способ избежать деления на ноль в предложении <literal>WHERE</literal> ненадёжен: <placeholder-1/> Безопасный вариант: <placeholder-2/> Применяемая так конструкция <literal>CASE</literal> защищает выражение от оптимизации, поэтому использовать её нужно только при необходимости. (В данном случае было бы лучше решить проблему, переписав условие как <literal>y &gt; 1.5*x</literal>.)

source: <literal>CASE</literal> is not a cure-all for such issues, however. One limitation of the technique illustrated above is that it does not prevent early evaluation of constant subexpressions. As described in <xref linkend="xfunc-volatility"/>, functions and operators marked <literal>IMMUTABLE</literal> can be evaluated when the query is planned rather than when it is executed. Thus for example <placeholder-1/> is likely to result in a division-by-zero failure due to the planner trying to simplify the constant subexpression, even if every row in the table has <literal>x &gt; 0</literal> so that the <literal>ELSE</literal> arm would never be entered at run time.
ru: Однако, <literal>CASE</literal> не всегда спасает в подобных случаях. Показанный выше приём плох тем, что не предотвращает раннее вычисление константных подвыражений. Как описано в <xref remap="6" linkend="xfunc-volatility"/>, функции и операторы, помеченные как <literal>IMMUTABLE</literal>, могут вычисляться при планировании, а не выполнении запроса. Поэтому в примере <placeholder-1/>, скорее всего, произойдёт деление на ноль из-за того, что планировщик попытается упростить константное подвыражение, даже если во всех строках в таблице <literal>x &gt; 0</literal>, а значит во время выполнения ветвь <literal>ELSE</literal> никогда не будет выполняться.

source: While that particular example might seem silly, related cases that don't obviously involve constants can occur in queries executed within functions, since the values of function arguments and local variables can be inserted into queries as constants for planning purposes. Within <application>PL/pgSQL</application> functions, for example, using an <literal>IF</literal>-<literal>THEN</literal>-<literal>ELSE</literal> statement to protect a risky computation is much safer than just nesting it in a <literal>CASE</literal> expression.
ru: Хотя этот конкретный пример может показаться надуманным, похожие ситуации, в которых неявно появляются константы, могут возникать и в запросах внутри функций, так как значения аргументов функции и локальных переменных при планировании могут быть заменены константами. Поэтому например, в функциях <application>PL/pgSQL</application> гораздо безопаснее для защиты от рискованных вычислений использовать конструкцию <literal>IF</literal>-<literal>THEN</literal>-<literal>ELSE</literal>, чем выражение <literal>CASE</literal>.

source: Another limitation of the same kind is that a <literal>CASE</literal> cannot prevent evaluation of an aggregate expression contained within it, because aggregate expressions are computed before other expressions in a <literal>SELECT</literal> list or <literal>HAVING</literal> clause are considered. For example, the following query can cause a division-by-zero error despite seemingly having protected against it: <placeholder-1/> The <function>min()</function> and <function>avg()</function> aggregates are computed concurrently over all the input rows, so if any row has <structfield>employees</structfield> equal to zero, the division-by-zero error will occur before there is any opportunity to test the result of <function>min()</function>. Instead, use a <literal>WHERE</literal> or <literal>FILTER</literal> clause to prevent problematic input rows from reaching an aggregate function in the first place.
ru: Ещё один подобный недостаток этого подхода в том, что <literal>CASE</literal> не может предотвратить вычисление заключённого в нём агрегатного выражения, так как агрегатные выражения вычисляются перед всеми остальными в списке <literal>SELECT</literal> или предложении <literal>HAVING</literal>. Например, в следующем запросе может возникнуть ошибка деления на ноль, несмотря на то, что он вроде бы защищён от неё: <placeholder-1/> Агрегатные функции <function>min()</function> и <function>avg()</function> вычисляются независимо по всем входным строкам, так что если в какой-то строке поле <structfield>employees</structfield> окажется равным нулю, деление на ноль произойдёт раньше, чем станет возможным проверить результат функции <function>min()</function>. Поэтому, чтобы проблемные входные строки изначально не попали в агрегатную функцию, следует воспользоваться предложениями <literal>WHERE</literal> или <literal>FILTER</literal>.

source: Calling Functions
ru: Вызов функций

source: <primary>notation</primary> <secondary>functions</secondary>
ru: <primary>запись</primary> <secondary>функций</secondary>

source: <productname>PostgreSQL</productname> allows functions that have named parameters to be called using either <firstterm>positional</firstterm> or <firstterm>named</firstterm> notation. Named notation is especially useful for functions that have a large number of parameters, since it makes the associations between parameters and actual arguments more explicit and reliable. In positional notation, a function call is written with its argument values in the same order as they are defined in the function declaration. In named notation, the arguments are matched to the function parameters by name and can be written in any order.
ru: <productname>PostgreSQL</productname> позволяет вызывать функции с именованными параметрами, используя запись с <firstterm>позиционной</firstterm> или <firstterm>именной</firstterm> передачей аргументов. Именная передача особенно полезна для функций со множеством параметров, так как она делает связь параметров и аргументов более явной и надёжной. В позиционной записи значения аргументов функции указываются в том же порядке, в каком они описаны в определении функции. При именной передаче аргументы сопоставляются с параметрами функции по именам и указывать их можно в любом порядке.

source: In either notation, parameters that have default values given in the function declaration need not be written in the call at all. But this is particularly useful in named notation, since any combination of parameters can be omitted; while in positional notation parameters can only be omitted from right to left.
ru: При записи любым способом параметры, для которых в определении функции заданы значения по умолчанию, можно вовсе не указывать. Но это особенно полезно при именной передаче, так как опустить можно любой набор параметров, тогда как при позиционной параметры можно опускать только последовательно, справа налево.

source: <productname>PostgreSQL</productname> also supports <firstterm>mixed</firstterm> notation, which combines positional and named notation. In this case, positional parameters are written first and named parameters appear after them.
ru: <productname>PostgreSQL</productname> также поддерживает <firstterm>смешанную</firstterm> передачу, когда параметры передаются и по именам, и по позиции. В этом случае позиционные параметры должны идти перед параметрами, передаваемыми по именам.

source: The following examples will illustrate the usage of all three notations, using the following function definition: <placeholder-1/> Function <function>concat_lower_or_upper</function> has two mandatory parameters, <literal>a</literal> and <literal>b</literal>. Additionally there is one optional parameter <literal>uppercase</literal> which defaults to <literal>false</literal>. The <literal>a</literal> and <literal>b</literal> inputs will be concatenated, and forced to either upper or lower case depending on the <literal>uppercase</literal> parameter. The remaining details of this function definition are not important here (see <xref linkend="extend"/> for more information).
ru: Мы рассмотрим все три варианта записи на примере следующей функции: <placeholder-1/> Функция <function>concat_lower_or_upper</function> имеет два обязательных параметра: <literal>a</literal> и <literal>b</literal>. Кроме того, есть один необязательный параметр <literal>uppercase</literal>, который по умолчанию имеет значение <literal>false</literal>. Аргументы <literal>a</literal> и <literal>b</literal> будут сложены вместе и переведены в верхний или нижний регистр, в зависимости от параметра <literal>uppercase</literal>. Остальные тонкости реализации функции сейчас не важны (подробнее о них рассказано в <xref remap="6" linkend="extend"/>).

source: Using Positional Notation
ru: Позиционная передача

source: <primary>function</primary> <secondary>positional notation</secondary>
ru: <primary>функция</primary> <secondary>позиционная запись</secondary>

source: Positional notation is the traditional mechanism for passing arguments to functions in <productname>PostgreSQL</productname>. An example is: <screen> SELECT concat_lower_or_upper('Hello', 'World', true); concat_lower_or_upper ----------------------- HELLO WORLD (1 row) </screen> All arguments are specified in order. The result is upper case since <literal>uppercase</literal> is specified as <literal>true</literal>. Another example is: <screen> SELECT concat_lower_or_upper('Hello', 'World'); concat_lower_or_upper ----------------------- hello world (1 row) </screen> Here, the <literal>uppercase</literal> parameter is omitted, so it receives its default value of <literal>false</literal>, resulting in lower case output. In positional notation, arguments can be omitted from right to left so long as they have defaults.
ru: Позиционная передача &mdash; это традиционный механизм передачи аргументов функции в <productname>PostgreSQL</productname>. Пример такой записи: <screen> SELECT concat_lower_or_upper('Hello', 'World', true); concat_lower_or_upper ----------------------- HELLO WORLD (1 row) </screen> Все аргументы указаны в заданном порядке. Результат возвращён в верхнем регистре, так как параметр <literal>uppercase</literal> имеет значение <literal>true</literal>. Ещё один пример: <screen> SELECT concat_lower_or_upper('Hello', 'World'); concat_lower_or_upper ----------------------- hello world (1 row) </screen> Здесь параметр <literal>uppercase</literal> опущен, и поэтому он принимает значение по умолчанию (<literal>false</literal>), и результат переводится в нижний регистр. В позиционной записи любые аргументы с определённым значением по умолчанию можно опускать справа налево.

source: Using Named Notation
ru: Именная передача

source: <primary>function</primary> <secondary>named notation</secondary>
ru: <primary>функция</primary> <secondary>именная передача</secondary>

source: In named notation, each argument's name is specified using <literal>=&gt;</literal> to separate it from the argument expression. For example: <screen> SELECT concat_lower_or_upper(a =&gt; 'Hello', b =&gt; 'World'); concat_lower_or_upper ----------------------- hello world (1 row) </screen> Again, the argument <literal>uppercase</literal> was omitted so it is set to <literal>false</literal> implicitly. One advantage of using named notation is that the arguments may be specified in any order, for example: <screen> SELECT concat_lower_or_upper(a =&gt; 'Hello', b =&gt; 'World', uppercase =&gt; true); concat_lower_or_upper ----------------------- HELLO WORLD (1 row) SELECT concat_lower_or_upper(a =&gt; 'Hello', uppercase =&gt; true, b =&gt; 'World'); concat_lower_or_upper ----------------------- HELLO WORLD (1 row) </screen>
ru: При именной передаче для аргумента добавляется имя, которое отделяется от выражения значения знаками <literal>=&gt;</literal>. Например: <screen> SELECT concat_lower_or_upper(a =&gt; 'Hello', b =&gt; 'World'); concat_lower_or_upper ----------------------- hello world (1 row) </screen> Здесь аргумент <literal>uppercase</literal> был так же опущен, так что он неявно получил значение <literal>false</literal>. Преимуществом такой записи является возможность записывать аргументы в любом порядке, например: <screen> SELECT concat_lower_or_upper(a =&gt; 'Hello', b =&gt; 'World', uppercase =&gt; true); concat_lower_or_upper ----------------------- HELLO WORLD (1 row) SELECT concat_lower_or_upper(a =&gt; 'Hello', uppercase =&gt; true, b =&gt; 'World'); concat_lower_or_upper ----------------------- HELLO WORLD (1 row) </screen>

source: An older syntax based on ":=" is supported for backward compatibility: <screen> SELECT concat_lower_or_upper(a := 'Hello', uppercase := true, b := 'World'); concat_lower_or_upper ----------------------- HELLO WORLD (1 row) </screen>
ru: Для обратной совместимости поддерживается и старый синтаксис с ":=": <screen> SELECT concat_lower_or_upper(a := 'Hello', uppercase := true, b := 'World'); concat_lower_or_upper ----------------------- HELLO WORLD (1 row) </screen>

source: Using Mixed Notation
ru: Смешанная передача

source: <primary>function</primary> <secondary>mixed notation</secondary>
ru: <primary>функция</primary> <secondary>смешанная запись</secondary>

source: The mixed notation combines positional and named notation. However, as already mentioned, named arguments cannot precede positional arguments. For example: <screen> SELECT concat_lower_or_upper('Hello', 'World', uppercase =&gt; true); concat_lower_or_upper ----------------------- HELLO WORLD (1 row) </screen> In the above query, the arguments <literal>a</literal> and <literal>b</literal> are specified positionally, while <literal>uppercase</literal> is specified by name. In this example, that adds little except documentation. With a more complex function having numerous parameters that have default values, named or mixed notation can save a great deal of writing and reduce chances for error.
ru: При смешанной передаче параметры передаются и по именам, и по позиции. Однако, как уже было сказано, именованные аргументы не могут стоять перед позиционными. Например: <screen> SELECT concat_lower_or_upper('Hello', 'World', uppercase =&gt; true); concat_lower_or_upper ----------------------- HELLO WORLD (1 row) </screen> В данном запросе аргументы <literal>a</literal> и <literal>b</literal> передаются по позиции, а <literal>uppercase</literal> &mdash; по имени. Единственное обоснование такого вызова здесь &mdash; он стал чуть более читаемым. Однако для более сложных функций с множеством аргументов, часть из которых имеют значения по умолчанию, именная или смешанная передача позволяют записать вызов эффективнее и уменьшить вероятность ошибок.

source: Named and mixed call notations currently cannot be used when calling an aggregate function (but they do work when an aggregate function is used as a window function).
ru: Именная и смешанная передача в настоящий момент не может использоваться при вызове агрегатной функции (но они допускаются, если агрегатная функция используется в качестве оконной).
