Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/syntax.po
Languages: ru

source: Any other character following a backslash is taken literally. Thus, to include a backslash character, write two backslashes (<literal>\\</literal>). Also, a single quote can be included in an escape string by writing <literal>\'</literal>, in addition to the normal way of <literal>''</literal>.
ru: Любой другой символ, идущий после обратной косой черты, воспринимается буквально. Таким образом, чтобы включить в строку обратную косую черту, нужно написать две косых черты (<literal>\\</literal>). Так же можно включить в строку апостроф, написав <literal>\'</literal>, в дополнение к обычному способу <literal>''</literal>.

source: It is your responsibility that the byte sequences you create, especially when using the octal or hexadecimal escapes, compose valid characters in the server character set encoding. When the server encoding is UTF-8, then the Unicode escapes or the alternative Unicode escape syntax, explained in <xref linkend="sql-syntax-strings-uescape"/>, should be used instead. (The alternative would be doing the UTF-8 encoding by hand and writing out the bytes, which would be very cumbersome.)
ru: Вы должны позаботиться, чтобы байтовые последовательности, которые вы создаёте таким образом, особенно в восьмеричной и шестнадцатеричной записи, образовывали допустимые символы в серверной кодировке. Когда сервер работает с кодировкой UTF-8, вместо такой записи байт следует использовать спецпоследовательности Unicode или альтернативный синтаксис Unicode, описанный в <xref remap="6" linkend="sql-syntax-strings-uescape"/>. (В противном случае придётся кодировать символы UTF-8 вручную и выписывать их по байтам, что очень неудобно.)

source: The Unicode escape syntax works fully only when the server encoding is <literal>UTF8</literal>. When other server encodings are used, only code points in the ASCII range (up to <literal>\u007F</literal>) can be specified. Both the 4-digit and the 8-digit form can be used to specify UTF-16 surrogate pairs to compose characters with code points larger than U+FFFF, although the availability of the 8-digit form technically makes this unnecessary. (When surrogate pairs are used when the server encoding is <literal>UTF8</literal>, they are first combined into a single code point that is then encoded in UTF-8.)
ru: Спецпоследовательности с Unicode полностью поддерживаются только при использовании на сервере кодировки <literal>UTF8</literal>. Когда используются другие кодировки, допускается указание только ASCII-символов (с кодами до <literal>\u007F</literal>). И в четырёх, и в восьмизначной форме можно записывать суррогатные пары UTF-16 и таким образом составлять символы с кодами больше чем U+FFFF, хотя наличие восьмизначной формы технически делает это ненужным. (Когда суррогатные пары используются с серверной кодировкой <literal>UTF8</literal>, они сначала объединяются в один символ, который затем кодируется в UTF-8.)

source: If the configuration parameter <xref linkend="guc-standard-conforming-strings"/> is <literal>off</literal>, then <productname>PostgreSQL</productname> recognizes backslash escapes in both regular and escape string constants. However, as of <productname>PostgreSQL</productname> 9.1, the default is <literal>on</literal>, meaning that backslash escapes are recognized only in escape string constants. This behavior is more standards-compliant, but might break applications which rely on the historical behavior, where backslash escapes were always recognized. As a workaround, you can set this parameter to <literal>off</literal>, but it is better to migrate away from using backslash escapes. If you need to use a backslash escape to represent a special character, write the string constant with an <literal>E</literal>.
ru: Если параметр конфигурации <xref linkend="guc-standard-conforming-strings"/> имеет значение <literal>off</literal>, <productname>PostgreSQL</productname> распознаёт обратную косую черту как спецсимвол и в обычных строках, и в строках со спецпоследовательностями. Однако в версии <productname>PostgreSQL</productname> 9.1 по умолчанию принято значение <literal>on</literal>, и в этом случае обратная косая черта распознаётся только в спецстроках. Это поведение больше соответствует стандарту, хотя может нарушить работу приложений, рассчитанных на предыдущий режим, когда обратная косая черта распознавалась везде. В качестве временного решения вы можете изменить этот параметр на <literal>off</literal>, но лучше уйти от такой практики. Если вам нужно, чтобы обратная косая черта представляла специальный символ, задайте строковую константу с <literal>E</literal>.

source: In addition to <varname>standard_conforming_strings</varname>, the configuration parameters <xref linkend="guc-escape-string-warning"/> and <xref linkend="guc-backslash-quote"/> govern treatment of backslashes in string constants.
ru: В дополнение к <varname>standard_conforming_strings</varname> поведением обратной косой черты в строковых константах управляют параметры <xref linkend="guc-escape-string-warning"/> и <xref linkend="guc-backslash-quote"/>.

source: The character with the code zero cannot be in a string constant.
ru: Строковая константа не может включать символ с кодом 0.

source: String Constants with Unicode Escapes
ru: Строковые константы со спецпоследовательностями Unicode

source: <primary>Unicode escape</primary> <secondary>in string constants</secondary>
ru: <primary>Спецкоды Unicode</primary> <secondary>в строковых константах</secondary>

source: <productname>PostgreSQL</productname> also supports another type of escape syntax for strings that allows specifying arbitrary Unicode characters by code point. A Unicode escape string constant starts with <literal>U&amp;</literal> (upper or lower case letter U followed by ampersand) immediately before the opening quote, without any spaces in between, for example <literal>U&amp;'foo'</literal>. (Note that this creates an ambiguity with the operator <literal>&amp;</literal>. Use spaces around the operator to avoid this problem.) Inside the quotes, Unicode characters can be specified in escaped form by writing a backslash followed by the four-digit hexadecimal code point number or alternatively a backslash followed by a plus sign followed by a six-digit hexadecimal code point number. For example, the string <literal>'data'</literal> could be written as <placeholder-1/> The following less trivial example writes the Russian word <quote>slon</quote> (elephant) in Cyrillic letters: <placeholder-2/>
ru: <productname>PostgreSQL</productname> также поддерживает ещё один вариант спецпоследовательностей, позволяющий включать в строки символы Unicode по их кодам. Строковая константа со спецпоследовательностями Unicode начинается с <literal>U&amp;</literal> (строчная или заглавная U и амперсанд), а затем сразу без пробелов идёт апостроф, например <literal>U&amp;'foo'</literal>. (Заметьте, что при этом возникает неоднозначность с оператором <literal>&amp;</literal>. Чтобы её избежать, окружайте этот оператор пробелами.) Затем в апострофах можно записывать символы Unicode двумя способами: обратная косая черта, а за ней код символа из четырёх шестнадцатеричных цифр, либо обратная косая черта, знак плюс, а затем код из шести шестнадцатеричных цифр. Например, строку <literal>'data'</literal> можно записать так:<placeholder-1/> В следующем менее тривиальном примере закодировано русское слово <quote>слон</quote>, записанное кириллицей: <placeholder-2/>

source: If a different escape character than backslash is desired, it can be specified using the <literal>UESCAPE</literal><placeholder-1/> clause after the string, for example: <placeholder-2/> The escape character can be any single character other than a hexadecimal digit, the plus sign, a single quote, a double quote, or a whitespace character.
ru: Если вы хотите использовать не обратную косую черту, а другой спецсимвол, его можно указать, добавив <literal>UESCAPE</literal><placeholder-1/> после строки, например: <placeholder-2/> В качестве спецсимвола можно выбрать любой символ, кроме шестнадцатеричной цифры, знака плюс, апострофа, кавычки или пробельного символа.

source: The Unicode escape syntax works only when the server encoding is <literal>UTF8</literal>. When other server encodings are used, only code points in the ASCII range (up to <literal>\007F</literal>) can be specified. Both the 4-digit and the 6-digit form can be used to specify UTF-16 surrogate pairs to compose characters with code points larger than U+FFFF, although the availability of the 6-digit form technically makes this unnecessary. (When surrogate pairs are used when the server encoding is <literal>UTF8</literal>, they are first combined into a single code point that is then encoded in UTF-8.)
ru: Спецпоследовательности с Unicode поддерживаются только при использовании на сервере кодировки <literal>UTF8</literal>. Когда используются другие кодировки, допускается указание только ASCII-символов (с кодами до <literal>\007F</literal>). И в четырёх, и в шестизначной форме можно записывать суррогатные пары UTF-16 и таким образом составлять символы с кодами больше чем U+FFFF, хотя наличие шестизначной формы технически делает это ненужным. (Когда суррогатные пары используются с серверной кодировкой <literal>UTF8</literal>, они сначала объединяются в один символ, который затем кодируется в UTF-8.)

source: Also, the Unicode escape syntax for string constants only works when the configuration parameter <xref linkend="guc-standard-conforming-strings"/> is turned on. This is because otherwise this syntax could confuse clients that parse the SQL statements to the point that it could lead to SQL injections and similar security issues. If the parameter is set to off, this syntax will be rejected with an error message.
ru: Также заметьте, что спецпоследовательности Unicode в строковых константах работают, только когда параметр конфигурации <xref linkend="guc-standard-conforming-strings"/> равен <literal>on</literal>. Это объясняется тем, что иначе клиентские программы, проверяющие SQL-операторы, можно будет ввести в заблуждение и эксплуатировать это как уязвимость, например, для SQL-инъекций. Если этот параметр имеет значение <literal>off</literal>, эти спецпоследовательности будут вызывать ошибку.

source: To include the escape character in the string literally, write it twice.
ru: Чтобы включить спецсимвол в строку буквально, напишите его дважды.

source: Dollar-quoted String Constants
ru: Строковые константы, заключённые в доллары

source: <primary>dollar quoting</primary>
ru: <primary>заключение строк в доллары</primary>

source: $$Dianne's horse$$ $SomeTag$Dianne's horse$SomeTag$
ru: $$Жанна д'Арк$$ $SomeTag$Жанна д'Арк$SomeTag$

source: While the standard syntax for specifying string constants is usually convenient, it can be difficult to understand when the desired string contains many single quotes or backslashes, since each of those must be doubled. To allow more readable queries in such situations, <productname>PostgreSQL</productname> provides another way, called <quote>dollar quoting</quote>, to write string constants. A dollar-quoted string constant consists of a dollar sign (<literal>$</literal>), an optional <quote>tag</quote> of zero or more characters, another dollar sign, an arbitrary sequence of characters that makes up the string content, a dollar sign, the same tag that began this dollar quote, and a dollar sign. For example, here are two different ways to specify the string <quote>Dianne's horse</quote> using dollar quoting: <placeholder-1/> Notice that inside the dollar-quoted string, single quotes can be used without needing to be escaped. Indeed, no characters inside a dollar-quoted string are ever escaped: the string content is always written literally. Backslashes are not special, and neither are dollar signs, unless they are part of a sequence matching the opening tag.
ru: Хотя стандартный синтаксис для строковых констант обычно достаточно удобен, он может плохо читаться, когда строка содержит много апострофов или обратных косых черт, так как каждый такой символ приходится дублировать. Чтобы и в таких случаях запросы оставались читаемыми, <productname>PostgreSQL</productname> предлагает ещё один способ записи строковых констант &mdash; <quote>заключение строк в доллары</quote>. Строковая константа, заключённая в доллары, начинается со знака доллара (<literal>$</literal>), необязательного <quote>тега</quote> из нескольких символов и ещё одного знака доллара, затем содержит обычную последовательность символов, составляющую строку, и оканчивается знаком доллара, тем же тегом и замыкающим знаком доллара. Например, строку <quote>Жанна д'Арк</quote> можно записать в долларах двумя способами: <placeholder-1/> Заметьте, что внутри такой строки апострофы не нужно записывать особым образом. На самом деле, в строке, заключённой в доллары, все символы можно записывать в чистом виде: содержимое строки всегда записывается буквально. Ни обратная косая черта, ни даже знак доллара не являются спецсимволами, если только они не образуют последовательность, соответствующую открывающему тегу.

source: It is possible to nest dollar-quoted string constants by choosing different tags at each nesting level. This is most commonly used in writing function definitions. For example: <placeholder-1/> Here, the sequence <literal>$q$[\t\r\n\v\\]$q$</literal> represents a dollar-quoted literal string <literal>[\t\r\n\v\\]</literal>, which will be recognized when the function body is executed by <productname>PostgreSQL</productname>. But since the sequence does not match the outer dollar quoting delimiter <literal>$function$</literal>, it is just some more characters within the constant so far as the outer string is concerned.
ru: Строковые константы в долларах можно вкладывать друг в друга, выбирая на разных уровнях вложенности разные теги. Чаще всего это используется при написании определений функций. Например: <placeholder-1/> Здесь последовательность <literal>$q$[\t\r\n\v\\]$q$</literal> представляет в долларах текстовую строку <literal>[\t\r\n\v\\]</literal>, которая будет обработана, когда <productname>PostgreSQL</productname> будет выполнять эту функцию. Но так как эта последовательность не соответствует внешнему тегу в долларах (<literal>$function$</literal>), с точки зрения внешней строки это просто обычные символы внутри константы.

source: The tag, if any, of a dollar-quoted string follows the same rules as an unquoted identifier, except that it cannot contain a dollar sign. Tags are case sensitive, so <literal>$tag$String content$tag$</literal> is correct, but <literal>$TAG$String content$tag$</literal> is not.
ru: Тег строки в долларах, если он присутствует, должен соответствовать правилам, определённым для идентификаторов без кавычек, и к тому же не должен содержать знак доллара. Теги регистрозависимы, так что <literal>$tag$String content$tag$</literal> &mdash; правильная строка, а <literal>$TAG$String content$tag$</literal> &mdash; нет.

source: A dollar-quoted string that follows a keyword or identifier must be separated from it by whitespace; otherwise the dollar quoting delimiter would be taken as part of the preceding identifier.
ru: Строка в долларах, следующая за ключевым словом или идентификатором, должна отделяться от него пробельными символами, иначе доллар будет считаться продолжением предыдущего идентификатора.

source: Dollar quoting is not part of the SQL standard, but it is often a more convenient way to write complicated string literals than the standard-compliant single quote syntax. It is particularly useful when representing string constants inside other constants, as is often needed in procedural function definitions. With single-quote syntax, each backslash in the above example would have to be written as four backslashes, which would be reduced to two backslashes in parsing the original string constant, and then to one when the inner string constant is re-parsed during function execution.
ru: Заключение строк в доллары не является частью стандарта SQL, но часто это более удобный способ записывать сложные строки, чем стандартный вариант с апострофами. Он особенно полезен, когда нужно представить строковую константу внутри другой строки, что часто требуется в определениях процедурных функций. Ограничившись только апострофами, каждую обратную косую черту в приведённом примере пришлось бы записывать четырьмя такими символами, которые бы затем уменьшились до двух при разборе внешней строки, и наконец до одного при обработке внутренней строки во время выполнения функции.

source: Bit-string Constants
ru: Битовые строковые константы

source: <primary>bit string</primary> <secondary>constant</secondary>
ru: <primary>битовая строковая</primary> <secondary>константа</secondary>

source: Bit-string constants look like regular string constants with a <literal>B</literal> (upper or lower case) immediately before the opening quote (no intervening whitespace), e.g., <literal>B'1001'</literal>. The only characters allowed within bit-string constants are <literal>0</literal> and <literal>1</literal>.
ru: Битовые строковые константы похожи на обычные с дополнительной буквой <literal>B</literal> (заглавной или строчной), добавленной непосредственно перед открывающим апострофом (без промежуточных пробелов), например: <literal>B'1001'</literal>. В битовых строковых константах допускаются лишь символы <literal>0</literal> и <literal>1</literal>.

source: Alternatively, bit-string constants can be specified in hexadecimal notation, using a leading <literal>X</literal> (upper or lower case), e.g., <literal>X'1FF'</literal>. This notation is equivalent to a bit-string constant with four binary digits for each hexadecimal digit.
ru: Битовые константы могут быть записаны и по-другому, в шестнадцатеричном виде, с начальной буквой <literal>X</literal> (заглавной или строчной), например: <literal>X'1FF'</literal>. Такая запись эквивалентна двоичной, только четыре двоичных цифры заменяются одной шестнадцатеричной.

source: Both forms of bit-string constant can be continued across lines in the same way as regular string constants. Dollar quoting cannot be used in a bit-string constant.
ru: Обе формы записи допускают перенос строк так же, как и обычные строковые константы. Однако заключать в доллары битовые строки нельзя.

source: Numeric Constants
ru: Числовые константы

source: <primary>number</primary> <secondary>constant</secondary>
ru: <primary>числовые</primary> <secondary>константы</secondary>

source: Numeric constants are accepted in these general forms: <synopsis> <replaceable>digits</replaceable> <replaceable>digits</replaceable>.<optional><replaceable>digits</replaceable></optional><optional>e<optional>+-</optional><replaceable>digits</replaceable></optional> <optional><replaceable>digits</replaceable></optional>.<replaceable>digits</replaceable><optional>e<optional>+-</optional><replaceable>digits</replaceable></optional> <replaceable>digits</replaceable>e<optional>+-</optional><replaceable>digits</replaceable> </synopsis> where <replaceable>digits</replaceable> is one or more decimal digits (0 through 9). At least one digit must be before or after the decimal point, if one is used. At least one digit must follow the exponent marker (<literal>e</literal>), if one is present. There cannot be any spaces or other characters embedded in the constant. Note that any leading plus or minus sign is not actually considered part of the constant; it is an operator applied to the constant.
ru: Числовые константы могут быть заданы в следующем общем виде: <synopsis> <replaceable>цифры</replaceable> <replaceable>цифры</replaceable>.<optional><replaceable>цифры</replaceable></optional><optional>e<optional>+-</optional><replaceable>цифры</replaceable></optional> <optional><replaceable>цифры</replaceable></optional>.<replaceable>цифры</replaceable><optional>e<optional>+-</optional><replaceable>цифры</replaceable></optional> <replaceable>цифры</replaceable>e<optional>+-</optional><replaceable>цифры</replaceable> </synopsis> где <replaceable>цифры</replaceable> &mdash; это одна или несколько десятичных цифр (0..9). До или после десятичной точки (при её наличии) должна быть минимум одна цифра. Как минимум одна цифра должна следовать за обозначением экспоненты (<literal>e</literal>), если оно присутствует. В числовой константе не может быть пробелов или других символов. Заметьте, что любой знак минус или плюс в начале строки не считается частью числа; это оператор, применённый к константе.

source: These are some examples of valid numeric constants: <literallayout> 42 3.5 4. .001 5e2 1.925e-3 </literallayout>
ru: Несколько примеров допустимых числовых констант: <literallayout> 42 3.5 4. .001 5e2 1.925e-3 </literallayout>

source: <placeholder-1/> <placeholder-2/> <placeholder-3/> A numeric constant that contains neither a decimal point nor an exponent is initially presumed to be type <type>integer</type> if its value fits in type <type>integer</type> (32 bits); otherwise it is presumed to be type <type>bigint</type> if its value fits in type <type>bigint</type> (64 bits); otherwise it is taken to be type <type>numeric</type>. Constants that contain decimal points and/or exponents are always initially presumed to be type <type>numeric</type>.
ru: <placeholder-1/> <placeholder-2/> <placeholder-3/> Числовая константа, не содержащая точки и экспоненты, изначально рассматривается как константа типа <type>integer</type>, если её значение умещается в 32-битный тип <type>integer</type>; затем как константа типа <type>bigint</type>, если её значение умещается в 64-битный <type>bigint</type>; в противном случае она принимает тип <type>numeric</type>. Константы, содержащие десятичные точки и/или экспоненты, всегда считаются константами типа <type>numeric</type>.

source: <primary>type cast</primary>
ru: <primary>приведение типа</primary>

source: REAL '1.23' -- string style 1.23::REAL -- PostgreSQL (historical) style
ru: REAL '1.23' -- строковый стиль 1.23::REAL -- стиль PostgreSQL (исторический)

source: The initially assigned data type of a numeric constant is just a starting point for the type resolution algorithms. In most cases the constant will be automatically coerced to the most appropriate type depending on context. When necessary, you can force a numeric value to be interpreted as a specific data type by casting it.<placeholder-1/> For example, you can force a numeric value to be treated as type <type>real</type> (<type>float4</type>) by writing: <placeholder-2/> These are actually just special cases of the general casting notations discussed next.
ru: Изначально назначенный тип данных числовой константы это только отправная точка для алгоритмов определения типа. В большинстве случаев константа будет автоматически приведена к наиболее подходящему типу для данного контекста. При необходимости вы можете принудительно интерпретировать числовое значение как значение определённого типа, приведя его тип к нужному.<placeholder-1/> Например, вы можете сделать, чтобы числовое значение рассматривалось как имеющее тип <type>real</type> (<type>float4</type>), написав: <placeholder-2/> На самом деле это только частные случаи синтаксиса приведения типов, который будет рассматриваться далее.

source: Constants of Other Types
ru: Константы других типов

source: <primary>data type</primary> <secondary>constant</secondary>
ru: <primary>типы данных</primary> <secondary>константы</secondary>
