Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/syntax.po
Languages: ru

source: SQL Syntax
ru: Синтаксис SQL

source: <primary>syntax</primary> <secondary>SQL</secondary>
ru: <primary>синтаксис</primary> <secondary>SQL</secondary>

source: This chapter describes the syntax of SQL. It forms the foundation for understanding the following chapters which will go into detail about how SQL commands are applied to define and modify data.
ru: В этой главе описывается синтаксис языка SQL. Тем самым закладывается фундамент для следующих глав, где будет подробно рассмотрено, как с помощью команд SQL описывать и изменять данные.

source: We also advise users who are already familiar with SQL to read this chapter carefully because it contains several rules and concepts that are implemented inconsistently among SQL databases or that are specific to <productname>PostgreSQL</productname>.
ru: Мы советуем прочитать эту главу и тем, кто уже знаком SQL, так как в ней описываются несколько правил и концепций, которые реализованы в разных базах данных SQL по-разному или относятся только к <productname>PostgreSQL</productname>.

source: Lexical Structure
ru: Лексическая структура

source: <primary>token</primary>
ru: <primary>компонент</primary>

source: SQL input consists of a sequence of <firstterm>commands</firstterm>. A command is composed of a sequence of <firstterm>tokens</firstterm>, terminated by a semicolon (<quote>;</quote>). The end of the input stream also terminates a command. Which tokens are valid depends on the syntax of the particular command.
ru: SQL-программа состоит из последовательности <firstterm>команд</firstterm>. Команда, в свою очередь, представляет собой последовательность <firstterm>компонентов</firstterm>, оканчивающуюся точкой с запятой (<quote>;</quote>). Конец входного потока также считается концом команды. Какие именно компоненты допустимы для конкретной команды, зависит от её синтаксиса.

source: A token can be a <firstterm>key word</firstterm>, an <firstterm>identifier</firstterm>, a <firstterm>quoted identifier</firstterm>, a <firstterm>literal</firstterm> (or constant), or a special character symbol. Tokens are normally separated by whitespace (space, tab, newline), but need not be if there is no ambiguity (which is generally only the case if a special character is adjacent to some other token type).
ru: Компонентом команды может быть <firstterm>ключевое слово</firstterm>, <firstterm>идентификатор</firstterm>, <firstterm>идентификатор в кавычках</firstterm>, <firstterm>строка</firstterm> (или константа) или специальный символ. Компоненты обычно разделяются пробельными символами (пробел, табуляция, перевод строки), но это не требуется, если нет неоднозначности (например, когда спецсимвол оказывается рядом с компонентом другого типа).

source: For example, the following is (syntactically) valid SQL input: <placeholder-1/> This is a sequence of three commands, one per line (although this is not required; more than one command can be on a line, and commands can usefully be split across lines).
ru: Например, следующий текст является правильной (синтаксически) SQL-программой: <placeholder-1/> Это последовательность трёх команд, по одной в строке (хотя их можно было разместить и в одну строку или наоборот, разделить команды на несколько строк).

source: Additionally, <firstterm>comments</firstterm> can occur in SQL input. They are not tokens, they are effectively equivalent to whitespace.
ru: Кроме этого, SQL-программы могут содержать <firstterm>комментарии</firstterm>. Они не являются компонентами команд, а по сути равносильны пробельным символам.

source: The SQL syntax is not very consistent regarding what tokens identify commands and which are operands or parameters. The first few tokens are generally the command name, so in the above example we would usually speak of a <quote>SELECT</quote>, an <quote>UPDATE</quote>, and an <quote>INSERT</quote> command. But for instance the <command>UPDATE</command> command always requires a <token>SET</token> token to appear in a certain position, and this particular variation of <command>INSERT</command> also requires a <token>VALUES</token> in order to be complete. The precise syntax rules for each command are described in <xref linkend="reference"/>.
ru: Синтаксис SQL не очень строго определяет, какие компоненты идентифицируют команды, а какие &mdash; их операнды или параметры. Первые несколько компонентов обычно содержат имя команды, так что в данном примере мы можем говорить о командах <quote>SELECT</quote>, <quote>UPDATE</quote> и <quote>INSERT</quote>. Но например, команда <command>UPDATE</command> требует, чтобы также в определённом положении всегда стоял компонент <token>SET</token>, а <command>INSERT</command> в приведённом виде требует наличия компонента <token>VALUES</token>. Точные синтаксические правила для каждой команды описаны в <xref remap="6" linkend="reference"/>.

source: Identifiers and Key Words
ru: Идентификаторы и ключевые слова

source: <primary>identifier</primary> <secondary>syntax of</secondary>
ru: <primary>идентификатор</primary> <secondary>синтаксис</secondary>

source: <primary>name</primary> <secondary>syntax of</secondary>
ru: <primary>имя</primary> <secondary>синтаксис</secondary>

source: <primary>key word</primary> <secondary>syntax of</secondary>
ru: <primary>ключевое слово</primary> <secondary>синтаксис</secondary>

source: Tokens such as <token>SELECT</token>, <token>UPDATE</token>, or <token>VALUES</token> in the example above are examples of <firstterm>key words</firstterm>, that is, words that have a fixed meaning in the SQL language. The tokens <token>MY_TABLE</token> and <token>A</token> are examples of <firstterm>identifiers</firstterm>. They identify names of tables, columns, or other database objects, depending on the command they are used in. Therefore they are sometimes simply called <quote>names</quote>. Key words and identifiers have the same lexical structure, meaning that one cannot know whether a token is an identifier or a key word without knowing the language. A complete list of key words can be found in <xref linkend="sql-keywords-appendix"/>.
ru: Показанные выше команды содержали компоненты <token>SELECT</token>, <token>UPDATE</token> и <token>VALUES</token>, которые являются примерами <firstterm>ключевых слов</firstterm>, то есть слов, имеющих фиксированное значение в языке SQL. Компоненты <token>MY_TABLE</token> и <token>A</token> являются примерами <firstterm>идентификаторов</firstterm>. Они идентифицируют имена таблиц, столбцов или других объектов баз данных, в зависимости от того, где они используются. Поэтому иногда их называют просто <quote>именами</quote>. Ключевые слова и идентификаторы имеют одинаковую лексическую структуру, то есть, не зная языка, нельзя определить, является ли некоторый компонент ключевым словом или идентификатором. Полный список ключевых слов приведён в <xref remap="6" linkend="sql-keywords-appendix"/>.

source: SQL identifiers and key words must begin with a letter (<literal>a</literal>-<literal>z</literal>, but also letters with diacritical marks and non-Latin letters) or an underscore (<literal>_</literal>). Subsequent characters in an identifier or key word can be letters, underscores, digits (<literal>0</literal>-<literal>9</literal>), or dollar signs (<literal>$</literal>). Note that dollar signs are not allowed in identifiers according to the letter of the SQL standard, so their use might render applications less portable. The SQL standard will not define a key word that contains digits or starts or ends with an underscore, so identifiers of this form are safe against possible conflict with future extensions of the standard.
ru: Идентификаторы и ключевые слова SQL должны начинаться с буквы (<literal>a</literal>-<literal>z</literal>, хотя допускаются также не латинские буквы и буквы с диакритическими знаками) или подчёркивания (<literal>_</literal>). Последующими символами в идентификаторе или ключевом слове могут быть буквы, цифры (<literal>0</literal>-<literal>9</literal>), знаки доллара (<literal>$</literal>) или подчёркивания. Заметьте, что строго следуя букве стандарта SQL, знаки доллара нельзя использовать в идентификаторах, так что их использование вредит переносимости приложений. В стандарте SQL гарантированно не будет ключевых слов с цифрами и начинающихся или заканчивающихся подчёркиванием, так что идентификаторы такого вида защищены от возможных конфликтов с будущими расширениями стандарта.

source: <primary>identifier</primary><secondary>length</secondary>
ru: <primary>идентификатор</primary> <secondary>длина</secondary>

source: <placeholder-1/> The system uses no more than <symbol>NAMEDATALEN</symbol>-1 bytes of an identifier; longer names can be written in commands, but they will be truncated. By default, <symbol>NAMEDATALEN</symbol> is 64 so the maximum identifier length is 63 bytes. If this limit is problematic, it can be raised by changing the <symbol>NAMEDATALEN</symbol> constant in <filename>src/include/pg_config_manual.h</filename>.
ru: <placeholder-1/> Система выделяет для идентификатора не более <symbol>NAMEDATALEN</symbol>-1 байт, а более длинные имена усекаются. По умолчанию <symbol>NAMEDATALEN</symbol> равно 64, так что максимальная длина идентификатора равна 63 байтам. Если этого недостаточно, этот предел можно увеличить, изменив константу <symbol>NAMEDATALEN</symbol> в файле <filename>src/include/pg_config_manual.h</filename>.

source: <primary>case sensitivity</primary> <secondary>of SQL commands</secondary>
ru: <primary>чувствительность к регистру</primary> <secondary>в командах SQL</secondary>

source: <placeholder-1/> Key words and unquoted identifiers are case insensitive. Therefore: <placeholder-2/> can equivalently be written as: <placeholder-3/> A convention often used is to write key words in upper case and names in lower case, e.g.: <placeholder-4/>
ru: <placeholder-1/> Ключевые слова и идентификаторы без кавычек воспринимаются системой без учёта регистра. Таким образом: <placeholder-2/> равносильно записи: <placeholder-3/> Часто используется неформальное соглашение записывать ключевые слова заглавными буквами, а имена строчными, например: <placeholder-4/>

source: <primary>quotation marks</primary> <secondary>and identifiers</secondary>
ru: <primary>кавычки</primary> <secondary>и идентификаторы</secondary>

source: <placeholder-1/> There is a second kind of identifier: the <firstterm>delimited identifier</firstterm> or <firstterm>quoted identifier</firstterm>. It is formed by enclosing an arbitrary sequence of characters in double-quotes (<literal>"</literal>). A delimited identifier is always an identifier, never a key word. So <literal>"select"</literal> could be used to refer to a column or table named <quote>select</quote>, whereas an unquoted <literal>select</literal> would be taken as a key word and would therefore provoke a parse error when used where a table or column name is expected. The example can be written with quoted identifiers like this: <placeholder-2/>
ru: <placeholder-1/> Есть и другой тип идентификаторов: <firstterm>отделённые идентификаторы</firstterm> или <firstterm>идентификаторы в кавычках</firstterm>. Они образуются при заключении обычного набора символов в двойные кавычки (<literal>"</literal>). Такие идентификаторы всегда будут считаться идентификаторами, но не ключевыми словами. Так <literal>"select"</literal> можно использовать для обозначения столбца или таблицы <quote>select</quote>, тогда как <literal>select</literal> без кавычек будет воспринят как ключевое слово и приведёт к ошибке разбора команды в месте, где ожидается имя таблицы или столбца. Тот же пример можно переписать с идентификаторами в кавычках следующим образом: <placeholder-2/>

source: Quoted identifiers can contain any character, except the character with code zero. (To include a double quote, write two double quotes.) This allows constructing table or column names that would otherwise not be possible, such as ones containing spaces or ampersands. The length limitation still applies.
ru: Идентификаторы в кавычках могут содержать любые символы, за исключением символа с кодом 0. (Чтобы включить в такой идентификатор кавычки, продублируйте их.) Это позволяет создавать таблицы и столбцы с именами, которые иначе были бы невозможны, например, с пробелами или амперсандами. Ограничение длины при этом сохраняется.

source: <primary>Unicode escape</primary> <secondary>in identifiers</secondary>
ru: <primary>Символы Unicode</primary> <secondary>в идентификаторах</secondary>

source: A variant of quoted identifiers allows including escaped Unicode characters identified by their code points. This variant starts with <literal>U&amp;</literal> (upper or lower case U followed by ampersand) immediately before the opening double quote, without any spaces in between, for example <literal>U&amp;"foo"</literal>. (Note that this creates an ambiguity with the operator <literal>&amp;</literal>. Use spaces around the operator to avoid this problem.) Inside the quotes, Unicode characters can be specified in escaped form by writing a backslash followed by the four-digit hexadecimal code point number or alternatively a backslash followed by a plus sign followed by a six-digit hexadecimal code point number. For example, the identifier <literal>"data"</literal> could be written as <placeholder-1/> The following less trivial example writes the Russian word <quote>slon</quote> (elephant) in Cyrillic letters: <placeholder-2/>
ru: Ещё один вариант идентификаторов в кавычках позволяет использовать символы Unicode по их кодам. Такой идентификатор начинается с <literal>U&amp;</literal> (строчная или заглавная U и амперсанд), а затем сразу без пробелов идёт двойная кавычка, например <literal>U&amp;"foo"</literal>. (Заметьте, что при этом возникает неоднозначность с оператором <literal>&amp;</literal>. Чтобы её избежать, окружайте этот оператор пробелами.) Затем в кавычках можно записывать символы Unicode двумя способами: обратная косая черта, а за ней код символа из четырёх шестнадцатеричных цифр, либо обратная косая черта, знак плюс, а затем код из шести шестнадцатеричных цифр. Например, идентификатор <literal>"data"</literal> можно записать так: <placeholder-1/> В следующем менее тривиальном примере закодировано русское слово <quote>слон</quote>, записанное кириллицей: <placeholder-2/>

source: If a different escape character than backslash is desired, it can be specified using the <literal>UESCAPE</literal><placeholder-1/> clause after the string, for example: <placeholder-2/> The escape character can be any single character other than a hexadecimal digit, the plus sign, a single quote, a double quote, or a whitespace character. Note that the escape character is written in single quotes, not double quotes.
ru: Если вы хотите использовать не обратную косую черту, а другой спецсимвол, его можно указать, добавив <literal>UESCAPE</literal> <placeholder-1/> после строки, например: <placeholder-2/> В качестве спецсимвола можно выбрать любой символ, кроме шестнадцатеричной цифры, знака плюс, апострофа, кавычки или пробельного символа. Заметьте, что спецсимвол заключается не в двойные кавычки, а в апострофы.

source: To include the escape character in the identifier literally, write it twice.
ru: Чтобы сделать спецсимволом знак апострофа, напишите его дважды.

source: The Unicode escape syntax works only when the server encoding is <literal>UTF8</literal>. When other server encodings are used, only code points in the ASCII range (up to <literal>\007F</literal>) can be specified. Both the 4-digit and the 6-digit form can be used to specify UTF-16 surrogate pairs to compose characters with code points larger than U+FFFF, although the availability of the 6-digit form technically makes this unnecessary. (Surrogate pairs are not stored directly, but combined into a single code point that is then encoded in UTF-8.)
ru: Unicode-формат полностью поддерживается только при использовании на сервере кодировки <literal>UTF8</literal>. Когда используются другие кодировки, допускается указание только ASCII-символов (с кодами до <literal>\007F</literal>). И в четырёх, и в шестизначной форме можно записывать суррогатные пары UTF-16 и таким образом составлять символы с кодами больше чем U+FFFF, хотя наличие шестизначной формы технически делает это ненужным. (Суррогатные пары не сохраняются непосредственно, а объединяются в один символ, который затем кодируется в UTF-8.)

source: Quoting an identifier also makes it case-sensitive, whereas unquoted names are always folded to lower case. For example, the identifiers <literal>FOO</literal>, <literal>foo</literal>, and <literal>"foo"</literal> are considered the same by <productname>PostgreSQL</productname>, but <literal>"Foo"</literal> and <literal>"FOO"</literal> are different from these three and each other. (The folding of unquoted names to lower case in <productname>PostgreSQL</productname> is incompatible with the SQL standard, which says that unquoted names should be folded to upper case. Thus, <literal>foo</literal> should be equivalent to <literal>"FOO"</literal> not <literal>"foo"</literal> according to the standard. If you want to write portable applications you are advised to always quote a particular name or never quote it.)
ru: Идентификатор, заключённый в кавычки, становится зависимым от регистра, тогда как идентификаторы без кавычек всегда переводятся в нижний регистр. Например, идентификаторы <literal>FOO</literal>, <literal>foo</literal> и <literal>"foo"</literal> считаются одинаковыми в <productname>PostgreSQL</productname>, но <literal>"Foo"</literal> и <literal>"FOO"</literal> отличны друг от друга и от предыдущих трёх. (Приведение имён без кавычек к нижнему регистру, как это делает <productname>PostgreSQL</productname>, несовместимо со стандартом SQL, который говорит о том, что имена должны приводиться к верхнему регистру. То есть, согласно стандарту <literal>foo</literal> должно быть эквивалентно <literal>"FOO"</literal>, а не <literal>"foo"</literal>. Поэтому при создании переносимых приложений рекомендуется либо всегда заключать определённое имя в кавычки, либо не заключать никогда.)

source: Constants
ru: Константы

source: <primary>constant</primary>
ru: <primary>константа</primary>

source: There are three kinds of <firstterm>implicitly-typed constants</firstterm> in <productname>PostgreSQL</productname>: strings, bit strings, and numbers. Constants can also be specified with explicit types, which can enable more accurate representation and more efficient handling by the system. These alternatives are discussed in the following subsections.
ru: В <productname>PostgreSQL</productname> есть три типа констант <firstterm>подразумеваемых типов</firstterm>: строки, битовые строки и числа. Константы можно также записывать, указывая типы явно, что позволяет представить их более точно и обработать более эффективно. Эти варианты рассматриваются в следующих подразделах.

source: String Constants
ru: Строковые константы

source: <primary>character string</primary> <secondary>constant</secondary>
ru: <primary>текстовая строка</primary> <secondary>константа</secondary>

source: <primary>quotation marks</primary> <secondary>escaping</secondary>
ru: <primary>кавычки</primary> <secondary>спецсимволы</secondary>

source: <placeholder-1/> A string constant in SQL is an arbitrary sequence of characters bounded by single quotes (<literal>'</literal>), for example <literal>'This is a string'</literal>. To include a single-quote character within a string constant, write two adjacent single quotes, e.g., <literal>'Dianne''s horse'</literal>. Note that this is <emphasis>not</emphasis> the same as a double-quote character (<literal>"</literal>).
ru: <placeholder-1/> Строковая константа в SQL &mdash; это обычная последовательность символов, заключённая в апострофы (<literal>'</literal>), например: <literal>'Это строка'</literal>. Чтобы включить апостроф в строку, напишите в ней два апострофа рядом, например: <literal>'Жанна д''Арк'</literal>. Заметьте, это <emphasis>не</emphasis> то же самое, что двойная кавычка (<literal>"</literal>).

source: Two string constants that are only separated by whitespace <emphasis>with at least one newline</emphasis> are concatenated and effectively treated as if the string had been written as one constant. For example: <placeholder-1/> is equivalent to: <placeholder-2/> but: <placeholder-3/> is not valid syntax. (This slightly bizarre behavior is specified by <acronym>SQL</acronym>; <productname>PostgreSQL</productname> is following the standard.)
ru: Две строковые константы, разделённые пробельными символами <emphasis>и минимум одним переводом строки</emphasis>, объединяются в одну и обрабатываются, как если бы строка была записана в одной константе. Например: <placeholder-1/> эквивалентно: <placeholder-2/> но эта запись: <placeholder-3/> считается синтаксической ошибкой. (Это несколько странное поведение определено в стандарте <acronym>SQL</acronym>, <productname>PostgreSQL</productname> просто следует ему.)

source: String Constants with C-style Escapes
ru: Строковые константы со спецпоследовательностями в стиле C

source: <primary>escape string syntax</primary>
ru: <primary>синтаксис спецпоследовательностей</primary>

source: <primary>backslash escapes</primary>
ru: <primary>спецсимвол обратная косая черта</primary>

source: <productname>PostgreSQL</productname> also accepts <quote>escape</quote> string constants, which are an extension to the SQL standard. An escape string constant is specified by writing the letter <literal>E</literal> (upper or lower case) just before the opening single quote, e.g., <literal>E'foo'</literal>. (When continuing an escape string constant across lines, write <literal>E</literal> only before the first opening quote.) Within an escape string, a backslash character (<literal>\</literal>) begins a C-like <firstterm>backslash escape</firstterm> sequence, in which the combination of backslash and following character(s) represent a special byte value, as shown in <xref linkend="sql-backslash-table"/>.
ru: <productname>PostgreSQL</productname> также принимает <quote>спецпоследовательности</quote>, что является расширением стандарта SQL. Строка со спецпоследовательностями начинается с буквы <literal>E</literal> (заглавной или строчной), стоящей непосредственно перед апострофом, например: <literal>E'foo'</literal>. (Когда константа со спецпоследовательностью разбивается на несколько строк, букву <literal>E</literal> нужно поставить только перед первым открывающим апострофом.) Внутри таких строк символ обратной косой черты (<literal>\</literal>) начинает C-подобные <firstterm>спецпоследовательности</firstterm>, в которых сочетание обратной косой черты со следующим символом(ами) даёт определённое байтовое значение, как показано в <xref remap="6" linkend="sql-backslash-table"/>.

source: Backslash Escape Sequences
ru: Спецпоследовательности

source: Backslash Escape Sequence
ru: Спецпоследовательность

source: Interpretation
ru: Интерпретация

source: backspace
ru: символ &laquo;забой&raquo;

source: form feed
ru: подача формы

source: newline
ru: новая строка

source: carriage return
ru: возврат каретки

source: tab
ru: табуляция

source: octal byte value
ru: восьмеричное значение байта

source: hexadecimal byte value
ru: шестнадцатеричное значение байта

source: 16 or 32-bit hexadecimal Unicode character value
ru: 16- или 32-битный шестнадцатеричный код символа Unicode
