Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/syntax.po
Languages: ru

source: The built-in window functions are described in <xref linkend="functions-window-table"/>. Other window functions can be added by the user. Also, any built-in or user-defined normal aggregate function can be used as a window function. Ordered-set aggregates presently cannot be used as window functions, however.
ru: Встроенные оконные функции описаны в <xref remap="6" linkend="functions-window-table"/>, но этот набор можно расширить, создавая собственные функции. Кроме того, в качестве оконных функций можно использовать любые встроенные или пользовательские обычные агрегатные функции (сортирующие агрегатные функции использовать в качестве оконных нельзя).

source: The syntaxes using <literal>*</literal> are used for calling parameter-less aggregate functions as window functions, for example <literal>count(*) OVER (PARTITION BY x ORDER BY y)</literal>. The asterisk (<literal>*</literal>) is customarily not used for non-aggregate window functions. Aggregate window functions, unlike normal aggregate functions, do not allow <literal>DISTINCT</literal> or <literal>ORDER BY</literal> to be used within the function argument list.
ru: Запись со звёздочкой (<literal>*</literal>) применяется при вызове агрегатных функций в качестве оконных, например <literal>count(*) OVER (PARTITION BY x ORDER BY y)</literal>. Звёздочка (<literal>*</literal>) обычно не применяется для не агрегатных оконных функций. Агрегатные оконные функции, в отличие от обычных агрегатных функций, не допускают использования <literal>DISTINCT</literal> и <literal>ORDER BY</literal> в списке аргументов.

source: Window function calls are permitted only in the <literal>SELECT</literal> list and the <literal>ORDER BY</literal> clause of the query.
ru: Вызовы оконных функций разрешены в запросах только в списке <literal>SELECT</literal> и в предложении <literal>ORDER BY</literal>.

source: More information about window functions can be found in <xref linkend="tutorial-window"/>, <xref linkend="functions-window"/>, and <xref linkend="queries-window"/>.
ru: Дополнительно об оконных функциях можно узнать в <xref remap="6" linkend="tutorial-window"/>, <xref remap="6" linkend="functions-window"/> и <xref remap="6" linkend="queries-window"/>.

source: Type Casts
ru: Приведения типов

source: <primary>data type</primary> <secondary>type cast</secondary>
ru: <primary>тип данных</primary> <secondary>приведение типа</secondary>

source: A type cast specifies a conversion from one data type to another. <productname>PostgreSQL</productname> accepts two equivalent syntaxes for type casts: <synopsis> CAST ( <replaceable>expression</replaceable> AS <replaceable>type</replaceable> ) <replaceable>expression</replaceable>::<replaceable>type</replaceable> </synopsis> The <literal>CAST</literal> syntax conforms to SQL; the syntax with <literal>::</literal> is historical <productname>PostgreSQL</productname> usage.
ru: Приведение типа определяет преобразование данных из одного типа в другой. <productname>PostgreSQL</productname> воспринимает две равносильные записи приведения типов: <synopsis> CAST ( <replaceable>выражение</replaceable> AS <replaceable>тип</replaceable> ) <replaceable>выражение</replaceable>::<replaceable>тип</replaceable> </synopsis> Запись с <literal>CAST</literal> соответствует стандарту SQL, тогда как вариант с <literal>::</literal> &mdash; историческое наследие <productname>PostgreSQL</productname>.

source: When a cast is applied to a value expression of a known type, it represents a run-time type conversion. The cast will succeed only if a suitable type conversion operation has been defined. Notice that this is subtly different from the use of casts with constants, as shown in <xref linkend="sql-syntax-constants-generic"/>. A cast applied to an unadorned string literal represents the initial assignment of a type to a literal constant value, and so it will succeed for any type (if the contents of the string literal are acceptable input syntax for the data type).
ru: Когда приведению подвергается значение выражения известного типа, происходит преобразование типа во время выполнения. Это приведение будет успешным, только если определён подходящий оператор преобразования типов. Обратите внимание на небольшое отличие от приведения констант, описанного в <xref remap="6" linkend="sql-syntax-constants-generic"/>. Приведение строки в чистом виде представляет собой начальное присваивание строковой константы и оно будет успешным для любого типа (конечно, если строка содержит значение, приемлемое для данного типа данных).

source: An explicit type cast can usually be omitted if there is no ambiguity as to the type that a value expression must produce (for example, when it is assigned to a table column); the system will automatically apply a type cast in such cases. However, automatic casting is only done for casts that are marked <quote>OK to apply implicitly</quote> in the system catalogs. Other casts must be invoked with explicit casting syntax. This restriction is intended to prevent surprising conversions from being applied silently.
ru: Неявное приведение типа можно опустить, если возможно однозначно определить, какой тип должно иметь выражение (например, когда оно присваивается столбцу таблицы); в таких случаях система автоматически преобразует тип. Однако автоматическое преобразование выполняется только для приведений с пометкой <quote>допускается неявное применение</quote> в системных каталогах. Все остальные приведения должны записываться явно. Это ограничение позволяет избежать сюрпризов с неявным преобразованием.

source: It is also possible to specify a type cast using a function-like syntax: <synopsis> <replaceable>typename</replaceable> ( <replaceable>expression</replaceable> ) </synopsis> However, this only works for types whose names are also valid as function names. For example, <literal>double precision</literal> cannot be used this way, but the equivalent <literal>float8</literal> can. Also, the names <literal>interval</literal>, <literal>time</literal>, and <literal>timestamp</literal> can only be used in this fashion if they are double-quoted, because of syntactic conflicts. Therefore, the use of the function-like cast syntax leads to inconsistencies and should probably be avoided.
ru: Также можно записать приведение типа как вызов функции: <synopsis> <replaceable>имя_типа</replaceable> ( <replaceable>выражение</replaceable> ) </synopsis> Однако это будет работать только для типов, имена которых являются также допустимыми именами функций. Например, <literal>double precision</literal> так использовать нельзя, а <literal>float8</literal> (альтернативное название того же типа) &mdash; можно. Кроме того, имена типов <literal>interval</literal>, <literal>time</literal> и <literal>timestamp</literal> из-за синтаксического конфликта можно использовать в такой записи только в кавычках. Таким образом, запись приведения типа в виде вызова функции провоцирует несоответствия и, возможно, лучше будет её не применять.

source: The function-like syntax is in fact just a function call. When one of the two standard cast syntaxes is used to do a run-time conversion, it will internally invoke a registered function to perform the conversion. By convention, these conversion functions have the same name as their output type, and thus the <quote>function-like syntax</quote> is nothing more than a direct invocation of the underlying conversion function. Obviously, this is not something that a portable application should rely on. For further details see <xref linkend="sql-createcast"/>.
ru: Приведение типа, представленное в виде вызова функции, на самом деле соответствует внутреннему механизму. Даже при использовании двух стандартных типов записи внутри происходит вызов зарегистрированной функции, выполняющей преобразование. По соглашению именем такой функции преобразования является имя выходного типа, и таким образом запись <quote>в виде вызова функции</quote> есть не что иное, как прямой вызов нижележащей функции преобразования. При создании переносимого приложения на это поведение, конечно, не следует рассчитывать. Подробнее это описано в справке <xref linkend="sql-createcast"/>.

source: Collation Expressions
ru: Применение правил сортировки

source: The <literal>COLLATE</literal> clause overrides the collation of an expression. It is appended to the expression it applies to: <synopsis> <replaceable>expr</replaceable> COLLATE <replaceable>collation</replaceable> </synopsis> where <replaceable>collation</replaceable> is a possibly schema-qualified identifier. The <literal>COLLATE</literal> clause binds tighter than operators; parentheses can be used when necessary.
ru: Предложение <literal>COLLATE</literal> переопределяет правило сортировки выражения. Оно добавляется после выражения: <synopsis> <replaceable>выражение</replaceable> COLLATE <replaceable>правило_сортировки</replaceable> </synopsis> где <replaceable>правило_сортировки</replaceable> &mdash; идентификатор правила, возможно дополненный именем схемы. Предложение <literal>COLLATE</literal> связывает выражение сильнее, чем операторы, так что при необходимости следует использовать скобки.

source: If no collation is explicitly specified, the database system either derives a collation from the columns involved in the expression, or it defaults to the default collation of the database if no column is involved in the expression.
ru: Если правило сортировки не определено явно, система либо выбирает его по столбцам, которые используются в выражении, либо, если таких столбцов нет, переключается на установленное для базы данных правило сортировки по умолчанию.

source: The two common uses of the <literal>COLLATE</literal> clause are overriding the sort order in an <literal>ORDER BY</literal> clause, for example: <placeholder-1/> and overriding the collation of a function or operator call that has locale-sensitive results, for example: <placeholder-2/> Note that in the latter case the <literal>COLLATE</literal> clause is attached to an input argument of the operator we wish to affect. It doesn't matter which argument of the operator or function call the <literal>COLLATE</literal> clause is attached to, because the collation that is applied by the operator or function is derived by considering all arguments, and an explicit <literal>COLLATE</literal> clause will override the collations of all other arguments. (Attaching non-matching <literal>COLLATE</literal> clauses to more than one argument, however, is an error. For more details see <xref linkend="collation"/>.) Thus, this gives the same result as the previous example: <placeholder-3/> But this is an error: <placeholder-4/> because it attempts to apply a collation to the result of the <literal>&gt;</literal> operator, which is of the non-collatable data type <type>boolean</type>.
ru: Предложение <literal>COLLATE</literal> имеет два распространённых применения: переопределение порядка сортировки в предложении <literal>ORDER BY</literal>, например: <placeholder-1/> и переопределение правил сортировки при вызове функций или операторов, возвращающих языкозависимые результаты, например: <placeholder-2/> Заметьте, что в последнем случае предложение <literal>COLLATE</literal> добавлено к аргументу оператора, на действие которого мы хотим повлиять. При этом не имеет значения, к какому именно аргументу оператора или функции добавляется <literal>COLLATE</literal>, так как правило сортировки, применяемое к оператору или функции, выбирается при рассмотрении всех аргументов, а явное предложение <literal>COLLATE</literal> переопределяет правила сортировки для всех других аргументов. (Однако добавление разных предложений <literal>COLLATE</literal> к нескольким аргументам будет ошибкой. Подробнее об этом см. <xref remap="4" linkend="collation"/>.) Таким образом, эта команда выдаст тот же результат: <placeholder-3/> Но это будет ошибкой: <placeholder-4/> здесь правило сортировки нельзя применить к результату оператора <literal>&gt;</literal>, который имеет несравниваемый тип данных <type>boolean</type>.

source: Scalar Subqueries
ru: Скалярные подзапросы

source: <primary>subquery</primary>
ru: <primary>подзапрос</primary>

source: A scalar subquery is an ordinary <command>SELECT</command> query in parentheses that returns exactly one row with one column. (See <xref linkend="queries"/> for information about writing queries.) The <command>SELECT</command> query is executed and the single returned value is used in the surrounding value expression. It is an error to use a query that returns more than one row or more than one column as a scalar subquery. (But if, during a particular execution, the subquery returns no rows, there is no error; the scalar result is taken to be null.) The subquery can refer to variables from the surrounding query, which will act as constants during any one evaluation of the subquery. See also <xref linkend="functions-subquery"/> for other expressions involving subqueries.
ru: Скалярный подзапрос &mdash; это обычный запрос <command>SELECT</command> в скобках, который возвращает ровно одну строку и один столбец. (Написание запросов освещается в <xref remap="6" linkend="queries"/>.) После выполнения запроса <command>SELECT</command> его единственный результат используется в окружающем его выражении. В качестве скалярного подзапроса нельзя использовать запросы, возвращающие более одной строки или столбца. (Но если в результате выполнения подзапрос не вернёт строк, скалярный результат считается равным NULL.) В подзапросе можно ссылаться на переменные из окружающего запроса; в процессе одного вычисления подзапроса они будут считаться константами. Другие выражения с подзапросами описаны в <xref remap="6" linkend="functions-subquery"/>.

source: For example, the following finds the largest city population in each state: <placeholder-1/>
ru: Например, следующий запрос находит самый населённый город в каждом штате: <placeholder-1/>

source: Array Constructors
ru: Конструкторы массивов

source: <primary>array</primary> <secondary>constructor</secondary>
ru: <primary>массив</primary> <secondary>конструктор</secondary>

source: An array constructor is an expression that builds an array value using values for its member elements. A simple array constructor consists of the key word <literal>ARRAY</literal>, a left square bracket <literal>[</literal>, a list of expressions (separated by commas) for the array element values, and finally a right square bracket <literal>]</literal>. For example: <placeholder-1/> By default, the array element type is the common type of the member expressions, determined using the same rules as for <literal>UNION</literal> or <literal>CASE</literal> constructs (see <xref linkend="typeconv-union-case"/>). You can override this by explicitly casting the array constructor to the desired type, for example: <placeholder-2/> This has the same effect as casting each expression to the array element type individually. For more on casting, see <xref linkend="sql-syntax-type-casts"/>.
ru: Конструктор массива &mdash; это выражение, которое создаёт массив, определяя значения его элементов. Конструктор простого массива состоит из ключевого слова <literal>ARRAY</literal>, открывающей квадратной скобки <literal>[</literal>, списка выражений (разделённых запятыми), задающих значения элементов массива, и закрывающей квадратной скобки <literal>]</literal>. Например: <placeholder-1/> По умолчанию типом элементов массива считается общий тип для всех выражений, определённый по правилам, действующим и для конструкций <literal>UNION</literal> и <literal>CASE</literal> (см. <xref remap="4" linkend="typeconv-union-case"/>). Вы можете переопределить его явно, приведя конструктор массива к требуемому типу, например: <placeholder-2/> Это равносильно тому, что привести к нужному типу каждое выражение по отдельности. Подробнее приведение типов описано в <xref remap="6" linkend="sql-syntax-type-casts"/>.

source: Multidimensional array values can be built by nesting array constructors. In the inner constructors, the key word <literal>ARRAY</literal> can be omitted. For example, these produce the same result: <placeholder-1/> Since multidimensional arrays must be rectangular, inner constructors at the same level must produce sub-arrays of identical dimensions. Any cast applied to the outer <literal>ARRAY</literal> constructor propagates automatically to all the inner constructors.
ru: Многомерные массивы можно образовывать, вкладывая конструкторы массивов. При этом во внутренних конструкторах слово <literal>ARRAY</literal> можно опускать. Например, результат работы этих конструкторов одинаков: <placeholder-1/> Многомерные массивы должны быть прямоугольными, и поэтому внутренние конструкторы одного уровня должны создавать вложенные массивы одинаковой размерности. Любое приведение типа, применённое к внешнему конструктору <literal>ARRAY</literal>, автоматически распространяется на все внутренние.

source: Multidimensional array constructor elements can be anything yielding an array of the proper kind, not only a sub-<literal>ARRAY</literal> construct. For example: <placeholder-1/>
ru: Элементы многомерного массива можно создавать не только вложенными конструкторами <literal>ARRAY</literal>, но и другими способами, позволяющими получить массивы нужного типа. Например: <placeholder-1/>

source: You can construct an empty array, but since it's impossible to have an array with no type, you must explicitly cast your empty array to the desired type. For example: <placeholder-1/>
ru: Вы можете создать и пустой массив, но так как массив не может быть не типизированным, вы должны явно привести пустой массив к нужному типу. Например: <placeholder-1/>

source: It is also possible to construct an array from the results of a subquery. In this form, the array constructor is written with the key word <literal>ARRAY</literal> followed by a parenthesized (not bracketed) subquery. For example: <placeholder-1/> The subquery must return a single column. If the subquery's output column is of a non-array type, the resulting one-dimensional array will have an element for each row in the subquery result, with an element type matching that of the subquery's output column. If the subquery's output column is of an array type, the result will be an array of the same type but one higher dimension; in this case all the subquery rows must yield arrays of identical dimensionality, else the result would not be rectangular.
ru: Также возможно создать массив из результатов подзапроса. В этом случае конструктор массива записывается так же с ключевым словом <literal>ARRAY</literal>, за которым в круглых скобках следует подзапрос. Например: <placeholder-1/> Такой подзапрос должен возвращать один столбец. Если этот столбец имеет тип, отличный от массива, результирующий одномерный массив будет включать элементы для каждой строки-результата подзапроса и типом элемента будет тип столбца результата. Если же тип столбца — массив, будет создан массив того же типа, но большей размерности; в любом случае во всех строках подзапроса должны выдаваться массивы одинаковой размерности, чтобы можно было получить прямоугольный результат.

source: The subscripts of an array value built with <literal>ARRAY</literal> always begin with one. For more information about arrays, see <xref linkend="arrays"/>.
ru: Индексы массива, созданного конструктором <literal>ARRAY</literal>, всегда начинаются с одного. Подробнее о массивах вы узнаете в <xref remap="6" linkend="arrays"/>.

source: Row Constructors
ru: Конструкторы табличных строк

source: <primary>composite type</primary> <secondary>constructor</secondary>
ru: <primary>составной тип</primary> <secondary>конструктор</secondary>

source: <primary>row type</primary> <secondary>constructor</secondary>
ru: <primary>тип табличной строки</primary> <secondary>конструктор</secondary>

source: A row constructor is an expression that builds a row value (also called a composite value) using values for its member fields. A row constructor consists of the key word <literal>ROW</literal>, a left parenthesis, zero or more expressions (separated by commas) for the row field values, and finally a right parenthesis. For example: <placeholder-1/> The key word <literal>ROW</literal> is optional when there is more than one expression in the list.
ru: Конструктор табличной строки &mdash; это выражение, создающее строку или кортеж (или составное значение) из значений его аргументов-полей. Конструктор строки состоит из ключевого слова <literal>ROW</literal>, открывающей круглой скобки, нуля или нескольких выражений (разделённых запятыми), определяющих значения полей, и закрывающей скобки. Например: <placeholder-1/> Если в списке более одного выражения, ключевое слово <literal>ROW</literal> можно опустить.

source: A row constructor can include the syntax <replaceable>rowvalue</replaceable><literal>.*</literal>, which will be expanded to a list of the elements of the row value, just as occurs when the <literal>.*</literal> syntax is used at the top level of a <command>SELECT</command> list (see <xref linkend="rowtypes-usage"/>). For example, if table <literal>t</literal> has columns <literal>f1</literal> and <literal>f2</literal>, these are the same: <placeholder-1/>
ru: Конструктор строки поддерживает запись <replaceable>составное_значение</replaceable><literal>.*</literal>, при этом данное значение будет развёрнуто в список элементов, так же, как в записи <literal>.*</literal> на верхнем уровне списка <command>SELECT</command> (см. <xref remap="4" linkend="rowtypes-usage"/>). Например, если таблица <literal>t</literal> содержит столбцы <literal>f1</literal> и <literal>f2</literal>, эти записи равнозначны: <placeholder-1/>

source: Before <productname>PostgreSQL</productname> 8.2, the <literal>.*</literal> syntax was not expanded in row constructors, so that writing <literal>ROW(t.*, 42)</literal> created a two-field row whose first field was another row value. The new behavior is usually more useful. If you need the old behavior of nested row values, write the inner row value without <literal>.*</literal>, for instance <literal>ROW(t, 42)</literal>.
ru: До версии <productname>PostgreSQL</productname> 8.2 запись <literal>.*</literal> не разворачивалась в конструкторах строк, так что выражение <literal>ROW(t.*, 42)</literal> создавало составное значение из двух полей, в котором первое поле так же было составным. Новое поведение обычно более полезно. Если вам нужно получить прежнее поведение, чтобы одно значение строки было вложено в другое, напишите внутреннее значение без <literal>.*</literal>, например: <literal>ROW(t, 42)</literal>.
