Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/syntax.po
Languages: ru

source: We have already discussed constants in <xref linkend="sql-syntax-constants"/>. The following sections discuss the remaining options.
ru: Мы уже обсудили константы в <xref remap="6" linkend="sql-syntax-constants"/>. В следующих разделах рассматриваются остальные варианты.

source: Column References
ru: Ссылки на столбцы

source: <primary>column reference</primary>
ru: <primary>ссылка на столбец</primary>

source: A column can be referenced in the form: <synopsis> <replaceable>correlation</replaceable>.<replaceable>columnname</replaceable> </synopsis>
ru: Ссылку на столбец можно записать в форме: <synopsis> <replaceable>отношение</replaceable>.<replaceable>имя_столбца</replaceable> </synopsis>

source: <replaceable>correlation</replaceable> is the name of a table (possibly qualified with a schema name), or an alias for a table defined by means of a <literal>FROM</literal> clause. The correlation name and separating dot can be omitted if the column name is unique across all the tables being used in the current query. (See also <xref linkend="queries"/>.)
ru: Здесь <replaceable>отношение</replaceable> &mdash; имя таблицы (возможно, полное, с именем схемы) или её псевдоним, определённый в предложении <literal>FROM</literal>. Это имя и разделяющую точку можно опустить, если имя столбца уникально среди всех таблиц, задействованных в текущем запросе. (См. также <xref remap="4" linkend="queries"/>.)

source: Positional Parameters
ru: Позиционные параметры

source: <primary>parameter</primary> <secondary>syntax</secondary>
ru: <primary>параметр</primary> <secondary>синтаксис</secondary>

source: A positional parameter reference is used to indicate a value that is supplied externally to an SQL statement. Parameters are used in SQL function definitions and in prepared queries. Some client libraries also support specifying data values separately from the SQL command string, in which case parameters are used to refer to the out-of-line data values. The form of a parameter reference is: <synopsis> $<replaceable>number</replaceable> </synopsis>
ru: Ссылка на позиционный параметр применяется для обращения к значению, переданному в SQL-оператор извне. Параметры используются в определениях SQL-функций и подготовленных операторов. Некоторые клиентские библиотеки также поддерживают передачу значений данных отдельно от самой SQL-команды, и в этом случае параметры позволяют ссылаться на такие значения. Ссылка на параметр записывается в следующей форме: <synopsis> $<replaceable>число</replaceable> </synopsis>

source: For example, consider the definition of a function, <function>dept</function>, as: <placeholder-1/> Here the <literal>$1</literal> references the value of the first function argument whenever the function is invoked.
ru: Например, рассмотрим следующее определение функции <function>dept</function>: <placeholder-1/> Здесь <literal>$1</literal> всегда будет ссылаться на значение первого аргумента функции.

source: Subscripts
ru: Индексы элементов

source: <primary>subscript</primary>
ru: <primary>индекс элемента</primary>

source: If an expression yields a value of an array type, then a specific element of the array value can be extracted by writing <synopsis> <replaceable>expression</replaceable>[<replaceable>subscript</replaceable>] </synopsis> or multiple adjacent elements (an <quote>array slice</quote>) can be extracted by writing <synopsis> <replaceable>expression</replaceable>[<replaceable>lower_subscript</replaceable>:<replaceable>upper_subscript</replaceable>] </synopsis> (Here, the brackets <literal>[ ]</literal> are meant to appear literally.) Each <replaceable>subscript</replaceable> is itself an expression, which must yield an integer value.
ru: Если в выражении вы имеете дело с массивом, то можно извлечь определённый его элемент, написав: <synopsis> <replaceable>выражение</replaceable>[<replaceable>индекс</replaceable>] </synopsis> или несколько соседних элементов (<quote>срез массива</quote>): <synopsis> <replaceable>выражение</replaceable>[<replaceable>нижний_индекс</replaceable>:<replaceable>верхний_индекс</replaceable>] </synopsis> (Здесь квадратные скобки <literal>[ ]</literal> должны быть в явном виде.) Каждый <replaceable>индекс</replaceable> сам по себе является выражением, результатом которого должно быть целое число.

source: mytable.arraycolumn[4] mytable.two_d_column[17][34] $1[10:42] (arrayfunction(a,b))[42]
ru: моя_таблица.столбец_массив[4] моя_таблица.столбец_массив_2d[17][34] $1[10:42] (функция_массив(a,b))[42]

source: In general the array <replaceable>expression</replaceable> must be parenthesized, but the parentheses can be omitted when the expression to be subscripted is just a column reference or positional parameter. Also, multiple subscripts can be concatenated when the original array is multidimensional. For example: <placeholder-1/> The parentheses in the last example are required. See <xref linkend="arrays"/> for more about arrays.
ru: В общем случае <replaceable>выражение</replaceable> массива должно заключаться в круглые скобки, но их можно опустить, когда выражение с индексом &mdash; это просто ссылка на столбец или позиционный параметр. Кроме того, можно соединить несколько индексов, если исходный массив многомерный. Например: <placeholder-1/> В последней строке круглые скобки необходимы. Подробнее массивы рассматриваются в <xref remap="6" linkend="arrays"/>.

source: Field Selection
ru: Выбор поля

source: <primary>field selection</primary>
ru: <primary>выбор поля</primary>

source: If an expression yields a value of a composite type (row type), then a specific field of the row can be extracted by writing <synopsis> <replaceable>expression</replaceable>.<replaceable>fieldname</replaceable> </synopsis>
ru: Если результат выражения &mdash; значение составного типа (строка таблицы), тогда определённое поле этой строки можно извлечь, написав:<synopsis> <replaceable>выражение</replaceable>.<replaceable>имя_поля</replaceable> </synopsis>

source: mytable.mycolumn $1.somecolumn (rowfunction(a,b)).col3
ru: моя_таблица.столбец $1.столбец (функция_кортеж(a,b)).стол3

source: (compositecol).somefield (mytable.compositecol).somefield
ru: (составной_столбец).поле (моя_таблица.составной_столбец).поле

source: In general the row <replaceable>expression</replaceable> must be parenthesized, but the parentheses can be omitted when the expression to be selected from is just a table reference or positional parameter. For example: <placeholder-1/> (Thus, a qualified column reference is actually just a special case of the field selection syntax.) An important special case is extracting a field from a table column that is of a composite type: <placeholder-2/> The parentheses are required here to show that <structfield>compositecol</structfield> is a column name not a table name, or that <structname>mytable</structname> is a table name not a schema name in the second case.
ru: В общем случае <replaceable>выражение</replaceable> такого типа должно заключаться в круглые скобки, но их можно опустить, когда это ссылка на таблицу или позиционный параметр. Например: <placeholder-1/> (Таким образом, полная ссылка на столбец &mdash; это просто частный случай выбора поля.) Важный особый случай здесь &mdash; извлечение поля из столбца составного типа: <placeholder-2/> Здесь скобки нужны, чтобы показать, что <structfield>составной_столбец</structfield> &mdash; это имя столбца, а не таблицы, и что <structname>моя_таблица</structname> &mdash; имя таблицы, а не схемы.

source: (compositecol).*
ru: (составной_столбец).*

source: You can ask for all fields of a composite value by writing <literal>.*</literal>: <placeholder-1/> This notation behaves differently depending on context; see <xref linkend="rowtypes-usage"/> for details.
ru: Вы можете запросить все поля составного значения, написав <literal>.*</literal>: <placeholder-1/> Эта запись действует по-разному в зависимости от контекста; подробнее об этом говорится в <xref remap="6" linkend="rowtypes-usage"/>.

source: Operator Invocations
ru: Применение оператора

source: <primary>operator</primary> <secondary>invocation</secondary>
ru: <primary>оператор</primary> <secondary>вызов</secondary>

source: expression
ru: выражение

source: operator
ru: оператор

source: <placeholder-1/> <placeholder-2/> <placeholder-3/> (binary infix operator)
ru: <placeholder-1/> <placeholder-2/> <placeholder-3/> (бинарный инфиксный оператор)

source: <placeholder-1/> <placeholder-2/> (unary prefix operator)
ru: <placeholder-1/> <placeholder-2/> (унарный префиксный оператор)

source: <placeholder-1/> <placeholder-2/> (unary postfix operator)
ru: <placeholder-1/> <placeholder-2/> (унарный постфиксный оператор)

source: There are three possible syntaxes for an operator invocation: <placeholder-1/> where the <replaceable>operator</replaceable> token follows the syntax rules of <xref linkend="sql-syntax-operators"/>, or is one of the key words <token>AND</token>, <token>OR</token>, and <token>NOT</token>, or is a qualified operator name in the form: <synopsis> <literal>OPERATOR(</literal><replaceable>schema</replaceable><literal>.</literal><replaceable>operatorname</replaceable><literal>)</literal> </synopsis> Which particular operators exist and whether they are unary or binary depends on what operators have been defined by the system or the user. <xref linkend="functions"/> describes the built-in operators.
ru: Существуют три возможных синтаксиса применения операторов: <placeholder-1/>где <replaceable>оператор</replaceable> соответствует синтаксическим правилам, описанным в <xref remap="6" linkend="sql-syntax-operators"/>, либо это одно из ключевых слов <token>AND</token>, <token>OR</token> и <token>NOT</token>, либо полное имя оператора в форме: <synopsis> <literal>OPERATOR(</literal><replaceable>схема</replaceable><literal>.</literal><replaceable>имя_оператора</replaceable><literal>)</literal> </synopsis> Существование конкретных операторов и их тип (унарный или бинарный) зависит от того, как и какие операторы определены системой и пользователем. Встроенные операторы описаны в <xref remap="6" linkend="functions"/>.

source: Function Calls
ru: Вызовы функций

source: <primary>function</primary> <secondary>invocation</secondary>
ru: <primary>функция</primary> <secondary>вызов</secondary>

source: The syntax for a function call is the name of a function (possibly qualified with a schema name), followed by its argument list enclosed in parentheses: <synopsis> <replaceable>function_name</replaceable> (<optional><replaceable>expression</replaceable> <optional>, <replaceable>expression</replaceable> ... </optional></optional> ) </synopsis>
ru: Вызов функции записывается просто как имя функции (возможно, дополненное именем схемы) и список аргументов в скобках: <synopsis> <replaceable>имя_функции</replaceable> (<optional><replaceable>выражение</replaceable> <optional>, <replaceable>выражение</replaceable> ... </optional></optional>) </synopsis>

source: For example, the following computes the square root of 2: <placeholder-1/>
ru: Например, так вычисляется квадратный корень из 2: <placeholder-1/>

source: The list of built-in functions is in <xref linkend="functions"/>. Other functions can be added by the user.
ru: Список встроенных функций приведён в <xref remap="6" linkend="functions"/>. Пользователь также может определить и другие функции.

source: The arguments can optionally have names attached. See <xref linkend="sql-syntax-calling-funcs"/> for details.
ru: Аргументам могут быть присвоены необязательные имена. Подробнее об этом см. <xref remap="4" linkend="sql-syntax-calling-funcs"/>.

source: A function that takes a single argument of composite type can optionally be called using field-selection syntax, and conversely field selection can be written in functional style. That is, the notations <literal>col(table)</literal> and <literal>table.col</literal> are interchangeable. This behavior is not SQL-standard but is provided in <productname>PostgreSQL</productname> because it allows use of functions to emulate <quote>computed fields</quote>. For more information see <xref linkend="rowtypes-usage"/>.
ru: Функцию, принимающую один аргумент составного типа, можно также вызывать, используя синтаксис выбора поля, и наоборот, выбор поля можно записать в функциональном стиле. То есть записи <literal>col(table)</literal> и <literal>table.col</literal> равносильны и взаимозаменяемы. Это поведение не оговорено стандартом SQL, но реализовано в <productname>PostgreSQL</productname>, так как это позволяет использовать функции для эмуляции <quote>вычисляемых полей</quote>. Подробнее это описано в <xref remap="6" linkend="rowtypes-usage"/>.

source: Aggregate Expressions
ru: Агрегатные выражения

source: <primary>aggregate function</primary> <secondary>invocation</secondary>
ru: <primary>агрегатная функция</primary> <secondary>вызов</secondary>

source: <primary>ordered-set aggregate</primary>
ru: <primary>сортирующая агрегатная функция</primary>

source: An <firstterm>aggregate expression</firstterm> represents the application of an aggregate function across the rows selected by a query. An aggregate function reduces multiple inputs to a single output value, such as the sum or average of the inputs. The syntax of an aggregate expression is one of the following: <synopsis> <replaceable>aggregate_name</replaceable> (<replaceable>expression</replaceable> [ , ... ] [ <replaceable>order_by_clause</replaceable> ] ) [ FILTER ( WHERE <replaceable>filter_clause</replaceable> ) ] <replaceable>aggregate_name</replaceable> (ALL <replaceable>expression</replaceable> [ , ... ] [ <replaceable>order_by_clause</replaceable> ] ) [ FILTER ( WHERE <replaceable>filter_clause</replaceable> ) ] <replaceable>aggregate_name</replaceable> (DISTINCT <replaceable>expression</replaceable> [ , ... ] [ <replaceable>order_by_clause</replaceable> ] ) [ FILTER ( WHERE <replaceable>filter_clause</replaceable> ) ] <replaceable>aggregate_name</replaceable> ( * ) [ FILTER ( WHERE <replaceable>filter_clause</replaceable> ) ] <replaceable>aggregate_name</replaceable> ( [ <replaceable>expression</replaceable> [ , ... ] ] ) WITHIN GROUP ( <replaceable>order_by_clause</replaceable> ) [ FILTER ( WHERE <replaceable>filter_clause</replaceable> ) ] </synopsis> where <replaceable>aggregate_name</replaceable> is a previously defined aggregate (possibly qualified with a schema name) and <replaceable>expression</replaceable> is any value expression that does not itself contain an aggregate expression or a window function call. The optional <replaceable>order_by_clause</replaceable> and <replaceable>filter_clause</replaceable> are described below.
ru: <firstterm>Агрегатное выражение</firstterm> представляет собой применение агрегатной функции к строкам, выбранным запросом. Агрегатная функция сводит множество входных значений к одному выходному, как например, сумма или среднее. Агрегатное выражение может записываться следующим образом: <synopsis> <replaceable>агрегатная_функция</replaceable> (<replaceable>выражение</replaceable> [ , ... ] [ <replaceable>предложение_order_by</replaceable> ] ) [ FILTER ( WHERE <replaceable>условие_фильтра</replaceable> ) ] <replaceable>агрегатная_функция</replaceable> (ALL <replaceable>выражение</replaceable> [ , ... ] [ <replaceable>предложение_order_by</replaceable> ] ) [ FILTER ( WHERE <replaceable>условие_фильтра</replaceable> ) ] <replaceable>агрегатная_функция</replaceable> (DISTINCT <replaceable>выражение</replaceable> [ , ... ] [ <replaceable>предложение_order_by</replaceable> ] ) [ FILTER ( WHERE <replaceable>условие_фильтра</replaceable> ) ] <replaceable>агрегатная_функция</replaceable> ( * ) [ FILTER ( WHERE <replaceable>условие_фильтра</replaceable> ) ] <replaceable>агрегатная_функция</replaceable> ( [ <replaceable>выражение</replaceable> [ , ... ] ] ) WITHIN GROUP ( <replaceable>предложение_order_by</replaceable> ) [ FILTER ( WHERE <replaceable>условие_фильтра</replaceable> ) ] </synopsis> Здесь <replaceable>агрегатная_функция</replaceable> &mdash; имя ранее определённой агрегатной функции (возможно, дополненное именем схемы), <replaceable>выражение</replaceable> &mdash; любое выражение значения, не содержащее в себе агрегатного выражения или вызова оконной функции. Необязательные предложения <replaceable>предложение_order_by</replaceable> и <replaceable>условие_фильтра</replaceable> описываются ниже.

source: The first form of aggregate expression invokes the aggregate once for each input row. The second form is the same as the first, since <literal>ALL</literal> is the default. The third form invokes the aggregate once for each distinct value of the expression (or distinct set of values, for multiple expressions) found in the input rows. The fourth form invokes the aggregate once for each input row; since no particular input value is specified, it is generally only useful for the <function>count(*)</function> aggregate function. The last form is used with <firstterm>ordered-set</firstterm> aggregate functions, which are described below.
ru: В первой форме агрегатного выражения агрегатная функция вызывается для каждой строки. Вторая форма эквивалентна первой, так как указание <literal>ALL</literal> подразумевается по умолчанию. В третьей форме агрегатная функция вызывается для всех различных значений выражения (или набора различных значений, для нескольких выражений), выделенных во входных данных. В четвёртой форме агрегатная функция вызывается для каждой строки, так как никакого конкретного значения не указано (обычно это имеет смысл только для функции <function>count(*)</function>). В последней форме используются <firstterm>сортирующие</firstterm> агрегатные функции, которые будут описаны ниже.

source: Most aggregate functions ignore null inputs, so that rows in which one or more of the expression(s) yield null are discarded. This can be assumed to be true, unless otherwise specified, for all built-in aggregates.
ru: Большинство агрегатных функций игнорируют значения NULL, так что строки, для которых выражения выдают одно или несколько значений NULL, отбрасываются. Это можно считать истинным для всех встроенных операторов, если явно не говорится об обратном.

source: For example, <literal>count(*)</literal> yields the total number of input rows; <literal>count(f1)</literal> yields the number of input rows in which <literal>f1</literal> is non-null, since <function>count</function> ignores nulls; and <literal>count(distinct f1)</literal> yields the number of distinct non-null values of <literal>f1</literal>.
ru: Например, <literal>count(*)</literal> подсчитает общее количество строк, а <literal>count(f1)</literal> только количество строк, в которых <literal>f1</literal> не NULL (так как <function>count</function> игнорирует NULL), а <literal>count(distinct f1)</literal> подсчитает число различных и отличных от NULL значений столбца <literal>f1</literal>.

source: Ordinarily, the input rows are fed to the aggregate function in an unspecified order. In many cases this does not matter; for example, <function>min</function> produces the same result no matter what order it receives the inputs in. However, some aggregate functions (such as <function>array_agg</function> and <function>string_agg</function>) produce results that depend on the ordering of the input rows. When using such an aggregate, the optional <replaceable>order_by_clause</replaceable> can be used to specify the desired ordering. The <replaceable>order_by_clause</replaceable> has the same syntax as for a query-level <literal>ORDER BY</literal> clause, as described in <xref linkend="queries-order"/>, except that its expressions are always just expressions and cannot be output-column names or numbers. For example: <placeholder-1/>
ru: Обычно строки данных передаются агрегатной функции в неопределённом порядке и во многих случаях это не имеет значения, например функция <function>min</function> выдаёт один и тот же результат независимо от порядка поступающих данных. Однако некоторые агрегатные функции (такие как <function>array_agg</function> и <function>string_agg</function>) выдают результаты, зависящие от порядка данных. Для таких агрегатных функций можно добавить <replaceable>предложение_order_by</replaceable> и задать нужный порядок. Это <replaceable>предложение_order_by</replaceable> имеет тот же синтаксис, что и предложение <literal>ORDER BY</literal> на уровне запроса, как описано в <xref remap="6" linkend="queries-order"/>, за исключением того, что его выражения должны быть просто выражениями, а не именами результирующих столбцов или числами. Например: <placeholder-1/>

source: SELECT string_agg(a ORDER BY a, ',') FROM table; -- incorrect
ru: SELECT string_agg(a ORDER BY a, ',') FROM table; -- неправильно

source: When dealing with multiple-argument aggregate functions, note that the <literal>ORDER BY</literal> clause goes after all the aggregate arguments. For example, write this: <placeholder-1/> not this: <placeholder-2/> The latter is syntactically valid, but it represents a call of a single-argument aggregate function with two <literal>ORDER BY</literal> keys (the second one being rather useless since it's a constant).
ru: Заметьте, что при использовании агрегатных функций с несколькими аргументами, предложение <literal>ORDER BY</literal> идёт после всех аргументов. Например, надо писать так: <placeholder-1/> а не так: <placeholder-2/> Последний вариант синтаксически допустим, но он представляет собой вызов агрегатной функции одного аргумента с двумя ключами <literal>ORDER BY</literal> (при этом второй не имеет смысла, так как это константа).

source: If <literal>DISTINCT</literal> is specified in addition to an <replaceable>order_by_clause</replaceable>, then all the <literal>ORDER BY</literal> expressions must match regular arguments of the aggregate; that is, you cannot sort on an expression that is not included in the <literal>DISTINCT</literal> list.
ru: Если <replaceable>предложение_order_by</replaceable> дополнено указанием <literal>DISTINCT</literal>, тогда все выражения <literal>ORDER BY</literal> должны соответствовать обычным аргументам агрегатной функции; то есть вы не можете сортировать строки по выражению, не включённому в список <literal>DISTINCT</literal>.

source: The ability to specify both <literal>DISTINCT</literal> and <literal>ORDER BY</literal> in an aggregate function is a <productname>PostgreSQL</productname> extension.
ru: Возможность указывать и <literal>DISTINCT</literal>, и <literal>ORDER BY</literal> в агрегатной функции &mdash; это расширение <productname>PostgreSQL</productname>.
