Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/syntax.po
Languages: ru

source: A constant of an <emphasis>arbitrary</emphasis> type can be entered using any one of the following notations: <synopsis> <replaceable>type</replaceable> '<replaceable>string</replaceable>' '<replaceable>string</replaceable>'::<replaceable>type</replaceable> CAST ( '<replaceable>string</replaceable>' AS <replaceable>type</replaceable> ) </synopsis> The string constant's text is passed to the input conversion routine for the type called <replaceable>type</replaceable>. The result is a constant of the indicated type. The explicit type cast can be omitted if there is no ambiguity as to the type the constant must be (for example, when it is assigned directly to a table column), in which case it is automatically coerced.
ru: Константу <emphasis>обычного</emphasis> типа можно ввести одним из следующих способов: <synopsis> <replaceable>type</replaceable> '<replaceable>string</replaceable>' '<replaceable>string</replaceable>'::<replaceable>type</replaceable> CAST ( '<replaceable>string</replaceable>' AS <replaceable>type</replaceable> ) </synopsis> Текст строковой константы передаётся процедуре преобразования ввода для типа, обозначенного здесь <replaceable>type</replaceable>. Результатом становится константа указанного типа. Явное приведение типа можно опустить, если нужный тип константы определяется однозначно (например, когда она присваивается непосредственно столбцу таблицы), так как в этом случае приведение происходит автоматически.

source: The string constant can be written using either regular SQL notation or dollar-quoting.
ru: Строковую константу можно записать, используя как обычный синтаксис SQL, так и формат с долларами.

source: It is also possible to specify a type coercion using a function-like syntax: <synopsis> <replaceable>typename</replaceable> ( '<replaceable>string</replaceable>' ) </synopsis> but not all type names can be used in this way; see <xref linkend="sql-syntax-type-casts"/> for details.
ru: Также можно записать приведение типов, используя синтаксис функций: <synopsis> <replaceable>typename</replaceable> ( '<replaceable>string</replaceable>' ) </synopsis>но это работает не для всех имён типов; подробнее об этом написано в <xref remap="6" linkend="sql-syntax-type-casts"/>.

source: The <literal>::</literal>, <literal>CAST()</literal>, and function-call syntaxes can also be used to specify run-time type conversions of arbitrary expressions, as discussed in <xref linkend="sql-syntax-type-casts"/>. To avoid syntactic ambiguity, the <literal><replaceable>type</replaceable> '<replaceable>string</replaceable>'</literal> syntax can only be used to specify the type of a simple literal constant. Another restriction on the <literal><replaceable>type</replaceable> '<replaceable>string</replaceable>'</literal> syntax is that it does not work for array types; use <literal>::</literal> or <literal>CAST()</literal> to specify the type of an array constant.
ru: Конструкцию <literal>::</literal>, <literal>CAST()</literal> и синтаксис вызова функции можно также использовать для преобразования типов обычных выражений во время выполнения, как описано в <xref remap="6" linkend="sql-syntax-type-casts"/>. Во избежание синтаксической неопределённости, запись <literal><replaceable>тип</replaceable> '<replaceable>строка</replaceable>'</literal> можно использовать только для указания типа простой текстовой константы. Ещё одно ограничение записи <literal><replaceable>тип</replaceable> '<replaceable>строка</replaceable>'</literal>: она не работает для массивов; для таких констант следует использовать <literal>::</literal> или <literal>CAST()</literal>.

source: The <literal>CAST()</literal> syntax conforms to SQL. The <literal><replaceable>type</replaceable> '<replaceable>string</replaceable>'</literal> syntax is a generalization of the standard: SQL specifies this syntax only for a few data types, but <productname>PostgreSQL</productname> allows it for all types. The syntax with <literal>::</literal> is historical <productname>PostgreSQL</productname> usage, as is the function-call syntax.
ru: Синтаксис <literal>CAST()</literal> соответствует SQL, а запись <literal><replaceable>type</replaceable> '<replaceable>string</replaceable>'</literal> является обобщением стандарта: в SQL такой синтаксис поддерживает только некоторые типы данных, но <productname>PostgreSQL</productname> позволяет использовать его для всех. Синтаксис с <literal>::</literal> имеет исторические корни в <productname>PostgreSQL</productname>, как и запись в виде вызова функции.

source: Operators
ru: Операторы

source: <primary>operator</primary> <secondary>syntax</secondary>
ru: <primary>оператор</primary> <secondary>синтаксис</secondary>

source: <literal>--</literal> and <literal>/*</literal> cannot appear anywhere in an operator name, since they will be taken as the start of a comment.
ru: Сочетания символов <literal>--</literal> и <literal>/*</literal> не могут присутствовать в имени оператора, так как они будут обозначать начало комментария.

source: A multiple-character operator name cannot end in <literal>+</literal> or <literal>-</literal>, unless the name also contains at least one of these characters: <literallayout> ~ ! @ # % ^ &amp; | ` ? </literallayout> For example, <literal>@-</literal> is an allowed operator name, but <literal>*-</literal> is not. This restriction allows <productname>PostgreSQL</productname> to parse SQL-compliant queries without requiring spaces between tokens.
ru: Многосимвольное имя оператора не может заканчиваться знаком <literal>+</literal> или <literal>-</literal>, если только оно не содержит также один из этих символов: <literallayout> ~ ! @ # % ^ &amp; | ` ? </literallayout> Например, <literal>@-</literal> &mdash; допустимое имя оператора, а <literal>*-</literal> &mdash; нет. Благодаря этому ограничению, <productname>PostgreSQL</productname> может разбирать корректные SQL-запросы без пробелов между компонентами.

source: An operator name is a sequence of up to <symbol>NAMEDATALEN</symbol>-1 (63 by default) characters from the following list: <literallayout> + - * / &lt; &gt; = ~ ! @ # % ^ &amp; | ` ? </literallayout> There are a few restrictions on operator names, however: <placeholder-1/>
ru: Имя оператора образует последовательность не более чем <symbol>NAMEDATALEN</symbol>-1 (по умолчанию 63) символов из следующего списка: <literallayout> + - * / &lt; &gt; = ~ ! @ # % ^ &amp; | ` ? </literallayout> Однако для имён операторов есть ещё несколько ограничений: <placeholder-1/>

source: When working with non-SQL-standard operator names, you will usually need to separate adjacent operators with spaces to avoid ambiguity. For example, if you have defined a left unary operator named <literal>@</literal>, you cannot write <literal>X*@Y</literal>; you must write <literal>X* @Y</literal> to ensure that <productname>PostgreSQL</productname> reads it as two operator names not one.
ru: Записывая нестандартные SQL-операторы, обычно нужно отделять имена соседних операторов пробелами для однозначности. Например, если вы определили левый унарный оператор с именем <literal>@</literal>, вы не можете написать <literal>X*@Y</literal>, а должны написать <literal>X* @Y</literal>, чтобы <productname>PostgreSQL</productname> однозначно прочитал это как два оператора, а не один.

source: Special Characters
ru: Специальные знаки

source: A dollar sign (<literal>$</literal>) followed by digits is used to represent a positional parameter in the body of a function definition or a prepared statement. In other contexts the dollar sign can be part of an identifier or a dollar-quoted string constant.
ru: Знак доллара (<literal>$</literal>), предваряющий число, используется для представления позиционного параметра в теле определения функции или подготовленного оператора. В других контекстах знак доллара может быть частью идентификатора или строковой константы, заключённой в доллары.

source: Parentheses (<literal>()</literal>) have their usual meaning to group expressions and enforce precedence. In some cases parentheses are required as part of the fixed syntax of a particular SQL command.
ru: Круглые скобки (<literal>()</literal>) имеют обычное значение и применяются для группировки выражений и повышения приоритета операций. В некоторых случаях скобки &mdash; это необходимая часть синтаксиса определённых SQL-команд.

source: Brackets (<literal>[]</literal>) are used to select the elements of an array. See <xref linkend="arrays"/> for more information on arrays.
ru: Квадратные скобки (<literal>[]</literal>) применяются для выделения элементов массива. Подробнее массивы рассматриваются в <xref remap="6" linkend="arrays"/>.

source: Commas (<literal>,</literal>) are used in some syntactical constructs to separate the elements of a list.
ru: Запятые (<literal>,</literal>) используются в некоторых синтаксических конструкциях для разделения элементов списка.

source: The semicolon (<literal>;</literal>) terminates an SQL command. It cannot appear anywhere within a command, except within a string constant or quoted identifier.
ru: Точка с запятой (<literal>;</literal>) завершает команду SQL. Она не может находиться нигде внутри команды, за исключением строковых констант или идентификаторов в кавычках.

source: The colon (<literal>:</literal>) is used to select <quote>slices</quote> from arrays. (See <xref linkend="arrays"/>.) In certain SQL dialects (such as Embedded SQL), the colon is used to prefix variable names.
ru: Двоеточие (<literal>:</literal>) применяется для выборки <quote>срезов</quote> массивов (см. <xref remap="4" linkend="arrays"/>.) В некоторых диалектах SQL (например, в Embedded SQL) двоеточие может быть префиксом в имени переменной.

source: The asterisk (<literal>*</literal>) is used in some contexts to denote all the fields of a table row or composite value. It also has a special meaning when used as the argument of an aggregate function, namely that the aggregate does not require any explicit parameter.
ru: Звёздочка (<literal>*</literal>) используется в некоторых контекстах как обозначение всех полей строки или составного значения. Она также имеет специальное значение, когда используется как аргумент некоторых агрегатных функций, а именно функций, которым не нужны явные параметры.

source: The period (<literal>.</literal>) is used in numeric constants, and to separate schema, table, and column names.
ru: Точка (<literal>.</literal>) используется в числовых константах, а также для отделения имён схемы, таблицы и столбца.

source: Some characters that are not alphanumeric have a special meaning that is different from being an operator. Details on the usage can be found at the location where the respective syntax element is described. This section only exists to advise the existence and summarize the purposes of these characters. <placeholder-1/>
ru: Некоторые не алфавитно-цифровые символы имеют специальное значение, но при этом не являются операторами. Подробнее их использование будет рассмотрено при описании соответствующего элемента синтаксиса. Здесь они упоминаются только для сведения и обобщения их предназначения. <placeholder-1/>

source: Comments
ru: Комментарии

source: <primary>comment</primary> <secondary sortas="SQL">in SQL</secondary>
ru: <primary>комментарий</primary> <secondary sortas="SQL">в SQL</secondary>

source: -- This is a standard SQL comment
ru: -- Это стандартный комментарий SQL

source: A comment is a sequence of characters beginning with double dashes and extending to the end of the line, e.g.: <placeholder-1/>
ru: Комментарий &mdash; это последовательность символов, которая начинается с двух минусов и продолжается до конца строки, например: <placeholder-1/>

source: /* multiline comment * with nesting: /* nested block comment */ */
ru: /* многострочный комментарий * с вложенностью: /* вложенный блок комментария */ */

source: Alternatively, C-style block comments can be used: <placeholder-1/> where the comment begins with <literal>/*</literal> and extends to the matching occurrence of <literal>*/</literal>. These block comments nest, as specified in the SQL standard but unlike C, so that one can comment out larger blocks of code that might contain existing block comments.
ru: Кроме этого, блочные комментарии можно записывать в стиле C: <placeholder-1/> где комментарий начинается с <literal>/*</literal> и продолжается до соответствующего вхождения <literal>*/</literal>. Блочные комментарии можно вкладывать друг в друга, как разрешено по стандарту SQL (но не разрешено в C), так что вы можете комментировать большие блоки кода, которые при этом уже могут содержать блоки комментариев.

source: A comment is removed from the input stream before further syntax analysis and is effectively replaced by whitespace.
ru: Комментарий удаляется из входного потока в начале синтаксического анализа и фактически заменяется пробелом.

source: Operator Precedence
ru: Приоритеты операторов

source: <primary>operator</primary> <secondary>precedence</secondary>
ru: <primary>оператор</primary> <secondary>приоритеты</secondary>

source: <xref linkend="sql-precedence-table"/> shows the precedence and associativity of the operators in <productname>PostgreSQL</productname>. Most operators have the same precedence and are left-associative. The precedence and associativity of the operators is hard-wired into the parser.
ru: В <xref remap="6" linkend="sql-precedence-table"/> показаны приоритеты и очерёдность операторов, действующие в <productname>PostgreSQL</productname>. Большинство операторов имеют одинаковый приоритет и вычисляются слева направо. Приоритет и очерёдность операторов жёстко фиксированы в синтаксическом анализаторе.

source: You will sometimes need to add parentheses when using combinations of binary and unary operators. For instance: <placeholder-1/> will be parsed as: <placeholder-2/> because the parser has no idea &mdash; until it is too late &mdash; that <token>!</token> is defined as a postfix operator, not an infix one. To get the desired behavior in this case, you must write: <placeholder-3/> This is the price one pays for extensibility.
ru: Иногда вам потребуется добавлять скобки, когда вы комбинируете унарные и бинарные операторы. Например, выражение: <placeholder-1/> будет разобрано как: <placeholder-2/> так как анализатор до последнего не знает, что оператор <token>!</token> определён как постфиксный, а не инфиксный (внутренний). Чтобы получить желаемый результат в этом случае, нужно написать: <placeholder-3/> Такова цена расширяемости.

source: Operator Precedence (highest to lowest)
ru: Приоритет операторов (от большего к меньшему)

source: Operator/Element
ru: Оператор/элемент

source: Associativity
ru: Очерёдность

source: Description
ru: Описание

source: left
ru: слева-направо

source: table/column name separator
ru: разделитель имён таблицы и столбца

source: <productname>PostgreSQL</productname>-style typecast
ru: приведение типов в стиле <productname>PostgreSQL</productname>

source: array element selection
ru: выбор элемента массива

source: right
ru: справа-налево

source: unary plus, unary minus
ru: унарный плюс, унарный минус

source: exponentiation
ru: возведение в степень

source: multiplication, division, modulo
ru: умножение, деление, остаток от деления

source: addition, subtraction
ru: сложение, вычитание

source: (any other operator)
ru: (любой другой оператор)

source: all other native and user-defined operators
ru: все другие встроенные и пользовательские операторы

source: range containment, set membership, string matching
ru: проверка диапазона, проверка членства, сравнение строк

source: comparison operators
ru: операторы сравнения

source: <literal>IS TRUE</literal>, <literal>IS FALSE</literal>, <literal>IS NULL</literal>, <literal>IS DISTINCT FROM</literal>, etc
ru: <literal>IS TRUE</literal>, <literal>IS FALSE</literal>, <literal>IS NULL</literal>, <literal>IS DISTINCT FROM</literal> и т. д.

source: logical negation
ru: логическое отрицание

source: logical conjunction
ru: логическая конъюнкция

source: logical disjunction
ru: логическая дизъюнкция

source: Note that the operator precedence rules also apply to user-defined operators that have the same names as the built-in operators mentioned above. For example, if you define a <quote>+</quote> operator for some custom data type it will have the same precedence as the built-in <quote>+</quote> operator, no matter what yours does.
ru: Заметьте, что правила приоритета операторов также применяются к операторам, определённым пользователем с теми же именами, что и вышеперечисленные встроенные операторы. Например, если вы определите оператор <quote>+</quote> для некоторого нестандартного типа данных, он будет иметь тот же приоритет, что и встроенный оператор <quote>+</quote>, независимо от того, что он у вас делает.

source: When a schema-qualified operator name is used in the <literal>OPERATOR</literal> syntax, as for example in: <placeholder-1/> the <literal>OPERATOR</literal> construct is taken to have the default precedence shown in <xref linkend="sql-precedence-table"/> for <quote>any other operator</quote>. This is true no matter which specific operator appears inside <literal>OPERATOR()</literal>.
ru: Когда в конструкции <literal>OPERATOR</literal> используется имя оператора со схемой, например так: <placeholder-1/> тогда <literal>OPERATOR</literal> имеет приоритет по умолчанию, соответствующий в <xref remap="6" linkend="sql-precedence-table"/> строке <quote>любой другой оператор</quote>. Это не зависит от того, какие именно операторы находятся в конструкции <literal>OPERATOR()</literal>.

source: <productname>PostgreSQL</productname> versions before 9.5 used slightly different operator precedence rules. In particular, <token>&lt;=</token> <token>&gt;=</token> and <token>&lt;&gt;</token> used to be treated as generic operators; <literal>IS</literal> tests used to have higher priority; and <literal>NOT BETWEEN</literal> and related constructs acted inconsistently, being taken in some cases as having the precedence of <literal>NOT</literal> rather than <literal>BETWEEN</literal>. These rules were changed for better compliance with the SQL standard and to reduce confusion from inconsistent treatment of logically equivalent constructs. In most cases, these changes will result in no behavioral change, or perhaps in <quote>no such operator</quote> failures which can be resolved by adding parentheses. However there are corner cases in which a query might change behavior without any parsing error being reported. If you are concerned about whether these changes have silently broken something, you can test your application with the configuration parameter <xref linkend="guc-operator-precedence-warning"/> turned on to see if any warnings are logged.
ru: В <productname>PostgreSQL</productname> до версии 9.5 действовали немного другие правила приоритета операторов. В частности, операторы <token>&lt;=</token>, <token>&gt;=</token> и <token>&lt;&gt;</token> обрабатывались по общему правилу; проверки <literal>IS</literal> имели более высокий приоритет; а <literal>NOT BETWEEN</literal> и связанные конструкции работали несогласованно — в некоторых случаях приоритетнее оказывался оператор <literal>NOT</literal>, а не <literal>BETWEEN</literal>. Эти правила были изменены для лучшего соответствия стандарту SQL и для уменьшения путаницы из-за несогласованной обработки логически равнозначных конструкций. В большинстве случаев эти изменения никак не проявятся, либо могут привести к ошибкам типа <quote>нет такого оператора</quote>, которые можно разрешить, добавив скобки. Однако, возможны особые случаи, когда запрос будет разобран без ошибки, но его поведение может измениться. Если вас беспокоит, не нарушают ли эти изменения незаметно работу вашего приложения, вы можете проверить это, включив конфигурационный параметр <xref linkend="guc-operator-precedence-warning"/> и пронаблюдав, не появятся ли предупреждения в журнале.

source: Value Expressions
ru: Выражения значения

source: <primary>expression</primary> <secondary>syntax</secondary>
ru: <primary>выражение</primary> <secondary>синтаксис</secondary>

source: <primary>value expression</primary>
ru: <primary>выражение значения</primary>

source: <primary>scalar</primary> <see>expression</see>
ru: <primary>скаляр</primary> <see>выражение</see>

source: Value expressions are used in a variety of contexts, such as in the target list of the <command>SELECT</command> command, as new column values in <command>INSERT</command> or <command>UPDATE</command>, or in search conditions in a number of commands. The result of a value expression is sometimes called a <firstterm>scalar</firstterm>, to distinguish it from the result of a table expression (which is a table). Value expressions are therefore also called <firstterm>scalar expressions</firstterm> (or even simply <firstterm>expressions</firstterm>). The expression syntax allows the calculation of values from primitive parts using arithmetic, logical, set, and other operations.
ru: Выражения значения применяются в самых разных контекстах, например в списке результатов команды <command>SELECT</command>, в значениях столбцов в <command>INSERT</command> или <command>UPDATE</command> или в условиях поиска во многих командах. Результат такого выражения иногда называют <firstterm>скаляром</firstterm>, чтобы отличить его от результата табличного выражения (который представляет собой таблицу). А сами выражения значения часто называют <firstterm>скалярными</firstterm> (или просто <firstterm>выражениями</firstterm>). Синтаксис таких выражений позволяет вычислять значения из примитивных частей, используя арифметические, логические и другие операции.

source: A constant or literal value
ru: Константа или непосредственное значение

source: A column reference
ru: Ссылка на столбец

source: A positional parameter reference, in the body of a function definition or prepared statement
ru: Ссылка на позиционный параметр в теле определения функции или подготовленного оператора

source: A subscripted expression
ru: Выражение с индексом

source: A field selection expression
ru: Выражение выбора поля

source: An operator invocation
ru: Применение оператора

source: A function call
ru: Вызов функции

source: An aggregate expression
ru: Агрегатное выражение

source: A window function call
ru: Вызов оконной функции

source: A type cast
ru: Приведение типов

source: A collation expression
ru: Применение правил сортировки

source: A scalar subquery
ru: Скалярный подзапрос

source: An array constructor
ru: Конструктор массива

source: A row constructor
ru: Конструктор табличной строки

source: <primary>parenthesis</primary>
ru: <primary>скобки</primary>

source: Another value expression in parentheses (used to group subexpressions and override precedence<placeholder-1/>)
ru: Кроме того, выражением значения являются скобки (предназначенные для группировки подвыражений и переопределения приоритета <placeholder-1/>)

source: A value expression is one of the following: <placeholder-1/>
ru: Выражениями значения являются: <placeholder-1/>

source: In addition to this list, there are a number of constructs that can be classified as an expression but do not follow any general syntax rules. These generally have the semantics of a function or operator and are explained in the appropriate location in <xref linkend="functions"/>. An example is the <literal>IS NULL</literal> clause.
ru: В дополнение к этому списку есть ещё несколько конструкций, которые можно классифицировать как выражения, хотя они не соответствуют общим синтаксическим правилам. Они обычно имеют вид функции или оператора и будут рассмотрены в соответствующем разделе <xref remap="2" linkend="functions"/>. Пример такой конструкции &mdash; предложение <literal>IS NULL</literal>.
