Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/syntax.po
Languages: ru

source: Placing <literal>ORDER BY</literal> within the aggregate's regular argument list, as described so far, is used when ordering the input rows for a <quote>normal</quote> aggregate for which ordering is optional. There is a subclass of aggregate functions called <firstterm>ordered-set aggregates</firstterm> for which an <replaceable>order_by_clause</replaceable> is <emphasis>required</emphasis>, usually because the aggregate's computation is only sensible in terms of a specific ordering of its input rows. Typical examples of ordered-set aggregates include rank and percentile calculations. For an ordered-set aggregate, the <replaceable>order_by_clause</replaceable> is written inside <literal>WITHIN GROUP (...)</literal>, as shown in the final syntax alternative above. The expressions in the <replaceable>order_by_clause</replaceable> are evaluated once per input row just like normal aggregate arguments, sorted as per the <replaceable>order_by_clause</replaceable>'s requirements, and fed to the aggregate function as input arguments. (This is unlike the case for a non-<literal>WITHIN GROUP</literal> <replaceable>order_by_clause</replaceable>, which is not treated as argument(s) to the aggregate function.) The argument expressions preceding <literal>WITHIN GROUP</literal>, if any, are called <firstterm>direct arguments</firstterm> to distinguish them from the <firstterm>aggregated arguments</firstterm> listed in the <replaceable>order_by_clause</replaceable>. Unlike normal aggregate arguments, direct arguments are evaluated only once per aggregate call, not once per input row. This means that they can contain variables only if those variables are grouped by <literal>GROUP BY</literal>; this restriction is the same as if the direct arguments were not inside an aggregate expression at all. Direct arguments are typically used for things like percentile fractions, which only make sense as a single value per aggregation calculation. The direct argument list can be empty; in this case, write just <literal>()</literal> not <literal>(*)</literal>. (<productname>PostgreSQL</productname> will actually accept either spelling, but only the first way conforms to the SQL standard.)
ru: При добавлении <literal>ORDER BY</literal> в обычный список аргументов агрегатной функции, описанном до этого, выполняется сортировка строк для <quote>обычной</quote> агрегатной функции, для которой сортировка необязательна. Но есть подмножество агрегатных функций, <firstterm>сортирующие агрегатные функции</firstterm>, для которых <replaceable>предложение_order</replaceable> является <emphasis>обязательным</emphasis>, обычно потому, что вычисление этой функции имеет смысл только при определённой сортировке входных строк. Типичными примерами сортирующих агрегатных функций являются вычисления ранга и процентиля. Для сортирующей агрегатной функции <replaceable>предложение_order_by</replaceable> записывается внутри <literal>WITHIN GROUP (...)</literal>, что иллюстрирует последний пример, приведённый выше. Выражения в <replaceable>предложении_order_by</replaceable> вычисляются однократно для каждой входной строки как аргументы обычной агрегатной функции, сортируемые в соответствии с требованием <replaceable>предложения_order_by</replaceable>, и поступают в агрегатную функции как входящие аргументы. (Если же <replaceable>предложение_order_by</replaceable> находится не в <literal>WITHIN GROUP</literal>, оно не передаётся как аргумент(ы) агрегатной функции.) Выражения-аргументы, предшествующие <literal>WITHIN GROUP</literal>, (если они есть), называются <firstterm>непосредственными аргументами</firstterm>, а выражения, указанные в <replaceable>предложении_order_by</replaceable> &mdash; <firstterm>агрегируемыми аргументами</firstterm>. В отличие от аргументов обычной агрегатной функции, непосредственные аргументы вычисляются однократно для каждого вызова функции, а не для каждой строки. Это значит, что они могут содержать переменные, только если эти переменные сгруппированы в <literal>GROUP BY</literal>; это суть то же ограничение, что действовало бы, будь эти непосредственные аргументы вне агрегатного выражения. Непосредственные аргументы обычно используются, например, для указания значения процентиля, которое имеет смысл, только если это конкретное число для всего расчёта агрегатной функции. Список непосредственных аргументов может быть пуст; в этом случае запишите просто <literal>()</literal>, но не <literal>(*)</literal>. (На самом деле <productname>PostgreSQL</productname> примет обе записи, но только первая соответствует стандарту SQL.)

source: <primary>median</primary>
ru: <primary>медиана</primary>

source: <primary>median</primary> <seealso>percentile</seealso>
ru: <primary>медиана</primary> <seealso>процентиль</seealso>

source: <placeholder-1/> <placeholder-2/> An example of an ordered-set aggregate call is: <placeholder-3/> which obtains the 50th percentile, or median, value of the <structfield>income</structfield> column from table <structname>households</structname>. Here, <literal>0.5</literal> is a direct argument; it would make no sense for the percentile fraction to be a value varying across rows.
ru: <placeholder-1/> <placeholder-2/> Пример вызова сортирующей агрегатной функции: <placeholder-3/> она получает 50-ый процентиль, или медиану, значения столбца <structfield>income</structfield> из таблицы <structname>households</structname>. В данном случае, <literal>0.5</literal> — это непосредственный аргумент; если бы дробь процентиля менялась от строки к строке, это не имело бы смысла.

source: If <literal>FILTER</literal> is specified, then only the input rows for which the <replaceable>filter_clause</replaceable> evaluates to true are fed to the aggregate function; other rows are discarded. For example: <placeholder-1/>
ru: Если добавлено предложение <literal>FILTER</literal>, агрегатной функции подаются только те входные строки, для которых <replaceable>условие_фильтра</replaceable> вычисляется как истинное; другие строки отбрасываются. Например: <placeholder-1/>

source: The predefined aggregate functions are described in <xref linkend="functions-aggregate"/>. Other aggregate functions can be added by the user.
ru: Предопределённые агрегатные функции описаны в <xref remap="6" linkend="functions-aggregate"/>. Пользователь также может определить другие агрегатные функции.

source: An aggregate expression can only appear in the result list or <literal>HAVING</literal> clause of a <command>SELECT</command> command. It is forbidden in other clauses, such as <literal>WHERE</literal>, because those clauses are logically evaluated before the results of aggregates are formed.
ru: Агрегатное выражение может фигурировать только в списке результатов или в предложении <literal>HAVING</literal> команды <command>SELECT</command>. Во всех остальных предложениях, например <literal>WHERE</literal>, они запрещены, так как эти предложения логически вычисляются до того, как формируются результаты агрегатных функций.

source: When an aggregate expression appears in a subquery (see <xref linkend="sql-syntax-scalar-subqueries"/> and <xref linkend="functions-subquery"/>), the aggregate is normally evaluated over the rows of the subquery. But an exception occurs if the aggregate's arguments (and <replaceable>filter_clause</replaceable> if any) contain only outer-level variables: the aggregate then belongs to the nearest such outer level, and is evaluated over the rows of that query. The aggregate expression as a whole is then an outer reference for the subquery it appears in, and acts as a constant over any one evaluation of that subquery. The restriction about appearing only in the result list or <literal>HAVING</literal> clause applies with respect to the query level that the aggregate belongs to.
ru: Когда агрегатное выражение используется в подзапросе (см. <xref remap="4" linkend="sql-syntax-scalar-subqueries"/> и <xref remap="4" linkend="functions-subquery"/>), оно обычно вычисляется для всех строк подзапроса. Но если в аргументах (или в <replaceable>условии_filter</replaceable>) агрегатной функции есть только переменные внешнего уровня, агрегатная функция относится к ближайшему внешнему уровню и вычисляется для всех строк соответствующего запроса. Такое агрегатное выражение в целом является внешней ссылкой для своего подзапроса и на каждом вычислении считается константой. При этом допустимое положение агрегатной функции ограничивается списком результатов и предложением <literal>HAVING</literal> на том уровне запросов, где она находится.

source: Window Function Calls
ru: Вызовы оконных функций

source: <primary>window function</primary> <secondary>invocation</secondary>
ru: <primary>оконная функция</primary> <secondary>вызов</secondary>

source: <primary>OVER clause</primary>
ru: <primary>предложение OVER</primary>

source: A <firstterm>window function call</firstterm> represents the application of an aggregate-like function over some portion of the rows selected by a query. Unlike regular aggregate function calls, this is not tied to grouping of the selected rows into a single output row &mdash; each row remains separate in the query output. However the window function is able to scan all the rows that would be part of the current row's group according to the grouping specification (<literal>PARTITION BY</literal> list) of the window function call. The syntax of a window function call is one of the following: <synopsis> <replaceable>function_name</replaceable> (<optional><replaceable>expression</replaceable> <optional>, <replaceable>expression</replaceable> ... </optional></optional>) [ FILTER ( WHERE <replaceable>filter_clause</replaceable> ) ] OVER <replaceable>window_name</replaceable> <replaceable>function_name</replaceable> (<optional><replaceable>expression</replaceable> <optional>, <replaceable>expression</replaceable> ... </optional></optional>) [ FILTER ( WHERE <replaceable>filter_clause</replaceable> ) ] OVER ( <replaceable class="parameter">window_definition</replaceable> ) <replaceable>function_name</replaceable> ( * ) [ FILTER ( WHERE <replaceable>filter_clause</replaceable> ) ] OVER <replaceable>window_name</replaceable> <replaceable>function_name</replaceable> ( * ) [ FILTER ( WHERE <replaceable>filter_clause</replaceable> ) ] OVER ( <replaceable class="parameter">window_definition</replaceable> ) </synopsis> where <replaceable class="parameter">window_definition</replaceable> has the syntax <synopsis> [ <replaceable class="parameter">existing_window_name</replaceable> ] [ PARTITION BY <replaceable class="parameter">expression</replaceable> [, ...] ] [ ORDER BY <replaceable class="parameter">expression</replaceable> [ ASC | DESC | USING <replaceable class="parameter">operator</replaceable> ] [ NULLS { FIRST | LAST } ] [, ...] ] [ <replaceable class="parameter">frame_clause</replaceable> ] </synopsis> and the optional <replaceable class="parameter">frame_clause</replaceable> can be one of <synopsis> { RANGE | ROWS } <replaceable>frame_start</replaceable> { RANGE | ROWS } BETWEEN <replaceable>frame_start</replaceable> AND <replaceable>frame_end</replaceable> </synopsis> where <replaceable>frame_start</replaceable> and <replaceable>frame_end</replaceable> can be one of <synopsis> UNBOUNDED PRECEDING <replaceable>value</replaceable> PRECEDING CURRENT ROW <replaceable>value</replaceable> FOLLOWING UNBOUNDED FOLLOWING </synopsis>
ru: <firstterm>Вызов оконной функции</firstterm> представляет собой применение функции, подобной агрегатной, к некоторому набору строк, выбранному запросом. В отличие от обычных агрегатных функций, оконные функции не связаны с группировкой выбранных строк в одну &mdash; каждая строка остаётся отдельной в результате запроса. Однако оконная функция может просканировать все строки, вошедшие в группу текущей строки согласно указанию (списку <literal>PARTITION BY</literal>) при вызове оконной функции. Вызов оконной функции может иметь следующие формы: <synopsis> <replaceable>имя_функции</replaceable> (<optional><replaceable>выражение</replaceable> <optional>, <replaceable>выражение</replaceable> ... </optional></optional>) [ FILTER ( WHERE <replaceable>условие_фильтра</replaceable> ) ] OVER <replaceable>имя_окна</replaceable> <replaceable>имя_функции</replaceable> (<optional><replaceable>выражение</replaceable> <optional>, <replaceable>выражение</replaceable> ... </optional></optional>) [ FILTER ( WHERE <replaceable>условие_фильтра</replaceable> ) ] OVER ( <replaceable class="parameter">определение_окна</replaceable> ) <replaceable>имя_функции</replaceable> ( * ) [ FILTER ( WHERE <replaceable>условие_фильтра</replaceable> ) ] OVER <replaceable>имя_окна</replaceable> <replaceable>имя_функции</replaceable> ( * ) [ FILTER ( WHERE <replaceable>условие_фильтра</replaceable> ) ] OVER ( <replaceable class="parameter">определение_окна</replaceable> ) </synopsis> Здесь <replaceable class="parameter">определение_окна</replaceable> записывается в виде: <synopsis> [ <replaceable class="parameter">имя_существующего_окна</replaceable> ] [ PARTITION BY <replaceable class="parameter">выражение</replaceable> [, ...] ] [ ORDER BY <replaceable class="parameter">выражение</replaceable> [ ASC | DESC | USING <replaceable class="parameter">оператор</replaceable> ] [ NULLS { FIRST | LAST } ] [, ...] ] [ <replaceable class="parameter">определение_рамки</replaceable> ] </synopsis> и необязательное <replaceable class="parameter">определение_рамки</replaceable> может иметь вид: <synopsis> { RANGE | ROWS } <replaceable>начало_рамки</replaceable> { RANGE | ROWS } BETWEEN <replaceable>начало_рамки</replaceable> AND <replaceable>конец_рамки</replaceable> </synopsis> Здесь <replaceable>начало_рамки</replaceable> и <replaceable>конец_рамки</replaceable> задаются одним из следующих способов: <synopsis> UNBOUNDED PRECEDING <replaceable>значение</replaceable> PRECEDING CURRENT ROW <replaceable>значение</replaceable> FOLLOWING UNBOUNDED FOLLOWING </synopsis>

source: Here, <replaceable>expression</replaceable> represents any value expression that does not itself contain window function calls.
ru: Здесь <replaceable>выражение</replaceable> &mdash; это любое выражение значения, не содержащее вызовов оконных функций.

source: <replaceable>window_name</replaceable> is a reference to a named window specification defined in the query's <literal>WINDOW</literal> clause. Alternatively, a full <replaceable>window_definition</replaceable> can be given within parentheses, using the same syntax as for defining a named window in the <literal>WINDOW</literal> clause; see the <xref linkend="sql-select"/> reference page for details. It's worth pointing out that <literal>OVER wname</literal> is not exactly equivalent to <literal>OVER (wname)</literal>; the latter implies copying and modifying the window definition, and will be rejected if the referenced window specification includes a frame clause.
ru: <replaceable>имя_окна</replaceable> &mdash; ссылка на именованное окно, определённое предложением <literal>WINDOW</literal> в данном запросе. Также возможно написать в скобках полное <replaceable>определение_окна</replaceable>, используя тот же синтаксис определения именованного окна в предложении <literal>WINDOW</literal>; подробнее это описано в справке по <xref linkend="sql-select"/>. Стоит отметить, что запись <literal>OVER имя_окна</literal> не полностью равнозначна <literal>OVER (имя_окна)</literal>; последний вариант подразумевает копирование и изменение определения окна и не будет допустимым, если определение этого окна включает определение рамки.

source: The <literal>PARTITION BY</literal> option groups the rows of the query into <firstterm>partitions</firstterm>, which are processed separately by the window function. <literal>PARTITION BY</literal> works similarly to a query-level <literal>GROUP BY</literal> clause, except that its expressions are always just expressions and cannot be output-column names or numbers. Without <literal>PARTITION BY</literal>, all rows produced by the query are treated as a single partition. The <literal>ORDER BY</literal> option determines the order in which the rows of a partition are processed by the window function. It works similarly to a query-level <literal>ORDER BY</literal> clause, but likewise cannot use output-column names or numbers. Without <literal>ORDER BY</literal>, rows are processed in an unspecified order.
ru: Указание <literal>PARTITION BY</literal> группирует строки запроса в <firstterm>разделы</firstterm>, которые затем обрабатываются оконной функцией независимо друг от друга. <literal>PARTITION BY</literal> работает подобно предложению <literal>GROUP BY</literal> на уровне запроса, за исключением того, что его аргументы всегда просто выражения, а не имена выходных столбцов или числа. Без <literal>PARTITION BY</literal> все строки, выдаваемые запросом, рассматриваются как один раздел. Указание <literal>ORDER BY</literal> определяет порядок, в котором оконная функция обрабатывает строки раздела. Оно так же подобно предложению <literal>ORDER BY</literal> на уровне запроса и так же не принимает имена выходных столбцов или числа. Без <literal>ORDER BY</literal> строки обрабатываются в неопределённом порядке.

source: The <replaceable class="parameter">frame_clause</replaceable> specifies the set of rows constituting the <firstterm>window frame</firstterm>, which is a subset of the current partition, for those window functions that act on the frame instead of the whole partition. The frame can be specified in either <literal>RANGE</literal> or <literal>ROWS</literal> mode; in either case, it runs from the <replaceable>frame_start</replaceable> to the <replaceable>frame_end</replaceable>. If <replaceable>frame_end</replaceable> is omitted, it defaults to <literal>CURRENT ROW</literal>.
ru: <replaceable class="parameter">определение_рамки</replaceable> задаёт набор строк, образующих <firstterm>рамку окна</firstterm>, которая представляет собой подмножество строк текущего раздела и используется для оконных функций, работающих с рамкой, а не со всем разделом. Рамку можно указать в режимах <literal>RANGE</literal> или <literal>ROWS</literal>; в любом случае она начинается с положения <replaceable>начало_рамки</replaceable> и заканчивается положением <replaceable>конец_рамки</replaceable>. Если <replaceable>конец_рамки</replaceable> опущен, подразумевается <literal>CURRENT ROW</literal> (текущая строка).

source: A <replaceable>frame_start</replaceable> of <literal>UNBOUNDED PRECEDING</literal> means that the frame starts with the first row of the partition, and similarly a <replaceable>frame_end</replaceable> of <literal>UNBOUNDED FOLLOWING</literal> means that the frame ends with the last row of the partition.
ru: Если <replaceable>начало_рамки</replaceable> задано как <literal>UNBOUNDED PRECEDING</literal>, рамка начинается с первой строки раздела, а если <replaceable>конец_рамки</replaceable> определён как <literal>UNBOUNDED FOLLOWING</literal>, рамка заканчивается последней строкой раздела.

source: In <literal>RANGE</literal> mode, a <replaceable>frame_start</replaceable> of <literal>CURRENT ROW</literal> means the frame starts with the current row's first <firstterm>peer</firstterm> row (a row that <literal>ORDER BY</literal> considers equivalent to the current row), while a <replaceable>frame_end</replaceable> of <literal>CURRENT ROW</literal> means the frame ends with the last equivalent <literal>ORDER BY</literal> peer. In <literal>ROWS</literal> mode, <literal>CURRENT ROW</literal> simply means the current row.
ru: В режиме <literal>RANGE</literal> <replaceable>начало_рамки</replaceable>, заданное как <literal>CURRENT ROW</literal>, определяет в качестве начала первую <firstterm>родственную</firstterm> строку (строку, которую <literal>ORDER BY</literal> считает равной текущей), тогда как <replaceable>конец_рамки</replaceable>, заданный как <literal>CURRENT ROW</literal>, определяет концом рамки последнюю родственную (для <literal>ORDER BY</literal>) строку. В режиме <literal>ROWS</literal> вариант <literal>CURRENT ROW</literal> просто обозначает текущую строку.

source: The <replaceable>value</replaceable> <literal>PRECEDING</literal> and <replaceable>value</replaceable> <literal>FOLLOWING</literal> cases are currently only allowed in <literal>ROWS</literal> mode. They indicate that the frame starts or ends the specified number of rows before or after the current row. <replaceable>value</replaceable> must be an integer expression not containing any variables, aggregate functions, or window functions. The value must not be null or negative; but it can be zero, which just selects the current row.
ru: Варианты <replaceable>значение</replaceable> <literal>PRECEDING</literal> и <replaceable>значение</replaceable> <literal>FOLLOWING</literal> допускаются только в режиме <literal>ROWS</literal>. Они указывают, что рамка начинается или заканчивается со сдвигом на заданное число строк перед или после заданной строки. Здесь <replaceable>значение</replaceable> должно быть целочисленным выражением, не содержащим переменные, агрегатные или оконные функции, и может быть нулевым, что будет означать выбор текущей строки.

source: The default framing option is <literal>RANGE UNBOUNDED PRECEDING</literal>, which is the same as <literal>RANGE BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW</literal>. With <literal>ORDER BY</literal>, this sets the frame to be all rows from the partition start up through the current row's last <literal>ORDER BY</literal> peer. Without <literal>ORDER BY</literal>, all rows of the partition are included in the window frame, since all rows become peers of the current row.
ru: По умолчанию рамка определяется как <literal>RANGE UNBOUNDED PRECEDING</literal>, что равносильно расширенному определению <literal>RANGE BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW</literal>. С указанием <literal>ORDER BY</literal> это означает, что рамка будет включать все строки от начала раздела до последней строки, родственной текущей (для <literal>ORDER BY</literal>). Без <literal>ORDER BY</literal> в рамку включаются все строки раздела, так как все они считаются родственными текущей.

source: Restrictions are that <replaceable>frame_start</replaceable> cannot be <literal>UNBOUNDED FOLLOWING</literal>, <replaceable>frame_end</replaceable> cannot be <literal>UNBOUNDED PRECEDING</literal>, and the <replaceable>frame_end</replaceable> choice cannot appear earlier in the above list than the <replaceable>frame_start</replaceable> choice &mdash; for example <literal>RANGE BETWEEN CURRENT ROW AND <replaceable>value</replaceable> PRECEDING</literal> is not allowed.
ru: Действуют также ограничения: <replaceable>начало_рамки</replaceable> не может определяться как <literal>UNBOUNDED FOLLOWING</literal>, а <replaceable>конец_рамки</replaceable> &mdash; <literal>UNBOUNDED PRECEDING</literal>, и <replaceable>конец_рамки</replaceable> не может определяться раньше, чем <replaceable>начало_рамки</replaceable> &mdash; например, запись <literal>RANGE BETWEEN CURRENT ROW AND <replaceable>значение</replaceable> PRECEDING</literal> недопустима.

source: If <literal>FILTER</literal> is specified, then only the input rows for which the <replaceable>filter_clause</replaceable> evaluates to true are fed to the window function; other rows are discarded. Only window functions that are aggregates accept a <literal>FILTER</literal> clause.
ru: Если добавлено предложение <literal>FILTER</literal>, оконной функции подаются только те входные строки, для которых <replaceable>условие_фильтра</replaceable> вычисляется как истинное; другие строки отбрасываются. Предложение <literal>FILTER</literal> допускается только для агрегирующих оконных функций.
