Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/wal.po
Languages: ru

source: Because <acronym>WAL</acronym> restores database file contents after a crash, journaled file systems are not necessary for reliable storage of the data files or WAL files. In fact, journaling overhead can reduce performance, especially if journaling causes file system <emphasis>data</emphasis> to be flushed to disk. Fortunately, data flushing during journaling can often be disabled with a file system mount option, e.g. <literal>data=writeback</literal> on a Linux ext3 file system. Journaled file systems do improve boot speed after a crash.
ru: Поскольку <acronym>WAL</acronym> восстанавливает содержимое файлов базы данных, журналируемая файловая система не является необходимой для надёжного хранения файлов с данными или файлов WAL. Фактически, журналирование может снизить производительность, особенно если журналирование заставляет сохранять <emphasis>данные</emphasis> файловой системы на диск. К счастью, такое сохранение при журналировании часто можно отключить с помощью параметров монтирования файловой системы, например, <literal>data=writeback</literal> для файловой системы ext3 в Linux. С другой стороны, с журналируемыми файловыми системами увеличивается скорость загрузки после сбоя.

source: Using <acronym>WAL</acronym> results in a significantly reduced number of disk writes, because only the log file needs to be flushed to disk to guarantee that a transaction is committed, rather than every data file changed by the transaction. The log file is written sequentially, and so the cost of syncing the log is much less than the cost of flushing the data pages. This is especially true for servers handling many small transactions touching different parts of the data store. Furthermore, when the server is processing many small concurrent transactions, one <function>fsync</function> of the log file may suffice to commit many transactions.
ru: Результатом использования <acronym>WAL</acronym> является значительное уменьшение количества запросов записи на диск, потому что для гарантии, что транзакция подтверждена, в записи на диск нуждается только файл журнала, а не каждый файл данных изменённый в результате транзакции. Файл журнала записывается последовательно и таким образом, затраты на синхронизацию журнала намного меньше, чем затраты на запись страниц с данными. Это особенно справедливо для серверов, которые обрабатывают много маленьких транзакций, изменяющих разные части хранилища данных. Таким образом, когда сервер обрабатывает множество мелких конкурентных транзакций, для подтверждения многих транзакций достаточно одного вызова <function>fsync</function> на файл журнала.

source: <acronym>WAL</acronym> also makes it possible to support on-line backup and point-in-time recovery, as described in <xref linkend="continuous-archiving"/>. By archiving the WAL data we can support reverting to any time instant covered by the available WAL data: we simply install a prior physical backup of the database, and replay the WAL log just as far as the desired time. What's more, the physical backup doesn't have to be an instantaneous snapshot of the database state &mdash; if it is made over some period of time, then replaying the WAL log for that period will fix any internal inconsistencies.
ru: <acronym>WAL</acronym> также делает возможным поддержку онлайнового резервного копирования и восстановления на определённый момент времени, как описывается в <xref remap="6" linkend="continuous-archiving"/>. С помощью архивирования данных WAL поддерживается возврат к любому моменту времени, который доступен в данных WAL: мы просто устанавливаем предыдущую физическую резервную копию базы данных и воспроизводим журнал WAL до нужного момента времени. Более того, физическая резервная копия не должна быть мгновенным снимком состояния баз данных &mdash; если она была сделана некоторое время назад, воспроизведение журнала WAL за этот период исправит все внутренние несоответствия.

source: Asynchronous Commit
ru: Асинхронное подтверждение транзакций

source: <primary>synchronous commit</primary>
ru: <primary>синхронная фиксация данных</primary>

source: <primary>asynchronous commit</primary>
ru: <primary>асинхронная фиксация данных</primary>

source: <firstterm>Asynchronous commit</firstterm> is an option that allows transactions to complete more quickly, at the cost that the most recent transactions may be lost if the database should crash. In many applications this is an acceptable trade-off.
ru: <firstterm>Асинхронная фиксация</firstterm> &mdash; это возможность завершать транзакции быстрее, ценой того, что в случае краха СУБД последние транзакции могут быть потеряны. Для многих приложений такой компромисс приемлем.

source: As described in the previous section, transaction commit is normally <firstterm>synchronous</firstterm>: the server waits for the transaction's <acronym>WAL</acronym> records to be flushed to permanent storage before returning a success indication to the client. The client is therefore guaranteed that a transaction reported to be committed will be preserved, even in the event of a server crash immediately after. However, for short transactions this delay is a major component of the total transaction time. Selecting asynchronous commit mode means that the server returns success as soon as the transaction is logically completed, before the <acronym>WAL</acronym> records it generated have actually made their way to disk. This can provide a significant boost in throughput for small transactions.
ru: Как описано в предыдущей части, подтверждение транзакции обычно <firstterm>синхронное</firstterm>: сервер ждёт сохранения записей <acronym>WAL</acronym> транзакции в постоянном хранилище, прежде чем сообщить клиенту об успешном завершении. Таким образом, клиенту гарантируется, что транзакция, которую подтвердил сервер, будет защищена, даже если сразу после этого произойдёт крах сервера. Однако, для коротких транзакций данная задержка будет основной составляющей общего времени транзакции. В режиме асинхронного подтверждения сервер сообщает об успешном завершении сразу, как только транзакция будет завершена логически, прежде чем сгенерированные записи <acronym>WAL</acronym> фактически будут записаны на диск. Это может значительно увеличить производительность при выполнении небольших транзакций.

source: Asynchronous commit introduces the risk of data loss. There is a short time window between the report of transaction completion to the client and the time that the transaction is truly committed (that is, it is guaranteed not to be lost if the server crashes). Thus asynchronous commit should not be used if the client will take external actions relying on the assumption that the transaction will be remembered. As an example, a bank would certainly not use asynchronous commit for a transaction recording an ATM's dispensing of cash. But in many scenarios, such as event logging, there is no need for a strong guarantee of this kind.
ru: Асинхронное подтверждение транзакций приводит к риску потери данных. Существует короткое окно между отчётом о завершении транзакции для клиента и временем, когда транзакция реально подтверждена (т. е. гарантируется, что она не будет потеряна в случае краха сервера). Таким образом, асинхронное подтверждение транзакций не должно использоваться, если клиент будет выполнять внешние действия, опираясь на предположение, что транзакция будет сохранена. Например, банк конечно не должен использовать асинхронное подтверждение для транзакций в банкоматах, выдающих наличные. Но во многих случаях, таких как журналирование событий, столь серьёзная гарантия сохранности данных не нужна.

source: The risk that is taken by using asynchronous commit is of data loss, not data corruption. If the database should crash, it will recover by replaying <acronym>WAL</acronym> up to the last record that was flushed. The database will therefore be restored to a self-consistent state, but any transactions that were not yet flushed to disk will not be reflected in that state. The net effect is therefore loss of the last few transactions. Because the transactions are replayed in commit order, no inconsistency can be introduced &mdash; for example, if transaction B made changes relying on the effects of a previous transaction A, it is not possible for A's effects to be lost while B's effects are preserved.
ru: Риск потери данных при использовании асинхронного подтверждения транзакций &mdash; это не риск повреждения данных. Если случился крах СУБД, она будет восстановлена путём воспроизведения <acronym>WAL</acronym> до последней записи, которая была записана на диск. Таким образом, будет восстановлено целостное состояние СУБД, но любые транзакции, которые ещё не были сохранены на диск, в этом состоянии не будут отражены. Чистый эффект будет заключаться в потере нескольких последних транзакций. Поскольку транзакции воспроизводятся в том же порядке, в котором подтверждались, воспроизведение не нарушает целостность &mdash; например, если транзакция "B" выполнила изменения, которые влияют на предыдущую транзакцию "A", то не может быть такого, что изменения, выполненные "A" были потеряны, а изменения, внесённые "B" сохранены.

source: The user can select the commit mode of each transaction, so that it is possible to have both synchronous and asynchronous commit transactions running concurrently. This allows flexible trade-offs between performance and certainty of transaction durability. The commit mode is controlled by the user-settable parameter <xref linkend="guc-synchronous-commit"/>, which can be changed in any of the ways that a configuration parameter can be set. The mode used for any one transaction depends on the value of <varname>synchronous_commit</varname> when transaction commit begins.
ru: Пользователь может выбрать режим подтверждения для каждой транзакции, так что возможен конкурентный запуск транзакций в синхронном и асинхронном режиме. Это позволяет достичь гибкого компромисса между производительностью и конечно надёжностью транзакций. Режим подтверждения транзакций управляется параметром <xref linkend="guc-synchronous-commit"/>, который может быть изменён любым из способов, пригодным для установки параметров конфигурации. Режим, используемый для какой-либо конкретной транзакции, зависит от значения <varname>synchronous_commit</varname>, которое действует на момент начала этой транзакции.

source: Certain utility commands, for instance <command>DROP TABLE</command>, are forced to commit synchronously regardless of the setting of <varname>synchronous_commit</varname>. This is to ensure consistency between the server's file system and the logical state of the database. The commands supporting two-phase commit, such as <command>PREPARE TRANSACTION</command>, are also always synchronous.
ru: Некоторые команды, например <command>DROP TABLE</command>, принудительно запускают синхронное подтверждение транзакции, независимо от значения <varname>synchronous_commit</varname>. Это сделано для того, чтобы иметь уверенность в целостности данных между файловой системой сервера и логическим состоянием базы данных. Команды, которые поддерживают двухфазное подтверждение транзакций, такие как <command>PREPARE TRANSACTION</command>, также всегда синхронные.

source: If the database crashes during the risk window between an asynchronous commit and the writing of the transaction's <acronym>WAL</acronym> records, then changes made during that transaction <emphasis>will</emphasis> be lost. The duration of the risk window is limited because a background process (the <quote>WAL writer</quote>) flushes unwritten <acronym>WAL</acronym> records to disk every <xref linkend="guc-wal-writer-delay"/> milliseconds. The actual maximum duration of the risk window is three times <varname>wal_writer_delay</varname> because the WAL writer is designed to favor writing whole pages at a time during busy periods.
ru: Если во время окна риска между асинхронным подтверждением транзакции и сохранением на диск записей <acronym>WAL</acronym>, происходит крах СУБД, то изменения, сделанные во время этой транзакции <emphasis>будут</emphasis> потеряны. Продолжительность окна риска ограничена, потому что фоновый процесс (<quote>WAL writer</quote>), сохраняет не записанные записи <acronym>WAL</acronym> на диск каждые <xref linkend="guc-wal-writer-delay"/> миллисекунд. Фактически, максимальная продолжительность окна риска составляет трёхкратное значение <varname>wal_writer_delay</varname>, потому что WAL writer разработан так, чтобы сразу сохранять целые страницы во время периодов занятости.

source: An immediate-mode shutdown is equivalent to a server crash, and will therefore cause loss of any unflushed asynchronous commits.
ru: Режим немедленного завершения работы (immediate) эквивалентен краху сервера и приведёт, таким образом, к потере всех не сохранённых асинхронных транзакций.

source: Asynchronous commit provides behavior different from setting <xref linkend="guc-fsync"/> = off. <varname>fsync</varname> is a server-wide setting that will alter the behavior of all transactions. It disables all logic within <productname>PostgreSQL</productname> that attempts to synchronize writes to different portions of the database, and therefore a system crash (that is, a hardware or operating system crash, not a failure of <productname>PostgreSQL</productname> itself) could result in arbitrarily bad corruption of the database state. In many scenarios, asynchronous commit provides most of the performance improvement that could be obtained by turning off <varname>fsync</varname>, but without the risk of data corruption.
ru: Асинхронное подтверждение транзакций предоставляет поведение, которое отличается от того, что соответствует установке параметра <xref linkend="guc-fsync"/> = off. Настройка <varname>fsync</varname> касается всего сервера и может изменить поведение всех транзакций. Она выключает всю логику внутри <productname>PostgreSQL</productname>, которая пытается синхронизировать запись отдельных порций в базу данных и, таким образом, крах системы (обусловленный отказом аппаратного обеспечения или операционной системы, который не является сбоем самой СУБД <productname>PostgreSQL</productname> ) может в результате привести к повреждению состояния базы данных. Во многих случаях, асинхронное подтверждение транзакций предоставляет лучшую производительность, чем то, что можно получить выключением <varname>fsync</varname>, но без риска повреждения данных.

source: <xref linkend="guc-commit-delay"/> also sounds very similar to asynchronous commit, but it is actually a synchronous commit method (in fact, <varname>commit_delay</varname> is ignored during an asynchronous commit). <varname>commit_delay</varname> causes a delay just before a transaction flushes <acronym>WAL</acronym> to disk, in the hope that a single flush executed by one such transaction can also serve other transactions committing at about the same time. The setting can be thought of as a way of increasing the time window in which transactions can join a group about to participate in a single flush, to amortize the cost of the flush among multiple transactions.
ru: <xref linkend="guc-commit-delay"/> также выглядит очень похоже на асинхронное подтверждение транзакций, но по сути это является методом асинхронного подтверждения транзакций (фактически, во время асинхронных транзакций <varname>commit_delay</varname> игнорируется). <varname>commit_delay</varname> приводит к задержке только перед тем, как синхронная транзакция пытается записать данные <acronym>WAL</acronym> на диск, в надежде, что одиночная запись, выполняемая на одну такую транзакцию, сможет также обслужить другие транзакции, которые подтверждаются приблизительно в это же время. Установку этого параметра можно рассматривать как способ увеличения промежутка времени, в течение которого транзакции группируются для единовременной записи на диск. Это распределяет стоимость записи между несколькими транзакциями.

source: <acronym>WAL</acronym> Configuration
ru: Настройка <acronym>WAL</acronym>

source: There are several <acronym>WAL</acronym>-related configuration parameters that affect database performance. This section explains their use. Consult <xref linkend="runtime-config"/> for general information about setting server configuration parameters.
ru: Существует несколько конфигурационных параметров относящихся к <acronym>WAL</acronym>, которые влияют на производительность СУБД. Далее рассказывается об их использовании. Общую информацию об установке параметров конфигурации сервера смотрите в <xref remap="6" linkend="runtime-config"/>.

source: <primary>checkpoint</primary>
ru: <primary>контрольная точка</primary>

source: <firstterm>Checkpoints</firstterm><placeholder-1/> are points in the sequence of transactions at which it is guaranteed that the heap and index data files have been updated with all information written before that checkpoint. At checkpoint time, all dirty data pages are flushed to disk and a special checkpoint record is written to the log file. (The change records were previously flushed to the <acronym>WAL</acronym> files.) In the event of a crash, the crash recovery procedure looks at the latest checkpoint record to determine the point in the log (known as the redo record) from which it should start the REDO operation. Any changes made to data files before that point are guaranteed to be already on disk. Hence, after a checkpoint, log segments preceding the one containing the redo record are no longer needed and can be recycled or removed. (When <acronym>WAL</acronym> archiving is being done, the log segments must be archived before being recycled or removed.)
ru: <firstterm>Контрольные точки</firstterm><placeholder-1/> &mdash; это точки в последовательности транзакций, в которых гарантируется, что файлы с данными и индексами были обновлены всей информацией записанной перед контрольной точкой. Во время контрольной точки, все страницы данных, находящиеся в памяти, сохраняются на диск, а в файл журнала записывается специальная запись контрольной точки. (Сделанные изменения были перед этим записаны в файлы <acronym>WAL</acronym>.) В случае краха процедура восстановления ищет последнюю запись контрольной точки, чтобы определить эту точку в журнале (называемую записью REDO), от которой процедура должна начать операцию воспроизведения изменений. Любые изменения файлов данных перед этой точкой гарантированно находятся уже на диске. Таким образом, после контрольной точки, сегменты журнала, которые предшествуют записи воспроизведения, больше не нужны и могут быть удалены или пущены в циклическую перезапись. (Когда архивирование WAL будет завершено, сегменты журнала должны быть архивированы перед их удалением или циклической перезаписи.)

source: The checkpoint requirement of flushing all dirty data pages to disk can cause a significant I/O load. For this reason, checkpoint activity is throttled so that I/O begins at checkpoint start and completes before the next checkpoint is due to start; this minimizes performance degradation during checkpoints.
ru: Запись всех страниц данных из памяти на диск, которая требуется для контрольной точки, может вызвать значительную нагрузку на дисковый ввод/вывод. По этой причине, активность записи по контрольной точке регулируется так, что ввод/вывод начинается при старте контрольной точки и завершается перед стартом следующей контрольной точки; это минимизирует потерю производительности во время прохождения контрольных точек.

source: The server's checkpointer process automatically performs a checkpoint every so often. A checkpoint is begun every <xref linkend="guc-checkpoint-timeout"/> seconds, or if <xref linkend="guc-max-wal-size"/> is about to be exceeded, whichever comes first. The default settings are 5 minutes and 1 GB, respectively. If no WAL has been written since the previous checkpoint, new checkpoints will be skipped even if <varname>checkpoint_timeout</varname> has passed. (If WAL archiving is being used and you want to put a lower limit on how often files are archived in order to bound potential data loss, you should adjust the <xref linkend="guc-archive-timeout"/> parameter rather than the checkpoint parameters.) It is also possible to force a checkpoint by using the SQL command <command>CHECKPOINT</command>.
ru: Отдельный серверный процесс контрольных точек автоматически выполняет контрольные точки с заданной частотой. Контрольные точки производятся каждые <xref linkend="guc-checkpoint-timeout"/> секунд либо при приближении к пределу <xref linkend="guc-max-wal-size"/>, если это имеет место раньше. Значения по умолчанию: 5 минут и 1 Гбайт, соответственно. Если после предыдущей контрольной точки новые записи WAL не добавились, следующие контрольные точки будут пропущены, даже если проходит время <varname>checkpoint_timeout</varname>. (Если вы применяете архивацию WAL и хотите установить нижний предел для частоты архивации, чтобы ограничить потенциальную потерю данных, вам следует настраивать параметр <xref linkend="guc-archive-timeout"/>, а не параметры контрольных точек.) Также можно выполнить контрольную точку принудительно, воспользовавшись SQL-командой <command>CHECKPOINT</command>.

source: Reducing <varname>checkpoint_timeout</varname> and/or <varname>max_wal_size</varname> causes checkpoints to occur more often. This allows faster after-crash recovery, since less work will need to be redone. However, one must balance this against the increased cost of flushing dirty data pages more often. If <xref linkend="guc-full-page-writes"/> is set (as is the default), there is another factor to consider. To ensure data page consistency, the first modification of a data page after each checkpoint results in logging the entire page content. In that case, a smaller checkpoint interval increases the volume of output to the WAL log, partially negating the goal of using a smaller interval, and in any case causing more disk I/O.
ru: Уменьшение значений <varname>checkpoint_timeout</varname> и/или <varname>max_wal_size</varname> приводит к учащению контрольных точек. Это позволяет ускорить восстановление после краха (поскольку для воспроизведения нужно меньше данных), но с другой стороны нужно учитывать дополнительную нагрузку, возникающую вследствие более частого сброса изменённых страниц данных на диск. Если включён режим <xref linkend="guc-full-page-writes"/> (по умолчанию это так), нужно учесть и ещё один фактор. Для обеспечения целостности страницы данных, при первом изменении страницы данных после контрольной точки эта страница записывается в журнал целиком. В данном случае, чем меньше интервал между контрольными точками, тем больше объём записи в журнал WAL, так что это частично дискредитирует идею уменьшения интервала записи, и в любом случае приводит к увеличению объёма обмена с диском
