Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/wal.po
Languages: ru

source: Checkpoints are fairly expensive, first because they require writing out all currently dirty buffers, and second because they result in extra subsequent WAL traffic as discussed above. It is therefore wise to set the checkpointing parameters high enough so that checkpoints don't happen too often. As a simple sanity check on your checkpointing parameters, you can set the <xref linkend="guc-checkpoint-warning"/> parameter. If checkpoints happen closer together than <varname>checkpoint_warning</varname> seconds, a message will be output to the server log recommending increasing <varname>max_wal_size</varname>. Occasional appearance of such a message is not cause for alarm, but if it appears often then the checkpoint control parameters should be increased. Bulk operations such as large <command>COPY</command> transfers might cause a number of such warnings to appear if you have not set <varname>max_wal_size</varname> high enough.
ru: Контрольные точки довольно дороги с точки зрения ресурсов, во-первых, потому что они требуют записи всех буферов из памяти на диск, и во-вторых потому что они создают дополнительный трафик WAL, о чём говорилось выше. Таким образом, будет благоразумным установить параметры контрольных точек так, чтобы контрольные точки не выполнялись слишком часто. Для простой проверки параметров контрольной точки можно установить параметр <xref linkend="guc-checkpoint-warning"/>. Если промежуток времени между контрольными точками будет меньше чем количество секунд, заданное параметром <varname>checkpoint_warning</varname>, то в журнал сервера будет выдано сообщение с рекомендацией увеличить <varname>max_wal_size</varname>. Эпизодическое появление такого сообщения не является поводом для беспокойства. Но если оно появляется часто, необходимо увеличить значения параметров управления контрольными точками. Массовые операции, такие как <command>COPY</command> с большим объёмом данных, могут привести к появлению нескольких таких предупреждений, если вы не установили <varname>max_wal_size</varname> достаточно большим.

source: To avoid flooding the I/O system with a burst of page writes, writing dirty buffers during a checkpoint is spread over a period of time. That period is controlled by <xref linkend="guc-checkpoint-completion-target"/>, which is given as a fraction of the checkpoint interval. The I/O rate is adjusted so that the checkpoint finishes when the given fraction of <varname>checkpoint_timeout</varname> seconds have elapsed, or before <varname>max_wal_size</varname> is exceeded, whichever is sooner. With the default value of 0.5, <productname>PostgreSQL</productname> can be expected to complete each checkpoint in about half the time before the next checkpoint starts. On a system that's very close to maximum I/O throughput during normal operation, you might want to increase <varname>checkpoint_completion_target</varname> to reduce the I/O load from checkpoints. The disadvantage of this is that prolonging checkpoints affects recovery time, because more WAL segments will need to be kept around for possible use in recovery. Although <varname>checkpoint_completion_target</varname> can be set as high as 1.0, it is best to keep it less than that (perhaps 0.9 at most) since checkpoints include some other activities besides writing dirty buffers. A setting of 1.0 is quite likely to result in checkpoints not being completed on time, which would result in performance loss due to unexpected variation in the number of WAL segments needed.
ru: Чтобы избежать &laquo;заваливания&raquo; системы ввода/вывода при резкой интенсивной записи страниц, запись &laquo;грязных&raquo; буферов во время контрольной точки растягивается на определённый период времени. Этот период управляется параметром <xref linkend="guc-checkpoint-completion-target"/>, который задаётся как часть интервала контрольной точки. Скорость ввода/вывода подстраивается так, чтобы контрольная точка завершилась к моменту истечения заданной части от <varname>checkpoint_timeout</varname> секунд или до превышения <varname>max_wal_size</varname>, если оно имеет место раньше. Со значением 0.5, заданным по умолчанию, можно ожидать, что <productname>PostgreSQL</productname> завершит процедуру контрольной точки примерно за половину времени до начала следующей. В системе, которая работает практически на пределе мощности ввода/вывода в обычном режиме, есть смысл увеличить <varname>checkpoint_completion_target</varname>, чтобы уменьшить нагрузку ввода/вывода, связанную с контрольными точками. Но с другой стороны, растягивание контрольных точек влияет на время восстановления, так как для восстановления нужно будет задействовать большее количество сегментов WAL. Хотя в <varname>checkpoint_completion_target</varname> можно задать значение вплоть до 1.0, лучше выбрать значение меньше (по крайней мере, не больше 0.9), так как при контрольных точках выполняются и некоторые другие операции, помимо записи &laquo;грязных&raquo; буферов. Со значением 1.0 контрольные точки, скорее всего, не будут завершаться вовремя, что приведёт к потере производительности из-за неожиданных колебаний требуемого количества сегментов WAL.

source: On Linux and POSIX platforms <xref linkend="guc-checkpoint-flush-after"/> allows to force the OS that pages written by the checkpoint should be flushed to disk after a configurable number of bytes. Otherwise, these pages may be kept in the OS's page cache, inducing a stall when <literal>fsync</literal> is issued at the end of a checkpoint. This setting will often help to reduce transaction latency, but it also can an adverse effect on performance; particularly for workloads that are bigger than <xref linkend="guc-shared-buffers"/>, but smaller than the OS's page cache.
ru: На платформах Linux и POSIX параметр <xref linkend="guc-checkpoint-flush-after"/> позволяет принудить ОС к сбросу страниц, записываемых во время контрольной точки, при накоплении заданного количества байт. Если его не настроить, эти страницы могут оставаться в кеше страниц ОС, что повлечёт затормаживание при выполнении <literal>fsync</literal> в конце контрольной точки. Этот параметр часто помогает уменьшить задержки транзакций, но может оказать и негативное влияние на производительность; особенно, когда объём нагрузки больше <xref linkend="guc-shared-buffers"/>, но меньше кеша страниц в ОС.

source: The number of WAL segment files in <filename>pg_xlog</filename> directory depends on <varname>min_wal_size</varname>, <varname>max_wal_size</varname> and the amount of WAL generated in previous checkpoint cycles. When old log segment files are no longer needed, they are removed or recycled (that is, renamed to become future segments in the numbered sequence). If, due to a short-term peak of log output rate, <varname>max_wal_size</varname> is exceeded, the unneeded segment files will be removed until the system gets back under this limit. Below that limit, the system recycles enough WAL files to cover the estimated need until the next checkpoint, and removes the rest. The estimate is based on a moving average of the number of WAL files used in previous checkpoint cycles. The moving average is increased immediately if the actual usage exceeds the estimate, so it accommodates peak usage rather than average usage to some extent. <varname>min_wal_size</varname> puts a minimum on the amount of WAL files recycled for future usage; that much WAL is always recycled for future use, even if the system is idle and the WAL usage estimate suggests that little WAL is needed.
ru: Число файлов сегментов WAL в каталоге <filename>pg_xlog</filename> зависит от <varname>min_wal_size</varname>, <varname>max_wal_size</varname> и объёма WAL, сгенерированного в предыдущих циклах контрольных точек. Когда старые файлы сегментов оказываются не нужны, они удаляются или перерабатываются (то есть переименовываются, чтобы стать будущими сегментами в нумерованной последовательности). Если вследствие кратковременного скачка интенсивности записи в журнал, предел <varname>max_wal_size</varname> превышается, ненужные файлы сегментов будут удаляться, пока система не опустится ниже этого предела. Оставаясь ниже этого предела, система перерабатывает столько файлов WAL, сколько необходимо для покрытия ожидаемой потребности до следующей контрольной точки, и удаляет остальные. Эта оценка базируется на скользящем среднем числа файлов WAL, задействованных в предыдущих циклах контрольных точек. Скользящее среднее увеличивается немедленно, если фактическое использование превышает оценку, так что в нём в некоторой степени накапливается пиковое использование, а не среднее. Значение <varname>min_wal_size</varname> ограничивает снизу число файлов WAL, которые будут переработаны для будущего использования; такой объём WAL всегда будет перерабатываться, даже если система простаивает и оценка использования говорит, что нужен совсем небольшой WAL.

source: Independently of <varname>max_wal_size</varname>, <xref linkend="guc-wal-keep-segments"/> + 1 most recent WAL files are kept at all times. Also, if WAL archiving is used, old segments can not be removed or recycled until they are archived. If WAL archiving cannot keep up with the pace that WAL is generated, or if <varname>archive_command</varname> fails repeatedly, old WAL files will accumulate in <filename>pg_xlog</filename> until the situation is resolved. A slow or failed standby server that uses a replication slot will have the same effect (see <xref linkend="streaming-replication-slots"/>).
ru: Вне зависимости от <varname>max_wal_size</varname>, в количестве <xref linkend="guc-wal-keep-segments"/> + 1 самые последние файлы WAL сохраняются в любом случае. Так же, если применяется архивация WAL, старые сегменты не могут быть удалены или переработаны, пока они не будут заархивированы. Если WAL архивируется медленнее, чем генерируется, либо если команда <varname>archive_command</varname> постоянно даёт сбои, старые файлы WAL будут накапливаться в <filename>pg_xlog</filename>, пока ситуация не будет разрешена. Медленно работающий или отказавший резервный сервер, использующий слот репликации, даст тот же эффект (см. <xref remap="4" linkend="streaming-replication-slots"/>).

source: <primary>restartpoint</primary>
ru: <primary>точка перезапуска</primary>

source: In archive recovery or standby mode, the server periodically performs <firstterm>restartpoints</firstterm>,<placeholder-1/> which are similar to checkpoints in normal operation: the server forces all its state to disk, updates the <filename>pg_control</filename> file to indicate that the already-processed WAL data need not be scanned again, and then recycles any old log segment files in the <filename>pg_xlog</filename> directory. Restartpoints can't be performed more frequently than checkpoints in the master because restartpoints can only be performed at checkpoint records. A restartpoint is triggered when a checkpoint record is reached if at least <varname>checkpoint_timeout</varname> seconds have passed since the last restartpoint, or if WAL size is about to exceed <varname>max_wal_size</varname>. However, because of limitations on when a restartpoint can be performed, <varname>max_wal_size</varname> is often exceeded during recovery, by up to one checkpoint cycle's worth of WAL. (<varname>max_wal_size</varname> is never a hard limit anyway, so you should always leave plenty of headroom to avoid running out of disk space.)
ru: В режиме восстановления архива или горячего резерва сервер периодически выполняет <firstterm>точки перезапуска</firstterm><placeholder-1/>, которые похожи на контрольные точки в обычном режиме работы: сервер принудительно сбрасывает своё состояние на диск, обновляет файл <filename>pg_control</filename>, чтобы показать, что уже обработанные данные WAL не нужно сканировать снова, и затем перерабатывает все старые файлы сегментов журнала в каталоге <filename>pg_xlog</filename>. Точки перезапуска не могут выполняться чаще, чем контрольные точки на главном сервере, так как они могут происходить только в записях контрольных точек. Точка перезапуска производится, когда достигается запись контрольной точки и после предыдущей точки перезапуска прошло не меньше <varname>checkpoint_timeout</varname> секунд или размер WAL может превысить <varname>max_wal_size</varname>. Однако из-за того, что на время выполнения точек перезапуска накладываются ограничения, <varname>max_wal_size</varname> часто превышается при восстановлении, вплоть до объёма WAL, записываемого в цикле между контрольными точками. (Значение <varname>max_wal_size</varname> никогда и не было жёстким пределом, так что всегда следует оставлять приличный запас сверху, чтобы не остаться без свободного места на диске.)

source: There are two commonly used internal <acronym>WAL</acronym> functions: <function>XLogInsertRecord</function> and <function>XLogFlush</function>. <function>XLogInsertRecord</function> is used to place a new record into the <acronym>WAL</acronym> buffers in shared memory. If there is no space for the new record, <function>XLogInsertRecord</function> will have to write (move to kernel cache) a few filled <acronym>WAL</acronym> buffers. This is undesirable because <function>XLogInsertRecord</function> is used on every database low level modification (for example, row insertion) at a time when an exclusive lock is held on affected data pages, so the operation needs to be as fast as possible. What is worse, writing <acronym>WAL</acronym> buffers might also force the creation of a new log segment, which takes even more time. Normally, <acronym>WAL</acronym> buffers should be written and flushed by an <function>XLogFlush</function> request, which is made, for the most part, at transaction commit time to ensure that transaction records are flushed to permanent storage. On systems with high log output, <function>XLogFlush</function> requests might not occur often enough to prevent <function>XLogInsertRecord</function> from having to do writes. On such systems one should increase the number of <acronym>WAL</acronym> buffers by modifying the <xref linkend="guc-wal-buffers"/> parameter. When <xref linkend="guc-full-page-writes"/> is set and the system is very busy, setting <varname>wal_buffers</varname> higher will help smooth response times during the period immediately following each checkpoint.
ru: Наиболее часто используются две связанные с <acronym>WAL</acronym> внутренние функции: <function>XLogInsertRecord</function> и <function>XLogFlush</function>. <function>XLogInsertRecord</function> применяется для добавления записи в буферы <acronym>WAL</acronym> в разделяемой памяти. Если места для новой записи недостаточно, <function>XLogInsertRecord</function> придётся записать (переместить в кеш ядра) несколько заполненных буферов <acronym>WAL</acronym>. Это нежелательно, так как <function>XLogInsertRecord</function> используется при каждом изменении в базе данных на низком уровне (например, при добавлении строки) в момент, когда установлена исключительная блокировка задействованных страниц данных, поэтому данная операция должна быть максимально быстрой. Что ещё хуже, запись буферов <acronym>WAL</acronym> может также повлечь создание нового сегмента журнала, что займёт ещё больше времени. Обычно буферы <acronym>WAL</acronym> должны записываться и сохраняться на диске в функции <function>XLogFlush</function>, которая вызывается, по большей части, при фиксировании транзакции, чтобы результаты транзакции сохранились в надёжном хранилище. В системах с интенсивной записью в журнал вызовы <function>XLogFlush</function> могут иметь место не так часто, чтобы <function>XLogInsertRecord</function> не приходилось производить запись. В таких системах следует увеличить число буферов <acronym>WAL</acronym>, изменив параметр <xref linkend="guc-wal-buffers"/>. Когда включён режим <xref linkend="guc-full-page-writes"/> и система очень сильно загружена, увеличение <varname>wal_buffers</varname> поможет сгладить скачки во времени ответа в период сразу после каждой контрольной точки.

source: The <xref linkend="guc-commit-delay"/> parameter defines for how many microseconds a group commit leader process will sleep after acquiring a lock within <function>XLogFlush</function>, while group commit followers queue up behind the leader. This delay allows other server processes to add their commit records to the WAL buffers so that all of them will be flushed by the leader's eventual sync operation. No sleep will occur if <xref linkend="guc-fsync"/> is not enabled, or if fewer than <xref linkend="guc-commit-siblings"/> other sessions are currently in active transactions; this avoids sleeping when it's unlikely that any other session will commit soon. Note that on some platforms, the resolution of a sleep request is ten milliseconds, so that any nonzero <varname>commit_delay</varname> setting between 1 and 10000 microseconds would have the same effect. Note also that on some platforms, sleep operations may take slightly longer than requested by the parameter.
ru: Параметр <xref linkend="guc-commit-delay"/> определяет, на сколько микросекунд будет засыпать ведущий процесс группы, записывающий в журнал, после получения блокировки в <function>XLogFlush</function>, пока подчинённые формируют очередь на запись. Во время этой задержки другие серверные процессы смогут добавлять записи в WAL буферы журнала, чтобы все эти записи сохранились на диск в результате одной операции синхронизации, которую выполнит ведущий. Ведущий процесс не засыпает, если отключён режим <xref linkend="guc-fsync"/>, либо число сеансов с активными транзакциями меньше <xref linkend="guc-commit-siblings"/>, так как маловероятно, что какой-либо другой сеанс зафиксирует транзакцию в ближайшее время. Заметьте, что на некоторых платформах, разрешение этого таймера сна составляет 10 миллисекунд, так что любое значение параметра <varname>commit_delay</varname> от 1 до 10000 микросекунд будет действовать одинаково. Кроме того, в некоторых системах состояние сна может продлиться несколько дольше, чем требует параметр.

source: Since the purpose of <varname>commit_delay</varname> is to allow the cost of each flush operation to be amortized across concurrently committing transactions (potentially at the expense of transaction latency), it is necessary to quantify that cost before the setting can be chosen intelligently. The higher that cost is, the more effective <varname>commit_delay</varname> is expected to be in increasing transaction throughput, up to a point. The <xref linkend="pgtestfsync"/> program can be used to measure the average time in microseconds that a single WAL flush operation takes. A value of half of the average time the program reports it takes to flush after a single 8kB write operation is often the most effective setting for <varname>commit_delay</varname>, so this value is recommended as the starting point to use when optimizing for a particular workload. While tuning <varname>commit_delay</varname> is particularly useful when the WAL log is stored on high-latency rotating disks, benefits can be significant even on storage media with very fast sync times, such as solid-state drives or RAID arrays with a battery-backed write cache; but this should definitely be tested against a representative workload. Higher values of <varname>commit_siblings</varname> should be used in such cases, whereas smaller <varname>commit_siblings</varname> values are often helpful on higher latency media. Note that it is quite possible that a setting of <varname>commit_delay</varname> that is too high can increase transaction latency by so much that total transaction throughput suffers.
ru: Так как цель <varname>commit_delay</varname> состоит в том, чтобы позволить стоимости каждой операции синхронизации амортизироваться через параллельную фиксацию транзакций (потенциально за счёт задержки транзакции), необходимо определить количество той стоимости, прежде чем урегулирование сможет быть выбрано разумно. Чем выше стоимость, тем более эффективный будет <varname>commit_delay</varname> в увеличении пропускной способности транзакций в какой-то степени. Программа <xref linkend="pgtestfsync"/> может использоваться, чтобы измерить среднее время в микросекундах, которое занимает одиночная работа сброса WAL на диск. Значение половины среднего времени сообщаемого программой рекомендуется в качестве отправной точки для использования значения в параметре <varname>commit_delay</varname> при оптимизации для конкретного объёма работы, и говорит о том, сколько нужно времени для синхронизации сброса единственной операции записи 8 КБ. Настройка параметра <varname>commit_delay</varname> особенно полезна в случае хранения WAL в хранилище с высокоскоростными дисками, такими как твердотельные накопители (SSD) или RAID-массивы с кешем записи и аварийным питанием на батарее; но это определённо должно тестироваться на репрезентативной рабочей нагрузке. Более высокие значения <varname>commit_siblings</varname> должны использоваться в таких случаях, тогда как меньшие значения <varname>commit_siblings</varname> часто полезны на носителях с большими задержками. Обратите внимание на то, что увеличение значения параметра <varname>commit_delay</varname> может увеличить задержку транзакции настолько, что пострадает общая производительность транзакций.

source: When <varname>commit_delay</varname> is set to zero (the default), it is still possible for a form of group commit to occur, but each group will consist only of sessions that reach the point where they need to flush their commit records during the window in which the previous flush operation (if any) is occurring. At higher client counts a <quote>gangway effect</quote> tends to occur, so that the effects of group commit become significant even when <varname>commit_delay</varname> is zero, and thus explicitly setting <varname>commit_delay</varname> tends to help less. Setting <varname>commit_delay</varname> can only help when (1) there are some concurrently committing transactions, and (2) throughput is limited to some degree by commit rate; but with high rotational latency this setting can be effective in increasing transaction throughput with as few as two clients (that is, a single committing client with one sibling transaction).
ru: Даже если <varname>commit_delay</varname> равен нулю (значение по умолчанию), групповая фиксация все равно может произойти, но группа будет состоять только из тех сеансов, которым понадобилось сбросить записи о фиксации на диск за то время, пока происходил предыдущий сброс. Чем больше сеансов, тем чаще это происходит даже при нулевом <varname>commit_delay</varname>, поэтому увеличение этого параметра может и не оказать заметного действия. Установка <varname>commit_delay</varname> имеет смысл в двух случаях: (1) когда несколько транзакций одновременно фиксируют изменения, (2) либо когда частота фиксаций ограничена пропускной способностью дисковой подсистемы. Однако при задержке из-за низкой скорости вращения диска, эта настройка может оказаться полезной даже всего при двух сеансах.
