Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/wal.po
Languages: ru

source: Reliability and the Write-Ahead Log
ru: Надёжность и журнал упреждающей записи

source: This chapter explains how the Write-Ahead Log is used to obtain efficient, reliable operation.
ru: В данной главе рассказывается, как для обеспечения эффективной и надёжной работы используется журнал упреждающей записи.

source: Reliability
ru: Надёжность

source: Reliability is an important property of any serious database system, and <productname>PostgreSQL</productname> does everything possible to guarantee reliable operation. One aspect of reliable operation is that all data recorded by a committed transaction should be stored in a nonvolatile area that is safe from power loss, operating system failure, and hardware failure (except failure of the nonvolatile area itself, of course). Successfully writing the data to the computer's permanent storage (disk drive or equivalent) ordinarily meets this requirement. In fact, even if a computer is fatally damaged, if the disk drives survive they can be moved to another computer with similar hardware and all committed transactions will remain intact.
ru: Надёжность — это важное свойство любой серьёзной СУБД и <productname>PostgreSQL</productname> делает всё возможное, чтобы гарантировать надёжность своего функционирования. Один из аспектов надёжности состоит в том, что все данные записываются с помощью подтверждённых транзакций, которые сохраняются в энергонезависимой области, которая защищена от потери питания, сбоев операционной системы и аппаратных отказов (разумеется, за исключением отказа самой энергонезависимой области). Успешная запись данных в постоянное место хранения (диск или эквивалентный носитель) обычно всё, что требуется. Фактически, даже если компьютер полностью вышел из строя, если диски выжили, то они могут быть переставлены в другой похожий компьютер и все подтверждённые транзакции останутся неповреждёнными.

source: While forcing data to the disk platters periodically might seem like a simple operation, it is not. Because disk drives are dramatically slower than main memory and CPUs, several layers of caching exist between the computer's main memory and the disk platters. First, there is the operating system's buffer cache, which caches frequently requested disk blocks and combines disk writes. Fortunately, all operating systems give applications a way to force writes from the buffer cache to disk, and <productname>PostgreSQL</productname> uses those features. (See the <xref linkend="guc-wal-sync-method"/> parameter to adjust how this is done.)
ru: Хотя периодическая запись данных на пластины диска может выглядеть как простая операция, это не так, потому что диски значительно медленнее, чем оперативная память и процессор, а также потому что между оперативной памятью и пластинами диска есть некоторые механизмы кеширования. Во-первых, есть буферный кеш операционной системы, который кеширует частые запросы к блокам диска и комбинирует запись на диск. К счастью, все операционные системы предоставляют приложениям способ принудительной записи из буферного кеша на диск и <productname>PostgreSQL</productname> использует эту возможность. (Смотрите параметр <xref linkend="guc-wal-sync-method"/> который отвечает за то как это делается.)

source: Next, there might be a cache in the disk drive controller; this is particularly common on <acronym>RAID</acronym> controller cards. Some of these caches are <firstterm>write-through</firstterm>, meaning writes are sent to the drive as soon as they arrive. Others are <firstterm>write-back</firstterm>, meaning data is sent to the drive at some later time. Such caches can be a reliability hazard because the memory in the disk controller cache is volatile, and will lose its contents in a power failure. Better controller cards have <firstterm>battery-backup units</firstterm> (<acronym>BBU</acronym>s), meaning the card has a battery that maintains power to the cache in case of system power loss. After power is restored the data will be written to the disk drives.
ru: Далее, кеширование также может осуществляться контроллером диска; в особенности это касается <acronym>RAID</acronym>-контроллеров. В некоторых случаях это кеширование работает в режиме <firstterm>сквозной записи</firstterm>, что означает, что запись осуществляется на диск как только приходят данные. В других случаях, возможна работа в режиме <firstterm>отложенной записи</firstterm>, что означает, что запись осуществляется некоторое время спустя. Такой режим кеширования может создавать риск для надёжности, потому что память контроллера диска непостоянна и будет потеряна в случае потери питания. Лучшие контроллеры имеют так называемую <firstterm>батарею резервного питания</firstterm> (Battery-Backup Unit, <acronym>BBU</acronym>), которая сохраняет кеш контроллера на батарее, если пропадёт системное питание. После возобновления питания, данные, оставшиеся в кеше контроллера, будут записаны на диски.

source: And finally, most disk drives have caches. Some are write-through while some are write-back, and the same concerns about data loss exist for write-back drive caches as for disk controller caches. Consumer-grade IDE and SATA drives are particularly likely to have write-back caches that will not survive a power failure. Many solid-state drives (SSD) also have volatile write-back caches.
ru: И наконец, многие диски имеют кеширование. На каких-то дисках оно работает в режиме сквозной записи, на других в режиме отложенной записи, что приводит к тем же проблемам потери данных для кеша отложенной записи, что и с кешем в контроллерах дисков. Диски IDE и SATA, потребительского класса особенно, часто имеют кеш отложенной записи, который сбрасывается при потере питания. Многие SSD-накопители также имеют зависимый от питания кеш отложенной записи.

source: These caches can typically be disabled; however, the method for doing this varies by operating system and drive type:
ru: Обычно, такое кеширование можно выключить; однако, то, как это делается, различается для операционной системы и для типа диска:

source: On <productname>Linux</productname>, IDE and SATA drives can be queried using <command>hdparm -I</command>; write caching is enabled if there is a <literal>*</literal> next to <literal>Write cache</literal>. <command>hdparm -W 0</command> can be used to turn off write caching. SCSI drives can be queried using <ulink url="http://sg.danny.cz/sg/sdparm.html"><application>sdparm</application></ulink>. Use <command>sdparm --get=WCE</command> to check whether the write cache is enabled and <command>sdparm --clear=WCE</command> to disable it.
ru: В <productname>Linux</productname> параметры дисков IDE и SATA могут быть получены с помощью команды <command>hdparm -I</command>; кеширование записи включено, если за строкой <literal>Write cache</literal> следует <literal>*</literal>. Для выключения кеширования записи может быть использована команда <command>hdparm -W 0</command>. Параметры SCSI-дисков могут быть получены с помощью утилиты <ulink url="http://sg.danny.cz/sg/sdparm.html"><application>sdparm</application></ulink>. Используйте <command>sdparm --get=WCE</command>, чтобы проверить, включено ли кеширование записи, и <command>sdparm --clear=WCE</command>, чтобы выключить его.

source: On <productname>FreeBSD</productname>, IDE drives can be queried using <command>atacontrol</command> and write caching turned off using <literal>hw.ata.wc=0</literal> in <filename>/boot/loader.conf</filename>; SCSI drives can be queried using <command>camcontrol identify</command>, and the write cache both queried and changed using <command>sdparm</command> when available.
ru: Во <productname>FreeBSD</productname> параметры IDE-дисков могут быть получены с помощью команды <command>atacontrol</command>, а кеширование записи выключается при помощи установки параметра <literal>hw.ata.wc=0</literal> в файле <filename>/boot/loader.conf</filename>; Для SCSI-дисков параметры могут быть получены, используя команду <command>camcontrol identify</command>, а кеширование записи изменяется при помощи утилиты <command>sdparm</command>.

source: On <productname>Solaris</productname>, the disk write cache is controlled by <command>format -e</command>. (The Solaris <acronym>ZFS</acronym> file system is safe with disk write-cache enabled because it issues its own disk cache flush commands.)
ru: В <productname>Solaris</productname> кешированием записи на диск управляет команда <command>format -e</command>. (Использование файловой системы Solaris <acronym>ZFS</acronym>, при включённом кешировании записи на диск, является безопасным, потому что она использует собственные команды сброса кеша на диск.)

source: On <productname>Windows</productname>, if <varname>wal_sync_method</varname> is <literal>open_datasync</literal> (the default), write caching can be disabled by unchecking <literal>My Computer\Open\<replaceable>disk drive</replaceable>\Properties\Hardware\Properties\Policies\Enable write caching on the disk</literal>. Alternatively, set <varname>wal_sync_method</varname> to <literal>fsync</literal> or <literal>fsync_writethrough</literal>, which prevent write caching.
ru: В <productname>Windows</productname>, если параметр <varname>wal_sync_method</varname> установлен в <literal>open_datasync</literal> (по умолчанию), кеширование записи на диск может быть выключено снятием галочки <literal>My Computer\Open\<replaceable>disk drive</replaceable>\Properties\Hardware\Properties\Policies\Enable write caching on the disk</literal>. В качестве альтернативы, можно установить параметр <varname>wal_sync_method</varname> в значение <literal>fsync</literal> или <literal>fsync_writethrough</literal>, что предотвращает кеширование записи.

source: On <productname>OS X</productname>, write caching can be prevented by setting <varname>wal_sync_method</varname> to <literal>fsync_writethrough</literal>.
ru: В <productname>OS X</productname> кеширование записи можно отключить, установив для параметра <varname>wal_sync_method</varname> значение <literal>fsync_writethrough</literal>.

source: Recent SATA drives (those following <acronym>ATAPI-6</acronym> or later) offer a drive cache flush command (<command>FLUSH CACHE EXT</command>), while SCSI drives have long supported a similar command <command>SYNCHRONIZE CACHE</command>. These commands are not directly accessible to <productname>PostgreSQL</productname>, but some file systems (e.g., <acronym>ZFS</acronym>, <acronym>ext4</acronym>) can use them to flush data to the platters on write-back-enabled drives. Unfortunately, such file systems behave suboptimally when combined with battery-backup unit (<acronym>BBU</acronym>) disk controllers. In such setups, the synchronize command forces all data from the controller cache to the disks, eliminating much of the benefit of the BBU. You can run the <xref linkend="pgtestfsync"/> program to see if you are affected. If you are affected, the performance benefits of the BBU can be regained by turning off write barriers in the file system or reconfiguring the disk controller, if that is an option. If write barriers are turned off, make sure the battery remains functional; a faulty battery can potentially lead to data loss. Hopefully file system and disk controller designers will eventually address this suboptimal behavior.
ru: Новые модели SATA-дисков (которые соответствуют стандарту <acronym>ATAPI-6</acronym> или более позднему) предлагают команду сброса кеша на диск (<command>FLUSH CACHE EXT</command>), а SCSI-диски уже давно поддерживают похожую команду <command>SYNCHRONIZE CACHE</command>. Эти команды недоступны из <productname>PostgreSQL</productname> напрямую, но некоторые файловые системы (например, <acronym>ZFS</acronym>, <acronym>ext4</acronym>), могут использовать их для сброса данных из кеша на пластины диска при включённом режиме кеша сквозной записи. К сожалению, такие файловые системы ведут себя неоптимально при комбинировании с батареей резервного питания (<acronym>BBU</acronym>) дискового контроллера. В таких случаях, команда синхронизации принуждает сохранять все данные на диск из кеша контроллера, сводя преимущество BBU к нулю. Вы можете запустить модуль <xref linkend="pgtestfsync"/>, чтобы увидеть, что вы попали в эту ситуацию. Если это так, преимущества производительности BBU могут быть восстановлены с помощью выключения барьеров записи для файловой системы или переконфигурирования контроллера диска, если это возможно. Если барьеры записи выключены, убедитесь, что батарея годная; при отказе батареи может произойти потеря данных. Есть надежда, что разработчики файловых систем и контроллеров дисков, в конце концов, устранят это неоптимальное поведение.

source: When the operating system sends a write request to the storage hardware, there is little it can do to make sure the data has arrived at a truly non-volatile storage area. Rather, it is the administrator's responsibility to make certain that all storage components ensure integrity for both data and file-system metadata. Avoid disk controllers that have non-battery-backed write caches. At the drive level, disable write-back caching if the drive cannot guarantee the data will be written before shutdown. If you use SSDs, be aware that many of these do not honor cache flush commands by default. You can test for reliable I/O subsystem behavior using <ulink url="http://brad.livejournal.com/2116715.html"><filename>diskchecker.pl</filename></ulink>.
ru: Когда операционная система отправляет запрос на запись к аппаратному обеспечению для хранения данных, она мало что может сделать, чтобы убедиться, что данные действительно сохранены в какой-либо энергонезависимой области. Скорее, это является зоной ответственности администратора, убедиться в целостности данных на всех компонентах хранения. Избегайте дисковых контроллеров, которые не имеют батарей резервного питания для кеширования записи. На уровне диска, запретите режим отложенной записи, если диск не может гарантировать, что данные будут записаны перед выключением. Если вы используете SSD, знайте, что многие их них по умолчанию не выполняют команды сброса кеша на диск. Вы можете протестировать надёжность поведения подсистемы ввода/вывода, используя <ulink url="http://brad.livejournal.com/2116715.html"><filename>diskchecker.pl</filename></ulink>.

source: Another risk of data loss is posed by the disk platter write operations themselves. Disk platters are divided into sectors, commonly 512 bytes each. Every physical read or write operation processes a whole sector. When a write request arrives at the drive, it might be for some multiple of 512 bytes (<productname>PostgreSQL</productname> typically writes 8192 bytes, or 16 sectors, at a time), and the process of writing could fail due to power loss at any time, meaning some of the 512-byte sectors were written while others were not. To guard against such failures, <productname>PostgreSQL</productname> periodically writes full page images to permanent WAL storage <emphasis>before</emphasis> modifying the actual page on disk. By doing this, during crash recovery <productname>PostgreSQL</productname> can restore partially-written pages from WAL. If you have file-system software that prevents partial page writes (e.g., ZFS), you can turn off this page imaging by turning off the <xref linkend="guc-full-page-writes"/> parameter. Battery-Backed Unit (BBU) disk controllers do not prevent partial page writes unless they guarantee that data is written to the BBU as full (8kB) pages.
ru: Другой риск потери данных состоит в самой записи на пластины диска. Пластины диска разделяются на секторы, обычно по 512 байт каждый. Каждая операция физического чтения или записи обрабатывает целый сектор. Когда дисковый накопитель получает запрос на запись, он может соответствовать нескольким секторам по 512 байт (<productname>PostgreSQL</productname> обычно за один раз записывает 8192 байта или 16 секторов) и из-за отказа питания процесс записи может закончится неудачей в любое время, что означает, что некоторые из 512-байтовых секторов будут записаны, а некоторые нет. Чтобы защититься от таких сбоев, <emphasis>перед</emphasis> изменением фактической страницы на диске, <productname>PostgreSQL</productname> периодически записывает полные образы страниц на постоянное устройство хранения WAL. С помощью этого, во время восстановления после краха, <productname>PostgreSQL</productname> может восстановить из WAL страницы, которые записаны частично. Если у вас файловая система, которая защищена от частичной записи страниц (например, ZFS), вы можете выключить работу с образами страниц, выключив параметр <xref linkend="guc-full-page-writes"/>. Батарея резервного питания (BBU) контроллера диска не защищает от частичной записи страниц, если не гарантируется, что данные записаны в BBU как полные (8kB) страницы.

source: Each individual record in a WAL file is protected by a CRC-32 (32-bit) check that allows us to tell if record contents are correct. The CRC value is set when we write each WAL record and checked during crash recovery, archive recovery and replication.
ru: Каждая индивидуальная запись в WAL защищена с помощью контрольной суммы по алгоритму CRC-32 (32-bit), что позволяет судить о корректности данных в записи. Значение CRC устанавливается, когда мы пишем каждую запись WAL и проверяется в ходе восстановления после сбоя, восстановления из архива, и при репликации.

source: Data pages are not currently checksummed by default, though full page images recorded in WAL records will be protected; see <link linkend="app-initdb-data-checksums"><application>initdb</application></link> for details about enabling data page checksums.
ru: Страницы данных в настоящее время не защищаются контрольными суммами по умолчанию, хотя полные образы страниц, записанные в WAL будут защищены; смотрите <link linkend="app-initdb-data-checksums"><application>initdb</application></link> для деталей о включении в страницы данных информации о контрольных суммах.

source: Internal data structures such as <filename>pg_clog</filename>, <filename>pg_subtrans</filename>, <filename>pg_multixact</filename>, <filename>pg_serial</filename>, <filename>pg_notify</filename>, <filename>pg_stat</filename>, <filename>pg_snapshots</filename> are not directly checksummed, nor are pages protected by full page writes. However, where such data structures are persistent, WAL records are written that allow recent changes to be accurately rebuilt at crash recovery and those WAL records are protected as discussed above.
ru: Для внутренних структур данных, таких как <filename>pg_clog</filename>, <filename>pg_subtrans</filename>, <filename>pg_multixact</filename>, <filename>pg_serial</filename>, <filename>pg_notify</filename>, <filename>pg_stat</filename>, <filename>pg_snapshots</filename> не ведётся расчёт контрольной суммы, равно как и для страниц, защищённых посредством полностраничной записи. Однако там, где такие структуры данных являются постоянными, записи WAL пишутся таким образом, чтобы после сбоя было возможно аккуратно повторить последние изменения, а эти записи WAL защищаются так же, как описано выше.

source: Individual state files in <filename>pg_twophase</filename> are protected by CRC-32.
ru: Файлы каталога <filename>pg_twophase</filename> защищены с помощью контрольной суммы CRC-32.

source: Temporary data files used in larger SQL queries for sorts, materializations and intermediate results are not currently checksummed, nor will WAL records be written for changes to those files.
ru: Временные файлы данных, используемые в больших SQL-запросах для сортировки, материализации и промежуточных результатов, в настоящее время не защищаются контрольной суммой, а изменения в этих файлах не отражаются в WAL.

source: <productname>PostgreSQL</productname> also protects against some kinds of data corruption on storage devices that may occur because of hardware errors or media failure over time, such as reading/writing garbage data. <placeholder-1/>
ru: <productname>PostgreSQL</productname> также защищает от некоторых видов повреждения данных на устройствах хранения, которые могут произойти из-за аппаратных ошибок или из-за дефектов поверхности с течением времени, например, при операциях чтения/записи во время сборки мусора. <placeholder-1/>

source: <productname>PostgreSQL</productname> does not protect against correctable memory errors and it is assumed you will operate using RAM that uses industry standard Error Correcting Codes (ECC) or better protection.
ru: <productname>PostgreSQL</productname> не защищает от корректируемых ошибок памяти; предполагается, что вы будете работать с памятью, которая использует промышленный стандарт коррекции ошибок (ECC, Error Correcting Codes) или лучшую защиту.

source: Write-Ahead Logging (<acronym>WAL</acronym>)
ru: Журнал упреждающей записи (<acronym>WAL</acronym>)

source: <primary>transaction log</primary> <see>WAL</see>
ru: <primary>журнал транзакций</primary> <see>WAL</see>

source: <firstterm>Write-Ahead Logging</firstterm> (<acronym>WAL</acronym>) is a standard method for ensuring data integrity. A detailed description can be found in most (if not all) books about transaction processing. Briefly, <acronym>WAL</acronym>'s central concept is that changes to data files (where tables and indexes reside) must be written only after those changes have been logged, that is, after log records describing the changes have been flushed to permanent storage. If we follow this procedure, we do not need to flush data pages to disk on every transaction commit, because we know that in the event of a crash we will be able to recover the database using the log: any changes that have not been applied to the data pages can be redone from the log records. (This is roll-forward recovery, also known as REDO.)
ru: <firstterm>Журнал упреждающей записи</firstterm> (<acronym>WAL</acronym>) — это стандартный метод обеспечения целостности данных. Детальное описание можно найти в большинстве книг (если не во всех) по обработке транзакций. Вкратце, основная идея <acronym>WAL</acronym> состоит в том, что изменения в файлах с данными (где находятся таблицы и индексы) должны записываться только после того, как эти изменения были занесены в журнал, т. е. после того как записи журнала, описывающие данные изменения, будут сохранены на постоянное устройство хранения. Если следовать этой процедуре, то записывать страницы данных на диск после подтверждения каждой транзакции нет необходимости, потому что мы знаем, что если случится сбой, то у нас будет возможность восстановить базу данных с помощью журнала: любые изменения, которые не были применены к страницам с данными, могут быть воссозданы из записей журнала. (Это называется восстановлением с воспроизведением, или REDO.)
