Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/wal.po
Languages: ru

source: The <xref linkend="guc-wal-sync-method"/> parameter determines how <productname>PostgreSQL</productname> will ask the kernel to force <acronym>WAL</acronym> updates out to disk. All the options should be the same in terms of reliability, with the exception of <literal>fsync_writethrough</literal>, which can sometimes force a flush of the disk cache even when other options do not do so. However, it's quite platform-specific which one will be the fastest. You can test the speeds of different options using the <xref linkend="pgtestfsync"/> program. Note that this parameter is irrelevant if <varname>fsync</varname> has been turned off.
ru: Параметр <xref linkend="guc-wal-sync-method"/> определяет, как <productname>PostgreSQL</productname> будет обращаться к ядру, чтобы принудительно сохранить <acronym>WAL</acronym> на диск. Все методы должны быть одинаковыми в плане надёжности, за исключением <literal>fsync_writethrough</literal>, который может иногда принудительно сбрасывать кеш диска, даже если другие методы не делают этого. Однако, какой из них самый быстрый, во многом определяется платформой; вы можете протестировать скорость, используя модуль <xref linkend="pgtestfsync"/>. Обратите внимание, что данный параметр не имеет значения, если <varname>fsync</varname> выключен.

source: Enabling the <xref linkend="guc-wal-debug"/> configuration parameter (provided that <productname>PostgreSQL</productname> has been compiled with support for it) will result in each <function>XLogInsertRecord</function> and <function>XLogFlush</function> <acronym>WAL</acronym> call being logged to the server log. This option might be replaced by a more general mechanism in the future.
ru: Включение параметра конфигурации <xref linkend="guc-wal-debug"/> (предоставляется, если <productname>PostgreSQL</productname> был скомпилирован с его поддержкой) будет приводить к тому, что все вызовы связанных с <acronym>WAL</acronym> функций <function>XLogInsertRecord</function> и <function>XLogFlush</function> будут протоколироваться в журнале сервера. В будущем данный параметр может быть заменён более общим механизмом.

source: WAL Internals
ru: Внутреннее устройство WAL

source: <acronym>WAL</acronym> is automatically enabled; no action is required from the administrator except ensuring that the disk-space requirements for the <acronym>WAL</acronym> logs are met, and that any necessary tuning is done (see <xref linkend="wal-configuration"/>).
ru: <acronym>WAL</acronym> включается автоматически; от администратора не требуется никаких действий за исключением того, чтобы убедиться, что выполнены требования <acronym>WAL</acronym> к месту на диске, и что выполнены все необходимые действия по тонкой настройке (см. <xref remap="4" linkend="wal-configuration"/>).

source: <acronym>WAL</acronym> logs are stored in the directory <filename>pg_xlog</filename> under the data directory, as a set of segment files, normally each 16 MB in size (but the size can be changed by altering the <option>--with-wal-segsize</option> configure option when building the server). Each segment is divided into pages, normally 8 kB each (this size can be changed via the <option>--with-wal-blocksize</option> configure option). The log record headers are described in <filename>access/xlogrecord.h</filename>; the record content is dependent on the type of event that is being logged. Segment files are given ever-increasing numbers as names, starting at <filename>000000010000000000000000</filename>. The numbers do not wrap, but it will take a very, very long time to exhaust the available stock of numbers.
ru: Журналы <acronym>WAL</acronym> хранятся в каталоге <filename>pg_xlog</filename>, который находится в каталоге data, в виде списка файлов сегментов, обычно 16MB каждый (этот размер может быть изменён с помощью указания configure <option>--with-wal-segsize</option> во время компиляции сервера). Каждый файл сегмента разделяется на страницы, обычно по 8KB каждая (данный размер может быть изменён с помощью указания configure <option>--with-wal-blocksize</option>). Заголовки записи журнала описываются в <filename>access/xlogrecord.h</filename>; содержимое самой записи зависит от типа события, которое сохраняется в журнале. Файлы сегментов имеют имена-номера, которые начинаются с <filename>000000010000000000000000</filename> и увеличиваются автоматически. Эти номера не перекрываются, но пока доступные номера исчерпаются, пройдёт очень, очень долгое время.

source: It is advantageous if the log is located on a different disk from the main database files. This can be achieved by moving the <filename>pg_xlog</filename> directory to another location (while the server is shut down, of course) and creating a symbolic link from the original location in the main data directory to the new location.
ru: Выгодно размещать журналы WAL на другом диске, отличном от того, где находятся основные файлы базы данных. Для этого можно переместить каталог <filename>pg_xlog</filename> в другое место (разумеется, когда сервер остановлен) и создать символьную ссылку из исходного места на перемещённый каталог.

source: <primary>disk drive</primary>
ru: <primary>дисковое устройство</primary>

source: The aim of <acronym>WAL</acronym> is to ensure that the log is written before database records are altered, but this can be subverted by disk drives<placeholder-1/> that falsely report a successful write to the kernel, when in fact they have only cached the data and not yet stored it on the disk. A power failure in such a situation might lead to irrecoverable data corruption. Administrators should try to ensure that disks holding <productname>PostgreSQL</productname>'s <acronym>WAL</acronym> log files do not make such false reports. (See <xref linkend="wal-reliability"/>.)
ru: Для <acronym>WAL</acronym> важно, чтобы запись в журнал выполнялась до изменений данных в базе. Но этот порядок могут нарушить дисковые устройства<placeholder-1/>, которые ложно сообщают ядру об успешном завершении записи, хотя фактически они только выполнили кеширование данных и пока не сохранили их на диск. Сбой питания в такой ситуации может привести к неисправимому повреждению данных. Администраторы должны убедиться, что диски, где хранятся файлы журналов <acronym>WAL</acronym> <productname>PostgreSQL</productname>, не выдают таких ложных сообщений ядру. (См. <xref remap="4" linkend="wal-reliability"/>.)

source: After a checkpoint has been made and the log flushed, the checkpoint's position is saved in the file <filename>pg_control</filename>. Therefore, at the start of recovery, the server first reads <filename>pg_control</filename> and then the checkpoint record; then it performs the REDO operation by scanning forward from the log position indicated in the checkpoint record. Because the entire content of data pages is saved in the log on the first page modification after a checkpoint (assuming <xref linkend="guc-full-page-writes"/> is not disabled), all pages changed since the checkpoint will be restored to a consistent state.
ru: При наступлении контрольной точки и сохранения журнала, позиция контрольной точки сохраняется в файл <filename>pg_control</filename>. Таким образом, при старте восстановления, сервер сперва читает файл <filename>pg_control</filename> и затем запись контрольной точки; затем он выполняет операцию REDO, сканируя вперёд от точки журнала, обозначенной в записи контрольной точки. Поскольку полное содержимое страниц данных сохраняется в журнале в первой странице после контрольной точки (предполагается, что включён режим <xref linkend="guc-full-page-writes"/>), все страницы, изменённые с момента контрольной точки будут восстановлены в целостное состояние.

source: To deal with the case where <filename>pg_control</filename> is corrupt, we should support the possibility of scanning existing log segments in reverse order &mdash; newest to oldest &mdash; in order to find the latest checkpoint. This has not been implemented yet. <filename>pg_control</filename> is small enough (less than one disk page) that it is not subject to partial-write problems, and as of this writing there have been no reports of database failures due solely to the inability to read <filename>pg_control</filename> itself. So while it is theoretically a weak spot, <filename>pg_control</filename> does not seem to be a problem in practice.
ru: В случае, если файл <filename>pg_control</filename> повреждён, мы должны поддерживать возможность сканирования существующих сегментов журнала в обратном порядке &mdash; от новых к старым &mdash; чтобы найти последнюю контрольную точку. Это пока не реализовано. <filename>pg_control</filename> является достаточно маленьким файлом (меньше, чем одна дисковая страница), который не должен попадать под проблему частичной записи и на момент написания данной документации, не было ни одного сообщения о сбоях СУБД исключительно из-за невозможности чтения самого файла <filename>pg_control</filename>. Таким образом, хотя теоретически это является слабым местом, на практике проблем с <filename>pg_control</filename> не обнаружено.
