Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/xaggr.po
Languages: ru

source: User-defined Aggregates
ru: Пользовательские агрегатные функции

source: <primary>aggregate function</primary> <secondary>user-defined</secondary>
ru: <primary>агрегатная функция</primary> <secondary>пользовательская</secondary>

source: Aggregate functions in <productname>PostgreSQL</productname> are defined in terms of <firstterm>state values</firstterm> and <firstterm>state transition functions</firstterm>. That is, an aggregate operates using a state value that is updated as each successive input row is processed. To define a new aggregate function, one selects a data type for the state value, an initial value for the state, and a state transition function. The state transition function takes the previous state value and the aggregate's input value(s) for the current row, and returns a new state value. A <firstterm>final function</firstterm> can also be specified, in case the desired result of the aggregate is different from the data that needs to be kept in the running state value. The final function takes the ending state value and returns whatever is wanted as the aggregate result. In principle, the transition and final functions are just ordinary functions that could also be used outside the context of the aggregate. (In practice, it's often helpful for performance reasons to create specialized transition functions that can only work when called as part of an aggregate.)
ru: Агрегатные функции в <productname>PostgreSQL</productname> определяются в терминах <firstterm>значений состояния</firstterm> и <firstterm>функций перехода состояния</firstterm>. То есть агрегатная функция работает со значением состояния, которое меняется при обработке каждой последующей строки. Чтобы определить агрегатную функцию, нужно выбрать тип данных для значения состояния, начальное значение состояния и функцию перехода состояния. Функция перехода состояния принимает предыдущее значение состояния и входное агрегируемое значение для текущей строки и возвращает новое значение состояния. Также можно указать <firstterm>функцию завершения</firstterm>, на случай, если ожидаемый результат агрегатной функции отличается от данных, которые сохраняются в изменяющемся значении состояния. Функция завершения принимает конечное значение состояния и возвращает то, что она хочет вернуть в виде результата агрегирования. В принципе, функции перехода и завершения представляют собой просто обычные функции, которые также могут применяться вне контекста агрегирования. (На практике для большей производительности часто создаются специализированные функции перехода, которые работают, только когда вызываются при агрегировании.)

source: Thus, in addition to the argument and result data types seen by a user of the aggregate, there is an internal state-value data type that might be different from both the argument and result types.
ru: Таким образом, помимо типов данных аргументов и результата, с которыми имеет дело пользователь агрегатной функции, есть также тип данных внутреннего состояния, который может отличаться от этих типов.

source: If we define an aggregate that does not use a final function, we have an aggregate that computes a running function of the column values from each row. <function>sum</function> is an example of this kind of aggregate. <function>sum</function> starts at zero and always adds the current row's value to its running total. For example, if we want to make a <function>sum</function> aggregate to work on a data type for complex numbers, we only need the addition function for that data type. The aggregate definition would be: <placeholder-1/> which we might use like this: <placeholder-2/> (Notice that we are relying on function overloading: there is more than one aggregate named <function>sum</function>, but <productname>PostgreSQL</productname> can figure out which kind of sum applies to a column of type <type>complex</type>.)
ru: Если мы определяем агрегат, не использующий функцию завершения, наш агрегат будет вычислять бегущее значение функции по столбцам каждой строки. Примером такой агрегатной функции является <function>sum</function>. Вычисление <function>sum</function> начинается с нуля, а затем к накапливаемой сумме всегда прибавляется значение из текущей строки. Например, если мы хотим сделать агрегатную функцию <function>sum</function> для комплексных чисел, нам потребуется только функция сложения для такого типа данных. Такая агрегатная функция может быть определена так: <placeholder-1/> Использовать её можно будет так: <placeholder-2/> (Заметьте, что мы задействуем перегрузку функций: в системе есть несколько агрегатных функций с именем <function>sum</function>, но <productname>PostgreSQL</productname> может определить, какая именно из них применима к столбцу типа <type>complex</type>.)

source: The above definition of <function>sum</function> will return zero (the initial state value) if there are no nonnull input values. Perhaps we want to return null in that case instead &mdash; the SQL standard expects <function>sum</function> to behave that way. We can do this simply by omitting the <literal>initcond</literal> phrase, so that the initial state value is null. Ordinarily this would mean that the <literal>sfunc</literal> would need to check for a null state-value input. But for <function>sum</function> and some other simple aggregates like <function>max</function> and <function>min</function>, it is sufficient to insert the first nonnull input value into the state variable and then start applying the transition function at the second nonnull input value. <productname>PostgreSQL</productname> will do that automatically if the initial state value is null and the transition function is marked <quote>strict</quote> (i.e., not to be called for null inputs).
ru: Определённая выше функция <function>sum</function> вернёт ноль (начальное значение состояния), если в наборе данных не окажется значений, отличных от NULL. У нас может возникнуть желание вернуть NULL в этом случае &mdash; стандарт SQL требует, чтобы <function>sum</function> работала так. Мы можем добиться этого, просто опустив фразу <literal>initcond</literal>, так что начальным значением состояния будет NULL. Обычно это будет означать, что в <literal>sfunc</literal> придётся проверять входное значение состояния на NULL. Но для <function>sum</function> и некоторых других простых агрегатных функций, как <function>max</function> и <function>min</function>, достаточно вставить в переменную состояния первое входное значение не NULL, а затем начать применять функцию перехода со следующего значения не NULL. <productname>PostgreSQL</productname> сделает это автоматически, если начальное значение состояние равно NULL и функция перехода помечена как <quote>strict</quote> (то есть не должна вызываться для аргументов NULL).

source: Another bit of default behavior for a <quote>strict</quote> transition function is that the previous state value is retained unchanged whenever a null input value is encountered. Thus, null values are ignored. If you need some other behavior for null inputs, do not declare your transition function as strict; instead code it to test for null inputs and do whatever is needed.
ru: Ещё одна особенность поведения по умолчанию <quote>строгой</quote> функции перехода — предыдущее значение состояния остаётся без изменений, когда встречается значение NULL. Другими словами, значения NULL игнорируются. Если вам нужно другое поведение для входных значений NULL, не объявляйте свою функцию перехода строгой (strict); вместо этого, проверьте в ней поступающие значения на NULL и обработайте их, как требуется.

source: <function>avg</function> (average) is a more complex example of an aggregate. It requires two pieces of running state: the sum of the inputs and the count of the number of inputs. The final result is obtained by dividing these quantities. Average is typically implemented by using an array as the state value. For example, the built-in implementation of <function>avg(float8)</function> looks like: <placeholder-1/>
ru: Функция <function>avg</function> (вычисляющая среднее арифметическое) представляет собой более сложный пример агрегатной функции. Ей необходимы два компонента текущего состояния: сумма входных значений и их количество. Окончательный результат получается как частное этих величин. При реализации этой функции для значения состояния обычно используется массив. Например, встроенная реализация <function>avg(float8)</function> выглядит так: <placeholder-1/>

source: <function>float8_accum</function> requires a three-element array, not just two elements, because it accumulates the sum of squares as well as the sum and count of the inputs. This is so that it can be used for some other aggregates as well as <function>avg</function>.
ru: Функция <function>float8_accum</function> принимает массив из трёх, а не двух элементов, так как в дополнение к количеству и сумме значений она подсчитывает ещё сумму их квадратов. Это сделано для того, чтобы её можно было применять для <function>avg</function> и для некоторых других агрегатных функций.

source: Aggregate function calls in SQL allow <literal>DISTINCT</literal> and <literal>ORDER BY</literal> options that control which rows are fed to the aggregate's transition function and in what order. These options are implemented behind the scenes and are not the concern of the aggregate's support functions.
ru: Вызовы агрегатных функций SQL допускают указания <literal>DISTINCT</literal> и <literal>ORDER BY</literal>, которые определяют, какие строки и в каком порядке будут поступать в функцию перехода агрегата. Это реализовано на заднем плане и непосредственно не затрагивает функции, поддерживающие работу агрегата.

source: For further details see the <xref linkend="sql-createaggregate"/> command.
ru: За дополнительными подробностями обратитесь к описанию <xref linkend="sql-createaggregate"/>.

source: Moving-Aggregate Mode
ru: Режим движущегося агрегата

source: <primary>moving-aggregate mode</primary>
ru: <primary>режим движущегося агрегата</primary>

source: <primary>aggregate function</primary> <secondary>moving aggregate</secondary>
ru: <primary>агрегатная функция</primary> <secondary>движущийся агрегат</secondary>

source: Aggregate functions can optionally support <firstterm>moving-aggregate mode</firstterm>, which allows substantially faster execution of aggregate functions within windows with moving frame starting points. (See <xref linkend="tutorial-window"/> and <xref linkend="syntax-window-functions"/> for information about use of aggregate functions as window functions.) The basic idea is that in addition to a normal <quote>forward</quote> transition function, the aggregate provides an <firstterm>inverse transition function</firstterm>, which allows rows to be removed from the aggregate's running state value when they exit the window frame. For example a <function>sum</function> aggregate, which uses addition as the forward transition function, would use subtraction as the inverse transition function. Without an inverse transition function, the window function mechanism must recalculate the aggregate from scratch each time the frame starting point moves, resulting in run time proportional to the number of input rows times the average frame length. With an inverse transition function, the run time is only proportional to the number of input rows.
ru: Агрегатные функции могут дополнительно поддерживать <firstterm>режим движущегося агрегата</firstterm>, который позволяет значительно быстрее выполнять агрегатные функции в окнах со сдвигающимся началом рамки. (За информацией об использовании агрегатных функций в качестве оконных обратитесь к <xref remap="3" linkend="tutorial-window"/> и <xref remap="3" linkend="syntax-window-functions"/>.) Основная идея состоит в том, что помимо добавления обычной функции перехода <quote>вперёд</quote>, для агрегатной функции задаётся <firstterm>функция обратного перехода</firstterm>, которая позволяет убирать строки из накапливаемого значения состояния, когда они покидают рамку окна. Например, для <function>sum</function> в качестве функции прямого перехода выполняется сложение, а в качестве функции обратного перехода выполняется вычитание. Без функции обратного перехода механизм оконных функций вынужден вычислять агрегат заново при каждом перемещении начала рамки, в результате чего время обработки оказывается пропорциональным количеству входных строк, помноженному на средний размер рамки. С функцией обратного перехода это время пропорционально только количеству входных строк.

source: The inverse transition function is passed the current state value and the aggregate input value(s) for the earliest row included in the current state. It must reconstruct what the state value would have been if the given input row had never been aggregated, but only the rows following it. This sometimes requires that the forward transition function keep more state than is needed for plain aggregation mode. Therefore, the moving-aggregate mode uses a completely separate implementation from the plain mode: it has its own state data type, its own forward transition function, and its own final function if needed. These can be the same as the plain mode's data type and functions, if there is no need for extra state.
ru: Функции обратного перехода передаётся текущее значение состояния и агрегируемое входное значение(я) для строки, ранее учтённой в текущем состоянии. Она должна восстановить то значение состояния, которое было бы получено, если бы эта строка не агрегировалась, но агрегировались все последующие. Иногда для этого нужно, чтобы функция обратного перехода сохраняла больше информации о состоянии, чем это требуется для простого режима агрегирования. Таким образом, для режима движущегося агрегата используется реализация, отличная от простого режима: для него определяется отдельный тип данных, отдельная функция прямого перехода и отдельная функция завершения, при необходимости. Они могут совпадать с типом данных и аналогичными функциями обычного режима, если в дополнительном состоянии необходимости нет.

source: As an example, we could extend the <function>sum</function> aggregate given above to support moving-aggregate mode like this: <placeholder-1/> The parameters whose names begin with <literal>m</literal> define the moving-aggregate implementation. Except for the inverse transition function <literal>minvfunc</literal>, they correspond to the plain-aggregate parameters without <literal>m</literal>.
ru: В качестве примера мы можем доработать показанную выше агрегатную функцию <function>sum</function>, чтобы она поддерживала режим движущегося агрегата так: <placeholder-1/> Параметры, имена которых начинаются с <literal>m</literal>, определяют реализацию для движущегося агрегата. За исключением функции обратного перехода, <literal>minvfunc</literal>, они соответствуют параметрам обычного агрегата без <literal>m</literal>.

source: The forward transition function for moving-aggregate mode is not allowed to return null as the new state value. If the inverse transition function returns null, this is taken as an indication that the inverse function cannot reverse the state calculation for this particular input, and so the aggregate calculation will be redone from scratch for the current frame starting position. This convention allows moving-aggregate mode to be used in situations where there are some infrequent cases that are impractical to reverse out of the running state value. The inverse transition function can <quote>punt</quote> on these cases, and yet still come out ahead so long as it can work for most cases. As an example, an aggregate working with floating-point numbers might choose to punt when a <literal>NaN</literal> (not a number) input has to be removed from the running state value.
ru: Функции прямого перехода в режиме движущегося агрегата не разрешено возвращать NULL в качестве нового значения состояния. Если функция обратного перехода возвращает NULL, это воспринимается как признак того, что она не может восстановить предыдущее состояние для полученных данных, и значит, агрегатное вычисление нужно производить заново с текущей позиции начала рамки. Это соглашение позволяет применять режим движущегося агрегата и в ситуациях, когда прокручивать назад значение состояния непрактично. Функция обратного перехода может <quote>спасовать</quote> в таких случаях, но включаться в работу, насколько это возможно в большинстве случаев. Например, агрегатная функция, работающая с числами с плавающей точкой, может спасовать, когда от неё потребуется убрать значение <literal>NaN</literal> (не число, not a number) из текущего значения состояния.

source: When writing moving-aggregate support functions, it is important to be sure that the inverse transition function can reconstruct the correct state value exactly. Otherwise there might be user-visible differences in results depending on whether the moving-aggregate mode is used. An example of an aggregate for which adding an inverse transition function seems easy at first, yet where this requirement cannot be met is <function>sum</function> over <type>float4</type> or <type>float8</type> inputs. A naive declaration of <function>sum(<type>float8</type>)</function> could be <placeholder-1/> This aggregate, however, can give wildly different results than it would have without the inverse transition function. For example, consider <placeholder-2/> This query returns <literal>0</literal> as its second result, rather than the expected answer of <literal>1</literal>. The cause is the limited precision of floating-point values: adding <literal>1</literal> to <literal>1e20</literal> results in <literal>1e20</literal> again, and so subtracting <literal>1e20</literal> from that yields <literal>0</literal>, not <literal>1</literal>. Note that this is a limitation of floating-point arithmetic in general, not a limitation of <productname>PostgreSQL</productname>.
ru: Разрабатывая функции, реализующие режим движущегося агрегата, важно, чтобы функция обратного перехода могла восстановить в точности требуемое значение состояния. В противном случае, в результатах могут проявляться различия, в зависимости от того, использовался ли режим движущегося агрегата. Например, на первый взгляд может показаться, что легко добавить функцию обратного перехода для сложения, но заявленное требование не будет выполняться для <function>sum</function> с типом <type>float4</type> или <type>float8</type>. Наивное объявление <function>sum(<type>float8</type>)</function> может быть таким: <placeholder-1/> Однако такой агрегат может выдавать результаты, радикально отличающиеся от тех, что он выдавал бы без функции обратного перехода. Например, рассмотрите запрос <placeholder-2/> Он возвращает <literal>0</literal> в качестве второго результата, а не ожидаемое значение <literal>1</literal>. Это связано с ограниченной точностью значений с плавающей точкой: при добавлении <literal>1</literal> к <literal>1e20</literal> снова получается <literal>1e20</literal>, а при вычитании <literal>1e20</literal> из результата получается <literal>0</literal>, а не <literal>1</literal>. Заметьте, что это принципиальное ограничение арифметики чисел с плавающей точкой, а не недостаток <productname>PostgreSQL</productname>.

source: Polymorphic and Variadic Aggregates
ru: Агрегатные функции с полиморфными и переменными аргументами

source: <primary>aggregate function</primary> <secondary>polymorphic</secondary>
ru: <primary>агрегатная функция</primary> <secondary>полиморфная</secondary>

source: <primary>aggregate function</primary> <secondary>variadic</secondary>
ru: <primary>агрегатная функция</primary> <secondary>с переменными аргументами</secondary>

source: Aggregate functions can use polymorphic state transition functions or final functions, so that the same functions can be used to implement multiple aggregates. See <xref linkend="extend-types-polymorphic"/> for an explanation of polymorphic functions. Going a step further, the aggregate function itself can be specified with polymorphic input type(s) and state type, allowing a single aggregate definition to serve for multiple input data types. Here is an example of a polymorphic aggregate: <placeholder-1/> Here, the actual state type for any given aggregate call is the array type having the actual input type as elements. The behavior of the aggregate is to concatenate all the inputs into an array of that type. (Note: the built-in aggregate <function>array_agg</function> provides similar functionality, with better performance than this definition would have.)
ru: Агрегатная функция может использовать полиморфные функции перехода состояния или функции завершения, так что эти функции могут применяться для реализации нескольких агрегатов. За объяснением полиморфных функций обратитесь к <xref remap="3" linkend="extend-types-polymorphic"/>. Более того, сама агрегатная функция может описываться с полиморфными типами входных данных и состояния, так что одно определение агрегатной функции может служить для использования с разными типами данных. Пример полиморфного агрегата: <placeholder-1/> Здесь фактическим типом состояния для любого конкретного агрегатного вызова будет массив, элементы которого будут иметь тип входных данных. Действие данного агрегата заключается в накоплении всех входных значений в массиве этого типа. (К вашему сведению: встроенная агрегатная функция <function>array_agg</function> обеспечивает подобную функциональность, но работает быстрее, чем могла бы функция с приведённым определением.)

source: Here's the output using two different actual data types as arguments: <placeholder-1/>
ru: Так будут выглядеть результаты с аргументами двух различных типов: <placeholder-1/>
