Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/xaggr.po
Languages: ru

source: Ordinarily, an aggregate function with a polymorphic result type has a polymorphic state type, as in the above example. This is necessary because otherwise the final function cannot be declared sensibly: it would need to have a polymorphic result type but no polymorphic argument type, which <command>CREATE FUNCTION</command> will reject on the grounds that the result type cannot be deduced from a call. But sometimes it is inconvenient to use a polymorphic state type. The most common case is where the aggregate support functions are to be written in C and the state type should be declared as <type>internal</type> because there is no SQL-level equivalent for it. To address this case, it is possible to declare the final function as taking extra <quote>dummy</quote> arguments that match the input arguments of the aggregate. Such dummy arguments are always passed as null values since no specific value is available when the final function is called. Their only use is to allow a polymorphic final function's result type to be connected to the aggregate's input type(s). For example, the definition of the built-in aggregate <function>array_agg</function> is equivalent to <placeholder-1/> Here, the <literal>finalfunc_extra</literal> option specifies that the final function receives, in addition to the state value, extra dummy argument(s) corresponding to the aggregate's input argument(s). The extra <type>anynonarray</type> argument allows the declaration of <function>array_agg_finalfn</function> to be valid.
ru: Обычно агрегатная функция с полиморфным типом результата имеет и полиморфный тип состояния, как в предыдущем примере. Это необходимо, так как иначе нельзя будет объявить функцию завершения: она должна будет иметь полиморфный тип результата, но не будет иметь полиморфного аргумента, что команда <command>CREATE FUNCTION</command> не примет на основании того, что тип результата нельзя будет определить при вызове. Но иметь полиморфный тип состояния не всегда удобно. Чаще всего эта проблема возникает, когда функции реализации агрегата пишутся на C и тип состояния должен объявляться как <type>internal</type>, так как для него нет соответствующего типа на уровне SQL. Чтобы решить эту проблему, можно объявить функцию завершения как принимающую дополнительные фиктивные аргументы, соответствующие входным аргументам агрегата. В этих фиктивных аргументах всегда передаются значения NULL, так как при вызове функции завершения какое-либо определённое значение отсутствует. Единственное их предназначение — позволить связать тип результата полиморфной функции завершения с типом входных данных агрегата. Например, определение встроенного агрегата <function>array_agg</function> выглядит так: <placeholder-1/> Здесь параметр <literal>finalfunc_extra</literal> указывает, что функция завершения помимо значения состояния получит дополнительные фиктивные аргументы, соответствующие входным аргументам агрегата. Дополнительный аргумент <type>anynonarray</type> позволяет сделать объявление <function>array_agg_finalfn</function> допустимым.

source: An aggregate function can be made to accept a varying number of arguments by declaring its last argument as a <literal>VARIADIC</literal> array, in much the same fashion as for regular functions; see <xref linkend="xfunc-sql-variadic-functions"/>. The aggregate's transition function(s) must have the same array type as their last argument. The transition function(s) typically would also be marked <literal>VARIADIC</literal>, but this is not strictly required.
ru: Агрегатную функцию можно сделать принимающей переменное число аргументов, объявив её последний аргумент как массив <literal>VARIADIC</literal>, в том же ключе, как и обычную функцию; см. <xref remap="4" linkend="xfunc-sql-variadic-functions"/>. При этом у функций перехода агрегата их последний аргумент должен иметь тот же тип массива. Такие функции обычно также объявляются как <literal>VARIADIC</literal>, но строго это не требуется.

source: Variadic aggregates are easily misused in connection with the <literal>ORDER BY</literal> option (see <xref linkend="syntax-aggregates"/>), since the parser cannot tell whether the wrong number of actual arguments have been given in such a combination. Keep in mind that everything to the right of <literal>ORDER BY</literal> is a sort key, not an argument to the aggregate. For example, in <placeholder-1/> the parser will see this as a single aggregate function argument and three sort keys. However, the user might have intended <placeholder-2/> If <literal>myaggregate</literal> is variadic, both these calls could be perfectly valid.
ru: Агрегатные функции с переменными аргументами легко допускают ошибочное использование в сочетании с указанием <literal>ORDER BY</literal> (см. <xref remap="4" linkend="syntax-aggregates"/>), так как анализатор запроса не может определить, было ли передано нужное количество фактических параметров в такой комбинации. Помните, что всё, находящееся справа от <literal>ORDER BY</literal>, является ключом сортировки, а не аргументом агрегатной функции. Например, в <placeholder-1/> анализатор запроса увидит один агрегатный аргумент функции и три ключа сортировки. Однако пользователь мог подразумевать и следующее: <placeholder-2/> Если функция <literal>myaggregate</literal> принимает переменные аргументы, оба эти вызова будут вполне допустимы.

source: For the same reason, it's wise to think twice before creating aggregate functions with the same names and different numbers of regular arguments.
ru: По этой же причине, стоит подумать дважды, прежде чем создавать агрегатные функции с одинаковыми именами, но разным числом обычных аргументов.

source: Ordered-Set Aggregates
ru: Сортирующие агрегатные функции

source: <primary>aggregate function</primary> <secondary>ordered set</secondary>
ru: <primary>агрегатная функция</primary> <secondary>сортирующая</secondary>

source: The aggregates we have been describing so far are <quote>normal</quote> aggregates. <productname>PostgreSQL</productname> also supports <firstterm>ordered-set aggregates</firstterm>, which differ from normal aggregates in two key ways. First, in addition to ordinary aggregated arguments that are evaluated once per input row, an ordered-set aggregate can have <quote>direct</quote> arguments that are evaluated only once per aggregation operation. Second, the syntax for the ordinary aggregated arguments specifies a sort ordering for them explicitly. An ordered-set aggregate is usually used to implement a computation that depends on a specific row ordering, for instance rank or percentile, so that the sort ordering is a required aspect of any call. For example, the built-in definition of <function>percentile_disc</function> is equivalent to: <placeholder-1/> This aggregate takes a <type>float8</type> direct argument (the percentile fraction) and an aggregated input that can be of any sortable data type. It could be used to obtain a median household income like this: <placeholder-2/> Here, <literal>0.5</literal> is a direct argument; it would make no sense for the percentile fraction to be a value varying across rows.
ru: Описанные выше агрегатные функции были <quote>обычными</quote> агрегатами. Но <productname>PostgreSQL</productname> также поддерживает <firstterm>сортирующие агрегатные функции</firstterm>, которые имеют два отличия от обычных. Во-первых, в дополнение к обычным агрегируемым аргументам, вычисляемых для каждой входной строки, сортирующий агрегат может иметь <quote>непосредственные</quote> аргументы, которые должны вычисляться в операции агрегирования только один раз. Во-вторых, для обычных агрегируемых аргументов порядок их сортировки задаётся явно, а сортирующий агрегат обычно выполняет вычисления, зависящие от конкретного порядка строк, например, вычисляет ранг или процентиль, так что порядок сортировки критичен для каждого вызова. Например, встроенное определение функции <function>percentile_disc</function> равнозначно следующему: <placeholder-1/> Этот агрегат принимает непосредственный аргумент <type>float8</type> (дробь процентиля) и агрегируемые данные, которые могут быть любого упорядочиваемого типа. Используя его, можно рассчитать средний семейный доход следующим образом: <placeholder-2/> В данном случае, <literal>0.5</literal> — это непосредственный аргумент; если бы дробь процентиля менялась от строки к строке, это не имело бы смысла.

source: Unlike the case for normal aggregates, the sorting of input rows for an ordered-set aggregate is <emphasis>not</emphasis> done behind the scenes, but is the responsibility of the aggregate's support functions. The typical implementation approach is to keep a reference to a <quote>tuplesort</quote> object in the aggregate's state value, feed the incoming rows into that object, and then complete the sorting and read out the data in the final function. This design allows the final function to perform special operations such as injecting additional <quote>hypothetical</quote> rows into the data to be sorted. While normal aggregates can often be implemented with support functions written in <application>PL/pgSQL</application> or another PL language, ordered-set aggregates generally have to be written in C, since their state values aren't definable as any SQL data type. (In the above example, notice that the state value is declared as type <type>internal</type> &mdash; this is typical.)
ru: В отличие от случая с обычными агрегатами, сортировка входных строк для сортирующего агрегата <emphasis>не</emphasis> выполняется на заднем плане, а является задачей функций, реализующих агрегат. Обычный подход к такой реализации заключается в сохранении ссылки на объект <quote>tuplesort</quote> в значении состояния агрегата, загрузке поступающих строк в этот объект, и собственно завершении сортировки и обработки данных в функции завершения. Такая конструкция позволяет функции завершения выполнять специальные операции, в частности, вставлять дополнительные <quote>гипотетические</quote> строки в сортируемые данные. Тогда как обычные агрегаты часто реализуются функциями, написанными на <application>PL/pgSQL</application> или другом процедурном языке, сортирующие агрегатные функции обычно должны быть написаны на C, так как их значение состояния нельзя выразить каким-либо типом данных SQL. (Обратите внимание, что в приведённом выше примере значение состояния объявлено как имеющее тип <type>internal</type> &mdash; это типичный вариант.)

source: The state transition function for an ordered-set aggregate receives the current state value plus the aggregated input values for each row, and returns the updated state value. This is the same definition as for normal aggregates, but note that the direct arguments (if any) are not provided. The final function receives the last state value, the values of the direct arguments if any, and (if <literal>finalfunc_extra</literal> is specified) null values corresponding to the aggregated input(s). As with normal aggregates, <literal>finalfunc_extra</literal> is only really useful if the aggregate is polymorphic; then the extra dummy argument(s) are needed to connect the final function's result type to the aggregate's input type(s).
ru: Функция перехода состояния для сортирующего агрегата получает значение текущего состояния плюс агрегируемые входные данные для каждой строки и возвращает изменённое значение состояния. Это определение распространяется и на обычные агрегаты, но заметьте, что непосредственные аргументы (если они есть) при этом не передаются. Функция завершения же получает последнее значение состояния и значения непосредственных аргументов (если они есть), а также (если присутствует указание <literal>finalfunc_extra</literal>) значения NULL, соответствующие агрегируемым данным. С обычными агрегатами указание <literal>finalfunc_extra</literal> действительно полезно, только если агрегат полиморфный; тогда дополнительные фиктивные аргументы необходимы, чтобы связать тип результата функции завершения с типом(ами) входных данных агрегата.

source: Currently, ordered-set aggregates cannot be used as window functions, and therefore there is no need for them to support moving-aggregate mode.
ru: В настоящее время сортирующие агрегаты не могут использоваться в качестве оконных функций, поэтому от них поддержка режима движущегося агрегата не требуется.

source: Partial Aggregation
ru: Частичное агрегирование

source: <primary>aggregate function</primary> <secondary>partial aggregation</secondary>
ru: <primary>агрегатная функция</primary> <secondary>частичное агрегирования</secondary>

source: Optionally, an aggregate function can support <firstterm>partial aggregation</firstterm>. The idea of partial aggregation is to run the aggregate's state transition function over different subsets of the input data independently, and then to combine the state values resulting from those subsets to produce the same state value that would have resulted from scanning all the input in a single operation. This mode can be used for parallel aggregation by having different worker processes scan different portions of a table. Each worker produces a partial state value, and at the end those state values are combined to produce a final state value. (In the future this mode might also be used for purposes such as combining aggregations over local and remote tables; but that is not implemented yet.)
ru: Дополнительно агрегатная функция может поддерживать <firstterm>частичное агрегирование</firstterm>. Идея такого агрегирования в том, чтобы вызывать функции перехода состояния для различных подмножеств входных данных независимо, а затем комбинировать значения состояния, вычисленные по этим подмножествам, и получать тот же результат, что был бы получен при сканировании сразу всех входных данных. Этот режим может применяться для параллельного агрегирования, когда разные рабочие процессы сканируют различные части таблицы. При этом каждый рабочий процесс выдаёт частичное значение состояния, а в конце эти значения комбинируются вместе и получается окончательное значение состояния. (В будущем этот режим может также применяться, например для комбинированного агрегирования локальных и удалённых таблиц, но пока это не реализовано.)

source: To support partial aggregation, the aggregate definition must provide a <firstterm>combine function</firstterm>, which takes two values of the aggregate's state type (representing the results of aggregating over two subsets of the input rows) and produces a new value of the state type, representing what the state would have been after aggregating over the combination of those sets of rows. It is unspecified what the relative order of the input rows from the two sets would have been. This means that it's usually impossible to define a useful combine function for aggregates that are sensitive to input row order.
ru: Для поддержки частичного агрегирования в определении агрегатной функции должна задаваться <firstterm>комбинирующая функция</firstterm>, принимающая два значения типа состояния агрегата (представляющие результаты агрегирования по двум подмножествам входных строк) и выдающая новое значение типа состояния, представляющее то состояние, которое было бы получено при агрегировании совокупности этих подмножеств строк. При этом относительный порядок входных строк в этих двух множествах не оговаривается. Это значит, что для агрегатных функций, зависящих от порядка входных строк, обычно невозможно определить осмысленную комбинирующую функцию.

source: As simple examples, <literal>MAX</literal> and <literal>MIN</literal> aggregates can be made to support partial aggregation by specifying the combine function as the same greater-of-two or lesser-of-two comparison function that is used as their transition function. <literal>SUM</literal> aggregates just need an addition function as combine function. (Again, this is the same as their transition function, unless the state value is wider than the input data type.)
ru: В качестве простого примера, частичное агрегирование могут поддерживать функции <literal>MAX</literal> и <literal>MIN</literal>, если задать в качестве комбинирующей соответственно функцию сравнения значений большее-из-двух или меньшее-из-двух, ту же, что они используют и как функцию перехода. Для <literal>SUM</literal> комбинирующей функцией будет просто функция сложения. (И это опять же функция перехода, если только значение состояния не выходит за рамки типа входных данных.)

source: The combine function is treated much like a transition function that happens to take a value of the state type, not of the underlying input type, as its second argument. In particular, the rules for dealing with null values and strict functions are similar. Also, if the aggregate definition specifies a non-null <literal>initcond</literal>, keep in mind that that will be used not only as the initial state for each partial aggregation run, but also as the initial state for the combine function, which will be called to combine each partial result into that state.
ru: Комбинирующая функция задействуется практически так же, как функция перехода, но принимает в качестве второго аргумента значение типа состояния, а не нижележащего входного типа. В частности, на неё распространяются те же правила строгости функции и передачи значений NULL. Также учтите, что если в определении агрегатной функции задаётся отличное от NULL значение <literal>initcond</literal>, оно будет задавать начальное состояние не только для каждого прохода частичного агрегирования, но также и начальное состояние для комбинирующей функции, которая будет вызываться для комбинирования каждого частичного результата в этом состоянии.

source: If the aggregate's state type is declared as <type>internal</type>, it is the combine function's responsibility that its result is allocated in the correct memory context for aggregate state values. This means in particular that when the first input is <literal>NULL</literal> it's invalid to simply return the second input, as that value will be in the wrong context and will not have sufficient lifespan.
ru: Если типом состояния агрегатной функции выбран <type>internal</type>, комбинирующая функция отвечает за то, чтобы её результат был помещён в контекст памяти, подходящий для значений агрегатного состояния. В частности это значит, что, получив в первом аргументе <literal>NULL</literal>, нельзя просто возвратить второй аргумент, так как это значение окажется в неверном контексте и не просуществует достаточное время.

source: When the aggregate's state type is declared as <type>internal</type>, it is usually also appropriate for the aggregate definition to provide a <firstterm>serialization function</firstterm> and a <firstterm>deserialization function</firstterm>, which allow such a state value to be copied from one process to another. Without these functions, parallel aggregation cannot be performed, and future applications such as local/remote aggregation will probably not work either.
ru: Когда типом состояния агрегатной функции выбран <type>internal</type>, обычно в определении агрегатной функции также уместно задать <firstterm>функцию сериализации</firstterm> и <firstterm>функцию десериализации</firstterm>, которые позволяют копировать значение состояния из одного процесса в другой. Без этих функций параллельное агрегирование невозможно, а также вероятно не будут работать такие будущие приложения, как локальное/удалённое агрегирование.

source: A serialization function must take a single argument of type <type>internal</type> and return a result of type <type>bytea</type>, which represents the state value packaged up into a flat blob of bytes. Conversely, a deserialization function reverses that conversion. It must take two arguments of types <type>bytea</type> and <type>internal</type>, and return a result of type <type>internal</type>. (The second argument is unused and is always zero, but it is required for type-safety reasons.) The result of the deserialization function should simply be allocated in the current memory context, as unlike the combine function's result, it is not long-lived.
ru: Функция сериализации должна принимать один аргумент типа <type>internal</type> и возвращать результат типа <type>bytea</type>, представляющий значение состояния, упакованное в плоский набор байтов. Функция десериализации, напротив, обращает это преобразование. Она должна принимать два аргумента типов <type>bytea</type> и <type>internal</type> и возвращать результат типа <type>internal</type>. (Второй её аргумент не используется и всегда равен нулю, но он требуется из соображений типобезопасности.) Результат функции десериализации следует просто разместить в текущем контексте памяти, так как в отличие от результата комбинирующей функции он недолговечен.

source: Worth noting also is that for an aggregate to be executed in parallel, the aggregate itself must be marked <literal>PARALLEL SAFE</literal>. The parallel-safety markings on its support functions are not consulted.
ru: Также стоит заметить, что для выполнения агрегатной функции в параллельном режиме она должна иметь характеристику <literal>PARALLEL SAFE</literal> (безопасная для распараллеливания). Характеристики допустимости распараллеливания её опорных функций значения не имеют.

source: Support Functions for Aggregates
ru: Вспомогательные функции для агрегатов

source: <primary>aggregate function</primary> <secondary>support functions for</secondary>
ru: <primary>агрегатная функция</primary> <secondary>вспомогательные функции</secondary>

source: A function written in C can detect that it is being called as an aggregate support function by calling <function>AggCheckCallContext</function>, for example: <placeholder-1/> One reason for checking this is that when it is true for a transition function, the first input must be a temporary state value and can therefore safely be modified in-place rather than allocating a new copy. See <function>int8inc()</function> for an example. (This is the <emphasis>only</emphasis> case where it is safe for a function to modify a pass-by-reference input. In particular, final functions for normal aggregates must not modify their inputs in any case, because in some cases they will be re-executed on the same final state value.)
ru: Функция, написанная на C, может определить, была ли она вызвана как вспомогательная функция агрегирования, вызвав <function>AggCheckCallContext</function>, например, так: <placeholder-1/> Смысл такой проверки в том, что для функции перехода (когда эта функция возвращает true) первым входным аргументом является временное значение состояния, которое можно безопасно модифицировать на месте, не создавая новую копию. Пример вы можете увидеть в функции <function>int8inc()</function>. (Это <emphasis>единственный</emphasis> случай, когда функция может безопасно изменять входные данные, передаваемые по ссылке. В частности, функции завершения для обычных агрегатов не должны изменять входные данные ни в коем случае, так как в некоторых ситуациях они могут вызываться повторно с тем же конечным значением состояния.)
