Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/xaggr.po
Languages: ru

source: The second argument of <function>AggCheckCallContext</function> can be used to retrieve the memory context in which aggregate state values are being kept. This is useful for transition functions that wish to use <quote>expanded</quote> objects (see <xref linkend="xtypes-toast"/>) as their state values. On first call, the transition function should return an expanded object whose memory context is a child of the aggregate state context, and then keep returning the same expanded object on subsequent calls. See <function>array_append()</function> for an example. (<function>array_append()</function> is not the transition function of any built-in aggregate, but it is written to behave efficiently when used as transition function of a custom aggregate.)
ru: Второй аргумент <function>AggCheckCallContext</function> можно использовать, чтобы получить контекст памяти, в котором содержатся значения агрегатного состояния. Это полезно для функций перехода, которые желают использовать <quote>развёрнутые</quote> объёкты (см. <xref remap="4" linkend="xtypes-toast"/>) в качестве значений состояния. При первом вызове такая функция перехода должна возвратить развёрнутый объект в контексте памяти, относящемся к контексту состояния агрегата, а затем продолжать возвращать тот же объект при последующих вызовах. Например, эту логику можно увидеть в функции <function>array_append()</function>. (Функция <function>array_append()</function> не используется в качестве перехода никаким встроенным агрегатом, но она написана так, чтобы работать эффективно в таком качестве в дополнительном агрегате.)

source: Another support routine available to aggregate functions written in C is <function>AggGetAggref</function>, which returns the <literal>Aggref</literal> parse node that defines the aggregate call. This is mainly useful for ordered-set aggregates, which can inspect the substructure of the <literal>Aggref</literal> node to find out what sort ordering they are supposed to implement. Examples can be found in <filename>orderedsetaggs.c</filename> in the <productname>PostgreSQL</productname> source code.
ru: Ещё одна вспомогательная подпрограмма, предназначенная для агрегатных функций, написанных на C, называется <function>AggGetAggref</function>. Эта функция возвращает узел разбора <literal>Aggref</literal>, описывающий вызов агрегата. Это в основном полезно для сортирующих агрегатов, которые могут исследовать структуру узла <literal>Aggref</literal> и выяснить, какой порядок сортировки они должны реализовать. Примеры использования можно найти в <filename>orderedsetaggs.c</filename> в исходном коде <productname>PostgreSQL</productname>.
