Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/xfunc.po
Languages: ru

source: It is recommended to locate shared libraries either relative to <literal>$libdir</literal> or through the dynamic library path. This simplifies version upgrades if the new installation is at a different location. The actual directory that <literal>$libdir</literal> stands for can be found out with the command <literal>pg_config --pkglibdir</literal>.
ru: Для поиска разделяемых библиотек рекомендуется задавать либо путь относительно <literal>$libdir</literal>, либо путь динамических библиотек. Это упрощает обновление версии при перемещении новой инсталляции в другое место. Какой именно каталог подразумевается под <literal>$libdir</literal>, можно узнать с помощью команды <literal>pg_config --pkglibdir</literal>.

source: The user ID the <productname>PostgreSQL</productname> server runs as must be able to traverse the path to the file you intend to load. Making the file or a higher-level directory not readable and/or not executable by the <systemitem>postgres</systemitem> user is a common mistake.
ru: Пользователь, от имени которого работает сервер <productname>PostgreSQL</productname>, должен иметь возможность пройти путь к файлу, который требуется загрузить. Очень распространённая ошибка — когда сам файл или каталог верхнего уровня оказывается недоступным для чтения и/или исполнения для пользователя <systemitem>postgres</systemitem>.

source: In any case, the file name that is given in the <command>CREATE FUNCTION</command> command is recorded literally in the system catalogs, so if the file needs to be loaded again the same procedure is applied.
ru: В любом случае, имя файла, заданное в команде <command>CREATE FUNCTION</command>, записывается в системные каталоги буквально, так что если этот файл потребуется загрузить ещё раз, та же процедура будет проделана снова.

source: <productname>PostgreSQL</productname> will not compile a C function automatically. The object file must be compiled before it is referenced in a <command>CREATE FUNCTION</command> command. See <xref linkend="dfunc"/> for additional information.
ru: <productname>PostgreSQL</productname> не будет компилировать функцию на C автоматически, поэтому прежде чем ссылаться на объектный файл в команде <command>CREATE FUNCTION</command>, его нужно скомпилировать. За дополнительными сведениями обратитесь к <xref remap="3" linkend="dfunc"/>.

source: <primary>magic block</primary>
ru: <primary>отличительный блок</primary>

source: To ensure that a dynamically loaded object file is not loaded into an incompatible server, <productname>PostgreSQL</productname> checks that the file contains a <quote>magic block</quote> with the appropriate contents. This allows the server to detect obvious incompatibilities, such as code compiled for a different major version of <productname>PostgreSQL</productname>. A magic block is required as of <productname>PostgreSQL</productname> 8.2. To include a magic block, write this in one (and only one) of the module source files, after having included the header <filename>fmgr.h</filename>: <placeholder-1/> The <literal>#ifdef</literal> test can be omitted if the code doesn't need to compile against pre-8.2 <productname>PostgreSQL</productname> releases.
ru: Чтобы гарантировать, что динамически загружаемый объектный файл не будет загружен несовместимым сервером, <productname>PostgreSQL</productname> проверяет, содержит ли этот файл <quote>отличительный блок</quote> с требуемым содержимым. Благодаря этому сервер может выявить очевидную несовместимость, например, когда код скомпилирован для другой старшей версии <productname>PostgreSQL</productname>. Отличительный блок стал обязательным, начиная с версии <productname>PostgreSQL</productname> 8.2. Чтобы включить его в свой модуль, напишите это в одном (и только одном) из исходных файлов модуля, после включения заголовочного файла <filename>fmgr.h</filename>: <placeholder-1/> Проверку <literal>#ifdef</literal> можно опустить, если этот код не планируется компилировать для версий <productname>PostgreSQL</productname> до 8.2.

source: After it is used for the first time, a dynamically loaded object file is retained in memory. Future calls in the same session to the function(s) in that file will only incur the small overhead of a symbol table lookup. If you need to force a reload of an object file, for example after recompiling it, begin a fresh session.
ru: После того, как он был использован первый раз, динамически загружаемый объектный файл сохраняется в памяти. Следующие обращения в том же сеансе к функциям в этом файле повлекут только небольшие издержки, связанные с поиском в таблице символов. Если вам нужно принудительно перезагрузить объектный файл, например, после перекомпиляции, начните новый сеанс.

source: <primary>library initialization function</primary>
ru: <primary>функция инициализации библиотеки</primary>

source: <primary>library finalization function</primary>
ru: <primary>функция завершения работы библиотеки</primary>

source: Optionally, a dynamically loaded file can contain initialization and finalization functions. If the file includes a function named <function>_PG_init</function>, that function will be called immediately after loading the file. The function receives no parameters and should return void. If the file includes a function named <function>_PG_fini</function>, that function will be called immediately before unloading the file. Likewise, the function receives no parameters and should return void. Note that <function>_PG_fini</function> will only be called during an unload of the file, not during process termination. (Presently, unloads are disabled and will never occur, but this may change in the future.)
ru: Динамически загружаемый файл может дополнительно содержать функции инициализации и завершения работы библиотеки. Если в файле находится функция с именем <function>_PG_init</function>, эта функция будет вызвана сразу после загрузки файла. Эта функция не принимает параметры и не должна ничего возвращать. Если в файле находится функция <function>_PG_fini</function>, эта функция будет вызвана непосредственно перед выгрузкой файла. Эта функция так же не принимает параметры и не должна ничего возвращать. Заметьте, что <function>_PG_fini</function> будет вызываться только при выгрузке файла, но не при завершении процесса. (В настоящее время выгрузка отключена и не происходит никогда, но в будущем это может измениться.)

source: Base Types in C-Language Functions
ru: Базовые типы в функциях на языке C

source: <primary>data type</primary> <secondary>internal organization</secondary>
ru: <primary>тип данных</primary> <secondary>внутренняя организация</secondary>

source: To know how to write C-language functions, you need to know how <productname>PostgreSQL</productname> internally represents base data types and how they can be passed to and from functions. Internally, <productname>PostgreSQL</productname> regards a base type as a <quote>blob of memory</quote>. The user-defined functions that you define over a type in turn define the way that <productname>PostgreSQL</productname> can operate on it. That is, <productname>PostgreSQL</productname> will only store and retrieve the data from disk and use your user-defined functions to input, process, and output the data.
ru: Чтобы понимать, как написать функцию на языке C, вы должны знать, как внутри <productname>PostgreSQL</productname> представляются базовые типы данных и как их могут принимать и передавать функции. <productname>PostgreSQL</productname> внутри воспринимает базовые типы как <quote>блоки памяти</quote>. Пользовательские функции, устанавливаемые для типов, в свою очередь, определяют, как <productname>PostgreSQL</productname> может работать с этими типами. То есть, <productname>PostgreSQL</productname> только сохраняет и загружает данные с диска, а для ввода, обработки и вывода данных он использует определяемые вами функции.

source: pass by value, fixed-length
ru: передаётся по значению, фиксированной длины

source: pass by reference, fixed-length
ru: передаётся по ссылке, фиксированной длины

source: pass by reference, variable-length
ru: передаётся по ссылке, переменной длины

source: Base types can have one of three internal formats: <placeholder-1/>
ru: Базовые типы могут иметь один из трёх внутренних форматов: <placeholder-1/>

source: /* 4-byte integer, passed by value */ typedef int int4;
ru: /* 4-байтное целое, передаётся по значению */ typedef int int4;

source: By-value types can only be 1, 2, or 4 bytes in length (also 8 bytes, if <literal>sizeof(Datum)</literal> is 8 on your machine). You should be careful to define your types such that they will be the same size (in bytes) on all architectures. For example, the <literal>long</literal> type is dangerous because it is 4 bytes on some machines and 8 bytes on others, whereas <type>int</type> type is 4 bytes on most Unix machines. A reasonable implementation of the <type>int4</type> type on Unix machines might be: <placeholder-1/> (The actual PostgreSQL C code calls this type <type>int32</type>, because it is a convention in C that <type>int<replaceable>XX</replaceable></type> means <replaceable>XX</replaceable> <emphasis>bits</emphasis>. Note therefore also that the C type <type>int8</type> is 1 byte in size. The SQL type <type>int8</type> is called <type>int64</type> in C. See also <xref linkend="xfunc-c-type-table"/>.)
ru: Типы, передаваемые по значению, могут иметь размер только 1, 2 или 4 байта (и 8 байт, если <literal>sizeof(Datum)</literal> равен 8 на вашей машине). Определяя собственные типы, следует позаботиться о том, чтобы они имели одинаковый размер (в байтах) во всех архитектурах. Например, тип <literal>long</literal> опасен, так как он имеет размер 4 байта на одних машинах, и 8 байт на других, тогда как тип <type>int</type> состоит из 4 байт в большинстве систем Unix. Поэтому разумной реализацией типа <type>int4</type> на платформе Unix может быть такая: <placeholder-1/> (В коде собственно PostgreSQL этот тип называется <type>int32</type>, так как в C принято соглашение, что <type>int<replaceable>XX</replaceable></type> подразумевает <replaceable>XX</replaceable> <emphasis>бит</emphasis>. Заметьте, что вследствие этого тип <type>int8</type> в C имеет размер 1 байт. Тип <type>int8</type>, принятый в SQL, в C называется <type>int64</type>. См. также <xref remap="4" linkend="xfunc-c-type-table"/>.)

source: /* 16-byte structure, passed by reference */ typedef struct { double x, y; } Point;
ru: /* 16-байтная структура, передаётся по ссылке */ typedef struct { double x, y; } Point;

source: On the other hand, fixed-length types of any size can be passed by-reference. For example, here is a sample implementation of a <productname>PostgreSQL</productname> type: <placeholder-1/> Only pointers to such types can be used when passing them in and out of <productname>PostgreSQL</productname> functions. To return a value of such a type, allocate the right amount of memory with <literal>palloc</literal>, fill in the allocated memory, and return a pointer to it. (Also, if you just want to return the same value as one of your input arguments that's of the same data type, you can skip the extra <literal>palloc</literal> and just return the pointer to the input value.)
ru: С другой стороны, типы фиксированной длины любого размера можно передавать по ссылке. Например, взгляните на пример реализации типа <productname>PostgreSQL</productname>: <placeholder-1/> В функции <productname>PostgreSQL</productname> и из них могут передаваться только указатели на такие типы. Чтобы вернуть значение такого типа, выделите для него нужное количество памяти функцией <literal>palloc</literal>, заполните выделенную память и верните указатель на неё. (Если вы захотите просто вернуть то же значение, что было получено во входном аргументе этого же типа данных, вы можете пропустить дополнительный вызов <literal>palloc</literal> и просто вернуть указатель на это поступившее значение.)

source: Finally, all variable-length types must also be passed by reference. All variable-length types must begin with an opaque length field of exactly 4 bytes, which will be set by <symbol>SET_VARSIZE</symbol>; never set this field directly! All data to be stored within that type must be located in the memory immediately following that length field. The length field contains the total length of the structure, that is, it includes the size of the length field itself.
ru: Наконец, все типы переменной длины также должны передаваться по ссылке. Все типы переменной длины должны начинаться с обязательного поля длины размером ровно 4 байта, которая будет задаваться макросом <symbol>SET_VARSIZE</symbol>; никогда не устанавливайте это поле вручную! Все данные, которые будут храниться в этом типе, должны размещаться в памяти непосредственно за этим полем длины. Поле длины содержит полную длину структуры, то есть включает размер самого поля длины.

source: Another important point is to avoid leaving any uninitialized bits within data type values; for example, take care to zero out any alignment padding bytes that might be present in structs. Without this, logically-equivalent constants of your data type might be seen as unequal by the planner, leading to inefficient (though not incorrect) plans.
ru: Ещё один важный момент — старайтесь не оставлять неинициализированных байт в значениях данных; например, обнуляйте все возможные байты выравнивания, которые могут присутствовать в структурах. Если этого не делать, логически равные значения ваших данных могут представляться неравными планировщику, что приведёт к построению неэффективных (хотя и корректных) планов.

source: <emphasis>Never</emphasis> modify the contents of a pass-by-reference input value. If you do so you are likely to corrupt on-disk data, since the pointer you are given might point directly into a disk buffer. The sole exception to this rule is explained in <xref linkend="xaggr"/>.
ru: <emphasis>Никогда</emphasis> не изменяйте содержимое, передаваемое на вход по ссылке. Если вы сделаете это, вы скорее всего испортите данные на диске, так как полученный вами указатель указывает непосредственно на место в дисковом буфере. Единственное исключение из этого правила освещается в <xref remap="6" linkend="xaggr"/>.

source: As an example, we can define the type <type>text</type> as follows: <placeholder-1/> The <literal>[FLEXIBLE_ARRAY_MEMBER]</literal> notation means that the actual length of the data part is not specified by this declaration.
ru: В качестве примера мы можем определить тип <type>text</type> так: <placeholder-1/> Запись <literal>[FLEXIBLE_ARRAY_MEMBER]</literal> означает, что действительная длина массива данных в этом объявлении не указывается.

source: When manipulating variable-length types, we must be careful to allocate the correct amount of memory and set the length field correctly. For example, if we wanted to store 40 bytes in a <structname>text</structname> structure, we might use a code fragment like this: <placeholder-1/> <literal>VARHDRSZ</literal> is the same as <literal>sizeof(int32)</literal>, but it's considered good style to use the macro <literal>VARHDRSZ</literal> to refer to the size of the overhead for a variable-length type. Also, the length field <emphasis>must</emphasis> be set using the <literal>SET_VARSIZE</literal> macro, not by simple assignment.
ru: Работая с типами переменной длины, мы должны аккуратно выделить нужный объём памяти и записать его размер в поле длины. Например, если нужно сохранить 40 байт в структуре <structname>text</structname>, можно применить такой код: <placeholder-1/> <literal>VARHDRSZ</literal> совпадает с <literal>sizeof(int32)</literal>, но для получения размера заголовка типа переменной длины хорошим стилем считается применять макрос <literal>VARHDRSZ</literal>. Кроме того, поле длины <emphasis>должно</emphasis> устанавливаться макросом <literal>SET_VARSIZE</literal>, а не простым присваиванием.

source: <xref linkend="xfunc-c-type-table"/> specifies which C type corresponds to which SQL type when writing a C-language function that uses a built-in type of <productname>PostgreSQL</productname>. The <quote>Defined In</quote> column gives the header file that needs to be included to get the type definition. (The actual definition might be in a different file that is included by the listed file. It is recommended that users stick to the defined interface.) Note that you should always include <filename>postgres.h</filename> first in any source file, because it declares a number of things that you will need anyway.
ru: В <xref remap="6" linkend="xfunc-c-type-table"/> указано, какие типы языка C соответствуют типам SQL при написании функций на C с использованием встроенных типов <productname>PostgreSQL</productname>. В столбце <quote>Определён в</quote> указывается, какой заголовочный файл необходимо подключить, чтобы получить определение типа. (Фактическое определение может быть в другом файле, который подключается из указанного, однако рекомендуется придерживаться обозначенного интерфейса.) Заметьте, что в любом исходном файле всегда необходимо первым включать <filename>postgres.h</filename>, так как в нём объявляется ряд вещей, которые нужны в любом случае.

source: Equivalent C Types for Built-in SQL Types
ru: Типы C, эквивалентные встроенным типам SQL

source: SQL Type
ru: Тип SQL

source: C Type
ru: Тип C

source: Defined In
ru: Определён в

source: <filename>postgres.h</filename> (maybe compiler built-in)
ru: <filename>postgres.h</filename> (может быть встроен в компиляторе)

source: (compiler built-in)
ru: (встроен в компиляторе)

source: Now that we've gone over all of the possible structures for base types, we can show some examples of real functions.
ru: Теперь, когда мы рассмотрели все возможные структуры для базовых типов, мы можем перейти к примерам реальных функций.

source: Version 0 Calling Conventions
ru: Соглашение о вызовах версии 0

source: We present the <quote>old style</quote> calling convention first &mdash; although this approach is now deprecated, it's easier to get a handle on initially. In the version-0 method, the arguments and result of the C function are just declared in normal C style, but being careful to use the C representation of each SQL data type as shown above.
ru: Сначала мы представим соглашение о вызовах <quote>старого стиля</quote> &mdash; хотя этот подход уже устарел, понять его сначала будет легче. По методу версии 0 аргументы и результат функции C объявляются в обычном стиле C, но при этом должны использоваться типы C, соответствующие типам данных SQL, как показано выше.

source: Here are some examples: <placeholder-1/>
ru: Несколько примеров функций: <placeholder-1/>

source: CREATE FUNCTION add_one(integer) RETURNS integer AS '<replaceable>DIRECTORY</replaceable>/funcs', 'add_one' LANGUAGE C STRICT; -- note overloading of SQL function name "add_one" CREATE FUNCTION add_one(double precision) RETURNS double precision AS '<replaceable>DIRECTORY</replaceable>/funcs', 'add_one_float8' LANGUAGE C STRICT; CREATE FUNCTION makepoint(point, point) RETURNS point AS '<replaceable>DIRECTORY</replaceable>/funcs', 'makepoint' LANGUAGE C STRICT; CREATE FUNCTION copytext(text) RETURNS text AS '<replaceable>DIRECTORY</replaceable>/funcs', 'copytext' LANGUAGE C STRICT; CREATE FUNCTION concat_text(text, text) RETURNS text AS '<replaceable>DIRECTORY</replaceable>/funcs', 'concat_text' LANGUAGE C STRICT;
ru: CREATE FUNCTION add_one(integer) RETURNS integer AS '<replaceable>КАТАЛОГ</replaceable>/funcs', 'add_one' LANGUAGE C STRICT; -- обратите внимание — это перегрузка SQL-функции "add_one" CREATE FUNCTION add_one(double precision) RETURNS double precision AS '<replaceable>КАТАЛОГ</replaceable>/funcs', 'add_one_float8' LANGUAGE C STRICT; CREATE FUNCTION makepoint(point, point) RETURNS point AS '<replaceable>КАТАЛОГ</replaceable>/funcs', 'makepoint' LANGUAGE C STRICT; CREATE FUNCTION copytext(text) RETURNS text AS '<replaceable>КАТАЛОГ</replaceable>/funcs', 'copytext' LANGUAGE C STRICT; CREATE FUNCTION concat_text(text, text) RETURNS text AS '<replaceable>КАТАЛОГ</replaceable>/funcs', 'concat_text' LANGUAGE C STRICT;

source: Supposing that the above code has been prepared in file <filename>funcs.c</filename> and compiled into a shared object, we could define the functions to <productname>PostgreSQL</productname> with commands like this: <placeholder-1/>
ru: В предположении, что приведённый выше код был подготовлен в файле <filename>funcs.c</filename> и скомпилирован в разделяемый объект, мы можем объявить эти функции в <productname>PostgreSQL</productname> следующими командами: <placeholder-1/>

source: Here, <replaceable>DIRECTORY</replaceable> stands for the directory of the shared library file (for instance the <productname>PostgreSQL</productname> tutorial directory, which contains the code for the examples used in this section). (Better style would be to use just <literal>'funcs'</literal> in the <literal>AS</literal> clause, after having added <replaceable>DIRECTORY</replaceable> to the search path. In any case, we can omit the system-specific extension for a shared library, commonly <literal>.so</literal> or <literal>.sl</literal>.)
ru: Здесь <replaceable>КАТАЛОГ</replaceable> — это путь к каталогу, в который помещён разделяемый библиотечный файл (например, каталог учебных материалов (tutorial) в исходном коде <productname>PostgreSQL</productname>, содержащий код примеров, использованных в этом разделе). (Лучше было бы просто написать <literal>'funcs'</literal> в предложении <literal>AS</literal>, предварительно добавив <replaceable>КАТАЛОГ</replaceable> в путь поиска. В любом случае, мы можем опустить принятое в системе расширение файлов разделяемых библиотек, обычно <literal>.so</literal> или <literal>.sl</literal>.)

source: Notice that we have specified the functions as <quote>strict</quote>, meaning that the system should automatically assume a null result if any input value is null. By doing this, we avoid having to check for null inputs in the function code. Without this, we'd have to check for null values explicitly, by checking for a null pointer for each pass-by-reference argument. (For pass-by-value arguments, we don't even have a way to check!)
ru: Заметьте, что мы объявили эти функции как <quote>strict</quote> (строгие) — это означает, что система будет автоматически подразумевать результат NULL, если в одном из входных значений передаётся NULL. Благодаря этому, мы избегаем необходимости проверять входные значения на NULL в коде функции. Без такого объявления нам пришлось бы явно проверять параметры на NULL, сравнивая указатель аргументов, передаваемых по ссылке, с NULL. (Для аргументов, передаваемых по значению, мы даже не можем это проверить!)

source: Although this calling convention is simple to use, it is not very portable; on some architectures there are problems with passing data types that are smaller than <type>int</type> this way. Also, there is no simple way to return a null result, nor to cope with null arguments in any way other than making the function strict. The version-1 convention, presented next, overcomes these objections.
ru: Хотя это соглашение о вызовах легко использовать, оно плохо портируется; на некоторых архитектурах возникали проблемы с передачей таким образом типов данных размером меньше <type>int</type>. Кроме того, оно не позволяет простым способом вернуть результат NULL, как и управиться с аргументами NULL, кроме как объявив функцию строгой. В соглашении версии 1, представленном далее, эти недостатки устранены.

source: Version 1 Calling Conventions
ru: Соглашение о вызовах версии 1
