Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/xfunc.po
Languages: ru

source: The select list order in the query must be exactly the same as that in which the columns appear in the table associated with the composite type. (Naming the columns, as we did above, is irrelevant to the system.)
ru: Порядок в списке выборки внутреннего запроса должен в точности совпадать с порядком следования столбцов в таблице, связанной с составным типом. (Имена столбцов, как показывает пример выше, для системы значения не имеют.)

source: You must typecast the expressions to match the definition of the composite type, or you will get errors like this: <screen> <computeroutput> ERROR: function declared to return emp returns varchar instead of text at column 1 </computeroutput> </screen>
ru: Вы должны привести выражения в соответствие с определением составного типа, либо вы получите такие ошибки: <screen> <computeroutput> ERROR: function declared to return emp returns varchar instead of text at column 1 </computeroutput> </screen>(ОШИБКА: функция, объявленная как возвращающая emp, возвращает varchar вместо text в столбце 1)

source: Note two important things about defining the function: <placeholder-1/>
ru: Учтите два важных требования относительно определения функции: <placeholder-1/>

source: A different way to define the same function is: <placeholder-1/> Here we wrote a <command>SELECT</command> that returns just a single column of the correct composite type. This isn't really better in this situation, but it is a handy alternative in some cases &mdash; for example, if we need to compute the result by calling another function that returns the desired composite value.
ru: Ту же функцию можно определить другим способом: <placeholder-1/> Здесь мы записали <command>SELECT</command>, который возвращает один столбец нужного составного типа. В данной ситуации этот вариант на самом деле не лучше, но в некоторых случаях он может быть удобной альтернативой &mdash; например, если нам нужно вычислить результат, вызывая другую функцию, которая возвращает нужное составное значение.

source: We could call this function directly either by using it in a value expression: <screen> SELECT new_emp(); new_emp -------------------------- (None,1000.0,25,"(2,2)") </screen> or by calling it as a table function: <screen> SELECT * FROM new_emp(); name | salary | age | cubicle ------+--------+-----+--------- None | 1000.0 | 25 | (2,2) </screen> The second way is described more fully in <xref linkend="xfunc-sql-table-functions"/>.
ru: Мы можем вызывать эту функцию напрямую, либо указав её в выражении значения: <screen> SELECT new_emp(); new_emp -------------------------- (None,1000.0,25,"(2,2)") </screen> либо обратившись к ней, как к табличной функции: <screen> SELECT * FROM new_emp(); name | salary | age | cubicle ------+--------+-----+--------- None | 1000.0 | 25 | (2,2) </screen> Второй способ более подробно описан в <xref remap="6" linkend="xfunc-sql-table-functions"/>.

source: When you use a function that returns a composite type, you might want only one field (attribute) from its result. You can do that with syntax like this: <screen> SELECT (new_emp()).name; name ------ None </screen> The extra parentheses are needed to keep the parser from getting confused. If you try to do it without them, you get something like this: <screen> SELECT new_emp().name; ERROR: syntax error at or near "." LINE 1: SELECT new_emp().name; ^ </screen>
ru: Когда используется функция, возвращающая составной тип, может возникнуть желание получить из её результата только одно поле (атрибут). Это можно сделать, применяя такую запись: <screen> SELECT (new_emp()).name; name ------ None </screen> Дополнительные скобки необходимы во избежание неоднозначности при разборе запроса. Если вы попытаетесь выполнить запрос без них, вы получите ошибку: <screen> SELECT new_emp().name; ERROR: syntax error at or near "." LINE 1: SELECT new_emp().name; ^ </screen> (ОШИБКА: синтаксическая ошибка (примерное положение: "."))

source: Another option is to use functional notation for extracting an attribute: <screen> SELECT name(new_emp()); name ------ None </screen> As explained in <xref linkend="rowtypes-usage"/>, the field notation and functional notation are equivalent.
ru: Функциональную запись также можно использовать и для извлечения атрибутов: <screen> SELECT name(new_emp()); name ------ None </screen> Как рассказывалось в <xref remap="6" linkend="rowtypes-usage"/>, запись с указанием поля и функциональная запись являются равнозначными.

source: Another way to use a function returning a composite type is to pass the result to another function that accepts the correct row type as input: <screen> CREATE FUNCTION getname(emp) RETURNS text AS $$ SELECT $1.name; $$ LANGUAGE SQL; SELECT getname(new_emp()); getname --------- None (1 row) </screen>
ru: Ещё один вариант использования функции, возвращающей составной тип, заключается в передаче её результата другой функции, которая принимает этот тип строки на вход: <screen> CREATE FUNCTION getname(emp) RETURNS text AS $$ SELECT $1.name; $$ LANGUAGE SQL; SELECT getname(new_emp()); getname --------- None (1 row) </screen>

source: <acronym>SQL</acronym> Functions with Output Parameters
ru: Функции <acronym>SQL</acronym> с выходными параметрами

source: <primary>function</primary> <secondary>output parameter</secondary>
ru: <primary>функция</primary> <secondary>выходной параметр</secondary>

source: An alternative way of describing a function's results is to define it with <firstterm>output parameters</firstterm>, as in this example: <screen> CREATE FUNCTION add_em (IN x int, IN y int, OUT sum int) AS 'SELECT x + y' LANGUAGE SQL; SELECT add_em(3,7); add_em -------- 10 (1 row) </screen> This is not essentially different from the version of <literal>add_em</literal> shown in <xref linkend="xfunc-sql-base-functions"/>. The real value of output parameters is that they provide a convenient way of defining functions that return several columns. For example, <screen> CREATE FUNCTION sum_n_product (x int, y int, OUT sum int, OUT product int) AS 'SELECT x + y, x * y' LANGUAGE SQL; SELECT * FROM sum_n_product(11,42); sum | product -----+--------- 53 | 462 (1 row) </screen> What has essentially happened here is that we have created an anonymous composite type for the result of the function. The above example has the same end result as <screen> CREATE TYPE sum_prod AS (sum int, product int); CREATE FUNCTION sum_n_product (int, int) RETURNS sum_prod AS 'SELECT $1 + $2, $1 * $2' LANGUAGE SQL; </screen> but not having to bother with the separate composite type definition is often handy. Notice that the names attached to the output parameters are not just decoration, but determine the column names of the anonymous composite type. (If you omit a name for an output parameter, the system will choose a name on its own.)
ru: Альтернативный способ описать результаты функции — определить её с <firstterm>выходными параметрами</firstterm>, как в этом примере: <screen> CREATE FUNCTION add_em (IN x int, IN y int, OUT sum int) AS 'SELECT x + y' LANGUAGE SQL; SELECT add_em(3,7); add_em -------- 10 (1 row) </screen> Это по сути не отличается от версии <literal>add_em</literal>, показанной в <xref remap="6" linkend="xfunc-sql-base-functions"/>. Действительная ценность выходных параметров в том, что они позволяют удобным способом определить функции, возвращающие несколько столбцов. Например: <screen> CREATE FUNCTION sum_n_product (x int, y int, OUT sum int, OUT product int) AS 'SELECT x + y, x * y' LANGUAGE SQL; SELECT * FROM sum_n_product(11,42); sum | product -----+--------- 53 | 462 (1 row) </screen> Фактически здесь мы определили анонимный составной тип для результата функции. Показанный выше пример даёт тот же конечный результат, что и команды: <screen> CREATE TYPE sum_prod AS (sum int, product int); CREATE FUNCTION sum_n_product (int, int) RETURNS sum_prod AS 'SELECT $1 + $2, $1 * $2' LANGUAGE SQL; </screen> Но предыдущий вариант зачастую удобнее, так как он не требует отдельно заниматься определением составного типа. Заметьте, что имена, назначаемые выходным параметрам, не просто декоративные, а определяют имена столбцов анонимного составного типа. (Если вы опустите имя выходного параметра, система выберет имя сама.)

source: Notice that output parameters are not included in the calling argument list when invoking such a function from SQL. This is because <productname>PostgreSQL</productname> considers only the input parameters to define the function's calling signature. That means also that only the input parameters matter when referencing the function for purposes such as dropping it. We could drop the above function with either of <screen> DROP FUNCTION sum_n_product (x int, y int, OUT sum int, OUT product int); DROP FUNCTION sum_n_product (int, int); </screen>
ru: Заметьте, что выходные параметры не включаются в список аргументов при вызове такой функции из SQL. Это объясняется тем, что <productname>PostgreSQL</productname> определяет сигнатуру вызова функции, рассматривая только входные параметры. Это также значит, что при таких операциях, как удаление функции, в ссылках на функцию учитываются только типы входных параметров. Таким образом, удалить эту конкретную функцию можно любой из этих команд: <screen> DROP FUNCTION sum_n_product (x int, y int, OUT sum int, OUT product int); DROP FUNCTION sum_n_product (int, int); </screen>

source: Parameters can be marked as <literal>IN</literal> (the default), <literal>OUT</literal>, <literal>INOUT</literal>, or <literal>VARIADIC</literal>. An <literal>INOUT</literal> parameter serves as both an input parameter (part of the calling argument list) and an output parameter (part of the result record type). <literal>VARIADIC</literal> parameters are input parameters, but are treated specially as described next.
ru: Параметры функции могут быть объявлены как <literal>IN</literal> (по умолчанию), <literal>OUT</literal>, <literal>INOUT</literal> или <literal>VARIADIC</literal>. Параметр <literal>INOUT</literal> действует как входной (является частью списка аргументов при вызове) и как выходной (часть типа записи результата). Параметры <literal>VARIADIC</literal> являются входными, но обрабатывается специальным образом, как описано далее.

source: <acronym>SQL</acronym> Functions with Variable Numbers of Arguments
ru: Функции <acronym>SQL</acronym> с переменным числом аргументов

source: <primary>function</primary> <secondary>variadic</secondary>
ru: <primary>функция</primary> <secondary>переменные параметры</secondary>

source: <primary>variadic function</primary>
ru: <primary>функция с переменными параметрами</primary>

source: <acronym>SQL</acronym> functions can be declared to accept variable numbers of arguments, so long as all the <quote>optional</quote> arguments are of the same data type. The optional arguments will be passed to the function as an array. The function is declared by marking the last parameter as <literal>VARIADIC</literal>; this parameter must be declared as being of an array type. For example: <screen> CREATE FUNCTION mleast(VARIADIC arr numeric[]) RETURNS numeric AS $$ SELECT min($1[i]) FROM generate_subscripts($1, 1) g(i); $$ LANGUAGE SQL; SELECT mleast(10, -1, 5, 4.4); mleast -------- -1 (1 row) </screen> Effectively, all the actual arguments at or beyond the <literal>VARIADIC</literal> position are gathered up into a one-dimensional array, as if you had written <screen> SELECT mleast(ARRAY[10, -1, 5, 4.4]); -- doesn't work </screen> You can't actually write that, though &mdash; or at least, it will not match this function definition. A parameter marked <literal>VARIADIC</literal> matches one or more occurrences of its element type, not of its own type.
ru: Функции <acronym>SQL</acronym> могут быть объявлены как принимающие переменное число аргументов, с условием, что все <quote>необязательные</quote> аргументы имеют один тип данных. Необязательные аргументы будут переданы такой функции в виде массива. Для этого в объявлении функции последний параметр помечается как <literal>VARIADIC</literal>; при этом он должен иметь тип массива. Например: <screen> CREATE FUNCTION mleast(VARIADIC arr numeric[]) RETURNS numeric AS $$ SELECT min($1[i]) FROM generate_subscripts($1, 1) g(i); $$ LANGUAGE SQL; SELECT mleast(10, -1, 5, 4.4); mleast -------- -1 (1 row) </screen> По сути, все фактические аргументы, начиная с позиции <literal>VARIADIC</literal>, собираются в одномерный массив, как если бы вы написали <screen> SELECT mleast(ARRAY[10, -1, 5, 4.4]); -- это не будет работать </screen> На самом деле так вызвать эту функцию нельзя, или, по крайней мере, это не будет соответствовать определению функции. Параметру <literal>VARIADIC</literal> соответствуют одно или несколько вхождений типа его элемента, но не его собственного типа.

source: Sometimes it is useful to be able to pass an already-constructed array to a variadic function; this is particularly handy when one variadic function wants to pass on its array parameter to another one. You can do that by specifying <literal>VARIADIC</literal> in the call: <screen> SELECT mleast(VARIADIC ARRAY[10, -1, 5, 4.4]); </screen> This prevents expansion of the function's variadic parameter into its element type, thereby allowing the array argument value to match normally. <literal>VARIADIC</literal> can only be attached to the last actual argument of a function call.
ru: Но иногда бывает полезно передать функции с переменными параметрами уже подготовленный массив; особенно когда одна функция с переменными параметрами хочет передавать свой массив параметров другой. Это можно сделать, указав <literal>VARIADIC</literal> в вызове: <screen> SELECT mleast(VARIADIC ARRAY[10, -1, 5, 4.4]); </screen> Это предотвращает разворачивание переменного множества параметров функции в базовый тип, что позволяет сопоставить с ним значение типа массива. <literal>VARIADIC</literal> можно добавить только к последнему фактическому аргументу вызова функции.

source: Specifying <literal>VARIADIC</literal> in the call is also the only way to pass an empty array to a variadic function, for example: <screen> SELECT mleast(VARIADIC ARRAY[]::numeric[]); </screen> Simply writing <literal>SELECT mleast()</literal> does not work because a variadic parameter must match at least one actual argument. (You could define a second function also named <literal>mleast</literal>, with no parameters, if you wanted to allow such calls.)
ru: Также указание <literal>VARIADIC</literal> даёт единственную возможность передать пустой массив функции с переменными параметрами, например, так: <screen> SELECT mleast(VARIADIC ARRAY[]::numeric[]); </screen> Простой вызов <literal>SELECT mleast()</literal> не будет работать, так как переменным параметрам должен соответствовать минимум один фактический аргумент. (Можно определить вторую функцию с таким же именем <literal>mleast</literal>, но без параметров, если вы хотите выполнять такие вызовы.)

source: The array element parameters generated from a variadic parameter are treated as not having any names of their own. This means it is not possible to call a variadic function using named arguments (<xref linkend="sql-syntax-calling-funcs"/>), except when you specify <literal>VARIADIC</literal>. For example, this will work: <screen> SELECT mleast(VARIADIC arr =&gt; ARRAY[10, -1, 5, 4.4]); </screen> but not these: <screen> SELECT mleast(arr =&gt; 10); SELECT mleast(arr =&gt; ARRAY[10, -1, 5, 4.4]); </screen>
ru: Элементы массива, создаваемые из переменных параметров, считаются не имеющими собственных имён. Это означает, что передать функции с переменными параметрами именованные аргументы нельзя (см. <xref remap="4" linkend="sql-syntax-calling-funcs"/>), если только при вызове не добавлено <literal>VARIADIC</literal>. Например, этот вариант будет работать: <screen> SELECT mleast(VARIADIC arr =&gt; ARRAY[10, -1, 5, 4.4]); </screen> А эти варианты нет: <screen> SELECT mleast(arr =&gt; 10); SELECT mleast(arr =&gt; ARRAY[10, -1, 5, 4.4]); </screen>

source: <acronym>SQL</acronym> Functions with Default Values for Arguments
ru: Функции <acronym>SQL</acronym> со значениями аргументов по умолчанию

source: <primary>function</primary> <secondary>default values for arguments</secondary>
ru: <primary>функция</primary> <secondary>значения аргументов по умолчанию</secondary>

source: Functions can be declared with default values for some or all input arguments. The default values are inserted whenever the function is called with insufficiently many actual arguments. Since arguments can only be omitted from the end of the actual argument list, all parameters after a parameter with a default value have to have default values as well. (Although the use of named argument notation could allow this restriction to be relaxed, it's still enforced so that positional argument notation works sensibly.)
ru: Функции могут быть объявлены со значениями по умолчанию для некоторых или всех входных аргументов. Значения по умолчанию подставляются, когда функция вызывается с недостаточным количеством фактических аргументов. Так как аргументы можно опускать только с конца списка фактических аргументов, все параметры после параметра со значением по умолчанию также получат значения по умолчанию. (Хотя запись с именованными аргументами могла бы ослабить это ограничение, оно всё же остаётся в силе, чтобы позиционные ссылки на аргументы оставались действительными.)

source: For example: <screen> CREATE FUNCTION foo(a int, b int DEFAULT 2, c int DEFAULT 3) RETURNS int LANGUAGE SQL AS $$ SELECT $1 + $2 + $3; $$; SELECT foo(10, 20, 30); foo ----- 60 (1 row) SELECT foo(10, 20); foo ----- 33 (1 row) SELECT foo(10); foo ----- 15 (1 row) SELECT foo(); -- fails since there is no default for the first argument ERROR: function foo() does not exist </screen> The <literal>=</literal> sign can also be used in place of the key word <literal>DEFAULT</literal>.
ru: Например: <screen> CREATE FUNCTION foo(a int, b int DEFAULT 2, c int DEFAULT 3) RETURNS int LANGUAGE SQL AS $$ SELECT $1 + $2 + $3; $$; SELECT foo(10, 20, 30); foo ----- 60 (1 row) SELECT foo(10, 20); foo ----- 33 (1 row) SELECT foo(10); foo ----- 15 (1 row) SELECT foo(); -- не работает из-за отсутствия значения по умолчанию для первого аргумента ERROR: function foo() does not exist </screen> (ОШИБКА: функция foo() не существует) Вместо ключевого слова <literal>DEFAULT</literal> можно использовать знак <literal>=</literal>.

source: <acronym>SQL</acronym> Functions as Table Sources
ru: Функции <acronym>SQL</acronym>, порождающие таблицы

source: All SQL functions can be used in the <literal>FROM</literal> clause of a query, but it is particularly useful for functions returning composite types. If the function is defined to return a base type, the table function produces a one-column table. If the function is defined to return a composite type, the table function produces a column for each attribute of the composite type.
ru: Все функции SQL можно использовать в предложении <literal>FROM</literal> запросов, но наиболее полезно это для функций, возвращающих составные типы. Если функция объявлена как возвращающая базовый тип, она возвращает таблицу с одним столбцом. Если же функция объявлена как возвращающая составной тип, она возвращает таблицу со столбцами для каждого атрибута составного типа.

source: Here is an example: <screen> CREATE TABLE foo (fooid int, foosubid int, fooname text); INSERT INTO foo VALUES (1, 1, 'Joe'); INSERT INTO foo VALUES (1, 2, 'Ed'); INSERT INTO foo VALUES (2, 1, 'Mary'); CREATE FUNCTION getfoo(int) RETURNS foo AS $$ SELECT * FROM foo WHERE fooid = $1; $$ LANGUAGE SQL; SELECT *, upper(fooname) FROM getfoo(1) AS t1; fooid | foosubid | fooname | upper -------+----------+---------+------- 1 | 1 | Joe | JOE (1 row) </screen> As the example shows, we can work with the columns of the function's result just the same as if they were columns of a regular table.
ru: Например: <screen> CREATE TABLE foo (fooid int, foosubid int, fooname text); INSERT INTO foo VALUES (1, 1, 'Joe'); INSERT INTO foo VALUES (1, 2, 'Ed'); INSERT INTO foo VALUES (2, 1, 'Mary'); CREATE FUNCTION getfoo(int) RETURNS foo AS $$ SELECT * FROM foo WHERE fooid = $1; $$ LANGUAGE SQL; SELECT *, upper(fooname) FROM getfoo(1) AS t1; fooid | foosubid | fooname | upper -------+----------+---------+------- 1 | 1 | Joe | JOE (1 row) </screen> Как показывает этот пример, мы можем работать со столбцами результата функции так же, как если бы это были столбцы обычной таблицы.

source: Note that we only got one row out of the function. This is because we did not use <literal>SETOF</literal>. That is described in the next section.
ru: Заметьте, что мы получаем из данной функции только одну строку. Это объясняется тем, что мы не использовали указание <literal>SETOF</literal>. Оно описывается в следующем разделе.

source: <acronym>SQL</acronym> Functions Returning Sets
ru: Функции <acronym>SQL</acronym>, возвращающие множества

source: <primary>function</primary> <secondary>with SETOF</secondary>
ru: <primary>функция</primary> <secondary>с SETOF</secondary>

source: When an SQL function is declared as returning <literal>SETOF <replaceable>sometype</replaceable></literal>, the function's final query is executed to completion, and each row it outputs is returned as an element of the result set.
ru: Когда SQL-функция объявляется как возвращающая <literal>SETOF <replaceable>некий_тип</replaceable></literal>, конечный запрос функции выполняется до завершения и каждая строка выводится как элемент результирующего множества.

source: This feature is normally used when calling the function in the <literal>FROM</literal> clause. In this case each row returned by the function becomes a row of the table seen by the query. For example, assume that table <literal>foo</literal> has the same contents as above, and we say: <placeholder-1/> Then we would get: <screen> fooid | foosubid | fooname -------+----------+--------- 1 | 1 | Joe 1 | 2 | Ed (2 rows) </screen>
ru: Это обычно используется, когда функция вызывается в предложении <literal>FROM</literal>. В этом случае каждая строка, возвращаемая функцией, становится строкой таблицы, появляющейся в запросе. Например, в предположении, что таблица <literal>foo</literal> имеет то же содержимое, что и раньше, мы выполняем: <placeholder-1/> Тогда в ответ мы получим: <screen> fooid | foosubid | fooname -------+----------+--------- 1 | 1 | Joe 1 | 2 | Ed (2 rows) </screen>

source: It is also possible to return multiple rows with the columns defined by output parameters, like this: <placeholder-1/> The key point here is that you must write <literal>RETURNS SETOF record</literal> to indicate that the function returns multiple rows instead of just one. If there is only one output parameter, write that parameter's type instead of <type>record</type>.
ru: Также возможно выдать несколько строк со столбцами, определяемыми выходными параметрами, следующим образом: <placeholder-1/> Здесь ключевая особенность заключается в записи <literal>RETURNS SETOF record</literal>, показывающей, что функция возвращает множество строк вместо одной. Если существует только один выходной параметр, укажите тип этого параметра вместо <type>record</type>.
