Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/xfunc.po
Languages: ru

source: It is frequently useful to construct a query's result by invoking a set-returning function multiple times, with the parameters for each invocation coming from successive rows of a table or subquery. The preferred way to do this is to use the <literal>LATERAL</literal> key word, which is described in <xref linkend="queries-lateral"/>. Here is an example using a set-returning function to enumerate elements of a tree structure: <screen> SELECT * FROM nodes; name | parent -----------+-------- Top | Child1 | Top Child2 | Top Child3 | Top SubChild1 | Child1 SubChild2 | Child1 (6 rows) CREATE FUNCTION listchildren(text) RETURNS SETOF text AS $$ SELECT name FROM nodes WHERE parent = $1 $$ LANGUAGE SQL STABLE; SELECT * FROM listchildren('Top'); listchildren -------------- Child1 Child2 Child3 (3 rows) SELECT name, child FROM nodes, LATERAL listchildren(name) AS child; name | child --------+----------- Top | Child1 Top | Child2 Top | Child3 Child1 | SubChild1 Child1 | SubChild2 (5 rows) </screen> This example does not do anything that we couldn't have done with a simple join, but in more complex calculations the option to put some of the work into a function can be quite convenient.
ru: Часто бывает полезно сконструировать результат запроса, вызывая функцию, возвращающую множество, несколько раз, передавая при каждом вызове параметры из очередных строк таблицы или подзапроса. Для этого рекомендуется применить ключевое слово <literal>LATERAL</literal>, описываемое в <xref remap="6" linkend="queries-lateral"/>. Ниже приведён пример использования функции, возвращающей множество, для перечисления элементов древовидной структуры: <screen> SELECT * FROM nodes; name | parent -----------+-------- Top | Child1 | Top Child2 | Top Child3 | Top SubChild1 | Child1 SubChild2 | Child1 (6 rows) CREATE FUNCTION listchildren(text) RETURNS SETOF text AS $$ SELECT name FROM nodes WHERE parent = $1 $$ LANGUAGE SQL STABLE; SELECT * FROM listchildren('Top'); listchildren -------------- Child1 Child2 Child3 (3 rows) SELECT name, child FROM nodes, LATERAL listchildren(name) AS child; name | child --------+----------- Top | Child1 Top | Child2 Top | Child3 Child1 | SubChild1 Child1 | SubChild2 (5 rows) </screen> В этом примере не делается ничего такого, что мы не могли бы сделать, применив простое соединение, но для более сложных вычислений возможность поместить некоторую логику в функцию может быть весьма удобной.

source: Currently, functions returning sets can also be called in the select list of a query. For each row that the query generates by itself, the function returning set is invoked, and an output row is generated for each element of the function's result set. Note, however, that this capability is deprecated and might be removed in future releases. The previous example could also be done with queries like these: <screen> SELECT listchildren('Top'); listchildren -------------- Child1 Child2 Child3 (3 rows) SELECT name, listchildren(name) FROM nodes; name | listchildren --------+-------------- Top | Child1 Top | Child2 Top | Child3 Child1 | SubChild1 Child1 | SubChild2 (5 rows) </screen> In the last <command>SELECT</command>, notice that no output row appears for <literal>Child2</literal>, <literal>Child3</literal>, etc. This happens because <function>listchildren</function> returns an empty set for those arguments, so no result rows are generated. This is the same behavior as we got from an inner join to the function result when using the <literal>LATERAL</literal> syntax.
ru: В настоящее время функции, возвращающие множества, могут также вызываться в списке выборки запроса. Для каждой строки, которая генерируется самим запросом, вызывается функция, возвращающая множество, и для каждого элемента набора её результатов генерируется отдельная строка. Заметьте, однако, что эта возможность считается устаревшей и может быть ликвидирована в будущих выпусках. Предыдущий пример можно было бы также переписать с применением запросов следующим образом: <screen> SELECT listchildren('Top'); listchildren -------------- Child1 Child2 Child3 (3 rows) SELECT name, listchildren(name) FROM nodes; name | listchildren --------+-------------- Top | Child1 Top | Child2 Top | Child3 Child1 | SubChild1 Child1 | SubChild2 (5 rows) </screen> Заметьте, что в последней команде <command>SELECT</command> для <literal>Child2</literal>, <literal>Child3</literal> и т. д. строки не выдаются. Это происходит потому, что <function>listchildren</function> возвращает пустое множество для этих аргументов, так что строки результата не генерируются. Это же поведение мы получаем при внутреннем соединении с результатом функции с применением <literal>LATERAL</literal>.

source: If a function's last command is <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command> with <literal>RETURNING</literal>, that command will always be executed to completion, even if the function is not declared with <literal>SETOF</literal> or the calling query does not fetch all the result rows. Any extra rows produced by the <literal>RETURNING</literal> clause are silently dropped, but the commanded table modifications still happen (and are all completed before returning from the function).
ru: Если последняя команда функции — <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command> с <literal>RETURNING</literal>, эта команда будет всегда выполняться до завершения, даже если функция не объявлена с указанием <literal>SETOF</literal> или вызывающий запрос не выбирает все строки результата. Все дополнительные строки, выданные предложением <literal>RETURNING</literal>, просто игнорируются, но соответствующие изменения в таблице всё равно произойдут (и будут завершены до выхода из функции).

source: The key problem with using set-returning functions in the select list, rather than the <literal>FROM</literal> clause, is that putting more than one set-returning function in the same select list does not behave very sensibly. (What you actually get if you do so is a number of output rows equal to the least common multiple of the numbers of rows produced by each set-returning function.) The <literal>LATERAL</literal> syntax produces less surprising results when calling multiple set-returning functions, and should usually be used instead.
ru: Ключевая проблема использования функций, возвращающих множества, в списке выборки, а не в предложении <literal>FROM</literal>, заключается в том, что при вызове в одном списке выборки нескольких таких функций, результат будет не вполне разумным. (На самом деле, если вы сделаете это, вы получите выходные строки в количестве, равном наименьшему общему кратному чисел строк, которые будут выданы всеми функциями, возвращающими множества.) Синтаксис <literal>LATERAL</literal> даёт более ожидаемые результаты при вызове нескольких таких функций и поэтому рекомендуется использовать его.

source: <acronym>SQL</acronym> Functions Returning <literal>TABLE</literal>
ru: Функции <acronym>SQL</acronym>, возвращающие таблицы (<literal>TABLE</literal>)

source: <primary>function</primary> <secondary>RETURNS TABLE</secondary>
ru: <primary>функция</primary> <secondary>RETURNS TABLE</secondary>

source: There is another way to declare a function as returning a set, which is to use the syntax <literal>RETURNS TABLE(<replaceable>columns</replaceable>)</literal>. This is equivalent to using one or more <literal>OUT</literal> parameters plus marking the function as returning <literal>SETOF record</literal> (or <literal>SETOF</literal> a single output parameter's type, as appropriate). This notation is specified in recent versions of the SQL standard, and thus may be more portable than using <literal>SETOF</literal>.
ru: Есть ещё один способ объявить функцию, возвращающую множества, — использовать синтаксис <literal>RETURNS TABLE(<replaceable>столбцы</replaceable>)</literal>. Это равнозначно использованию одного или нескольких параметров <literal>OUT</literal> с объявлением функции как возвращающей <literal>SETOF record</literal> (или <literal>SETOF</literal> тип единственного параметра, если это применимо). Этот синтаксис описан в последних версиях стандарта SQL, так что этот вариант может быть более портируемым, чем <literal>SETOF</literal>.

source: For example, the preceding sum-and-product example could also be done this way: <placeholder-1/> It is not allowed to use explicit <literal>OUT</literal> or <literal>INOUT</literal> parameters with the <literal>RETURNS TABLE</literal> notation &mdash; you must put all the output columns in the <literal>TABLE</literal> list.
ru: Например, предыдущий пример с суммой и произведением можно также переписать так: <placeholder-1/> Запись <literal>RETURNS TABLE</literal> не позволяет явно указывать <literal>OUT</literal> и <literal>INOUT</literal> для параметров &mdash; все выходные столбцы необходимо записать в списке <literal>TABLE</literal>.

source: Polymorphic <acronym>SQL</acronym> Functions
ru: Полиморфные функции <acronym>SQL</acronym>

source: <acronym>SQL</acronym> functions can be declared to accept and return the polymorphic types <type>anyelement</type>, <type>anyarray</type>, <type>anynonarray</type>, <type>anyenum</type>, and <type>anyrange</type>. See <xref linkend="extend-types-polymorphic"/> for a more detailed explanation of polymorphic functions. Here is a polymorphic function <function>make_array</function> that builds up an array from two arbitrary data type elements: <screen> CREATE FUNCTION make_array(anyelement, anyelement) RETURNS anyarray AS $$ SELECT ARRAY[$1, $2]; $$ LANGUAGE SQL; SELECT make_array(1, 2) AS intarray, make_array('a'::text, 'b') AS textarray; intarray | textarray ----------+----------- {1,2} | {a,b} (1 row) </screen>
ru: Функции <acronym>SQL</acronym> могут быть объявлены как принимающие и возвращающие полиморфные типы <type>anyelement</type>, <type>anyarray</type>, <type>anynonarray</type>, <type>anyenum</type> и <type>anyrange</type>. За более подробным объяснением полиморфизма функций обратитесь к <xref remap="3" linkend="extend-types-polymorphic"/>. В следующем примере полиморфная функция <function>make_array</function> создаёт массив из двух элементов произвольных типов: <screen> CREATE FUNCTION make_array(anyelement, anyelement) RETURNS anyarray AS $$ SELECT ARRAY[$1, $2]; $$ LANGUAGE SQL; SELECT make_array(1, 2) AS intarray, make_array('a'::text, 'b') AS textarray; intarray | textarray ----------+----------- {1,2} | {a,b} (1 row) </screen>

source: Notice the use of the typecast <literal>'a'::text</literal> to specify that the argument is of type <type>text</type>. This is required if the argument is just a string literal, since otherwise it would be treated as type <type>unknown</type>, and array of <type>unknown</type> is not a valid type. Without the typecast, you will get errors like this: <screen> <computeroutput> ERROR: could not determine polymorphic type because input has type "unknown" </computeroutput> </screen>
ru: Обратите внимание на приведение типа <literal>'a'::text</literal>, определяющее, что аргумент имеет тип <type>text</type>. Оно необходимо, если аргумент задаётся просто строковой константой, так как иначе он будет воспринят как имеющий тип <type>unknown</type>, а массив типов <type>unknown</type> является недопустимым. Без этого приведения вы получите такую ошибку: <screen> <computeroutput> ERROR: could not determine polymorphic type because input has type "unknown" </computeroutput> </screen> (ОШИБКА: не удалось определить полиморфный тип, так как входные аргументы имеют тип "unknown")

source: It is permitted to have polymorphic arguments with a fixed return type, but the converse is not. For example: <screen> CREATE FUNCTION is_greater(anyelement, anyelement) RETURNS boolean AS $$ SELECT $1 &gt; $2; $$ LANGUAGE SQL; SELECT is_greater(1, 2); is_greater ------------ f (1 row) CREATE FUNCTION invalid_func() RETURNS anyelement AS $$ SELECT 1; $$ LANGUAGE SQL; ERROR: cannot determine result data type DETAIL: A function returning a polymorphic type must have at least one polymorphic argument. </screen>
ru: Функция с полиморфными аргументами может иметь фиксированный тип результата, однако обратное не допускается. Например: <screen> CREATE FUNCTION is_greater(anyelement, anyelement) RETURNS boolean AS $$ SELECT $1 &gt; $2; $$ LANGUAGE SQL; SELECT is_greater(1, 2); is_greater ------------ f (1 row) CREATE FUNCTION invalid_func() RETURNS anyelement AS $$ SELECT 1; $$ LANGUAGE SQL; ERROR: cannot determine result data type DETAIL: A function returning a polymorphic type must have at least one polymorphic argument. </screen> (ОШИБКА: не удалось определить тип результата; ПОДРОБНОСТИ: Функция, возвращающая полиморфный тип, должна иметь минимум один полиморфный аргумент.")

source: Polymorphism can be used with functions that have output arguments. For example: <screen> CREATE FUNCTION dup (f1 anyelement, OUT f2 anyelement, OUT f3 anyarray) AS 'select $1, array[$1,$1]' LANGUAGE SQL; SELECT * FROM dup(22); f2 | f3 ----+--------- 22 | {22,22} (1 row) </screen>
ru: Полиморфизм можно применять и с функциями, имеющими выходные аргументы. Например: <screen> CREATE FUNCTION dup (f1 anyelement, OUT f2 anyelement, OUT f3 anyarray) AS 'select $1, array[$1,$1]' LANGUAGE SQL; SELECT * FROM dup(22); f2 | f3 ----+--------- 22 | {22,22} (1 row) </screen>

source: Polymorphism can also be used with variadic functions. For example: <screen> CREATE FUNCTION anyleast (VARIADIC anyarray) RETURNS anyelement AS $$ SELECT min($1[i]) FROM generate_subscripts($1, 1) g(i); $$ LANGUAGE SQL; SELECT anyleast(10, -1, 5, 4); anyleast ---------- -1 (1 row) SELECT anyleast('abc'::text, 'def'); anyleast ---------- abc (1 row) CREATE FUNCTION concat_values(text, VARIADIC anyarray) RETURNS text AS $$ SELECT array_to_string($2, $1); $$ LANGUAGE SQL; SELECT concat_values('|', 1, 4, 2); concat_values --------------- 1|4|2 (1 row) </screen>
ru: Полиморфизм также можно применять с функциями с переменными параметрами. Например: <screen> CREATE FUNCTION anyleast (VARIADIC anyarray) RETURNS anyelement AS $$ SELECT min($1[i]) FROM generate_subscripts($1, 1) g(i); $$ LANGUAGE SQL; SELECT anyleast(10, -1, 5, 4); anyleast ---------- -1 (1 row) SELECT anyleast('abc'::text, 'def'); anyleast ---------- abc (1 row) CREATE FUNCTION concat_values(text, VARIADIC anyarray) RETURNS text AS $$ SELECT array_to_string($2, $1); $$ LANGUAGE SQL; SELECT concat_values('|', 1, 4, 2); concat_values --------------- 1|4|2 (1 row) </screen>

source: <acronym>SQL</acronym> Functions with Collations
ru: Функции <acronym>SQL</acronym> с правилами сортировки

source: <primary>collation</primary> <secondary>in SQL functions</secondary>
ru: <primary>правила сортировки</primary> <secondary>в функциях SQL</secondary>

source: When a SQL function has one or more parameters of collatable data types, a collation is identified for each function call depending on the collations assigned to the actual arguments, as described in <xref linkend="collation"/>. If a collation is successfully identified (i.e., there are no conflicts of implicit collations among the arguments) then all the collatable parameters are treated as having that collation implicitly. This will affect the behavior of collation-sensitive operations within the function. For example, using the <function>anyleast</function> function described above, the result of <placeholder-1/> will depend on the database's default collation. In <literal>C</literal> locale the result will be <literal>ABC</literal>, but in many other locales it will be <literal>abc</literal>. The collation to use can be forced by adding a <literal>COLLATE</literal> clause to any of the arguments, for example <placeholder-2/> Alternatively, if you wish a function to operate with a particular collation regardless of what it is called with, insert <literal>COLLATE</literal> clauses as needed in the function definition. This version of <function>anyleast</function> would always use <literal>en_US</literal> locale to compare strings: <placeholder-3/> But note that this will throw an error if applied to a non-collatable data type.
ru: Когда функция SQL принимает один или несколько параметров сортируемых типов данных, правило сортировки определяется при каждом вызове функции, в зависимости от правил сортировки, связанных с фактическими аргументами, как описано в <xref remap="6" linkend="collation"/>. Если правило сортировки определено успешно (то есть не возникло конфликтов между неявно установленными правилами сортировки аргументов), оно неявно назначается для всех сортируемых параметров. Выбранное правило будет определять поведение операций, связанных с сортировкой, в данной функции. Например, для показанной выше функции <function>anyleast</function>, результат <placeholder-1/> будет зависеть от правила сортировки по умолчанию, заданного в базе данных. С локалью <literal>C</literal> результатом будет строка <literal>ABC</literal>, но со многими другими локалями это будет <literal>abc</literal>. Нужное правило сортировки можно установить принудительно, добавив предложение <literal>COLLATE</literal> к одному из аргументов функции, например: <placeholder-2/> С другой стороны, если вы хотите, чтобы функция работала с определённым правилом сортировки, вне зависимости от того, с каким она была вызвана, вставьте предложения <literal>COLLATE</literal> где требуется в определении функции. Эта версия <function>anyleast</function> всегда будет сравнивать строки по правилам локали <literal>en_US</literal>: <placeholder-3/> Но заметьте, что при попытке применить правило к несортируемому типу данных, возникнет ошибка.

source: If no common collation can be identified among the actual arguments, then a SQL function treats its parameters as having their data types' default collation (which is usually the database's default collation, but could be different for parameters of domain types).
ru: Если для фактических аргументов не удаётся определить общее правило сортировки, функция SQL считает, что им назначено правило сортировки по умолчанию для их типа данных (обычно это то же правило сортировки, что определено по умолчанию для базы данных, но оно может быть и другим для параметров доменных типов).

source: The behavior of collatable parameters can be thought of as a limited form of polymorphism, applicable only to textual data types.
ru: Поведение сортируемых параметров можно воспринимать как ограниченную форму полиморфизма, применимую только к текстовым типам данных.

source: Function Overloading
ru: Перегрузка функций

source: <primary>overloading</primary> <secondary>functions</secondary>
ru: <primary>перегрузка</primary> <secondary>функций</secondary>

source: More than one function can be defined with the same SQL name, so long as the arguments they take are different. In other words, function names can be <firstterm>overloaded</firstterm>. When a query is executed, the server will determine which function to call from the data types and the number of the provided arguments. Overloading can also be used to simulate functions with a variable number of arguments, up to a finite maximum number.
ru: Вы можете определить несколько функций с одним именем SQL, если эти функции будут принимать разные аргументы. Другими словами, имена функций можно <firstterm>перегружать</firstterm>. Когда выполняется запрос, сервер определяет, какую именно функцию вызывать, по количеству и типам представленных аргументов. Перегрузка может быть полезна для имитации функций с переменным количеством аргументов, до какого-то конечного числа.

source: When creating a family of overloaded functions, one should be careful not to create ambiguities. For instance, given the functions: <placeholder-1/> it is not immediately clear which function would be called with some trivial input like <literal>test(1, 1.5)</literal>. The currently implemented resolution rules are described in <xref linkend="typeconv"/>, but it is unwise to design a system that subtly relies on this behavior.
ru: Создавая семейство перегруженных функций, необходимо не допускать неоднозначности. Например, если созданы функции: <placeholder-1/> не вполне понятно, какая функция будет вызвана с довольно простыми аргументами вроде <literal>test(1, 1.5)</literal>. Реализованные в данный момент правила разрешения типов описаны в <xref remap="6" linkend="typeconv"/>, но разрабатывать систему, которая будет незаметно полагаться на такие особенности, неразумно.

source: A function that takes a single argument of a composite type should generally not have the same name as any attribute (field) of that type. Recall that <literal><replaceable>attribute</replaceable>(<replaceable>table</replaceable>)</literal> is considered equivalent to <literal><replaceable>table</replaceable>.<replaceable>attribute</replaceable></literal>. In the case that there is an ambiguity between a function on a composite type and an attribute of the composite type, the attribute will always be used. It is possible to override that choice by schema-qualifying the function name (that is, <literal><replaceable>schema</replaceable>.<replaceable>func</replaceable>(<replaceable>table</replaceable>) </literal>) but it's better to avoid the problem by not choosing conflicting names.
ru: Функции, принимающей один аргумент составного типа, обычно не следует давать имя, совпадающее с именем какого-либо атрибута (поля) этого типа. Вспомните, что запись <literal><replaceable>атрибут</replaceable>(<replaceable>таблица</replaceable>)</literal> считается равнозначной <literal><replaceable>таблица</replaceable>.<replaceable>атрибут</replaceable></literal>. В случае, когда возникает неоднозначность между функцией, принимающей составной тип, и атрибутом составного типа, всегда будет выбираться атрибут. Этот выбор можно переопределить, дополнив имя функции схемой (то есть, записав <literal><replaceable>схема</replaceable>.<replaceable>функция</replaceable>(<replaceable>таблица</replaceable>) </literal>), но лучше избежать этой проблемы, подобрав разные имена.

source: Another possible conflict is between variadic and non-variadic functions. For instance, it is possible to create both <literal>foo(numeric)</literal> and <literal>foo(VARIADIC numeric[])</literal>. In this case it is unclear which one should be matched to a call providing a single numeric argument, such as <literal>foo(10.1)</literal>. The rule is that the function appearing earlier in the search path is used, or if the two functions are in the same schema, the non-variadic one is preferred.
ru: Другой тип конфликта возможен между обычными функциями и функциями с переменными параметрами. Например, можно создать функции <literal>foo(numeric)</literal> и <literal>foo(VARIADIC numeric[])</literal>. В этом случае будет непонятно, какая функция должна выбираться при передаче одного числового аргумента, например <literal>foo(10.1)</literal>. При разрешении этого конфликта предпочтение отдаётся функции, найденной первой по пути поиска, либо, если две функции находятся в одной схеме, выбирается функция с постоянными аргументами.

source: CREATE FUNCTION test(int) RETURNS int AS '<replaceable>filename</replaceable>', 'test_1arg' LANGUAGE C; CREATE FUNCTION test(int, int) RETURNS int AS '<replaceable>filename</replaceable>', 'test_2arg' LANGUAGE C;
ru: CREATE FUNCTION test(int) RETURNS int AS '<replaceable>имя_файла</replaceable>', 'test_1arg' LANGUAGE C; CREATE FUNCTION test(int, int) RETURNS int AS '<replaceable>имя_файла</replaceable>', 'test_2arg' LANGUAGE C;
