Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/xfunc.po
Languages: ru

source: Several helper functions are available for setting up the needed <structname>TupleDesc</structname>. The recommended way to do this in most functions returning composite values is to call: <placeholder-1/> passing the same <literal>fcinfo</literal> struct passed to the calling function itself. (This of course requires that you use the version-1 calling conventions.) <varname>resultTypeId</varname> can be specified as <literal>NULL</literal> or as the address of a local variable to receive the function's result type OID. <varname>resultTupleDesc</varname> should be the address of a local <structname>TupleDesc</structname> variable. Check that the result is <literal>TYPEFUNC_COMPOSITE</literal>; if so, <varname>resultTupleDesc</varname> has been filled with the needed <structname>TupleDesc</structname>. (If it is not, you can report an error along the lines of <quote>function returning record called in context that cannot accept type record</quote>.)
ru: Для получения требуемого дескриптора <structname>TupleDesc</structname> предлагается несколько дополнительных функций. Рекомендованный способ возврата составных значений заключается в вызове функции: <placeholder-1/> При этом в <literal>fcinfo</literal> должна передаваться та же структура, что была передана самой вызывающей функции. (Для этого, конечно, необходимо использовать соглашения о вызовах версии 1.) В <varname>resultTypeId</varname> можно передать <literal>NULL</literal> или адрес локальной переменной, в которую будет записан OID типа результата функции. В <varname>resultTupleDesc</varname> должен передаваться адрес локальной переменной <structname>TupleDesc</structname>. Убедить, что функция возвратила результат <literal>TYPEFUNC_COMPOSITE</literal>; в этом случае, в <varname>resultTupleDesc</varname> оказывается требуемая структура <structname>TupleDesc</structname>. (Если получен другой результат, вы можете выдать ошибку с сообщением <quote>функция, возвращающая запись, вызвана в контексте, не допускающем этот тип</quote>.)

source: <function>get_call_result_type</function> can resolve the actual type of a polymorphic function result; so it is useful in functions that return scalar polymorphic results, not only functions that return composites. The <varname>resultTypeId</varname> output is primarily useful for functions returning polymorphic scalars.
ru: <function>get_call_result_type</function> позволяет получить фактический тип результата полиморфной функции, так что она полезна и в функциях, возвращающих скалярные полиморфные результаты, не только в функциях, возвращающих составные типы. Выходной параметр <varname>resultTypeId</varname> полезен в первую очередь для полиморфных скалярных функций.

source: <function>get_call_result_type</function> has a sibling <function>get_expr_result_type</function>, which can be used to resolve the expected output type for a function call represented by an expression tree. This can be used when trying to determine the result type from outside the function itself. There is also <function>get_func_result_type</function>, which can be used when only the function's OID is available. However these functions are not able to deal with functions declared to return <structname>record</structname>, and <function>get_func_result_type</function> cannot resolve polymorphic types, so you should preferentially use <function>get_call_result_type</function>.
ru: В дополнение к <function>get_call_result_type</function> есть схожая функция <function>get_expr_result_type</function>, позволяющая получить ожидаемый тип результата для вызова функции, представленного деревом выражения. Её можно использовать, когда тип результата нужно определить извне самой функции. Есть также функция <function>get_func_result_type</function>, которую можно применять, когда известен только OID функции. Однако эти две функции неспособны выдать тип результата функций, возвращающих <structname>record</structname>, а <function>get_func_result_type</function> неспособна разрешать полиморфные типы, так что вместо них лучше использовать <function>get_call_result_type</function>.

source: Older, now-deprecated functions for obtaining <structname>TupleDesc</structname>s are: <placeholder-1/> to get a <structname>TupleDesc</structname> for the row type of a named relation, and: <placeholder-2/> to get a <structname>TupleDesc</structname> based on a type OID. This can be used to get a <structname>TupleDesc</structname> for a base or composite type. It will not work for a function that returns <structname>record</structname>, however, and it cannot resolve polymorphic types.
ru: Ранее для получения <structname>TupleDesc</structname> использовались теперь уже устаревшие функции: <placeholder-1/> (возвращает <structname>TupleDesc</structname> для типа строк указанного отношения) и: <placeholder-2/> (возвращает <structname>TupleDesc</structname> для типа, задаваемого по OID). Применяя её, можно получить <structname>TupleDesc</structname> для базового или составного типа. Однако она не подойдёт для функции, возвращающей тип <structname>record</structname>, и не сможет разрешить полиморфные типы.

source: Once you have a <structname>TupleDesc</structname>, call: <placeholder-1/> if you plan to work with Datums, or: <placeholder-2/> if you plan to work with C strings. If you are writing a function returning set, you can save the results of these functions in the <structname>FuncCallContext</structname> structure &mdash; use the <structfield>tuple_desc</structfield> or <structfield>attinmeta</structfield> field respectively.
ru: Получив <structname>TupleDesc</structname>, вызовите: <placeholder-1/> если вы планируете работать со структурами Datum, либо: <placeholder-2/> если планируете работать со строками C. Если вы разрабатываете функцию, возвращающую набор данных, вы можете сохранить результаты этих функций в структуре <structname>FuncCallContext</structname>, в поле <structfield>tuple_desc</structfield> или <structfield>attinmeta</structfield>, соответственно.

source: When working with Datums, use: <placeholder-1/> to build a <structname>HeapTuple</structname> given user data in Datum form.
ru: Если вы работаете со структурами Datum, воспользуйтесь функцией: <placeholder-1/> Она формирует <structname>HeapTuple</structname> из переданных ей данных в форме Datum.

source: When working with C strings, use: <placeholder-1/> to build a <structname>HeapTuple</structname> given user data in C string form. <parameter>values</parameter> is an array of C strings, one for each attribute of the return row. Each C string should be in the form expected by the input function of the attribute data type. In order to return a null value for one of the attributes, the corresponding pointer in the <parameter>values</parameter> array should be set to <symbol>NULL</symbol>. This function will need to be called again for each row you return.
ru: Если вы работаете со строками C, воспользуйтесь функцией: <placeholder-1/> Она формирует <structname>HeapTuple</structname> из переданных ей данных в виде строк C. В параметре <parameter>values</parameter> ей передаётся массив строк C, по одной для каждого атрибута выходной строки. Каждая из этих строк должна иметь формат, принимаемый функцией ввода типа данных атрибута. Чтобы задать значение NULL для одного из этих атрибутов, вместо соответствующего указателя в массиве <parameter>values</parameter> нужно передать <symbol>NULL</symbol>. Эту функцию нужно вызывать для каждой строки, которую вы будете возвращать.

source: Once you have built a tuple to return from your function, it must be converted into a <type>Datum</type>. Use: <placeholder-1/> to convert a <structname>HeapTuple</structname> into a valid Datum. This <type>Datum</type> can be returned directly if you intend to return just a single row, or it can be used as the current return value in a set-returning function.
ru: Получив кортеж, который вы будете возвращать из вашей функции, вы должны преобразовать его в тип <type>Datum</type>. Чтобы преобразовать <structname>HeapTuple</structname> в Datum, воспользуйтесь функцией: <placeholder-1/> Полученный тип <type>Datum</type> можно вернуть непосредственно, если должна возвращаться только одна строка, либо использовать как текущее выдаваемое значение в функции, возвращающей набор строк.

source: An example appears in the next section.
ru: Пример приведён в следующем разделе.

source: Returning Sets
ru: Возврат множеств

source: There is also a special API that provides support for returning sets (multiple rows) from a C-language function. A set-returning function must follow the version-1 calling conventions. Also, source files must include <filename>funcapi.h</filename>, as above.
ru: Есть также специальный интерфейс, который позволяет функциям на C возвращать множества (несколько строк). Функции, возвращающие множества, должны следовать соглашению о вызовах версии 1. Кроме того, соответствующие исходные файлы должны включать <filename>funcapi.h</filename>, как показано выше.

source: typedef struct FuncCallContext { /* * Number of times we've been called before * * call_cntr is initialized to 0 for you by SRF_FIRSTCALL_INIT(), and * incremented for you every time SRF_RETURN_NEXT() is called. */ uint64 call_cntr; /* * OPTIONAL maximum number of calls * * max_calls is here for convenience only and setting it is optional. * If not set, you must provide alternative means to know when the * function is done. */ uint64 max_calls; /* * OPTIONAL pointer to result slot * * This is obsolete and only present for backward compatibility, viz, * user-defined SRFs that use the deprecated TupleDescGetSlot(). */ TupleTableSlot *slot; /* * OPTIONAL pointer to miscellaneous user-provided context information * * user_fctx is for use as a pointer to your own data to retain * arbitrary context information between calls of your function. */ void *user_fctx; /* * OPTIONAL pointer to struct containing attribute type input metadata * * attinmeta is for use when returning tuples (i.e., composite data types) * and is not used when returning base data types. It is only needed * if you intend to use BuildTupleFromCStrings() to create the return * tuple. */ AttInMetadata *attinmeta; /* * memory context used for structures that must live for multiple calls * * multi_call_memory_ctx is set by SRF_FIRSTCALL_INIT() for you, and used * by SRF_RETURN_DONE() for cleanup. It is the most appropriate memory * context for any memory that is to be reused across multiple calls * of the SRF. */ MemoryContext multi_call_memory_ctx; /* * OPTIONAL pointer to struct containing tuple description * * tuple_desc is for use when returning tuples (i.e., composite data types) * and is only needed if you are going to build the tuples with * heap_form_tuple() rather than with BuildTupleFromCStrings(). Note that * the TupleDesc pointer stored here should usually have been run through * BlessTupleDesc() first. */ TupleDesc tuple_desc; } FuncCallContext;
ru: typedef struct FuncCallContext { /* * Счётчик числа ранее выполненных вызовов * * call_cntr сбрасывается в 0 макросом SRF_FIRSTCALL_INIT() и * увеличивается на 1 каждый раз, когда вызывается SRF_RETURN_NEXT(). */ uint64 call_cntr; /* * Максимальное число вызовов (может не использоваться) * * max_calls не является обязательным и присутствует здесь только для удобства. * Если это значение не задано, вы должны предоставить другую возможность определить, * когда функция завершила свою работу. */ uint64 max_calls; /* * Указатель на слот результата (может не использоваться) * * Это поле устарело и представлено только для обратной совместимости, а именно, * для пользовательских SRF, использующих устаревшую TupleDescGetSlot(). */ TupleTableSlot *slot; /* * Указатель на разнообразную контекстную информацию, * представленную пользователем; (может не использоваться) * * user_fctx используется как указатель на ваши собственные данные, * позволяющий сохранить контекстную информацию между вызовами функции. */ void *user_fctx; /* * Указатель на структуру, содержащую метаданные ввода типа атрибута * (может не использоваться) * * attinmeta задействуется, когда возвращаются кортежи (т. е. составные типы данных), * и не применяется для возврата базовых типов. Он нужен, только если * вы планируете использовать BuildTupleFromCStrings() для формирования возвращаемого * кортежа. */ AttInMetadata *attinmeta; /* * Контекст памяти, нужный для структур, которые должны сохраняться при нескольких вызовах * * Поле multi_call_memory_ctx заполняется в SRF_FIRSTCALL_INIT() и используется * в SRF_RETURN_DONE() для очистки. Это наиболее подходящий контекст * для любых блоков памяти, которые должны многократно использоваться при * повторных вызовах SRF. */ MemoryContext multi_call_memory_ctx; /* * Указатель на структуру, содержащую описание кортежа (может не использоваться) * * tuple_desc задействуется, когда возвращаются кортежи (т. е. составные типы), * и нужен только, если вы планируете формировать кортежи с помощью функции * heap_form_tuple(), а не BuildTupleFromCStrings(). Заметьте, что сохраняемый * здесь указатель TupleDesc обычно должен сначала пройти через вызов * BlessTupleDesc(). */ TupleDesc tuple_desc; } FuncCallContext;

source: A set-returning function (<acronym>SRF</acronym>) is called once for each item it returns. The <acronym>SRF</acronym> must therefore save enough state to remember what it was doing and return the next item on each call. The structure <structname>FuncCallContext</structname> is provided to help control this process. Within a function, <literal>fcinfo-&gt;flinfo-&gt;fn_extra</literal> is used to hold a pointer to <structname>FuncCallContext</structname> across calls. <placeholder-1/>
ru: Функция, возвращающая множество (<acronym>SRF</acronym>, Set-Returning Function), вызывается каждый раз для очередной записи. Таким образом, <acronym>SRF</acronym> должна сохранять достаточно информации о состоянии, чтобы понимать, что она делает, и выдать очередную запись при следующем вызове. Для облегчения управления этим процессом представлена структура <structname>FuncCallContext</structname>. Для кода функции указатель на эту структуру <structname>FuncCallContext</structname> сохраняется между вызовами в поле <literal>fcinfo-&gt;flinfo-&gt;fn_extra</literal>. <placeholder-1/>

source: An <acronym>SRF</acronym> uses several functions and macros that automatically manipulate the <structname>FuncCallContext</structname> structure (and expect to find it via <literal>fn_extra</literal>). Use: <placeholder-1/> to determine if your function is being called for the first or a subsequent time. On the first call (only) use: <placeholder-2/> to initialize the <structname>FuncCallContext</structname>. On every function call, including the first, use: <placeholder-3/> to properly set up for using the <structname>FuncCallContext</structname> and clearing any previously returned data left over from the previous pass.
ru: В <acronym>SRF</acronym> применяются различные функции и макросы, автоматически манипулирующие структурой <structname>FuncCallContext</structname> (они обращаются к ней через <literal>fn_extra</literal>). В частности, чтобы определить, была ли функция вызвана в первый или последующий раз, используйте: <placeholder-1/> Чтобы инициализировать <structname>FuncCallContext</structname> при первом вызове (и только), используйте: <placeholder-2/> Чтобы подготовиться к использованию <structname>FuncCallContext</structname> и очистить все ранее возвращённые данные, оставшиеся после предыдущего прохода, при каждом вызове функции, в том числе, первом, выполните: <placeholder-3/>

source: If your function has data to return, use: <placeholder-1/> to return it to the caller. (<literal>result</literal> must be of type <type>Datum</type>, either a single value or a tuple prepared as described above.) Finally, when your function is finished returning data, use: <placeholder-2/> to clean up and end the <acronym>SRF</acronym>.
ru: Если у вашей функции есть данные, которые нужно возвратить, выполните: <placeholder-1/> для того, чтобы выдать их вызывающему. (Переменная <literal>result</literal> должна быть типа <type>Datum</type>, либо одним значением, либо кортежем, подготовленным как описано выше.) Наконец, когда ваша функция закончила возвращать данные, выполните: <placeholder-2/> для того, чтобы провести очистку и завершить <acronym>SRF</acronym>.

source: The memory context that is current when the <acronym>SRF</acronym> is called is a transient context that will be cleared between calls. This means that you do not need to call <function>pfree</function> on everything you allocated using <function>palloc</function>; it will go away anyway. However, if you want to allocate any data structures to live across calls, you need to put them somewhere else. The memory context referenced by <structfield>multi_call_memory_ctx</structfield> is a suitable location for any data that needs to survive until the <acronym>SRF</acronym> is finished running. In most cases, this means that you should switch into <structfield>multi_call_memory_ctx</structfield> while doing the first-call setup.
ru: Контекст памяти, в котором вызывается <acronym>SRF</acronym>, временный, он будет очищаться между вызовами. Это значит, что вам не нужно вызывать <function>pfree</function> для всех блоков памяти, которые вы получили через <function>palloc</function>; они всё равно будут освобождены. Однако, если вы хотите выделить структуры данных и сохранить их между вызовами, вам нужно разместить их где-то в другом месте. Для размещения таких данных, которые не должны уничтожаться, пока <acronym>SRF</acronym> не закончит работу, подходит контекст памяти, на который указывает <structfield>multi_call_memory_ctx</structfield>. В большинстве случаев это означает, что вы должны переключиться в контекст <structfield>multi_call_memory_ctx</structfield> в коде подготовки при первом вызове.

source: While the actual arguments to the function remain unchanged between calls, if you detoast the argument values (which is normally done transparently by the <function>PG_GETARG_<replaceable>xxx</replaceable></function> macro) in the transient context then the detoasted copies will be freed on each cycle. Accordingly, if you keep references to such values in your <structfield>user_fctx</structfield>, you must either copy them into the <structfield>multi_call_memory_ctx</structfield> after detoasting, or ensure that you detoast the values only in that context.
ru: Тогда как фактические аргументы такой функции не меняются от вызова к вызову, если вы распаковываете значения аргументов (что обычно прозрачно делают макросы <function>PG_GETARG_<replaceable>xxx</replaceable></function>) во временном контексте, распакованные копии будут освобождаться при каждом вызове. Соответственно, если вы сохраните ссылки на такие значения в своём контексте <structfield>user_fctx</structfield>, вы должны либо скопировать эти значения в <structfield>multi_call_memory_ctx</structfield> после распаковки, либо распаковывать значения только в этом контексте.

source: Datum my_set_returning_function(PG_FUNCTION_ARGS) { FuncCallContext *funcctx; Datum result; <replaceable>further declarations as needed</replaceable> if (SRF_IS_FIRSTCALL()) { MemoryContext oldcontext; funcctx = SRF_FIRSTCALL_INIT(); oldcontext = MemoryContextSwitchTo(funcctx-&gt;multi_call_memory_ctx); /* One-time setup code appears here: */ <replaceable>user code</replaceable> <replaceable>if returning composite</replaceable> <replaceable>build TupleDesc, and perhaps AttInMetadata</replaceable> <replaceable>endif returning composite</replaceable> <replaceable>user code</replaceable> MemoryContextSwitchTo(oldcontext); } /* Each-time setup code appears here: */ <replaceable>user code</replaceable> funcctx = SRF_PERCALL_SETUP(); <replaceable>user code</replaceable> /* this is just one way we might test whether we are done: */ if (funcctx-&gt;call_cntr &lt; funcctx-&gt;max_calls) { /* Here we want to return another item: */ <replaceable>user code</replaceable> <replaceable>obtain result Datum</replaceable> SRF_RETURN_NEXT(funcctx, result); } else { /* Here we are done returning items and just need to clean up: */ <replaceable>user code</replaceable> SRF_RETURN_DONE(funcctx); } }
ru: Datum my_set_returning_function(PG_FUNCTION_ARGS) { FuncCallContext *funcctx; Datum result; <replaceable>другие необходимые объявления</replaceable> if (SRF_IS_FIRSTCALL()) { MemoryContext oldcontext; funcctx = SRF_FIRSTCALL_INIT(); oldcontext = MemoryContextSwitchTo(funcctx-&gt;multi_call_memory_ctx); /* Здесь размещается код подготовки при первом вызове: */ <replaceable>некоторый код</replaceable> <replaceable>если возвращается составной тип</replaceable> <replaceable>получить TupleDesc и, возможно, AttInMetadata</replaceable> <replaceable>конец ветвления для составного типа</replaceable> <replaceable>некоторый код</replaceable> MemoryContextSwitchTo(oldcontext); } /* Здесь размещается код подготовки для каждого вызова: */ <replaceable>некоторый код</replaceable> funcctx = SRF_PERCALL_SETUP(); <replaceable>некоторый код</replaceable> /* это только один способ определить, не пора ли закончить работу: */ if (funcctx-&gt;call_cntr &lt; funcctx-&gt;max_calls) { /* Здесь мы хотим вернуть следующий результат: */ <replaceable>некоторый код</replaceable> <replaceable>получить результирующий Datum</replaceable> SRF_RETURN_NEXT(funcctx, result); } else { /* Здесь мы заканчиваем выдавать результаты и нам нужно провести очистку: */ <replaceable>некоторый код</replaceable> SRF_RETURN_DONE(funcctx); } }

source: A complete pseudo-code example looks like the following: <placeholder-1/>
ru: Полный пример с псевдокодом будет выглядеть так: <placeholder-1/>

source: CREATE TYPE __retcomposite AS (f1 integer, f2 integer, f3 integer); CREATE OR REPLACE FUNCTION retcomposite(integer, integer) RETURNS SETOF __retcomposite AS '<replaceable>filename</replaceable>', 'retcomposite' LANGUAGE C IMMUTABLE STRICT;
ru: CREATE TYPE __retcomposite AS (f1 integer, f2 integer, f3 integer); CREATE OR REPLACE FUNCTION retcomposite(integer, integer) RETURNS SETOF __retcomposite AS '<replaceable>имя_файла</replaceable>', 'retcomposite' LANGUAGE C IMMUTABLE STRICT;

source: CREATE OR REPLACE FUNCTION retcomposite(IN integer, IN integer, OUT f1 integer, OUT f2 integer, OUT f3 integer) RETURNS SETOF record AS '<replaceable>filename</replaceable>', 'retcomposite' LANGUAGE C IMMUTABLE STRICT;
ru: CREATE OR REPLACE FUNCTION retcomposite(IN integer, IN integer, OUT f1 integer, OUT f2 integer, OUT f3 integer) RETURNS SETOF record AS '<replaceable>имя_файла</replaceable>', 'retcomposite' LANGUAGE C IMMUTABLE STRICT;

source: A complete example of a simple <acronym>SRF</acronym> returning a composite type looks like: <placeholder-1/> One way to declare this function in SQL is: <placeholder-2/> A different way is to use OUT parameters: <placeholder-3/> Notice that in this method the output type of the function is formally an anonymous <structname>record</structname> type.
ru: Полный пример простой <acronym>SRF</acronym>-функции, возвращающей составной тип, выглядит так: <placeholder-1/> В SQL её можно объявить следующим образом: <placeholder-2/> Также её можно объявить с параметрами OUT: <placeholder-3/> Заметьте, что при таком подходе выходным типом функции формально является анонимный тип <structname>record</structname>.

source: The directory <link linkend="tablefunc">contrib/tablefunc</link> module in the source distribution contains more examples of set-returning functions.
ru: Каталог <link linkend="tablefunc">contrib/tablefunc</link> в пакете исходного кода содержит дополнительные примеры функций, возвращающих множества.

source: Polymorphic Arguments and Return Types
ru: Полиморфные типы аргументов и результата
