Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/xfunc.po
Languages: ru

source: When overloading C-language functions, there is an additional constraint: The C name of each function in the family of overloaded functions must be different from the C names of all other functions, either internal or dynamically loaded. If this rule is violated, the behavior is not portable. You might get a run-time linker error, or one of the functions will get called (usually the internal one). The alternative form of the <literal>AS</literal> clause for the SQL <command>CREATE FUNCTION</command> command decouples the SQL function name from the function name in the C source code. For instance: <placeholder-1/> The names of the C functions here reflect one of many possible conventions.
ru: При перегрузке функций на языке C есть дополнительное ограничение: имя уровня C каждой функции в семействе перегруженных функций должно отличаться от имён уровня C всех других функций, как внутренних, так и загружаемых динамически. Если это правило нарушается, поведение зависит от среды. Вы можете получить ошибку компоновщика во время выполнения, либо будет вызвана не та функция (обычно внутренняя). Альтернативная форма предложения <literal>AS</literal> для SQL-команды <command>CREATE FUNCTION</command> позволяет отвязать имя SQL-функции от имени, определённого в исходном коде на C. Например: <placeholder-1/> Имена функций на C здесь следуют одному из множества возможных соглашений.

source: Function Volatility Categories
ru: Категории изменчивости функций

source: <primary>volatility</primary> <secondary>functions</secondary>
ru: <primary>изменчивость</primary> <secondary>функций</secondary>

source: A <literal>VOLATILE</literal> function can do anything, including modifying the database. It can return different results on successive calls with the same arguments. The optimizer makes no assumptions about the behavior of such functions. A query using a volatile function will re-evaluate the function at every row where its value is needed.
ru: Изменчивая функция (<literal>VOLATILE</literal>) может делать всё, что угодно, в том числе, модифицировать базу данных. Она может возвращать различные результаты при нескольких вызовах с одинаковыми аргументами. Оптимизатор не делает никаких предположений о поведении таких функций. В запросе, использующем изменчивую функцию, она будет вычисляться заново для каждой строки, когда потребуется её результат.

source: A <literal>STABLE</literal> function cannot modify the database and is guaranteed to return the same results given the same arguments for all rows within a single statement. This category allows the optimizer to optimize multiple calls of the function to a single call. In particular, it is safe to use an expression containing such a function in an index scan condition. (Since an index scan will evaluate the comparison value only once, not once at each row, it is not valid to use a <literal>VOLATILE</literal> function in an index scan condition.)
ru: Стабильная функция (<literal>STABLE</literal>) не может модифицировать базу данных и гарантированно возвращает одинаковый результат, получая одинаковые аргументы, для всех строк в одном операторе. Эта характеристика позволяет оптимизатору заменить множество вызовов этой функции одним. В частности, выражение, содержащее такую функцию, можно безопасно использовать в условии поиска по индексу. (Так как при поиске по индексу целевое значение вычисляется только один раз, а не для каждой строки, использовать функцию с характеристикой <literal>VOLATILE</literal> в условии поиска по индексу нельзя.)

source: An <literal>IMMUTABLE</literal> function cannot modify the database and is guaranteed to return the same results given the same arguments forever. This category allows the optimizer to pre-evaluate the function when a query calls it with constant arguments. For example, a query like <literal>SELECT ... WHERE x = 2 + 2</literal> can be simplified on sight to <literal>SELECT ... WHERE x = 4</literal>, because the function underlying the integer addition operator is marked <literal>IMMUTABLE</literal>.
ru: Постоянная функция (<literal>IMMUTABLE</literal>) не может модифицировать базу данных и гарантированно всегда возвращает одинаковые результаты для одних и тех же аргументов. Эта характеристика позволяет оптимизатору предварительно вычислить функцию, когда она вызывается в запросе с постоянными аргументами. Например, запрос вида <literal>SELECT ... WHERE x = 2 + 2</literal> можно упростить до <literal>SELECT ... WHERE x = 4</literal>, так как нижележащая функция оператора сложения помечена как <literal>IMMUTABLE</literal>.

source: Every function has a <firstterm>volatility</firstterm> classification, with the possibilities being <literal>VOLATILE</literal>, <literal>STABLE</literal>, or <literal>IMMUTABLE</literal>. <literal>VOLATILE</literal> is the default if the <xref linkend="sql-createfunction"/> command does not specify a category. The volatility category is a promise to the optimizer about the behavior of the function: <placeholder-1/>
ru: Для каждой функции определяется характеристика <firstterm>изменчивости</firstterm>, с возможными вариантами: <literal>VOLATILE</literal>, <literal>STABLE</literal> и <literal>IMMUTABLE</literal>. Если эта характеристика не задаётся явно в команде <xref linkend="sql-createfunction"/>, по умолчанию подразумевается <literal>VOLATILE</literal>. Категория изменчивости представляет собой обещание некоторого поведения функции для оптимизатора: <placeholder-1/>

source: For best optimization results, you should label your functions with the strictest volatility category that is valid for them.
ru: Для наилучших результатов оптимизации, функции следует назначать самую строгую характеристику изменчивости, которой она соответствует.

source: Any function with side-effects <emphasis>must</emphasis> be labeled <literal>VOLATILE</literal>, so that calls to it cannot be optimized away. Even a function with no side-effects needs to be labeled <literal>VOLATILE</literal> if its value can change within a single query; some examples are <literal>random()</literal>, <literal>currval()</literal>, <literal>timeofday()</literal>.
ru: Любая функция с побочными эффектами <emphasis>должна</emphasis> быть помечена как <literal>VOLATILE</literal>, чтобы обращения к ней не исключались при оптимизации. Даже если функция не имеет побочных эффектов, её нужно пометить как <literal>VOLATILE</literal>, если её значение может меняться при выполнении одного запроса; таковы функции <literal>random()</literal>, <literal>currval()</literal> и <literal>timeofday()</literal>.

source: Another important example is that the <function>current_timestamp</function> family of functions qualify as <literal>STABLE</literal>, since their values do not change within a transaction.
ru: Другой важный пример представляет семейство функций <function>current_timestamp</function>, которые имеют характеристику <literal>STABLE</literal>, потому что их значения не меняются в рамках одной транзакции.

source: There is relatively little difference between <literal>STABLE</literal> and <literal>IMMUTABLE</literal> categories when considering simple interactive queries that are planned and immediately executed: it doesn't matter a lot whether a function is executed once during planning or once during query execution startup. But there is a big difference if the plan is saved and reused later. Labeling a function <literal>IMMUTABLE</literal> when it really isn't might allow it to be prematurely folded to a constant during planning, resulting in a stale value being re-used during subsequent uses of the plan. This is a hazard when using prepared statements or when using function languages that cache plans (such as <application>PL/pgSQL</application>).
ru: Характеристики <literal>STABLE</literal> и <literal>IMMUTABLE</literal> мало различаются, когда речь идёт о простых интерактивных запросах, которые планируются и сразу же выполняются; не имеет большого значения, будет ли функция выполнена однократно на этапе планирования или в начале выполнения. Существенное различие проявляется, когда план сохраняется и многократно используется позже. Если функция помечена как <literal>IMMUTABLE</literal>, тогда как на самом деле она не является постоянной, она может быть сведена к константе во время планирования, так что при последующих выполнениях плана вместо неё будет использоваться неактуальное значение. Это опасно при использовании подготовленных операторов или языков функций, кеширующих планы (например, <application>PL/pgSQL</application>).

source: For functions written in SQL or in any of the standard procedural languages, there is a second important property determined by the volatility category, namely the visibility of any data changes that have been made by the SQL command that is calling the function. A <literal>VOLATILE</literal> function will see such changes, a <literal>STABLE</literal> or <literal>IMMUTABLE</literal> function will not. This behavior is implemented using the snapshotting behavior of MVCC (see <xref linkend="mvcc"/>): <literal>STABLE</literal> and <literal>IMMUTABLE</literal> functions use a snapshot established as of the start of the calling query, whereas <literal>VOLATILE</literal> functions obtain a fresh snapshot at the start of each query they execute.
ru: У функций, написанных на SQL или на любом другом стандартном процедурном языке, есть ещё одно важное свойство, определяемое характеристикой изменчивости, а именно видимость изменений, произведённых командой SQL, которая вызывает эту функцию. Функция <literal>VOLATILE</literal> будет видеть такие изменения, тогда как <literal>STABLE</literal> и <literal>IMMUTABLE</literal> — нет. Это поведение реализуется посредством снимков в MVCC (см. <xref remap="4" linkend="mvcc"/>): <literal>STABLE</literal> и <literal>IMMUTABLE</literal> используют снимок, полученный в начале вызывающего запроса, тогда как функции <literal>VOLATILE</literal> получают свежий снимок в начале каждого запроса, который они выполняют.

source: Functions written in C can manage snapshots however they want, but it's usually a good idea to make C functions work this way too.
ru: Функции, написанные на C, могут работать со снимками как угодно, но обычно лучше сделать так, чтобы они действовали аналогично.

source: Because of this snapshotting behavior, a function containing only <command>SELECT</command> commands can safely be marked <literal>STABLE</literal>, even if it selects from tables that might be undergoing modifications by concurrent queries. <productname>PostgreSQL</productname> will execute all commands of a <literal>STABLE</literal> function using the snapshot established for the calling query, and so it will see a fixed view of the database throughout that query.
ru: Вследствие такой организации работы со снимками, функцию, содержащую только команды <command>SELECT</command>, можно безопасно пометить как <literal>STABLE</literal>, даже если она выбирает данные из таблиц, которые могут быть изменены параллельными запросами. <productname>PostgreSQL</productname> выполнит все команды в функции <literal>STABLE</literal> со снимком, полученным для вызывающего запроса, так что они будут видеть одно представление базы данных на протяжении всего запроса.

source: The same snapshotting behavior is used for <command>SELECT</command> commands within <literal>IMMUTABLE</literal> functions. It is generally unwise to select from database tables within an <literal>IMMUTABLE</literal> function at all, since the immutability will be broken if the table contents ever change. However, <productname>PostgreSQL</productname> does not enforce that you do not do that.
ru: То же самое поведение со снимками распространяется на команды <command>SELECT</command> в функциях <literal>IMMUTABLE</literal>. Вообще в функциях <literal>IMMUTABLE</literal> обычно неразумно выбирать данные из таблиц, так как &laquo;постоянство&raquo; функции будет нарушено, если содержимое таблиц изменится. Однако <productname>PostgreSQL</productname> не принуждает вас явно отказаться от этого.

source: A common error is to label a function <literal>IMMUTABLE</literal> when its results depend on a configuration parameter. For example, a function that manipulates timestamps might well have results that depend on the <xref linkend="guc-timezone"/> setting. For safety, such functions should be labeled <literal>STABLE</literal> instead.
ru: Одна из распространённых ошибок — помечать функцию как <literal>IMMUTABLE</literal>, при том, что её результаты зависят от параметра конфигурации. Например, функция, работающая с временем, может выдавать результаты, зависящие от параметра <xref linkend="guc-timezone"/>. Для надёжности такие функции следует помечать как <literal>STABLE</literal>.

source: <productname>PostgreSQL</productname> requires that <literal>STABLE</literal> and <literal>IMMUTABLE</literal> functions contain no SQL commands other than <command>SELECT</command> to prevent data modification. (This is not a completely bulletproof test, since such functions could still call <literal>VOLATILE</literal> functions that modify the database. If you do that, you will find that the <literal>STABLE</literal> or <literal>IMMUTABLE</literal> function does not notice the database changes applied by the called function, since they are hidden from its snapshot.)
ru: <productname>PostgreSQL</productname> требует, чтобы функции <literal>STABLE</literal> и <literal>IMMUTABLE</literal> не содержали SQL-команд, кроме <command>SELECT</command>, для предотвращения модификации данных. (Это не совсем непробиваемое ограничение, так как эти функции всё же могут вызывать функции <literal>VOLATILE</literal>, способные модифицировать базу данных. Если вы реализуете такую схему, вы увидите, что функция <literal>STABLE</literal> и <literal>IMMUTABLE</literal> не замечает изменений в базе данных, произведённых вызванной функцией, так как они не проявляются в её снимке данных.)

source: Procedural Language Functions
ru: Функции на процедурных языках

source: <productname>PostgreSQL</productname> allows user-defined functions to be written in other languages besides SQL and C. These other languages are generically called <firstterm>procedural languages</firstterm> (<acronym>PL</acronym>s). Procedural languages aren't built into the <productname>PostgreSQL</productname> server; they are offered by loadable modules. See <xref linkend="xplang"/> and following chapters for more information.
ru: <productname>PostgreSQL</productname> позволяет разрабатывать собственные функции и на языках, отличных от SQL и C. Эти другие языки в целом обычно называются <firstterm>процедурными языками</firstterm> (<acronym>PL</acronym>, Procedural Languages). Процедурные языки не встроены в сервер <productname>PostgreSQL</productname>; они предлагаются загружаемыми модулями. За дополнительной информацией обратитесь к <xref remap="3" linkend="xplang"/> и следующим главам.

source: Internal Functions
ru: Внутренние функции

source: <primary>function</primary><secondary>internal</secondary>
ru: <primary>функция</primary> <secondary>внутренняя</secondary>

source: Internal functions are functions written in C that have been statically linked into the <productname>PostgreSQL</productname> server. The <quote>body</quote> of the function definition specifies the C-language name of the function, which need not be the same as the name being declared for SQL use. (For reasons of backward compatibility, an empty body is accepted as meaning that the C-language function name is the same as the SQL name.)
ru: Внутренние функции — это функции, написанные на языке C, и статически скомпонованные в исполняемый код сервера <productname>PostgreSQL</productname>. В <quote>теле</quote> определения функции задаётся имя функции на уровне C, которое не обязательно должно совпадать с именем, объявленным для использования в SQL. (Обратной совместимости ради, тело функции может быть пустым, что будет означать, что имя функции на уровне C совпадает с именем в SQL.)

source: Normally, all internal functions present in the server are declared during the initialization of the database cluster (see <xref linkend="creating-cluster"/>), but a user could use <command>CREATE FUNCTION</command> to create additional alias names for an internal function. Internal functions are declared in <command>CREATE FUNCTION</command> with language name <literal>internal</literal>. For instance, to create an alias for the <function>sqrt</function> function: <placeholder-1/> (Most internal functions expect to be declared <quote>strict</quote>.)
ru: Обычно все внутренние функции, представленные на сервере, объявляются в ходе инициализации кластера баз данных (см. <xref remap="4" linkend="creating-cluster"/>), но пользователь может воспользоваться командой <command>CREATE FUNCTION</command> и добавить дополнительные псевдонимы для внутренней функции. Внутренние функции объявляются в <command>CREATE FUNCTION</command> с именем языка <literal>internal</literal>. Например, так можно создать псевдоним для функции <function>sqrt</function>: <placeholder-1/> (Большинство внутренних функций должны объявляться как <quote>strict</quote>.)

source: Not all <quote>predefined</quote> functions are <quote>internal</quote> in the above sense. Some predefined functions are written in SQL.
ru: Не все <quote>предопределённые</quote> функции являются <quote>внутренними</quote> в вышеописанном смысле. Некоторые предопределённые функции написаны на SQL.

source: C-Language Functions
ru: Функции на языке C

source: <primary>function</primary> <secondary>user-defined</secondary> <tertiary>in C</tertiary>
ru: <primary>функция</primary> <secondary>пользовательская</secondary> <tertiary>на C</tertiary>

source: User-defined functions can be written in C (or a language that can be made compatible with C, such as C++). Such functions are compiled into dynamically loadable objects (also called shared libraries) and are loaded by the server on demand. The dynamic loading feature is what distinguishes <quote>C language</quote> functions from <quote>internal</quote> functions &mdash; the actual coding conventions are essentially the same for both. (Hence, the standard internal function library is a rich source of coding examples for user-defined C functions.)
ru: Пользовательские функции могут быть написаны на C (или на языке, который может быть совместим с C, например C++). Такие функции компилируются в динамически загружаемые объекты (также называемые разделяемыми библиотеками) и загружаются сервером по требованию. Именно метод динамической загрузки отличает функции <quote>на языке C</quote> от <quote>внутренних</quote> функций &mdash; правила написания кода по сути одни и те же. (Собственно, поэтому стандартная библиотека внутренних функций может быть богатым источником примеров для написания собственных функций на языке C.)

source: Two different calling conventions are currently used for C functions. The newer <quote>version 1</quote> calling convention is indicated by writing a <literal>PG_FUNCTION_INFO_V1()</literal> macro call for the function, as illustrated below. Lack of such a macro indicates an old-style (<quote>version 0</quote>) function. The language name specified in <command>CREATE FUNCTION</command> is <literal>C</literal> in either case. Old-style functions are now deprecated because of portability problems and lack of functionality, but they are still supported for compatibility reasons.
ru: Для функций на C в настоящее время используются два различных соглашения о вызовах. По новому соглашению <quote>версии 1</quote> для функции записывается макрос <literal>PG_FUNCTION_INFO_V1()</literal>, как показано ниже. Отсутствие такого макроса говорит о том, что это функция старого стиля (<quote>версии 0</quote>). В качестве имени языка в <command>CREATE FUNCTION</command> задаётся <literal>C</literal> в любом случае. Функции старого стиля считаются устаревшими из-за проблем с переносимостью и недостаточной функциональности, но они всё ещё поддерживаются для совместимости.

source: Dynamic Loading
ru: Динамическая загрузка

source: <primary>dynamic loading</primary>
ru: <primary>динамическая загрузка</primary>

source: The first time a user-defined function in a particular loadable object file is called in a session, the dynamic loader loads that object file into memory so that the function can be called. The <command>CREATE FUNCTION</command> for a user-defined C function must therefore specify two pieces of information for the function: the name of the loadable object file, and the C name (link symbol) of the specific function to call within that object file. If the C name is not explicitly specified then it is assumed to be the same as the SQL function name.
ru: В первый раз, когда в сеансе вызывается пользовательская функция в определённом внешнем объектном файле, загрузчик динамических модулей загружает этот файл в память, чтобы можно было вызвать эту функцию. Таким образом, в команде <command>CREATE FUNCTION</command>, объявляющей пользовательскую функцию на языке C, необходимо определить две сущности для функции: имя загружаемого объектного файла и имя уровня C (символ для компоновки) заданной функции в этом объектном файле. Если имя уровня C не указано явно, предполагается, что оно совпадает с именем функции в SQL.

source: If the name is an absolute path, the given file is loaded.
ru: Если имя задаётся абсолютным путём, загружается заданный файл.

source: If the name starts with the string <literal>$libdir</literal>, that part is replaced by the <productname>PostgreSQL</productname> package library directory name, which is determined at build time.<placeholder-1/>
ru: Если имя начинается со строки <literal>$libdir</literal>, эта часть пути заменяется путём к каталогу библиотек <productname>PostgreSQL</productname>, который определяется во время сборки.<placeholder-1/>

source: If the name does not contain a directory part, the file is searched for in the path specified by the configuration variable <xref linkend="guc-dynamic-library-path"/>.<placeholder-1/>
ru: Если в имени не указывается каталог, поиск файла производится по пути, заданному конфигурационной переменной <xref linkend="guc-dynamic-library-path"/>.<placeholder-1/>

source: Otherwise (the file was not found in the path, or it contains a non-absolute directory part), the dynamic loader will try to take the name as given, which will most likely fail. (It is unreliable to depend on the current working directory.)
ru: В противном случае (файл не был найден в пути поиска, или в его имени указывается не абсолютный путь к каталогу), загрузчик попытается принять имя как есть, что, скорее всего, не увенчается успехом. (Полагаться на текущий рабочий каталог ненадёжно.)

source: The following algorithm is used to locate the shared object file based on the name given in the <command>CREATE FUNCTION</command> command: <placeholder-1/> If this sequence does not work, the platform-specific shared library file name extension (often <filename>.so</filename>) is appended to the given name and this sequence is tried again. If that fails as well, the load will fail.
ru: Для нахождения разделяемого объектного файла по имени, заданному в команде <command>CREATE FUNCTION</command>, применяется следующий алгоритм: <placeholder-1/> Если эта последовательность не даёт положительный результат, к данному имени добавляется принятое на данной платформе расширение файлов библиотек (часто <filename>.so</filename>) и последовательность повторяется снова. Если и это не приводит к успеху, происходит сбой загрузки.
