Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/xfunc.po
Languages: ru

source: C-language functions can be declared to accept and return the polymorphic types <type>anyelement</type>, <type>anyarray</type>, <type>anynonarray</type>, <type>anyenum</type>, and <type>anyrange</type>. See <xref linkend="extend-types-polymorphic"/> for a more detailed explanation of polymorphic functions. When function arguments or return types are defined as polymorphic types, the function author cannot know in advance what data type it will be called with, or need to return. There are two routines provided in <filename>fmgr.h</filename> to allow a version-1 C function to discover the actual data types of its arguments and the type it is expected to return. The routines are called <literal>get_fn_expr_rettype(FmgrInfo *flinfo)</literal> and <literal>get_fn_expr_argtype(FmgrInfo *flinfo, int argnum)</literal>. They return the result or argument type OID, or <symbol>InvalidOid</symbol> if the information is not available. The structure <literal>flinfo</literal> is normally accessed as <literal>fcinfo-&gt;flinfo</literal>. The parameter <literal>argnum</literal> is zero based. <function>get_call_result_type</function> can also be used as an alternative to <function>get_fn_expr_rettype</function>. There is also <function>get_fn_expr_variadic</function>, which can be used to find out whether variadic arguments have been merged into an array. This is primarily useful for <literal>VARIADIC "any"</literal> functions, since such merging will always have occurred for variadic functions taking ordinary array types.
ru: Функции на языке C могут быть объявлены как принимающие и возвращающие полиморфные типы <type>anyelement</type>, <type>anyarray</type>, <type>anynonarray</type>, <type>anyenum</type> и <type>anyrange</type>. За более подробным объяснением полиморфных функций обратитесь к <xref remap="3" linkend="extend-types-polymorphic"/>. Когда типы аргументов или результат определены как полиморфные, автор функции не может заранее знать, с какими типами данных она будет вызываться и какой возвращать. Чтобы функция на C в стиле версии 1 могла определить фактические типы данных своих аргументов и тип, который она должна вернуть, в <filename>fmgr.h</filename> предлагаются две функции. Они называются <literal>get_fn_expr_rettype(FmgrInfo *flinfo)</literal> и <literal>get_fn_expr_argtype(FmgrInfo *flinfo, int argnum)</literal> и возвращают соответственно OID типа результата и аргумента, либо <symbol>InvalidOid</symbol>, если информация о типе отсутствует. Структуру <literal>flinfo</literal> обычно можно получить по ссылке <literal>fcinfo-&gt;flinfo</literal>. Номер аргумента <literal>argnum</literal> задаётся, начиная с нуля. В качестве альтернативы <function>get_fn_expr_rettype</function> также можно использовать функции <function>get_call_result_type</function>. Кроме того, есть функция <function>get_fn_expr_variadic</function>, позволяющая определить, были ли переменные аргументы объединены в массив. Это полезно в основном для функций <literal>VARIADIC "any"</literal>, так как такое объединение всегда имеет место для функций с переменными аргументами, принимающих обычные типы.

source: PG_FUNCTION_INFO_V1(make_array); Datum make_array(PG_FUNCTION_ARGS) { ArrayType *result; Oid element_type = get_fn_expr_argtype(fcinfo-&gt;flinfo, 0); Datum element; bool isnull; int16 typlen; bool typbyval; char typalign; int ndims; int dims[MAXDIM]; int lbs[MAXDIM]; if (!OidIsValid(element_type)) elog(ERROR, "could not determine data type of input"); /* get the provided element, being careful in case it's NULL */ isnull = PG_ARGISNULL(0); if (isnull) element = (Datum) 0; else element = PG_GETARG_DATUM(0); /* we have one dimension */ ndims = 1; /* and one element */ dims[0] = 1; /* and lower bound is 1 */ lbs[0] = 1; /* get required info about the element type */ get_typlenbyvalalign(element_type, &amp;typlen, &amp;typbyval, &amp;typalign); /* now build the array */ result = construct_md_array(&amp;element, &amp;isnull, ndims, dims, lbs, element_type, typlen, typbyval, typalign); PG_RETURN_ARRAYTYPE_P(result); }
ru: PG_FUNCTION_INFO_V1(make_array); Datum make_array(PG_FUNCTION_ARGS) { ArrayType *result; Oid element_type = get_fn_expr_argtype(fcinfo-&gt;flinfo, 0); Datum element; bool isnull; int16 typlen; bool typbyval; char typalign; int ndims; int dims[MAXDIM]; int lbs[MAXDIM]; if (!OidIsValid(element_type)) elog(ERROR, "could not determine data type of input"); /* получить переданный элемент, учитывая, что это может быть NULL */ isnull = PG_ARGISNULL(0); if (isnull) element = (Datum) 0; else element = PG_GETARG_DATUM(0); /* мы имеем дело с одной размерностью */ ndims = 1; /* и одним элементом */ dims[0] = 1; /* с нижней границей, равной 1 */ lbs[0] = 1; /* получить требуемую информацию о типе элемента */ get_typlenbyvalalign(element_type, &amp;typlen, &amp;typbyval, &amp;typalign); /* теперь создать массив */ result = construct_md_array(&amp;element, &amp;isnull, ndims, dims, lbs, element_type, typlen, typbyval, typalign); PG_RETURN_ARRAYTYPE_P(result); }

source: For example, suppose we want to write a function to accept a single element of any type, and return a one-dimensional array of that type: <placeholder-1/>
ru: Например, предположим, что нам нужно написать функцию, принимающую один элемент любого типа и возвращающую одномерный массив этого типа: <placeholder-1/>

source: CREATE FUNCTION make_array(anyelement) RETURNS anyarray AS '<replaceable>DIRECTORY</replaceable>/funcs', 'make_array' LANGUAGE C IMMUTABLE;
ru: CREATE FUNCTION make_array(anyelement) RETURNS anyarray AS '<replaceable>КАТАЛОГ</replaceable>/funcs', 'make_array' LANGUAGE C IMMUTABLE;

source: The following command declares the function <function>make_array</function> in SQL: <placeholder-1/>
ru: Следующая команда объявляет функцию <function>make_array</function> в SQL: <placeholder-1/>

source: There is a variant of polymorphism that is only available to C-language functions: they can be declared to take parameters of type <literal>"any"</literal>. (Note that this type name must be double-quoted, since it's also a SQL reserved word.) This works like <type>anyelement</type> except that it does not constrain different <literal>"any"</literal> arguments to be the same type, nor do they help determine the function's result type. A C-language function can also declare its final parameter to be <literal>VARIADIC "any"</literal>. This will match one or more actual arguments of any type (not necessarily the same type). These arguments will <emphasis>not</emphasis> be gathered into an array as happens with normal variadic functions; they will just be passed to the function separately. The <function>PG_NARGS()</function> macro and the methods described above must be used to determine the number of actual arguments and their types when using this feature. Also, users of such a function might wish to use the <literal>VARIADIC</literal> keyword in their function call, with the expectation that the function would treat the array elements as separate arguments. The function itself must implement that behavior if wanted, after using <function>get_fn_expr_variadic</function> to detect that the actual argument was marked with <literal>VARIADIC</literal>.
ru: Существует один вариант полиморфизма, которым могут пользоваться только функции на языке C: их можно объявить с параметрами типа <literal>"any"</literal>. (Заметьте, что имя этого типа нужно заключать в двойные кавычки, так как это также зарезервированное слово в SQL.) Он работает так же, как <type>anyelement</type>, за исключением того, что он не требует, чтобы аргументы <literal>"any"</literal> имели одинаковый тип, и не помогает определить тип результата функции. Функцию на языке C можно также объявить с последним параметром <literal>VARIADIC "any"</literal>. Ему будут соответствовать один или более фактических аргументов любого типа (не обязательно одинакового). Эти аргументы <emphasis>не</emphasis> будут собираться в массив, как это происходит с обычными функциями с переменными аргументами; они просто будут переданы функции по отдельности. Если применяется этот вариант, то чтобы определить число фактических аргументов и их типы, нужно использовать макрос <function>PG_NARGS()</function> и функции, описанные выше. Пользователи такой функции также могут пожелать использовать ключевое слово <literal>VARIADIC</literal> в вызове функции, ожидая, что функция обработает элементы массива как отдельные аргументы. При необходимости соответствующее поведение должна реализовывать сама функция, определив с помощью <function>get_fn_expr_variadic</function>, был ли фактический аргумент передан с указанием <literal>VARIADIC</literal>.

source: Transform Functions
ru: Функции преобразования

source: Some function calls can be simplified during planning based on properties specific to the function. For example, <literal>int4mul(n, 1)</literal> could be simplified to just <literal>n</literal>. To define such function-specific optimizations, write a <firstterm>transform function</firstterm> and place its OID in the <structfield>protransform</structfield> field of the primary function's <structname>pg_proc</structname> entry. The transform function must have the SQL signature <literal>protransform(internal) RETURNS internal</literal>. The argument, actually <type>FuncExpr *</type>, is a dummy node representing a call to the primary function. If the transform function's study of the expression tree proves that a simplified expression tree can substitute for all possible concrete calls represented thereby, build and return that simplified expression. Otherwise, return a <literal>NULL</literal> pointer (<emphasis>not</emphasis> a SQL null).
ru: Некоторые вызовы функций можно упростить на стадии планирования, в зависимости от особых свойств функции. Например, функцию умножения (<literal>int4mul(n, 1)</literal>) можно упростить просто до <literal>n</literal>. Чтобы определить такую оптимизацию, нужно написать <firstterm>функцию преобразования</firstterm> и поместить её OID в поле <structfield>protransform</structfield> записи основной функции в <structname>pg_proc</structname>. Функция преобразования должна иметь в SQL сигнатуру <literal>protransform(internal) RETURNS internal</literal>. В аргументе, фактически имеющем тип <type>FuncExpr *</type>, передаётся фиктивный узел, представляющий вызов основной функции. Если анализ дерева выражения в функции преобразования показывает, что вместо всех возможных конкретных вызовов может быть подставлено дерево упрощённого выражения, эта функция должна построить и вернуть это упрощённое выражение. В противном случае нужно вернуть указатель <literal>NULL</literal> (<emphasis>не</emphasis> NULL языка SQL).

source: We make no guarantee that <productname>PostgreSQL</productname> will never call the primary function in cases that the transform function could simplify. Ensure rigorous equivalence between the simplified expression and an actual call to the primary function.
ru: Мы не гарантируем, что <productname>PostgreSQL</productname> никогда не будет вызывать основную функцию во всех случаях, когда функция преобразования может её упростить, поэтому важно, чтобы упрощённое выражение строго соответствовало реальному вызову основной функции.

source: Currently, this facility is not exposed to users at the SQL level because of security concerns, so it is only practical to use for optimizing built-in functions.
ru: В настоящее время эта функциональность не предоставляется пользователям на уровне SQL из соображений безопасности, так что на практике это можно использовать только для оптимизации встроенных функций.

source: Shared Memory and LWLocks
ru: Разделяемая память и лёгкие блокировки

source: Add-ins can reserve LWLocks and an allocation of shared memory on server startup. The add-in's shared library must be preloaded by specifying it in <xref linkend="guc-shared-preload-libraries"/><placeholder-1/>. Shared memory is reserved by calling: <placeholder-2/> from your <function>_PG_init</function> function.
ru: Модули расширений могут резервировать лёгкие блокировки и область в разделяемой памяти при запуске сервера. Чтобы библиотека модуля предварительно загружалась на этапе запуска сервера, нужно указать её в <xref linkend="guc-shared-preload-libraries"/><placeholder-1/>. Чтобы зарезервировать разделяемую память, вызовите из вашей функции <function>_PG_init</function> функцию: <placeholder-2/>

source: LWLocks are reserved by calling: <placeholder-1/> from <function>_PG_init</function>. This will ensure that an array of <literal>num_lwlocks</literal> LWLocks is available under the name <literal>tranche_name</literal>. Use <function>GetNamedLWLockTranche</function> to get a pointer to this array.
ru: Чтобы зарезервировать лёгкие блокировки, из <function>_PG_init</function> нужно вызвать: <placeholder-1/> В результате будет сформирован массив из <literal>num_lwlocks</literal> лёгких блокировок под именем <literal>tranche_name</literal>. Чтобы получить указатель на этот массив, воспользуйтесь функцией <function>GetNamedLWLockTranche</function>.

source: static mystruct *ptr = NULL; if (!ptr) { bool found; LWLockAcquire(AddinShmemInitLock, LW_EXCLUSIVE); ptr = ShmemInitStruct("my struct name", size, &amp;found); if (!found) { initialize contents of shmem area; acquire any requested LWLocks using: ptr-&gt;locks = GetNamedLWLockTranche("my tranche name"); } LWLockRelease(AddinShmemInitLock); }
ru: static mystruct *ptr = NULL; if (!ptr) { bool found; LWLockAcquire(AddinShmemInitLock, LW_EXCLUSIVE); ptr = ShmemInitStruct("my struct name", size, &amp;found); if (!found) { /* инициализировать содержимое области разделяемой памяти; */ /* получить все требуемые блокировки LWLocks: */ ptr-&gt;locks = GetNamedLWLockTranche("my tranche name"); } LWLockRelease(AddinShmemInitLock); }

source: To avoid possible race-conditions, each backend should use the LWLock <function>AddinShmemInitLock</function> when connecting to and initializing its allocation of shared memory, as shown here: <placeholder-1/>
ru: Во избежание возможных условий гонки каждый обслуживающий процесс должен вызывать <function>AddinShmemInitLock</function> в момент подключения и при инициализации разделяемой памяти, как показано здесь: <placeholder-1/>

source: Using C++ for Extensibility
ru: Использование C++ для расширяемости

source: All functions accessed by the backend must present a C interface to the backend; these C functions can then call C++ functions. For example, <literal>extern C</literal> linkage is required for backend-accessed functions. This is also necessary for any functions that are passed as pointers between the backend and C++ code.
ru: Все функции, к которым будет обращаться сервер, должны предоставлять ему интерфейс C; эти функции на C затем могут вызывать функции на языке C++. В частности, для функций, доступных серверу, необходимо указать <literal>extern C</literal>. Это также необходимо для всех функций, указатели на которые передаются между кодом сервера и подключаемым кодом на C++.

source: Free memory using the appropriate deallocation method. For example, most backend memory is allocated using <function>palloc()</function>, so use <function>pfree()</function> to free it. Using C++ <function>delete</function> in such cases will fail.
ru: Освобождайте память, применяя для этого подходящий метод. Например, память сервера в основном выделяется функцией <function>palloc()</function>, так что освобождать её нужно, вызывая <function>pfree()</function>. Попытка использовать в таких случаях принятую в C++ операцию <function>delete</function> приведёт к ошибке.

source: Prevent exceptions from propagating into the C code (use a catch-all block at the top level of all <literal>extern C</literal> functions). This is necessary even if the C++ code does not explicitly throw any exceptions, because events like out-of-memory can still throw exceptions. Any exceptions must be caught and appropriate errors passed back to the C interface. If possible, compile C++ with <option>-fno-exceptions</option> to eliminate exceptions entirely; in such cases, you must check for failures in your C++ code, e.g. check for NULL returned by <function>new()</function>.
ru: Не допускайте распространения исключений в код C (добавляйте блок, перехватывающий все исключения, на верхнем уровне функций <literal>extern C</literal>). Это необходимо, даже если код на C++ не генерирует исключения явно, потому что исключения могут возникать, например, и при нехватке памяти. Все исключения должны перехватываться, и в интерфейс C должны передаваться соответствующие ошибки. Если возможно, скомпилируйте код C++ с указанием <option>-fno-exceptions</option>, чтобы полностью отключить исключения; в таких случаях вы должны будете выявлять исключительные ситуации в коде C++, например, проверять на NULL адрес, возвращённый <function>new()</function>.

source: If calling backend functions from C++ code, be sure that the C++ call stack contains only plain old data structures (<acronym>POD</acronym>). This is necessary because backend errors generate a distant <function>longjmp()</function> that does not properly unroll a C++ call stack with non-POD objects.
ru: Вызывая серверные функции из кода C++, убедитесь, что в стеке вызова C++ содержатся только простые структуры данных. Это необходимо, потому что в случае ошибки сервера выполняется функция <function>longjmp()</function>, а она не отматывает стек вызовов C++ должным образом для объектов, отличных от простых структур.

source: Although the <productname>PostgreSQL</productname> backend is written in C, it is possible to write extensions in C++ if these guidelines are followed: <placeholder-1/>
ru: Хотя код сервера <productname>PostgreSQL</productname> написан на C, расширения для него можно писать и на C++, если соблюдать эти правила: <placeholder-1/>

source: In summary, it is best to place C++ code behind a wall of <literal>extern C</literal> functions that interface to the backend, and avoid exception, memory, and call stack leakage.
ru: Резюмируя, лучше всего поместить код C++ за ограду из функций <literal>extern C</literal>, которые будут доступны серверу и смогут защитить от исключений, а также потери стека вызовов и утечки памяти.
