Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/xfunc.po
Languages: ru

source: User-defined Functions
ru: Пользовательские функции

source: <primary>function</primary> <secondary>user-defined</secondary>
ru: <primary>функция</primary> <secondary>определяемая пользователем</secondary>

source: query language functions (functions written in <acronym>SQL</acronym>) (<xref linkend="xfunc-sql"/>)
ru: функции на языке запросов (функции, написанные на <acronym>SQL</acronym>) (<xref linkend="xfunc-sql"/>)

source: procedural language functions (functions written in, for example, <application>PL/pgSQL</application> or <application>PL/Tcl</application>) (<xref linkend="xfunc-pl"/>)
ru: функции на процедурных языках (функции, написанные, например, на <application>PL/pgSQL</application> или <application>PL/Tcl</application>) (<xref linkend="xfunc-pl"/>)

source: internal functions (<xref linkend="xfunc-internal"/>)
ru: внутренние функции (<xref linkend="xfunc-internal"/>)

source: C-language functions (<xref linkend="xfunc-c"/>)
ru: функции на языке C (<xref linkend="xfunc-c"/>)

source: <productname>PostgreSQL</productname> provides four kinds of functions: <placeholder-1/>
ru: В <productname>PostgreSQL</productname> представлены функции четырёх видов: <placeholder-1/>

source: Every kind of function can take base types, composite types, or combinations of these as arguments (parameters). In addition, every kind of function can return a base type or a composite type. Functions can also be defined to return sets of base or composite values.
ru: Функции любых видов могут принимать в качестве аргументов (параметров) базовые типы, составные типы или их сочетания. Кроме того, любые функции могут возвращать значения базового или составного типа. Также можно определить функции, возвращающие наборы базовых или составных значений.

source: Many kinds of functions can take or return certain pseudo-types (such as polymorphic types), but the available facilities vary. Consult the description of each kind of function for more details.
ru: Функции многих видов могут также принимать или возвращать определённые псевдотипы (например, полиморфные типы), но доступные средства для работы с ними различаются. За подробностями обратитесь к описанию конкретного вида функций.

source: It's easiest to define <acronym>SQL</acronym> functions, so we'll start by discussing those. Most of the concepts presented for <acronym>SQL</acronym> functions will carry over to the other types of functions.
ru: Проще всего определить функции на языке <acronym>SQL</acronym>, поэтому сначала мы рассмотрим их. Многие концепции, касающиеся функций на <acronym>SQL</acronym>, затем распространятся и на другие виды функций.

source: Throughout this chapter, it can be useful to look at the reference page of the <xref linkend="sql-createfunction"/> command to understand the examples better. Some examples from this chapter can be found in <filename>funcs.sql</filename> and <filename>funcs.c</filename> in the <filename>src/tutorial</filename> directory in the <productname>PostgreSQL</productname> source distribution.
ru: Изучая эту главу, будет полезно обращаться к странице справки по команде <xref linkend="sql-createfunction"/>, чтобы лучше понимать примеры. Некоторые примеры из этой главы можно найти в файлах <filename>funcs.sql</filename> и <filename>funcs.c</filename> в каталоге <filename>src/tutorial</filename> исходного кода <productname>PostgreSQL</productname>.

source: Query Language (<acronym>SQL</acronym>) Functions
ru: Функции на языке запросов (<acronym>SQL</acronym>)

source: <primary>function</primary> <secondary>user-defined</secondary> <tertiary>in SQL</tertiary>
ru: <primary>функции</primary> <secondary>пользовательские</secondary> <tertiary>на SQL</tertiary>

source: SQL functions execute an arbitrary list of SQL statements, returning the result of the last query in the list. In the simple (non-set) case, the first row of the last query's result will be returned. (Bear in mind that <quote>the first row</quote> of a multirow result is not well-defined unless you use <literal>ORDER BY</literal>.) If the last query happens to return no rows at all, the null value will be returned.
ru: SQL-функции выполняют произвольный список операторов SQL и возвращают результат последнего запроса в списке. В простом случае (не с множеством) будет возвращена первая строка результата последнего запроса. (Помните, что понятие <quote>первая строка</quote> в наборе результатов с несколькими строками определено точно, только если присутствует <literal>ORDER BY</literal>.) Если последний запрос вообще не вернёт строки, будет возвращено значение NULL.

source: Alternatively, an SQL function can be declared to return a set (that is, multiple rows) by specifying the function's return type as <literal>SETOF <replaceable>sometype</replaceable></literal>, or equivalently by declaring it as <literal>RETURNS TABLE(<replaceable>columns</replaceable>)</literal>. In this case all rows of the last query's result are returned. Further details appear below.
ru: Кроме того, можно объявить SQL-функцию как возвращающую множество (то есть, несколько строк), указав в качестве возвращаемого типа функции <literal>SETOF <replaceable>некий_тип</replaceable></literal>, либо объявив её с указанием <literal>RETURNS TABLE(<replaceable>столбцы</replaceable>)</literal>. В этом случае будут возвращены все строки результата последнего запроса. Подробнее это описывается ниже.

source: The body of an SQL function must be a list of SQL statements separated by semicolons. A semicolon after the last statement is optional. Unless the function is declared to return <type>void</type>, the last statement must be a <command>SELECT</command>, or an <command>INSERT</command>, <command>UPDATE</command>, or <command>DELETE</command> that has a <literal>RETURNING</literal> clause.
ru: Тело SQL-функции должно представлять собой список SQL-операторов, разделённых точкой с запятой. Точка с запятой после последнего оператора может отсутствовать. Если только функция не объявлена как возвращающая <type>void</type>, последним оператором должен быть <command>SELECT</command>, либо <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command> с предложением <literal>RETURNING</literal>.

source: Any collection of commands in the <acronym>SQL</acronym> language can be packaged together and defined as a function. Besides <command>SELECT</command> queries, the commands can include data modification queries (<command>INSERT</command>, <command>UPDATE</command>, and <command>DELETE</command>), as well as other SQL commands. (You cannot use transaction control commands, e.g. <command>COMMIT</command>, <command>SAVEPOINT</command>, and some utility commands, e.g. <literal>VACUUM</literal>, in <acronym>SQL</acronym> functions.) However, the final command must be a <command>SELECT</command> or have a <literal>RETURNING</literal> clause that returns whatever is specified as the function's return type. Alternatively, if you want to define a SQL function that performs actions but has no useful value to return, you can define it as returning <type>void</type>. For example, this function removes rows with negative salaries from the <literal>emp</literal> table: <screen> CREATE FUNCTION clean_emp() RETURNS void AS ' DELETE FROM emp WHERE salary &lt; 0; ' LANGUAGE SQL; SELECT clean_emp(); clean_emp ----------- (1 row) </screen>
ru: Любой набор команд на языке <acronym>SQL</acronym> можно скомпоновать вместе и обозначить как функцию. Помимо запросов <command>SELECT</command>, эти команды могут включать запросы, изменяющие данные (<command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command>), а также другие SQL-команды. (В <acronym>SQL</acronym>-функциях нельзя использовать команды управления транзакциями, например <command>COMMIT</command>, <command>SAVEPOINT</command>, и некоторые вспомогательные команды, в частности <literal>VACUUM</literal>.) Однако последней командой должна быть <command>SELECT</command> или команда с предложением <literal>RETURNING</literal>, возвращающая результат с типом возврата функции. Если же вы хотите определить функцию SQL, выполняющую действия, но не возвращающую полезное значение, вы можете объявить её как возвращающую тип <type>void</type>. Например, эта функция удаляет строки с отрицательным жалованьем из таблицы <literal>emp</literal>: <screen> CREATE FUNCTION clean_emp() RETURNS void AS ' DELETE FROM emp WHERE salary &lt; 0; ' LANGUAGE SQL; SELECT clean_emp(); clean_emp ----------- (1 row) </screen>

source: The entire body of a SQL function is parsed before any of it is executed. While a SQL function can contain commands that alter the system catalogs (e.g., <command>CREATE TABLE</command>), the effects of such commands will not be visible during parse analysis of later commands in the function. Thus, for example, <literal>CREATE TABLE foo (...); INSERT INTO foo VALUES(...);</literal> will not work as desired if packaged up into a single SQL function, since <structname>foo</structname> won't exist yet when the <command>INSERT</command> command is parsed. It's recommended to use <application>PL/PgSQL</application> instead of a SQL function in this type of situation.
ru: Прежде чем начинается выполнение команд, разбирается всё тело SQL-функции. Когда SQL-функция содержит команды, модифицирующие системные каталоги (например, <command>CREATE TABLE</command>), действие таких команд не будет видимо на стадии анализа последующих команд этой функции. Так, например, команды <literal>CREATE TABLE foo (...); INSERT INTO foo VALUES(...);</literal> не будут работать, как ожидается, если их упаковать в одну SQL-функцию, так как <structname>foo</structname> не будет существовать к моменту разбору команды <command>INSERT</command>. В подобных ситуациях вместо SQL-функции рекомендуется использовать <application>PL/PgSQL</application>.

source: The syntax of the <command>CREATE FUNCTION</command> command requires the function body to be written as a string constant. It is usually most convenient to use dollar quoting (see <xref linkend="sql-syntax-dollar-quoting"/>) for the string constant. If you choose to use regular single-quoted string constant syntax, you must double single quote marks (<literal>'</literal>) and backslashes (<literal>\</literal>) (assuming escape string syntax) in the body of the function (see <xref linkend="sql-syntax-strings"/>).
ru: Синтаксис команды <command>CREATE FUNCTION</command> требует, чтобы тело функции было записано как строковая константа. Обычно для этого удобнее всего заключать строковую константу в доллары (см. <xref remap="4" linkend="sql-syntax-dollar-quoting"/>). Если вы решите использовать обычный синтаксис с заключением строки в апострофы, вам придётся дублировать апострофы (<literal>'</literal>) и обратную косую черту (<literal>\</literal>) (предполагается синтаксис спецпоследовательностей) в теле функции (см. <xref remap="4" linkend="sql-syntax-strings"/>).

source: Arguments for <acronym>SQL</acronym> Functions
ru: Аргументы <acronym>SQL</acronym>-функций

source: <primary>function</primary> <secondary>named argument</secondary>
ru: <primary>функция</primary> <secondary>именованный аргумент</secondary>

source: Arguments of a SQL function can be referenced in the function body using either names or numbers. Examples of both methods appear below.
ru: К аргументам SQL-функции можно обращаться в теле функции по именам или номерам. Ниже приведены примеры обоих вариантов.

source: To use a name, declare the function argument as having a name, and then just write that name in the function body. If the argument name is the same as any column name in the current SQL command within the function, the column name will take precedence. To override this, qualify the argument name with the name of the function itself, that is <literal><replaceable>function_name</replaceable>.<replaceable>argument_name</replaceable></literal>. (If this would conflict with a qualified column name, again the column name wins. You can avoid the ambiguity by choosing a different alias for the table within the SQL command.)
ru: Чтобы использовать имя, объявите аргумент функции как именованный, а затем просто пишите это имя в теле функции. Если имя аргумента совпадает с именем какого-либо столбца в текущей SQL-команде внутри функции, имя столбца будет иметь приоритет. Чтобы всё же перекрыть имя столбца, дополните имя аргумента именем самой функции, то есть запишите его в виде <literal><replaceable>имя_функции</replaceable>.<replaceable>имя_аргумента</replaceable></literal>. (Если и это имя будет конфликтовать с полным именем столбца, снова выиграет имя столбца. Неоднозначности в этом случае вы можете избежать, выбрав другой псевдоним для таблицы в SQL-команде.)

source: In the older numeric approach, arguments are referenced using the syntax <literal>$<replaceable>n</replaceable></literal>: <literal>$1</literal> refers to the first input argument, <literal>$2</literal> to the second, and so on. This will work whether or not the particular argument was declared with a name.
ru: Старый подход с нумерацией позволяет обращаться к аргументам, применяя запись <literal>$<replaceable>n</replaceable></literal>: <literal>$1</literal> обозначает первый аргумент, <literal>$2</literal> — второй и т. д. Это будет работать и в том случае, если данному аргументу назначено имя.

source: If an argument is of a composite type, then the dot notation, e.g., <literal><replaceable>argname</replaceable>.<replaceable>fieldname</replaceable></literal> or <literal>$1.<replaceable>fieldname</replaceable></literal>, can be used to access attributes of the argument. Again, you might need to qualify the argument's name with the function name to make the form with an argument name unambiguous.
ru: Если аргумент имеет составной тип, то для обращения к его атрибутам можно использовать запись с точкой, например: <literal><replaceable>аргумент</replaceable>.<replaceable>поле</replaceable></literal> или <literal>$1.<replaceable>поле</replaceable></literal>. И опять же, при этом может потребоваться дополнить имя аргумента именем функции, чтобы сделать имя аргумента однозначным.

source: SQL function arguments can only be used as data values, not as identifiers. Thus for example this is reasonable: <placeholder-1/> but this will not work: <placeholder-2/>
ru: Аргументы SQL-функции могут использоваться только как значения данных, но не как идентификаторы. Например, это приемлемо: <placeholder-1/> а это не будет работать: <placeholder-2/>

source: The ability to use names to reference SQL function arguments was added in <productname>PostgreSQL</productname> 9.2. Functions to be used in older servers must use the <literal>$<replaceable>n</replaceable></literal> notation.
ru: Возможность обращаться к аргументам SQL-функций по именам появилась в <productname>PostgreSQL</productname> 9.2. В функциях, которые должны работать со старыми серверами, необходимо применять запись <literal>$<replaceable>n</replaceable></literal>.

source: <acronym>SQL</acronym> Functions on Base Types
ru: Функции <acronym>SQL</acronym> с базовыми типами

source: The simplest possible <acronym>SQL</acronym> function has no arguments and simply returns a base type, such as <type>integer</type>: <screen> CREATE FUNCTION one() RETURNS integer AS $$ SELECT 1 AS result; $$ LANGUAGE SQL; -- Alternative syntax for string literal: CREATE FUNCTION one() RETURNS integer AS ' SELECT 1 AS result; ' LANGUAGE SQL; SELECT one(); one ----- 1 </screen>
ru: Простейшая возможная функция <acronym>SQL</acronym> не имеет аргументов и просто возвращает базовый тип, например <type>integer</type>: <screen> CREATE FUNCTION one() RETURNS integer AS $$ SELECT 1 AS result; $$ LANGUAGE SQL; -- Альтернативная запись строковой константы: CREATE FUNCTION one() RETURNS integer AS ' SELECT 1 AS result; ' LANGUAGE SQL; SELECT one(); one ----- 1 </screen>

source: Notice that we defined a column alias within the function body for the result of the function (with the name <literal>result</literal>), but this column alias is not visible outside the function. Hence, the result is labeled <literal>one</literal> instead of <literal>result</literal>.
ru: Заметьте, что мы определили псевдоним столбца в теле функции для её результата (дали ему имя <literal>result</literal>), но этот псевдоним не виден снаружи функции. Вследствие этого, столбец результата получил имя <literal>one</literal>, а не <literal>result</literal>.

source: It is almost as easy to define <acronym>SQL</acronym> functions that take base types as arguments: <screen> CREATE FUNCTION add_em(x integer, y integer) RETURNS integer AS $$ SELECT x + y; $$ LANGUAGE SQL; SELECT add_em(1, 2) AS answer; answer -------- 3 </screen>
ru: Практически так же легко определяются функции <acronym>SQL</acronym>, которые принимают в аргументах базовые типы: <screen> CREATE FUNCTION add_em(x integer, y integer) RETURNS integer AS $$ SELECT x + y; $$ LANGUAGE SQL; SELECT add_em(1, 2) AS answer; answer -------- 3 </screen>

source: Alternatively, we could dispense with names for the arguments and use numbers: <screen> CREATE FUNCTION add_em(integer, integer) RETURNS integer AS $$ SELECT $1 + $2; $$ LANGUAGE SQL; SELECT add_em(1, 2) AS answer; answer -------- 3 </screen>
ru: Мы также можем отказаться от имён аргументов и обращаться к ним по номерам: <screen> CREATE FUNCTION add_em(integer, integer) RETURNS integer AS $$ SELECT $1 + $2; $$ LANGUAGE SQL; SELECT add_em(1, 2) AS answer; answer -------- 3 </screen>

source: Here is a more useful function, which might be used to debit a bank account: <placeholder-1/> A user could execute this function to debit account 17 by $100.00 as follows: <placeholder-2/>
ru: Вот более полезная функция, которую можно использовать, чтобы дебетовать банковский счёт: <placeholder-1/> Пользователь может выполнить эту функцию, чтобы дебетовать счёт 17 на 100 долларов, так: <placeholder-2/>

source: In this example, we chose the name <literal>accountno</literal> for the first argument, but this is the same as the name of a column in the <literal>bank</literal> table. Within the <command>UPDATE</command> command, <literal>accountno</literal> refers to the column <literal>bank.accountno</literal>, so <literal>tf1.accountno</literal> must be used to refer to the argument. We could of course avoid this by using a different name for the argument.
ru: В этом примере мы выбрали имя <literal>accountno</literal> для первого аргумента, но это же имя имеет столбец в таблице <literal>bank</literal>. В команде <command>UPDATE</command> имя <literal>accountno</literal> относится к столбцу <literal>bank.accountno</literal>, так для обращения к аргументу нужно записать <literal>tf1.accountno</literal>. Конечно, мы могли бы избежать этого, выбрав другое имя для аргумента.

source: In practice one would probably like a more useful result from the function than a constant 1, so a more likely definition is: <placeholder-1/> which adjusts the balance and returns the new balance. The same thing could be done in one command using <literal>RETURNING</literal>: <placeholder-2/>
ru: На практике обычно желательно получать от функции более полезный результат, чем константу 1, поэтому более реалистично такое определение: <placeholder-1/> Эта функция изменяет баланс и возвращает полученное значение. То же самое можно сделать в одной команде, применив <literal>RETURNING</literal>: <placeholder-2/>

source: <acronym>SQL</acronym> Functions on Composite Types
ru: Функции <acronym>SQL</acronym> со сложными типами

source: When writing functions with arguments of composite types, we must not only specify which argument we want but also the desired attribute (field) of that argument. For example, suppose that <type>emp</type> is a table containing employee data, and therefore also the name of the composite type of each row of the table. Here is a function <function>double_salary</function> that computes what someone's salary would be if it were doubled: <screen> CREATE TABLE emp ( name text, salary numeric, age integer, cubicle point ); INSERT INTO emp VALUES ('Bill', 4200, 45, '(2,1)'); CREATE FUNCTION double_salary(emp) RETURNS numeric AS $$ SELECT $1.salary * 2 AS salary; $$ LANGUAGE SQL; SELECT name, double_salary(emp.*) AS dream FROM emp WHERE emp.cubicle ~= point '(2,1)'; name | dream ------+------- Bill | 8400 </screen>
ru: В функциях с аргументами составных типов мы должны указывать не только, какой аргумент, но и какой атрибут (поле) этого аргумента нам нужен. Например, предположим, что <type>emp</type> — таблица, содержащая данные работников, и это же имя составного типа, представляющего каждую строку таблицы. Следующая функция <function>double_salary</function> вычисляет, каким было бы чьё-либо жалование в случае увеличения вдвое: <screen> CREATE TABLE emp ( name text, salary numeric, age integer, cubicle point ); INSERT INTO emp VALUES ('Bill', 4200, 45, '(2,1)'); CREATE FUNCTION double_salary(emp) RETURNS numeric AS $$ SELECT $1.salary * 2 AS salary; $$ LANGUAGE SQL; SELECT name, double_salary(emp.*) AS dream FROM emp WHERE emp.cubicle ~= point '(2,1)'; name | dream ------+------- Bill | 8400 </screen>

source: Notice the use of the syntax <literal>$1.salary</literal> to select one field of the argument row value. Also notice how the calling <command>SELECT</command> command uses <replaceable>table_name</replaceable><literal>.*</literal> to select the entire current row of a table as a composite value. The table row can alternatively be referenced using just the table name, like this: <screen> SELECT name, double_salary(emp) AS dream FROM emp WHERE emp.cubicle ~= point '(2,1)'; </screen> but this usage is deprecated since it's easy to get confused. (See <xref linkend="rowtypes-usage"/> for details about these two notations for the composite value of a table row.)
ru: Обратите внимание на запись <literal>$1.salary</literal> позволяющую выбрать одно поле из значения строки аргумента. Также заметьте, что в вызывающей команде <command>SELECT</command> указание <replaceable>имя_таблицы</replaceable><literal>.*</literal> выбирает всю текущую строку таблицы как составное значение. На строку таблицы можно сослаться и просто по имени таблицы, например так: <screen> SELECT name, double_salary(emp) AS dream FROM emp WHERE emp.cubicle ~= point '(2,1)'; </screen> Однако это использование считается устаревшим, так как провоцирует путаницу. (Подробнее эти две записи составных значений строки таблицы описаны в <xref remap="6" linkend="rowtypes-usage"/>.)

source: Sometimes it is handy to construct a composite argument value on-the-fly. This can be done with the <literal>ROW</literal> construct. For example, we could adjust the data being passed to the function: <screen> SELECT name, double_salary(ROW(name, salary*1.1, age, cubicle)) AS dream FROM emp; </screen>
ru: Иногда бывает удобно образовать составное значение аргумента на лету. Это позволяет сделать конструкция <literal>ROW</literal>. Например, так можно изменить данные, передаваемые функции: <screen> SELECT name, double_salary(ROW(name, salary*1.1, age, cubicle)) AS dream FROM emp; </screen>

source: It is also possible to build a function that returns a composite type. This is an example of a function that returns a single <type>emp</type> row: <placeholder-1/> In this example we have specified each of the attributes with a constant value, but any computation could have been substituted for these constants.
ru: Также возможно создать функцию, возвращающую составной тип. Например, эта функция возвращает одну строку <type>emp</type>: <placeholder-1/> В этом примере мы задали для каждого атрибута постоянное значение, но вместо этих констант можно подставить любые вычисления.
