Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/xfunc.po
Languages: ru

source: The version-1 calling convention relies on macros to suppress most of the complexity of passing arguments and results. The C declaration of a version-1 function is always: <placeholder-1/> In addition, the macro call: <placeholder-2/> must appear in the same source file. (Conventionally, it's written just before the function itself.) This macro call is not needed for <literal>internal</literal>-language functions, since <productname>PostgreSQL</productname> assumes that all internal functions use the version-1 convention. It is, however, required for dynamically-loaded functions.
ru: Соглашение о вызовах версии 1 полагается на макросы, скрывающие основную долю сложностей, связанных с передачей аргументов и результатов. По соглашению версии 1 функция на C должна всегда определяться так: <placeholder-1/> В дополнение к этому, в том же исходном файле должен присутствовать вызов макроса: <placeholder-2/> (Обычно его принято записывать непосредственно перед функцией.) Этот вызов макроса не нужен для функций <literal>internal</literal>, так как <productname>PostgreSQL</productname> предполагает, что все внутренние функции используют соглашении версии 1. Однако для функций, загружаемых динамически, этот макрос необходим.

source: In a version-1 function, each actual argument is fetched using a <function>PG_GETARG_<replaceable>xxx</replaceable>()</function> macro that corresponds to the argument's data type, and the result is returned using a <function>PG_RETURN_<replaceable>xxx</replaceable>()</function> macro for the return type. <function>PG_GETARG_<replaceable>xxx</replaceable>()</function> takes as its argument the number of the function argument to fetch, where the count starts at 0. <function>PG_RETURN_<replaceable>xxx</replaceable>()</function> takes as its argument the actual value to return.
ru: В функции версии 1 каждый аргумент выбирается макросом <function>PG_GETARG_<replaceable>xxx</replaceable>()</function>, который соответствует типу данных аргумента, а результат возвращается макросом <function>PG_RETURN_<replaceable>xxx</replaceable>()</function> для возвращаемого типа. <function>PG_GETARG_<replaceable>xxx</replaceable>()</function> принимает в качестве параметра номер выбираемого аргумента функции (нумерация начинается с 0). <function>PG_RETURN_<replaceable>xxx</replaceable>()</function> принимает в качестве параметра фактическое значение, которое нужно возвратить.

source: Here we show the same functions as above, coded in version-1 style: <placeholder-1/>
ru: Так выглядят те же функции, что были показаны выше, но реализованные в стиле версии 1: <placeholder-1/>

source: The <command>CREATE FUNCTION</command> commands are the same as for the version-0 equivalents.
ru: Команды <command>CREATE FUNCTION</command> не отличаются от тех, что объявляют функции версии 0.

source: At first glance, the version-1 coding conventions might appear to be just pointless obscurantism. They do, however, offer a number of improvements, because the macros can hide unnecessary detail. An example is that in coding <function>add_one_float8</function>, we no longer need to be aware that <type>float8</type> is a pass-by-reference type. Another example is that the <literal>GETARG</literal> macros for variable-length types allow for more efficient fetching of <quote>toasted</quote> (compressed or out-of-line) values.
ru: На первый взгляд соглашение версии 1 может показаться всего лишь бессмысленным мракобесием. Однако, оно приносит ряд усовершенствований, так как макрос может скрыть лишние детали. Например, в реализации <function>add_one_float8</function> мы больше не должны думать о том, что тип <type>float8</type> передаётся по ссылке. Ещё один плюс состоит в том, что макрос <literal>GETARG</literal> для типов переменной длины позволяет эффективно выбирать значения в формате TOAST (сжатых или хранимых отдельно).

source: One big improvement in version-1 functions is better handling of null inputs and results. The macro <function>PG_ARGISNULL(<replaceable>n</replaceable>)</function> allows a function to test whether each input is null. (Of course, doing this is only necessary in functions not declared <quote>strict</quote>.) As with the <function>PG_GETARG_<replaceable>xxx</replaceable>()</function> macros, the input arguments are counted beginning at zero. Note that one should refrain from executing <function>PG_GETARG_<replaceable>xxx</replaceable>()</function> until one has verified that the argument isn't null. To return a null result, execute <function>PG_RETURN_NULL()</function>; this works in both strict and nonstrict functions.
ru: Важным усовершенствованием для функций версии 1 стало улучшение обработки аргументов и результатов NULL. Такие функции могут проверить любое входное значение на NULL, воспользовавшись макросом <function>PG_ARGISNULL(<replaceable>n</replaceable>)</function>. (Разумеется, эти проверки нужны только в функциях, объявленных без характеристики <quote>strict</quote>.) Как и с макросом <function>PG_GETARG_<replaceable>xxx</replaceable>()</function>, входные аргументы нумеруются, начиная с нуля. Заметьте, что не следует обращаться к макросу <function>PG_GETARG_<replaceable>xxx</replaceable>()</function>, не убедившись, что соответствующий аргумент не NULL. Чтобы возвратить NULL в качестве результата, воспользуйтесь макросом <function>PG_RETURN_NULL()</function>; это работает и со строгими, и с нестрогими функциями.

source: Other options provided in the new-style interface are two variants of the <function>PG_GETARG_<replaceable>xxx</replaceable>()</function> macros. The first of these, <function>PG_GETARG_<replaceable>xxx</replaceable>_COPY()</function>, guarantees to return a copy of the specified argument that is safe for writing into. (The normal macros will sometimes return a pointer to a value that is physically stored in a table, which must not be written to. Using the <function>PG_GETARG_<replaceable>xxx</replaceable>_COPY()</function> macros guarantees a writable result.) The second variant consists of the <function>PG_GETARG_<replaceable>xxx</replaceable>_SLICE()</function> macros which take three arguments. The first is the number of the function argument (as above). The second and third are the offset and length of the segment to be returned. Offsets are counted from zero, and a negative length requests that the remainder of the value be returned. These macros provide more efficient access to parts of large values in the case where they have storage type <quote>external</quote>. (The storage type of a column can be specified using <literal>ALTER TABLE <replaceable>tablename</replaceable> ALTER COLUMN <replaceable>colname</replaceable> SET STORAGE <replaceable>storagetype</replaceable></literal>. <replaceable>storagetype</replaceable> is one of <literal>plain</literal>, <literal>external</literal>, <literal>extended</literal>, or <literal>main</literal>.)
ru: Кроме того, в интерфейсе нового стиля появились две вариации макросов <function>PG_GETARG_<replaceable>xxx</replaceable>()</function>. Первая вариация, <function>PG_GETARG_<replaceable>xxx</replaceable>_COPY()</function>, гарантированно возвращает копию указанного аргумента, которую можно безопасно модифицировать. (Обычный макрос иногда возвращает указатель на значение, которое физически хранится в таблице, в которую нельзя писать. С макросом <function>PG_GETARG_<replaceable>xxx</replaceable>_COPY()</function> гарантированно получается результат, доступный для записи.) Вторая вариация представлена макросом <function>PG_GETARG_<replaceable>xxx</replaceable>_SLICE()</function>, принимающим три параметра. В первом передаётся номер аргумента функции (как и раньше). Во втором и третьем передаётся смещение и длина сегмента, который должен быть возвращён. Смещение отсчитывается с нуля, а отрицательная длина указывает, что запрашивается оставшаяся часть значения. Эти макросы дают более эффективный доступ к частям больших значений, имеющим тип хранения <quote>external</quote>. (Тип хранения столбца может задаваться командой <literal>ALTER TABLE <replaceable>имя_таблицы</replaceable> ALTER COLUMN <replaceable>имя_столбца</replaceable> SET STORAGE <replaceable>тип_хранения</replaceable></literal>. Где <replaceable>тип_хранения</replaceable> может быть <literal>plain</literal>, <literal>external</literal>, <literal>extended</literal> или <literal>main</literal>.)

source: Finally, the version-1 function call conventions make it possible to return set results (<xref linkend="xfunc-c-return-set"/>) and implement trigger functions (<xref linkend="triggers"/>) and procedural-language call handlers (<xref linkend="plhandler"/>). Version-1 code is also more portable than version-0, because it does not break restrictions on function call protocol in the C standard. For more details see <filename>src/backend/utils/fmgr/README</filename> in the source distribution.
ru: Наконец соглашение о вызовах версии 1 позволяет возвращать множества (<xref linkend="xfunc-c-return-set"/>) и реализовывать триггерные функции (<xref linkend="triggers"/>) и обработчики вызовов процедурных языков (<xref linkend="plhandler"/>). Код версии 1 также более портируемый, чем версии 0, так как он не нарушает установленных в стандарте C ограничений протокола вызова функций. Дополнительные подробности можно найти в <filename>src/backend/utils/fmgr/README</filename> в пакете исходного кода.

source: Writing Code
ru: Написание кода

source: Before we turn to the more advanced topics, we should discuss some coding rules for <productname>PostgreSQL</productname> C-language functions. While it might be possible to load functions written in languages other than C into <productname>PostgreSQL</productname>, this is usually difficult (when it is possible at all) because other languages, such as C++, FORTRAN, or Pascal often do not follow the same calling convention as C. That is, other languages do not pass argument and return values between functions in the same way. For this reason, we will assume that your C-language functions are actually written in C.
ru: Прежде чем перейти к более сложным темам, мы должны обсудить некоторые правила написания кода функций на языке C для <productname>PostgreSQL</productname>. Хотя принципиально можно загружать в <productname>PostgreSQL</productname> функции, написанные на языках, отличных от C, обычно это довольно сложно (когда вообще возможно), так как другие языки, например C++, FORTRAN или Pascal часто не следуют соглашениям, принятым в C. То есть другие языки могут передавать аргументы и возвращаемые значения между функциями разными способами. Поэтому далее предполагается, что ваши функции на языке C действительно написаны на C.

source: <primary>pg_config</primary><secondary>with user-defined C functions</secondary>
ru: <primary>pg_config</primary> <secondary>для пользовательских функций на C</secondary>

source: Use <literal>pg_config --includedir-server</literal><placeholder-1/> to find out where the <productname>PostgreSQL</productname> server header files are installed on your system (or the system that your users will be running on).
ru: Чтобы выяснить, где находятся заголовочные файлы сервера <productname>PostgreSQL</productname>, установленные в вашей системе (или в системе, с которой будут работать ваши пользователи), воспользуйтесь командой <literal>pg_config --includedir-server</literal><placeholder-1/>.

source: Compiling and linking your code so that it can be dynamically loaded into <productname>PostgreSQL</productname> always requires special flags. See <xref linkend="dfunc"/> for a detailed explanation of how to do it for your particular operating system.
ru: Для компиляции и компоновки кода, который можно будет динамически загрузить в <productname>PostgreSQL</productname>, требуется указать специальные флаги. Чтобы конкретнее узнать, как это сделать в вашей конкретной операционной системе, обратитесь к <xref remap="3" linkend="dfunc"/>.

source: Remember to define a <quote>magic block</quote> for your shared library, as described in <xref linkend="xfunc-c-dynload"/>.
ru: Не забудьте определить <quote>отличительный блок</quote> для вашей разделяемой библиотеки, как описано в <xref remap="6" linkend="xfunc-c-dynload"/>.

source: When allocating memory, use the <productname>PostgreSQL</productname> functions <function>palloc</function><placeholder-1/> and <function>pfree</function><placeholder-2/> instead of the corresponding C library functions <function>malloc</function> and <function>free</function>. The memory allocated by <function>palloc</function> will be freed automatically at the end of each transaction, preventing memory leaks.
ru: Для выделения памяти используйте функцию <productname>PostgreSQL</productname> <function>palloc</function><placeholder-1/>, а для освобождения <function>pfree</function><placeholder-2/>, вместо соответствующих функций библиотеки C <function>malloc</function> и <function>free</function>. Память, выделяемая функцией <function>palloc</function>, будет автоматически освобождаться в конце каждой транзакции, во избежание утечек памяти.

source: Always zero the bytes of your structures using <function>memset</function> (or allocate them with <function>palloc0</function> in the first place). Even if you assign to each field of your structure, there might be alignment padding (holes in the structure) that contain garbage values. Without this, it's difficult to support hash indexes or hash joins, as you must pick out only the significant bits of your data structure to compute a hash. The planner also sometimes relies on comparing constants via bitwise equality, so you can get undesirable planning results if logically-equivalent values aren't bitwise equal.
ru: Всегда обнуляйте байты ваших структур, применяя <function>memset</function> (или сразу выделяйте память функцией <function>palloc0</function>). Даже если вы присвоите значение каждому полю структуры, в ней могут оставаться байты выравнивания (пустоты в структуре), содержащие случайные значения. Если исключить это требование, будет сложно поддерживать индексы или соединение по хешу, так как для вычисления хеша придётся выбирать только значащие биты из вашей структуры данных. Планировщик также иногда полагается на побитовое сравнение констант, так что результаты планирования могут оказаться неожиданными, если логически равные значения окажутся неравными на битовом уровне.

source: Most of the internal <productname>PostgreSQL</productname> types are declared in <filename>postgres.h</filename>, while the function manager interfaces (<symbol>PG_FUNCTION_ARGS</symbol>, etc.) are in <filename>fmgr.h</filename>, so you will need to include at least these two files. For portability reasons it's best to include <filename>postgres.h</filename> <emphasis>first</emphasis>, before any other system or user header files. Including <filename>postgres.h</filename> will also include <filename>elog.h</filename> and <filename>palloc.h</filename> for you.
ru: Большинство внутренних типов <productname>PostgreSQL</productname> объявлены в <filename>postgres.h</filename>, тогда как интерфейс менеджера функций (<symbol>PG_FUNCTION_ARGS</symbol> и т. д.) определён в <filename>fmgr.h</filename>, так что потребуется подключить как минимум два этих файла. По соображениям портируемости, лучше включить <filename>postgres.h</filename> <emphasis>первым</emphasis>, до каких-либо других системных или пользовательских файлов заголовков. При подключении <filename>postgres.h</filename> автоматически также будут подключены <filename>elog.h</filename> и <filename>palloc.h</filename>.

source: Symbol names defined within object files must not conflict with each other or with symbols defined in the <productname>PostgreSQL</productname> server executable. You will have to rename your functions or variables if you get error messages to this effect.
ru: Имена символов, определённые в объектных файлах, не должны конфликтовать друг с другом или с именами других символов, определённых в исполняемых файлах сервера <productname>PostgreSQL</productname>. Если вы столкнётесь с ошибками, вызванными таким конфликтом, вам придётся переименовать ваши функции или переменные.

source: The basic rules for writing and building C functions are as follows: <placeholder-1/>
ru: Основные правила написания и компиляции функций на C таковы: <placeholder-1/>

source: Composite-type Arguments
ru: Аргументы составного типа

source: Composite types do not have a fixed layout like C structures. Instances of a composite type can contain null fields. In addition, composite types that are part of an inheritance hierarchy can have different fields than other members of the same inheritance hierarchy. Therefore, <productname>PostgreSQL</productname> provides a function interface for accessing fields of composite types from C.
ru: Составные типы не имеют фиксированного макета данных, как структуры C. В частности, экземпляры составного типа могут содержать поля NULL. Кроме того, в контексте наследования составные типы могут иметь разные поля для разных членов в одной иерархии наследования. Поэтому <productname>PostgreSQL</productname> предоставляет функциям специальный интерфейс для обращения к полям составных типов из C.

source: Suppose we want to write a function to answer the query: <placeholder-1/> Using call conventions version 0, we can define <function>c_overpaid</function> as: <placeholder-2/> In version-1 coding, the above would look like this: <placeholder-3/>
ru: Предположим, что мы хотим написать функцию, отвечающую на запрос: <placeholder-1/> С соглашением о вызовах версии 0 мы можем определить функцию <function>c_overpaid</function> так: <placeholder-2/> Для версии 1 она будет выглядеть следующим образом: <placeholder-3/>

source: <function>GetAttributeByName</function> is the <productname>PostgreSQL</productname> system function that returns attributes out of the specified row. It has three arguments: the argument of type <type>HeapTupleHeader</type> passed into the function, the name of the desired attribute, and a return parameter that tells whether the attribute is null. <function>GetAttributeByName</function> returns a <type>Datum</type> value that you can convert to the proper data type by using the appropriate <function>DatumGet<replaceable>XXX</replaceable>()</function> macro. Note that the return value is meaningless if the null flag is set; always check the null flag before trying to do anything with the result.
ru: <function>GetAttributeByName</function> — это системная функция <productname>PostgreSQL</productname>, которая возвращает атрибуты указанной строки. Она принимает три параметра: аргумент типа <type>HeapTupleHeader</type>, имя нужного атрибута и выходной параметр, устанавливаемый, если значение атрибута — NULL. <function>GetAttributeByName</function> возвращает значение <type>Datum</type>, которое вы можете привести к подходящему типу данных, используя соответствующий макрос <function>DatumGet<replaceable>XXX</replaceable>()</function>. Заметьте, что возвращаемое значение недействительно, если установлен флаг null; всегда проверяйте этот флаг, прежде чем что-либо делать с результатом.

source: There is also <function>GetAttributeByNum</function>, which selects the target attribute by column number instead of name.
ru: Есть также функция <function>GetAttributeByNum</function>, которая выбирает целевой атрибут не по имени, а по номеру столбца.

source: CREATE FUNCTION c_overpaid(emp, integer) RETURNS boolean AS '<replaceable>DIRECTORY</replaceable>/funcs', 'c_overpaid' LANGUAGE C STRICT;
ru: CREATE FUNCTION c_overpaid(emp, integer) RETURNS boolean AS '<replaceable>КАТАЛОГ</replaceable>/funcs', 'c_overpaid' LANGUAGE C STRICT;

source: The following command declares the function <function>c_overpaid</function> in SQL: <placeholder-1/> Notice we have used <literal>STRICT</literal> so that we did not have to check whether the input arguments were NULL.
ru: Следующая команда объявляет функцию <function>c_overpaid</function> в SQL: <placeholder-1/> Заметьте, что мы использовали <literal>STRICT</literal>, чтобы нам не пришлось проверять входные аргументы на равенство NULL.

source: Returning Rows (Composite Types)
ru: Возврат строк (составных типов)

source: To return a row or composite-type value from a C-language function, you can use a special API that provides macros and functions to hide most of the complexity of building composite data types. To use this API, the source file must include: <placeholder-1/>
ru: Чтобы вернуть строку или значение составного типа из функции на языке C, можно использовать специальный API, предоставляющий макросы и функции, скрывающие основную сложность формирования составных типов данных. Для использования этого API необходимо включить в исходный файл: <placeholder-1/>

source: There are two ways you can build a composite data value (henceforth a <quote>tuple</quote>): you can build it from an array of Datum values, or from an array of C strings that can be passed to the input conversion functions of the tuple's column data types. In either case, you first need to obtain or construct a <structname>TupleDesc</structname> descriptor for the tuple structure. When working with Datums, you pass the <structname>TupleDesc</structname> to <function>BlessTupleDesc</function>, and then call <function>heap_form_tuple</function> for each row. When working with C strings, you pass the <structname>TupleDesc</structname> to <function>TupleDescGetAttInMetadata</function>, and then call <function>BuildTupleFromCStrings</function> for each row. In the case of a function returning a set of tuples, the setup steps can all be done once during the first call of the function.
ru: Сформировать значение составного типа (далее <quote>кортеж</quote>) можно двумя способами: его можно построить из массива значений Datum, или из массива строк C, которые будут переданы функциям преобразования ввода для типов столбцов кортежа. В любом случае, сначала нужно получить или сконструировать дескриптор <structname>TupleDesc</structname> для структуры кортежа. Работая со значениями Datum, вы передаёте <structname>TupleDesc</structname> функции <function>BlessTupleDesc</function>, а затем вызываете <function>heap_form_tuple</function> для каждой строки. Работая со строками C, вы передаёте <structname>TupleDesc</structname> функции <function>TupleDescGetAttInMetadata</function>, а затем для каждой строки вызываете <function>BuildTupleFromCStrings</function>. В случае функции, возвращающей множество кортежей, все подготовительные действия можно выполнить один раз при первом вызове функции.
