Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/bloom.po
Languages: ru

source: <literal>bloom</literal> provides an index access method based on <ulink url="http://en.wikipedia.org/wiki/Bloom_filter">Bloom filters</ulink>.
ru: Модуль <literal>bloom</literal> предоставляет метод доступа индекса, основанный на <ulink url="http://en.wikipedia.org/wiki/Bloom_filter">фильтрах Блума</ulink>.

source: A Bloom filter is a space-efficient data structure that is used to test whether an element is a member of a set. In the case of an index access method, it allows fast exclusion of non-matching tuples via signatures whose size is determined at index creation.
ru: Фильтр Блума представляет собой компактную структуру данных, позволяющую проверить, является ли элемент членом множества. В виде метода доступа индекса он позволяет быстро исключать неподходящие кортежи по сигнатурам, размер которых определяется при создании индекса.

source: A signature is a lossy representation of the indexed attribute(s), and as such is prone to reporting false positives; that is, it may be reported that an element is in the set, when it is not. So index search results must always be rechecked using the actual attribute values from the heap entry. Larger signatures reduce the odds of a false positive and thus reduce the number of useless heap visits, but of course also make the index larger and hence slower to scan.
ru: Сигнатура — это неточное представление проиндексированных атрибутов, вследствие чего оно допускает ложные положительные срабатывания; то есть оно может показывать, что элемент содержится в множестве, хотя это не так. Поэтому результаты поиска по такому индексу должны всегда перепроверяться по фактическим значениям атрибутов записи в таблице. Чем больше размер сигнатуры, тем меньше вероятность ложного срабатывания и число напрасных обращений к таблице, но это, разумеется, влечёт увеличение индекса и замедление сканирования.

source: This type of index is most useful when a table has many attributes and queries test arbitrary combinations of them. A traditional btree index is faster than a bloom index, but it can require many btree indexes to support all possible queries where one needs only a single bloom index. Note however that bloom indexes only support equality queries, whereas btree indexes can also perform inequality and range searches.
ru: Этот тип индекса наиболее полезен, когда в таблице много атрибутов и в запросах проверяются их произвольные сочетания. Традиционный индекс-B-дерево быстрее индекса Блума, но для поддержки всевозможных запросов может потребоваться множество индексов типа B-дерево, при том что индекс Блума нужен всего один. Заметьте, однако, что индексы Блума поддерживают только проверки на равенство, тогда как индексы-B-деревья также полезны при проверке неравенств и поиске в диапазоне.

source: Parameters
ru: Параметры

source: A <literal>bloom</literal> index accepts the following parameters in its <literal>WITH</literal> clause:
ru: Индекс <literal>bloom</literal> принимает в своём предложении <literal>WITH</literal> следующие параметры:

source: Length of each signature (index entry) in bits. The default is <literal>80</literal> bits and maximum is <literal>4096</literal>.
ru: Длина каждой сигнатуры (элемента индекса) в битах. Значение по умолчанию — <literal>80</literal>, а максимальное значение — <literal>4096</literal>.

source: Number of bits generated for each index column. Each parameter's name refers to the number of the index column that it controls. The default is <literal>2</literal> bits and maximum is <literal>4095</literal>. Parameters for index columns not actually used are ignored.
ru: Число битов, генерируемых для каждого столбца индекса. В имени параметра отражается номер столбца индекса, для которого это число задаётся. Значение по умолчанию — <literal>2</literal> бита, а максимум — <literal>4095</literal>. Параметры для неиспользуемых столбцов индекса игнорируются.

source: Examples
ru: Примеры

source: This is an example of creating a bloom index:
ru: Пример создания индекса bloom:

source: The index is created with a signature length of 80 bits, with attributes i1 and i2 mapped to 2 bits, and attribute i3 mapped to 4 bits. We could have omitted the <literal>length</literal>, <literal>col1</literal>, and <literal>col2</literal> specifications since those have the default values.
ru: Эта команда создаёт индекс с длиной сигнатуры 80 бит, в которой атрибуты i1 и i2 отображаются в 2 бита, а атрибут i3 — в 4. Мы могли бы опустить указания <literal>length</literal>, <literal>col1</literal> и <literal>col2</literal>, так как в них задаются значения по умолчанию.

source: Here is a more complete example of bloom index definition and usage, as well as a comparison with equivalent btree indexes. The bloom index is considerably smaller than the btree index, and can perform better.
ru: Ниже представлен более полный пример определения и использования индекса Блума, а также приводится сравнение его с равнозначным индексом-B-деревом. Видно, что индекс Блума значительно меньше индекса-B-дерева, и при этом он может работать быстрее.

source: A sequential scan over this large table takes a long time: <placeholder-1/>
ru: Последовательное сканирование по этой большой таблице выполняется долго: <placeholder-1/>

source: So the planner will usually select an index scan if possible. With a btree index, we get results like this: <placeholder-1/>
ru: Поэтому планировщик обычно предпочтёт сканирование по индексу, если это возможно. Индекс-B-дерево даёт такие результаты: <placeholder-1/>

source: Bloom is better than btree in handling this type of search: <placeholder-1/> Note the relatively large number of false positives: 2439 rows were selected to be visited in the heap, but none actually matched the query. We could reduce that by specifying a larger signature length. In this example, creating the index with <literal>length=200</literal> reduced the number of false positives to 55; but it doubled the index size (to 306 MB) and ended up being slower for this query (125 ms overall).
ru: При таком поиске Блум оказывается лучше B-дерева: <placeholder-1/> Обратите внимание на относительно большое количество ложных срабатываний: для перепроверки по куче были отобраны 2439 строк, но на самом деле ни одна из них не удовлетворила запросу. Мы можем уменьшить это количество, создав сигнатуру большей длины. В данном примере при создании индекса с <literal>length=200</literal> число ложных срабатываний уменьшилось до 55, но размер индекса удвоился (до 306 Мбайт) и запрос стал выполняться дольше (125 мс).

source: Now, the main problem with the btree search is that btree is inefficient when the search conditions do not constrain the leading index column(s). A better strategy for btree is to create a separate index on each column. Then the planner will choose something like this: <placeholder-1/> Although this query runs much faster than with either of the single indexes, we pay a large penalty in index size. Each of the single-column btree indexes occupies 214 MB, so the total space needed is over 1.2GB, more than 8 times the space used by the bloom index.
ru: При таком подходе основная проблема поиска по B-дереву состоит в том, что B-дерево неэффективно, когда условия поиска не ограничивают ведущие столбцы индекса. Поэтому, применяя индексы типа B-дерево, лучше создавать отдельные индексы для каждого столбца. В этом случае планировщик построит примерно такой план: <placeholder-1/> Хотя этот запрос выполняется гораздо быстрее, чем с каким-либо одиночным индексом, мы платим за это увеличением размера индекса. Каждый индекс-B-дерево занимает 214 Мбайт, так что общий объём индексов превышает 1.2 Гбайта, что в 8 раз больше размера индекса Блума.

source: Operator Class Interface
ru: Интерфейс класса операторов

source: An operator class for bloom indexes requires only a hash function for the indexed data type and an equality operator for searching. This example shows the operator class definition for the <type>text</type> data type:
ru: Класс операторов для индексов Блума требует наличия только хеш-функции для индексируемого типа данных и оператора равенства для поиска. Этот пример демонстрирует соответствующее определение класса операторов для типа <type>text</type>:

source: Limitations
ru: Ограничения

source: Only operator classes for <type>int4</type> and <type>text</type> are included with the module.
ru: В этот модуль включены только классы операторов для <type>int4</type> и <type>text</type>.

source: Only the <literal>=</literal> operator is supported for search. But it is possible to add support for arrays with union and intersection operations in the future.
ru: При поиске поддерживается только оператор <literal>=</literal>. Но в будущем возможно добавление поддержки для массивов с операциями объединения и пересечения.

source: Authors
ru: Авторы

source: Teodor Sigaev <email>teodor@postgrespro.ru</email>, Postgres Professional, Moscow, Russia
ru: Фёдор Сигаев <email>teodor@postgrespro.ru</email>, Postgres Professional, Москва, Россия

source: Alexander Korotkov <email>a.korotkov@postgrespro.ru</email>, Postgres Professional, Moscow, Russia
ru: Александр Коротков <email>a.korotkov@postgrespro.ru</email>, Postgres Professional, Москва, Россия

source: Oleg Bartunov <email>obartunov@postgrespro.ru</email>, Postgres Professional, Moscow, Russia
ru: Олег Бартунов <email>obartunov@postgrespro.ru</email>, Postgres Professional, Москва, Россия
