Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/contrib.po
Languages: ru

source: Additional Supplied Modules
ru: Дополнительно поставляемые модули

source: This appendix and the next one contain information regarding the modules that can be found in the <literal>contrib</literal> directory of the <productname>PostgreSQL</productname> distribution. These include porting tools, analysis utilities, and plug-in features that are not part of the core PostgreSQL system, mainly because they address a limited audience or are too experimental to be part of the main source tree. This does not preclude their usefulness.
ru: В этом и следующем приложении содержится информация о модулях, которые можно найти в каталоге <literal>contrib</literal> дистрибутива <productname>PostgreSQL</productname>. В их число входят средства портирования, утилиты анализа и подключаемые функции, не включённые в состав основной системы PostgreSQL, в основном потому что они адресованы ограниченной аудитории или находятся в экспериментальном состоянии, неподходящем для основного дерева кода. Однако это всё не умаляет их полезность.

source: This appendix covers extensions and other server plug-in modules found in <literal>contrib</literal>. <xref linkend="contrib-prog"/> covers utility programs.
ru: В этом приложении описываются расширения и другие подключаемые серверные модули, включённые в <literal>contrib</literal>. В <xref remap="6" linkend="contrib-prog"/> описываются вспомогательные программы.

source: When building from the source distribution, these components are not built automatically, unless you build the "world" target (see <xref linkend="build"/>). You can build and install all of them by running: <screen> <userinput>make</userinput> <userinput>make install</userinput> </screen> in the <literal>contrib</literal> directory of a configured source tree; or to build and install just one selected module, do the same in that module's subdirectory. Many of the modules have regression tests, which can be executed by running: <screen> <userinput>make check</userinput> </screen> before installation or <screen> <userinput>make installcheck</userinput> </screen> once you have a <productname>PostgreSQL</productname> server running.
ru: При сборке сервера из дистрибутивного исходного кода эти компоненты собираются, только если выбрана цель "world" (см. <xref remap="4" linkend="build"/>). Вы можете собрать и установить их отдельно, выполнив: <screen> <userinput>make</userinput> <userinput>make install</userinput> </screen> в каталоге <literal>contrib</literal> в настроенном дереве исходного кода; либо собрать и установить только один выбранный модуль, проделав то же самое в его подкаталоге. Для многих модулей имеются регрессионные тесты, которые можно выполнить, запустив: <screen> <userinput>make check</userinput> </screen> перед установкой или <screen> <userinput>make installcheck</userinput> </screen>, когда сервер <productname>PostgreSQL</productname> будет работать.

source: If you are using a pre-packaged version of <productname>PostgreSQL</productname>, these modules are typically made available as a separate subpackage, such as <literal>postgresql-contrib</literal>.
ru: Если вы используете готовую собранную версию <productname>PostgreSQL</productname>, эти модули обычно поставляются в виде отдельного подпакета, например <literal>postgresql-contrib</literal>.

source: CREATE EXTENSION <replaceable>module_name</replaceable>;
ru: CREATE EXTENSION <replaceable>имя_модуля</replaceable>;

source: Many modules supply new user-defined functions, operators, or types. To make use of one of these modules, after you have installed the code you need to register the new SQL objects in the database system. In <productname>PostgreSQL</productname> 9.1 and later, this is done by executing a <xref linkend="sql-createextension"/> command. In a fresh database, you can simply do <placeholder-1/> This command must be run by a database superuser. This registers the new SQL objects in the current database only, so you need to run this command in each database that you want the module's facilities to be available in. Alternatively, run it in database <literal>template1</literal> so that the extension will be copied into subsequently-created databases by default.
ru: Многие модули предоставляют дополнительные пользовательские функции, операторы и типы. Чтобы использовать один из таких модулей, когда его исполняемый код установлен, вы должны зарегистрировать новые объекты SQL в СУБД. В <productname>PostgreSQL</productname> версии 9.1 и новее для этого нужно воспользоваться командой <xref linkend="sql-createextension"/>. В чистой базе данных вы можете просто выполнить: <placeholder-1/> Запускать эту команду должен суперпользователь баз данных. При этом новые объекты SQL будут зарегистрированы только в текущей базе данных, так что эту команду нужно выполнять в каждой базе данных, в которой вы хотите пользоваться функциональностью этого модуля. Вы также можете запустить её в <literal>template1</literal>, чтобы установленное расширение копировалось во все впоследствии создаваемые базы по умолчанию.

source: Many modules allow you to install their objects in a schema of your choice. To do that, add <literal>SCHEMA <replaceable>schema_name</replaceable></literal> to the <command>CREATE EXTENSION</command> command. By default, the objects will be placed in your current creation target schema, typically <literal>public</literal>.
ru: Многие модули позволяют устанавливать свои объекты в схему по выбору. Для этого нужно добавить <literal>SCHEMA <replaceable>имя_схемы</replaceable></literal> в команду <command>CREATE EXTENSION</command>. По умолчанию объекты устанавливаются в текущую схему для создаваемых объектов, обычно это <literal>public</literal>.

source: CREATE EXTENSION <replaceable>module_name</replaceable> FROM unpackaged;
ru: CREATE EXTENSION <replaceable>имя_модуля</replaceable> FROM unpackaged;

source: If your database was brought forward by dump and reload from a pre-9.1 version of <productname>PostgreSQL</productname>, and you had been using the pre-9.1 version of the module in it, you should instead do <placeholder-1/> This will update the pre-9.1 objects of the module into a proper <firstterm>extension</firstterm> object. Future updates to the module will be managed by <xref linkend="sql-alterextension"/>. For more information about extension updates, see <xref linkend="extend-extensions"/>.
ru: Если ваша база данных была получена в результате выгрузки/перезагрузки данных <productname>PostgreSQL</productname> версии до 9.1, и вы ранее использовали версию этого модуля, рассчитанную на версию до 9.1, вместо этого вы должны выполнить: <placeholder-1/> При этом объекты этого модуля версии до 9.1 будут упакованы в соответствующий объект <firstterm>расширения</firstterm>. После этого обновления расширения будут осуществляться командой <xref linkend="sql-alterextension"/>. За дополнительными сведениями об обновлении расширении обратитесь к <xref remap="3" linkend="extend-extensions"/>.

source: Note, however, that some of these modules are not <quote>extensions</quote> in this sense, but are loaded into the server in some other way, for instance by way of <xref linkend="guc-shared-preload-libraries"/>. See the documentation of each module for details.
ru: Однако некоторые из этих модулей не являются <quote>расширениями</quote> в этом смысле, а подключаются к серверу по-другому, например, через параметр конфигурации <xref linkend="guc-shared-preload-libraries"/>. Подробнее об этом говорится в документации каждого модуля.

source: Additional Supplied Programs
ru: Дополнительно поставляемые программы

source: This appendix and the previous one contain information regarding the modules that can be found in the <literal>contrib</literal> directory of the <productname>PostgreSQL</productname> distribution. See <xref linkend="contrib"/> for more information about the <literal>contrib</literal> section in general and server extensions and plug-ins found in <literal>contrib</literal> specifically.
ru: В этом и предыдущем приложении содержится информация о программах и модулях, которые можно найти в каталоге <literal>contrib</literal> дистрибутива исходного кода <productname>PostgreSQL</productname>. Обратитесь к <xref remap="3" linkend="contrib"/> за дополнительной информацией о секции <literal>contrib</literal> в целом и серверных расширениях и модулях внутри <literal>contrib</literal> в частности.

source: This appendix covers utility programs found in <literal>contrib</literal>. Once installed, either from source or a packaging system, they are found in the <filename>bin</filename> directory of the <productname>PostgreSQL</productname> installation and can be used like any other program.
ru: В этом приложении описываются вспомогательные программы, находящиеся в <literal>contrib</literal>. После установки из исходного кода или двоичного пакета их можно найти в подкаталоге <filename>bin</filename> инсталляции <productname>PostgreSQL</productname> и использовать как любую другую программу.

source: Client Applications
ru: Клиентские приложения

source: This section covers <productname>PostgreSQL</productname> client applications in <literal>contrib</literal>. They can be run from anywhere, independent of where the database server resides. See also <xref linkend="reference-client"/> for information about client applications that part of the core <productname>PostgreSQL</productname> distribution.
ru: В этом разделе рассматриваются клиентские приложения <productname>PostgreSQL</productname>, размещённые в <literal>contrib</literal>. Их можно запускать откуда угодно, независимо от того, где находится сервер баз данных. Обратитесь также к <xref remap="3" linkend="reference-client"/> за информацией о клиентских приложениях, относящихся к ядру дистрибутива <productname>PostgreSQL</productname>.

source: Server Applications
ru: Серверные приложения

source: This section covers <productname>PostgreSQL</productname> server-related applications in <literal>contrib</literal>. They are typically run on the host where the database server resides. See also <xref linkend="reference-server"/> for information about server applications that part of the core <productname>PostgreSQL</productname> distribution.
ru: В этом разделе рассматриваются приложения, связанные с функциональностью сервера <productname>PostgreSQL</productname> и размещённые в <literal>contrib</literal>. Они обычно запускаются в той же системе, где работает сервер баз данных. Обратитесь также к <xref remap="3" linkend="reference-server"/> за информацией о серверных приложениях, относящихся к ядру дистрибутива <productname>PostgreSQL</productname>.
