Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/dml.po
Languages: ru

source: Data Manipulation
ru: Модификация данных

source: The previous chapter discussed how to create tables and other structures to hold your data. Now it is time to fill the tables with data. This chapter covers how to insert, update, and delete table data. The chapter after this will finally explain how to extract your long-lost data from the database.
ru: В предыдущей главе мы обсуждали, как создавать таблицы и другие структуры для хранения данных. Теперь пришло время заполнить таблицы данными. В этой главе мы расскажем, как добавлять, изменять и удалять данные из таблиц. А из следующей главы вы наконец узнаете, как извлекать нужные вам данные из базы данных.

source: Inserting Data
ru: Добавление данных

source: <primary>inserting</primary>
ru: <primary>добавление</primary>

source: When a table is created, it contains no data. The first thing to do before a database can be of much use is to insert data. Data is conceptually inserted one row at a time. Of course you can also insert more than one row, but there is no way to insert less than one row. Even if you know only some column values, a complete row must be created.
ru: Сразу после создания таблицы она не содержит никаких данных. Поэтому, чтобы она была полезна, в неё прежде всего нужно добавить данные. По сути данные добавляются в таблицу по одной строке. И хотя вы конечно можете добавить в таблицу несколько строк, добавить в неё меньше, чем строку, невозможно. Даже если вы указываете значения только некоторых столбцов, создаётся полная строка.

source: To create a new row, use the <xref linkend="sql-insert"/> command. The command requires the table name and column values. For example, consider the products table from <xref linkend="ddl"/>: <placeholder-1/> An example command to insert a row would be: <placeholder-2/> The data values are listed in the order in which the columns appear in the table, separated by commas. Usually, the data values will be literals (constants), but scalar expressions are also allowed.
ru: Чтобы создать строку, вы будете использовать команду <xref linkend="sql-insert"/>. В этой команде необходимо указать имя таблицы и значения столбцов. Например, рассмотрим таблицу товаров из <xref remap="2" linkend="ddl"/>: <placeholder-1/> Добавить в неё строку можно было бы так: <placeholder-2/> Значения данных перечисляются в порядке столбцов в таблице и разделяются запятыми. Обычно в качестве значений указываются константы, но это могут быть и скалярные выражения.

source: The above syntax has the drawback that you need to know the order of the columns in the table. To avoid this you can also list the columns explicitly. For example, both of the following commands have the same effect as the one above: <placeholder-1/> Many users consider it good practice to always list the column names.
ru: Показанная выше запись имеет один недостаток &mdash; вам необходимо знать порядок столбцов в таблице. Чтобы избежать этого, можно перечислить столбцы явно. Например, следующие две команды дадут тот же результат, что и показанная выше: <placeholder-1/> Многие считают, что лучше всегда явно указывать имена столбцов.

source: If you don't have values for all the columns, you can omit some of them. In that case, the columns will be filled with their default values. For example: <placeholder-1/> The second form is a <productname>PostgreSQL</productname> extension. It fills the columns from the left with as many values as are given, and the rest will be defaulted.
ru: Если значения определяются не для всех столбцов, лишние столбцы можно опустить. В таком случае эти столбцы получат значения по умолчанию. Например: <placeholder-1/> Вторая форма является расширением <productname>PostgreSQL</productname>. Она заполняет столбцы слева по числу переданных значений, а все остальные столбцы принимают значения по умолчанию.

source: For clarity, you can also request default values explicitly, for individual columns or for the entire row: <placeholder-1/>
ru: Для ясности можно также явно указать значения по умолчанию для отдельных столбцов или всей строки: <placeholder-1/>

source: You can insert multiple rows in a single command: <placeholder-1/>
ru: Одна команда может вставить сразу несколько строк: <placeholder-1/>

source: It is also possible to insert the result of a query (which might be no rows, one row, or many rows): <placeholder-1/> This provides the full power of the SQL query mechanism (<xref linkend="queries"/>) for computing the rows to be inserted.
ru: Также возможно вставить результат запроса (который может не содержать строк либо содержать одну или несколько): <placeholder-1/> Это позволяет использовать все возможности механизма запросов SQL (см. <xref remap="4" linkend="queries"/>) для вычисления вставляемых строк.

source: When inserting a lot of data at the same time, considering using the <xref linkend="sql-copy"/> command. It is not as flexible as the <xref linkend="sql-insert"/> command, but is more efficient. Refer to <xref linkend="populate"/> for more information on improving bulk loading performance.
ru: Когда нужно добавить сразу множество строк, возможно будет лучше использовать команду <xref linkend="sql-copy"/>. Она не такая гибкая, как <xref linkend="sql-insert"/>, но гораздо эффективнее. Дополнительно об ускорении массовой загрузки данных можно узнать в <xref remap="6" linkend="populate"/>.

source: Updating Data
ru: Изменение данных

source: <primary>updating</primary>
ru: <primary>изменение</primary>

source: The modification of data that is already in the database is referred to as updating. You can update individual rows, all the rows in a table, or a subset of all rows. Each column can be updated separately; the other columns are not affected.
ru: Модификация данных, уже сохранённых в БД, называется изменением. Изменить можно все строки таблицы, либо подмножество всех строк, либо только избранные строки. Каждый столбец при этом можно изменять независимо от других.

source: The name of the table and column to update
ru: Имя таблицы и изменяемого столбца

source: The new value of the column
ru: Новое значение столбца

source: Which row(s) to update
ru: Критерий отбора изменяемых строк

source: To update existing rows, use the <xref linkend="sql-update"/> command. This requires three pieces of information: <placeholder-1/>
ru: Для изменения данных в существующих строках используется команда <xref linkend="sql-update"/>. Ей требуется следующая информация: <placeholder-1/>

source: Recall from <xref linkend="ddl"/> that SQL does not, in general, provide a unique identifier for rows. Therefore it is not always possible to directly specify which row to update. Instead, you specify which conditions a row must meet in order to be updated. Only if you have a primary key in the table (independent of whether you declared it or not) can you reliably address individual rows by choosing a condition that matches the primary key. Graphical database access tools rely on this fact to allow you to update rows individually.
ru: Если вы помните, в <xref remap="6" linkend="ddl"/> говорилось, что в SQL в принципе нет уникального идентификатора строк. Таким образом, не всегда возможно явно указать на строку, которую требуется изменить. Поэтому необходимо указать условия, каким должны соответствовать требуемая строка. Только если в таблице есть первичный ключ (вне зависимости от того, объявляли вы его или нет), можно однозначно адресовать отдельные строки, определив условие по первичному ключу. Этим пользуются графические инструменты для работы с базой данных, дающие возможность редактировать данные по строкам.

source: For example, this command updates all products that have a price of 5 to have a price of 10: <placeholder-1/> This might cause zero, one, or many rows to be updated. It is not an error to attempt an update that does not match any rows.
ru: Например, следующая команда увеличивает цену всех товаров, имевших до этого цену 5, до 10: <placeholder-1/> В результате может измениться ноль, одна или множество строк. И если этому запросу не будет удовлетворять ни одна строка, это не будет ошибкой.

source: Let's look at that command in detail. First is the key word <literal>UPDATE</literal> followed by the table name. As usual, the table name can be schema-qualified, otherwise it is looked up in the path. Next is the key word <literal>SET</literal> followed by the column name, an equal sign, and the new column value. The new column value can be any scalar expression, not just a constant. For example, if you want to raise the price of all products by 10% you could use: <placeholder-1/> As you see, the expression for the new value can refer to the existing value(s) in the row. We also left out the <literal>WHERE</literal> clause. If it is omitted, it means that all rows in the table are updated. If it is present, only those rows that match the <literal>WHERE</literal> condition are updated. Note that the equals sign in the <literal>SET</literal> clause is an assignment while the one in the <literal>WHERE</literal> clause is a comparison, but this does not create any ambiguity. Of course, the <literal>WHERE</literal> condition does not have to be an equality test. Many other operators are available (see <xref linkend="functions"/>). But the expression needs to evaluate to a Boolean result.
ru: Давайте рассмотрим эту команду подробнее. Она начинается с ключевого слова <literal>UPDATE</literal>, за которым идёт имя таблицы. Как обычно, имя таблицы может быть записано в полной форме, в противном случае она будет найдена по пути. Затем идёт ключевое слово <literal>SET</literal>, за которым следует имя столбца, знак равенства и новое значение столбца. Этим значением может быть любое скалярное выражение, а не только константа. Например, если вы захотите поднять цену всех товаров на 10%, это можно сделать так: <placeholder-1/> Как видно из этого примера, выражение нового значения может ссылаться на существующие значения столбцов в строке. Мы также опустили в нём предложение <literal>WHERE</literal>. Это означает, что будут изменены все строки в таблице. Если же это предложение присутствует, изменяются только строки, которые соответствуют условию <literal>WHERE</literal>. Заметьте, что хотя знак равенства в предложении <literal>SET</literal> обозначает операцию присваивания, а такой же знак в предложении <literal>WHERE</literal> используется для сравнения, это не приводит к неоднозначности. И конечно, в условии <literal>WHERE</literal> не обязательно должна быть проверка равенства, а могут применяться и другие операторы (см. <xref remap="4" linkend="functions"/>). Необходимо только, чтобы это выражение возвращало логический результат.

source: You can update more than one column in an <command>UPDATE</command> command by listing more than one assignment in the <literal>SET</literal> clause. For example: <placeholder-1/>
ru: В команде <command>UPDATE</command> можно изменить значения сразу нескольких столбцов, перечислив их в предложении <literal>SET</literal>. Например: <placeholder-1/>

source: Deleting Data
ru: Удаление данных

source: <primary>deleting</primary>
ru: <primary>удаление</primary>

source: So far we have explained how to add data to tables and how to change data. What remains is to discuss how to remove data that is no longer needed. Just as adding data is only possible in whole rows, you can only remove entire rows from a table. In the previous section we explained that SQL does not provide a way to directly address individual rows. Therefore, removing rows can only be done by specifying conditions that the rows to be removed have to match. If you have a primary key in the table then you can specify the exact row. But you can also remove groups of rows matching a condition, or you can remove all rows in the table at once.
ru: Мы рассказали о том, как добавлять данные в таблицы и как изменять их. Теперь вам осталось узнать, как удалить данные, которые оказались не нужны. Так же, как добавлять данные можно только целыми строками, удалять их можно только по строкам. В предыдущем разделе мы отметили, что в SQL нет возможности напрямую адресовать отдельные строки, так что удалить избранные строки можно, только сформулировав для них подходящие условия. Но если в таблице есть первичный ключ, с его помощью можно однозначно выделить определённую строку. При этом можно так же удалить группы строк, соответствующие условию, либо сразу все строки таблицы.

source: You use the <xref linkend="sql-delete"/> command to remove rows; the syntax is very similar to the <command>UPDATE</command> command. For instance, to remove all rows from the products table that have a price of 10, use: <placeholder-1/>
ru: Для удаления строк используется команда <xref linkend="sql-delete"/>; её синтаксис очень похож на синтаксис команды <command>UPDATE</command>. Например, удалить все строки из таблицы с товарами, имеющими цену 10, можно так: <placeholder-1/>

source: If you simply write: <placeholder-1/> then all rows in the table will be deleted! Caveat programmer.
ru: Если вы напишете просто: <placeholder-1/> будут удалены все строки таблицы! Будьте осторожны!

source: Returning Data From Modified Rows
ru: Возврат данных из изменённых строк

source: Sometimes it is useful to obtain data from modified rows while they are being manipulated. The <command>INSERT</command>, <command>UPDATE</command>, and <command>DELETE</command> commands all have an optional <literal>RETURNING</literal> clause that supports this. Use of <literal>RETURNING</literal> avoids performing an extra database query to collect the data, and is especially valuable when it would otherwise be difficult to identify the modified rows reliably.
ru: Иногда бывает полезно получать данные из модифицируемых строк в процессе их обработки. Это возможно с использованием предложения <literal>RETURNING</literal>, которое можно задать для команд <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command>. Применение <literal>RETURNING</literal> позволяет обойтись без дополнительного запроса к базе для сбора данных и это особенно ценно, когда как-то иначе трудно получить изменённые строки надёжным образом.

source: The allowed contents of a <literal>RETURNING</literal> clause are the same as a <command>SELECT</command> command's output list (see <xref linkend="queries-select-lists"/>). It can contain column names of the command's target table, or value expressions using those columns. A common shorthand is <literal>RETURNING *</literal>, which selects all columns of the target table in order.
ru: В предложении <literal>RETURNING</literal> допускается то же содержимое, что и в выходном списке команды <command>SELECT</command> (см. <xref remap="4" linkend="queries-select-lists"/>). Оно может содержать имена столбцов целевой таблицы команды или значения выражений с этими столбцами. Также часто применяется краткая запись <literal>RETURNING *</literal>, выбирающая все столбцы целевой таблицы по порядку.

source: In an <command>INSERT</command>, the data available to <literal>RETURNING</literal> is the row as it was inserted. This is not so useful in trivial inserts, since it would just repeat the data provided by the client. But it can be very handy when relying on computed default values. For example, when using a <link linkend="datatype-serial"><type>serial</type></link> column to provide unique identifiers, <literal>RETURNING</literal> can return the ID assigned to a new row: <placeholder-1/> The <literal>RETURNING</literal> clause is also very useful with <literal>INSERT ... SELECT</literal>.
ru: В команде <command>INSERT</command> данные, выдаваемые в <literal>RETURNING</literal>, образуются из строки в том виде, в каком она была вставлена. Это не очень полезно при простом добавлении, так как в результате будут получены те же данные, что были переданы клиентом. Но это может быть очень удобно при использовании вычисляемых значений по умолчанию. Например, если в таблице есть столбец <link linkend="datatype-serial"><type>serial</type></link>, в котором генерируются уникальные идентификаторы, команда <literal>RETURNING</literal> может возвратить идентификатор, назначенный новой строке: <placeholder-1/> Предложение <literal>RETURNING</literal> также очень полезно с <literal>INSERT ... SELECT</literal>.

source: In an <command>UPDATE</command>, the data available to <literal>RETURNING</literal> is the new content of the modified row. For example: <placeholder-1/>
ru: В команде <command>UPDATE</command> данные, выдаваемые в <literal>RETURNING</literal>, образуются новым содержимым изменённой строки. Например: <placeholder-1/>

source: In a <command>DELETE</command>, the data available to <literal>RETURNING</literal> is the content of the deleted row. For example: <placeholder-1/>
ru: В команде <command>DELETE</command> данные, выдаваемые в <literal>RETURNING</literal>, образуются содержимым удалённой строки. Например: <placeholder-1/>

source: If there are triggers (<xref linkend="triggers"/>) on the target table, the data available to <literal>RETURNING</literal> is the row as modified by the triggers. Thus, inspecting columns computed by triggers is another common use-case for <literal>RETURNING</literal>.
ru: Если для целевой таблицы заданы триггеры (см. <xref remap="4" linkend="triggers"/>), в <literal>RETURNING</literal> выдаются данные из строки, изменённой триггерами. Таким образом, <literal>RETURNING</literal> часто применяется и для того, чтобы проверить содержимое столбцов, изменяемых триггерами.

source: This chapter is still quite incomplete.
ru: Эта глава всё ещё недостаточно полная.
