Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: If you understand these technical limitations of the <command>ecpg</command> preprocessor in C++, you might come to the conclusion that linking C objects and C++ objects at the link stage to enable C++ applications to use ECPG features could be better than writing some embedded SQL commands in C++ code directly. This section describes a way to separate some embedded SQL commands from C++ application code with a simple example. In this example, the application is implemented in C++, while C and ECPG is used to connect to the PostgreSQL server.
ru: Если вы поняли технические ограничения препроцессора <command>ecpg</command> с C++, вы можете прийти к заключению, что для использования ECPG в приложениях на C++ лучше связывать код C с кодом C++ на стадии компоновки, а не внедрять команды SQL непосредственно в код на C++. В данном разделе показывается, как отделить встраиваемые команды SQL от кода приложения на C++, на простом примере. В этом примере приложение реализуется на C++, а взаимодействие с сервером PostgreSQL построено на C и ECPG.

source: A sub-routine module to execute SQL commands embedded in C. It is going to be converted into <filename>test_mod.c</filename> by the preprocessor. <placeholder-1/>
ru: Модуль подпрограмм будет выполнять SQL-команды, встроенные в C. Этот код нужно будет преобразовать в <filename>test_mod.c</filename> с помощью препроцессора. <placeholder-1/>

source: A header file with declarations of the functions in the C module (<filename>test_mod.pgc</filename>). It is included by <filename>test_cpp.cpp</filename>. This file has to have an <literal>extern "C"</literal> block around the declarations, because it will be linked from the C++ module. <placeholder-1/>
ru: Заголовочный файл с объявлениями функций в модуле на языке C (<filename>test_mod.pgc</filename>). Он включается в <filename>test_cpp.cpp</filename>. Объявления в этом файле должны заключаться в блок <literal>extern "C"</literal>, так как он будет связываться с модулем C++. <placeholder-1/>

source: The main code for the application, including the <function>main</function> routine, and in this example a C++ class. <placeholder-1/>
ru: Основной код приложения, содержащий функцию <function>main</function>, а также, в данном примере, класс C++. <placeholder-1/>

source: Three kinds of files have to be created: a C file (<filename>*.pgc</filename>), a header file, and a C++ file: <placeholder-1/>
ru: Для сборки нужно создать три типа файлов: файл на C (<filename>*.pgc</filename>), заголовочный файл и файл на C++: <placeholder-1/>

source: To build the application, proceed as follows. Convert <filename>test_mod.pgc</filename> into <filename>test_mod.c</filename> by running <command>ecpg</command>, and generate <filename>test_mod.o</filename> by compiling <filename>test_mod.c</filename> with the C compiler: <placeholder-1/>
ru: Для сборки приложения проделайте следующее. Преобразуйте <filename>test_mod.pgc</filename> в <filename>test_mod.c</filename> с помощью <command>ecpg</command>, а затем получите <filename>test_mod.o</filename>, скомпилировав <filename>test_mod.c</filename> компилятором C: <placeholder-1/>

source: Next, generate <filename>test_cpp.o</filename> by compiling <filename>test_cpp.cpp</filename> with the C++ compiler: <placeholder-1/>
ru: После этого получите <filename>test_cpp.o</filename>, скомпилировав <filename>test_cpp.cpp</filename> компилятором C++: <placeholder-1/>

source: Finally, link these object files, <filename>test_cpp.o</filename> and <filename>test_mod.o</filename>, into one executable, using the C++ compiler driver: <placeholder-1/>
ru: Наконец, свяжите полученные объектные файлы, <filename>test_cpp.o</filename> и <filename>test_mod.o</filename>, в один исполняемый файл, выполнив компоновку под управлением компилятора C++: <placeholder-1/>

source: Embedded SQL Commands
ru: Команды встраиваемого SQL

source: This section describes all SQL commands that are specific to embedded SQL. Also refer to the SQL commands listed in <xref linkend="sql-commands"/>, which can also be used in embedded SQL, unless stated otherwise.
ru: В этом разделе описаны все команды, предназначенные специально для встраиваемого SQL. В <xref remap="6" linkend="sql-commands"/> также описаны обычные команды SQL, которые можно использовать и как встраиваемые, если явно не отмечено обратное.

source: allocate an SQL descriptor area
ru: выделить область SQL-дескриптора

source: Description
ru: Описание

source: <command>ALLOCATE DESCRIPTOR</command> allocates a new named SQL descriptor area, which can be used to exchange data between the PostgreSQL server and the host program.
ru: <command>ALLOCATE DESCRIPTOR</command> выделяет новую именованную область SQL-дескриптора, через которую можно обмениваться данными между сервером PostgreSQL и программой на C.

source: Descriptor areas should be freed after use using the <command>DEALLOCATE DESCRIPTOR</command> command.
ru: После использования области дескрипторов должны освобождаться командой <command>DEALLOCATE DESCRIPTOR</command>.

source: Parameters
ru: Параметры

source: A name of SQL descriptor, case sensitive. This can be an SQL identifier or a host variable.
ru: Имя SQL-дескриптора, задаётся с учётом регистра. Это может быть идентификатор SQL или переменная среды.

source: Examples
ru: Примеры

source: Compatibility
ru: Совместимость

source: <command>ALLOCATE DESCRIPTOR</command> is specified in the SQL standard.
ru: Команда <command>ALLOCATE DESCRIPTOR</command> описана в стандарте SQL.

source: See Also
ru: См. также

source: establish a database connection
ru: установить подключение к базе данных

source: connection_target
ru: цель_подключения

source: connection_name
ru: имя_подключения

source: connection_user
ru: пользователь_подключения

source: The <command>CONNECT</command> command establishes a connection between the client and the PostgreSQL server.
ru: Команда <command>CONNECT</command> устанавливает подключение клиента к серверу PostgreSQL.

source: [ <replaceable>database_name</replaceable> ] [ <literal>@</literal><replaceable>host</replaceable> ] [ <literal>:</literal><replaceable>port</replaceable> ]
ru: [ <replaceable>имя_бд</replaceable> ] [ <literal>@</literal><replaceable>сервер</replaceable> ] [ <literal>:</literal><replaceable>порт</replaceable> ]

source: Connect over TCP/IP
ru: Подключение по TCP/IP

source: <literal>unix:postgresql://</literal><replaceable>host</replaceable> [ <literal>:</literal><replaceable>port</replaceable> ] <literal>/</literal> [ <replaceable>database_name</replaceable> ] [ <literal>?</literal><replaceable>connection_option</replaceable> ]
ru: <literal>unix:postgresql://</literal><replaceable>сервер</replaceable> [ <literal>:</literal><replaceable>порт</replaceable> ] <literal>/</literal> [ <replaceable>имя_бд</replaceable> ] [ <literal>?</literal><replaceable>параметр_подключения</replaceable> ]

source: Connect over Unix-domain sockets
ru: Подключение через доменные сокеты Unix

source: <literal>tcp:postgresql://</literal><replaceable>host</replaceable> [ <literal>:</literal><replaceable>port</replaceable> ] <literal>/</literal> [ <replaceable>database_name</replaceable> ] [ <literal>?</literal><replaceable>connection_option</replaceable> ]
ru: <literal>tcp:postgresql://</literal><replaceable>сервер</replaceable> [ <literal>:</literal><replaceable>порт</replaceable> ] <literal>/</literal> [ <replaceable>имя_бд</replaceable> ] [ <literal>?</literal><replaceable>параметр_подключения</replaceable> ]

source: SQL string constant
ru: Строковая константа SQL

source: containing a value in one of the above forms
ru: содержащая значение в одной из показанных выше форм

source: host variable
ru: переменная среды

source: host variable of type <type>char[]</type> or <type>VARCHAR[]</type> containing a value in one of the above forms
ru: переменная среды типа <type>char[]</type> или <type>VARCHAR[]</type>, содержащая значение в одной из показанных выше форм

source: <replaceable class="parameter">connection_target</replaceable> specifies the target server of the connection on one of several forms. <placeholder-1/>
ru: <replaceable class="parameter">цель_соединения</replaceable> задаёт целевой сервер и базу для подключения в одной из нескольких форм. <placeholder-1/>

source: connection_object
ru: объект_соединения

source: An optional identifier for the connection, so that it can be referred to in other commands. This can be an SQL identifier or a host variable.
ru: Необязательный идентификатор подключения, позволяющий обращаться к этому подключению в других командах. Это может быть идентификатор SQL или переменная среды.

source: The user name for the database connection.
ru: Имя пользователя для подключения к базе данных.

source: This parameter can also specify user name and password, using one the forms <literal><replaceable>user_name</replaceable>/<replaceable>password</replaceable></literal>, <literal><replaceable>user_name</replaceable> IDENTIFIED BY <replaceable>password</replaceable></literal>, or <literal><replaceable>user_name</replaceable> USING <replaceable>password</replaceable></literal>.
ru: В этом параметре также можно передать имя и пароль одним из следующих способов: <literal><replaceable>имя_пользователя</replaceable>/<replaceable>пароль</replaceable></literal>, <literal><replaceable>имя_пользователя</replaceable> IDENTIFIED BY <replaceable>пароль</replaceable></literal> или <literal><replaceable>имя_пользователя</replaceable> USING <replaceable>пароль</replaceable></literal>.

source: User name and password can be SQL identifiers, string constants, or host variables.
ru: В качестве имени пользователя и пароля можно задать идентификаторы SQL, строковые константы или переменные среды.

source: Use all default connection parameters, as defined by libpq.
ru: Использовать все параметры подключения по умолчанию, которые определены библиотекой libpq.

source: Here a several variants for specifying connection parameters: <placeholder-1/>
ru: Несколько вариантов указания параметров подключения: <placeholder-1/>

source: int main(void) { EXEC SQL BEGIN DECLARE SECTION; char *dbname = "testdb"; /* database name */ char *user = "testuser"; /* connection user name */ char *connection = "tcp:postgresql://localhost:5432/testdb"; /* connection string */ char ver[256]; /* buffer to store the version string */ EXEC SQL END DECLARE SECTION; ECPGdebug(1, stderr); EXEC SQL CONNECT TO :dbname USER :user; EXEC SQL SELECT version() INTO :ver; EXEC SQL DISCONNECT; printf("version: %s\n", ver); EXEC SQL CONNECT TO :connection USER :user; EXEC SQL SELECT version() INTO :ver; EXEC SQL DISCONNECT; printf("version: %s\n", ver); return 0; }
ru: int main(void) { EXEC SQL BEGIN DECLARE SECTION; char *dbname = "testdb"; /* имя базы данных */ char *user = "testuser"; /* имя пользователя подключения */ char *connection = "tcp:postgresql://localhost:5432/testdb"; /* строка подключения */ char ver[256]; /* буфер для хранения строки версии */ EXEC SQL END DECLARE SECTION; ECPGdebug(1, stderr); EXEC SQL CONNECT TO :dbname USER :user; EXEC SQL SELECT version() INTO :ver; EXEC SQL DISCONNECT; printf("version: %s\n", ver); EXEC SQL CONNECT TO :connection USER :user; EXEC SQL SELECT version() INTO :ver; EXEC SQL DISCONNECT; printf("version: %s\n", ver); return 0; }

source: Here is an example program that illustrates the use of host variables to specify connection parameters: <placeholder-1/>
ru: Следующий пример программы демонстрирует применение переменных среды для определения параметров подключения: <placeholder-1/>

source: <command>CONNECT</command> is specified in the SQL standard, but the format of the connection parameters is implementation-specific.
ru: Команда <command>CONNECT</command> описана в стандарте SQL, но формат параметров подключения определяется реализацией.

source: deallocate an SQL descriptor area
ru: освободить область SQL-дескриптора

source: <command>DEALLOCATE DESCRIPTOR</command> deallocates a named SQL descriptor area.
ru: <command>DEALLOCATE DESCRIPTOR</command> освобождает область именованного SQL-дескриптора.

source: The name of the descriptor which is going to be deallocated. It is case sensitive. This can be an SQL identifier or a host variable.
ru: Имя дескриптора, подлежащего освобождению, задаётся с учётом регистра. Это может быть идентификатор SQL или переменная среды.

source: <command>DEALLOCATE DESCRIPTOR</command> is specified in the SQL standard.
ru: Команда <command>DEALLOCATE DESCRIPTOR</command> описана в стандарте SQL.

source: define a cursor
ru: определить курсор

source: cursor_name
ru: имя_курсора

source: prepared_name
ru: подготовленный_оператор

source: query
ru: запрос

source: <command>DECLARE</command> declares a cursor for iterating over the result set of a prepared statement. This command has slightly different semantics from the direct SQL command <command>DECLARE</command>: Whereas the latter executes a query and prepares the result set for retrieval, this embedded SQL command merely declares a name as a <quote>loop variable</quote> for iterating over the result set of a query; the actual execution happens when the cursor is opened with the <command>OPEN</command> command.
ru: <command>DECLARE</command> объявляет курсор для прохода по набору результатов подготовленного оператора. Эта команда несколько отличается от обычной SQL-команды <command>DECLARE</command>: тогда как последняя выполняет запрос и подготавливает набор результатов для получения, встраиваемая SQL-команда просто объявляет имя в качестве <quote>переменной цикла</quote> для прохода по набору результатов запроса; фактически запрос выполнится, когда курсор будет открыт командой <command>OPEN</command>.

source: A cursor name, case sensitive. This can be an SQL identifier or a host variable.
ru: Имя курсора, задаётся с учётом регистра. Это может быть идентификатор SQL или переменная среды.

source: The name of a prepared query, either as an SQL identifier or a host variable.
ru: Имя подготовленного запроса, задаваемое SQL-идентификатором или переменной среды.

source: A <xref linkend="sql-select"/> or <xref linkend="sql-values"/> command which will provide the rows to be returned by the cursor.
ru: Команда <xref linkend="sql-select"/> или <xref linkend="sql-values"/>, выдающая строки, которые будут получены через курсор.

source: For the meaning of the cursor options, see <xref linkend="sql-declare"/>.
ru: Параметры курсора рассматриваются в описании <xref linkend="sql-declare"/>.

source: Examples declaring a cursor for a query: <placeholder-1/>
ru: Примеры объявления курсора для запроса: <placeholder-1/>

source: An example declaring a cursor for a prepared statement: <placeholder-1/>
ru: Пример объявления курсора для подготовленного оператора: <placeholder-1/>

source: <command>DECLARE</command> is specified in the SQL standard.
ru: Команда <command>DECLARE</command> описана в стандарте SQL.

source: obtain information about a prepared statement or result set
ru: получить информацию о подготовленном операторе или наборе результатов

source: descriptor_name
ru: имя_дескриптора

source: sqlda_name
ru: имя_sqlda

source: <command>DESCRIBE</command> retrieves metadata information about the result columns contained in a prepared statement, without actually fetching a row.
ru: <command>DESCRIBE</command> получает метаданные о результирующих столбцах, содержащихся в подготовленном операторе, не считывая собственно строки результата.

source: The name of a prepared statement. This can be an SQL identifier or a host variable.
ru: Имя подготовленного оператора. Это может быть идентификатор SQL или переменная среды.

source: A descriptor name. It is case sensitive. It can be an SQL identifier or a host variable.
ru: Имя дескриптора, задаётся с учётом регистра. Это может быть идентификатор SQL или переменная среды.

source: The name of an SQLDA variable.
ru: Имя переменной SQLDA.

source: <command>DESCRIBE</command> is specified in the SQL standard.
ru: Команда <command>DESCRIBE</command> описана в стандарте SQL.

source: terminate a database connection
ru: закрыть подключение к базе данных

source: <command>DISCONNECT</command> closes a connection (or all connections) to the database.
ru: <command>DISCONNECT</command> закрывает подключение (или все подключения) к базе данных.

source: A database connection name established by the <command>CONNECT</command> command.
ru: Имя подключения к базе данных устанавливается командой <command>CONNECT</command>.

source: Close the <quote>current</quote> connection, which is either the most recently opened connection, or the connection set by the <command>SET CONNECTION</command> command. This is also the default if no argument is given to the <command>DISCONNECT</command> command.
ru: Закрывает <quote>текущее</quote> подключение, то есть подключение, открытое последним, либо установленное командой <command>SET CONNECTION</command>. Текущее подключение подразумевается по умолчанию, если <command>DISCONNECT</command> выполняется без аргументов.

source: Close the default connection.
ru: Закрывает подключение по умолчанию.

source: Close all open connections.
ru: Закрывает все открытые подключения.

source: int main(void) { EXEC SQL CONNECT TO testdb AS DEFAULT USER testuser; EXEC SQL CONNECT TO testdb AS con1 USER testuser; EXEC SQL CONNECT TO testdb AS con2 USER testuser; EXEC SQL CONNECT TO testdb AS con3 USER testuser; EXEC SQL DISCONNECT CURRENT; /* close con3 */ EXEC SQL DISCONNECT DEFAULT; /* close DEFAULT */ EXEC SQL DISCONNECT ALL; /* close con2 and con1 */ return 0; }
ru: int main(void) { EXEC SQL CONNECT TO testdb AS DEFAULT USER testuser; EXEC SQL CONNECT TO testdb AS con1 USER testuser; EXEC SQL CONNECT TO testdb AS con2 USER testuser; EXEC SQL CONNECT TO testdb AS con3 USER testuser; EXEC SQL DISCONNECT CURRENT; /* закрывает con3 */ EXEC SQL DISCONNECT DEFAULT; /* закрывает DEFAULT */ EXEC SQL DISCONNECT ALL; /* закрывает con2 и con1 */ return 0; }

source: <command>DISCONNECT</command> is specified in the SQL standard.
ru: Команда <command>DISCONNECT</command> описана в стандарте SQL.

source: dynamically prepare and execute a statement
ru: динамически подготовить и выполнить оператор

source: string
ru: строка

source: <command>EXECUTE IMMEDIATE</command> immediately prepares and executes a dynamically specified SQL statement, without retrieving result rows.
ru: <command>EXECUTE IMMEDIATE</command> немедленно подготавливает и выполняет динамически задаваемый оператор SQL, не получая при этом строки результата.

source: A literal C string or a host variable containing the SQL statement to be executed.
ru: Строковая константа C или переменная среды, содержащая SQL-оператор, который нужно выполнить.

source: Here is an example that executes an <command>INSERT</command> statement using <command>EXECUTE IMMEDIATE</command> and a host variable named <varname>command</varname>: <placeholder-1/>
ru: Пример выполнения оператора <command>INSERT</command> с применением команды <command>EXECUTE IMMEDIATE</command> и переменной среды <varname>command</varname>: <placeholder-1/>

source: <command>EXECUTE IMMEDIATE</command> is specified in the SQL standard.
ru: Команда <command>EXECUTE IMMEDIATE</command> описана в стандарте SQL.

source: get information from an SQL descriptor area
ru: получить информацию из области дескриптора SQL

source: descriptor_header_item
ru: элемент_заголовка_дескриптора

source: column_number
ru: номер_столбца

source: descriptor_item
ru: элемент_дескриптора

source: <command>GET DESCRIPTOR</command> retrieves information about a query result set from an SQL descriptor area and stores it into host variables. A descriptor area is typically populated using <command>FETCH</command> or <command>SELECT</command> before using this command to transfer the information into host language variables.
ru: <command>GET DESCRIPTOR</command> получает информацию о наборе результатов запроса из области дескриптора SQL и сохраняет её в переменные среды. Область дескриптора обычно предварительно заполняется командами <command>FETCH</command> или <command>SELECT</command>, чтобы из неё можно было перенести сопутствующую информацию в переменные среды.

source: This command has two forms: The first form retrieves descriptor <quote>header</quote> items, which apply to the result set in its entirety. One example is the row count. The second form, which requires the column number as additional parameter, retrieves information about a particular column. Examples are the column name and the actual column value.
ru: Эта команда имеет две формы: первая форма выдаёт элементы из <quote>заголовка</quote> дескриптора, который относится ко всему набору результатов в целом. Например, это число строк. Другая форма, требующая указания в дополнительном параметре номера столбца, выдаёт информацию о конкретном столбце строки. В качестве примеров можно привести имя столбца и фактическое значение в этом столбце.

source: A descriptor name.
ru: Имя дескриптора.

source: A token identifying which header information item to retrieve. Only <literal>COUNT</literal>, to get the number of columns in the result set, is currently supported.
ru: Идентификатор, определяющий, какой элемент заголовка нужно получить. В настоящее время поддерживается только <literal>COUNT</literal>, позволяющий получить число столбцов в наборе результатов.

source: The number of the column about which information is to be retrieved. The count starts at 1.
ru: Номер столбца, информацию о котором нужно получить. Нумерация начинается с 1.

source: A token identifying which item of information about a column to retrieve. See <xref linkend="ecpg-named-descriptors"/> for a list of supported items.
ru: Идентификатор, определяющий, какой элемент информации о столбце нужно получить. Список поддерживаемых элементов приведён в <xref remap="6" linkend="ecpg-named-descriptors"/>.

source: A host variable that will receive the data retrieved from the descriptor area.
ru: Переменная среды, в которую будут сохранены данные, полученные из области дескриптора.

source: An example to retrieve the number of columns in a result set: <placeholder-1/>
ru: Пример получения числа столбцов в наборе результатов: <placeholder-1/>

source: An example to retrieve a data length in the first column: <placeholder-1/>
ru: Пример получения размера данных в первом столбце: <placeholder-1/>

source: An example to retrieve the data body of the second column as a string: <placeholder-1/>
ru: Пример получения содержимого данных второго столбца в виде строки: <placeholder-1/>
