Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: int main(void) { EXEC SQL BEGIN DECLARE SECTION; int d_count; char d_data[1024]; int d_returned_octet_length; EXEC SQL END DECLARE SECTION; EXEC SQL CONNECT TO testdb AS con1 USER testuser; EXEC SQL ALLOCATE DESCRIPTOR d; /* Declare, open a cursor, and assign a descriptor to the cursor */ EXEC SQL DECLARE cur CURSOR FOR SELECT current_database(); EXEC SQL OPEN cur; EXEC SQL FETCH NEXT FROM cur INTO SQL DESCRIPTOR d; /* Get a number of total columns */ EXEC SQL GET DESCRIPTOR d :d_count = COUNT; printf("d_count = %d\n", d_count); /* Get length of a returned column */ EXEC SQL GET DESCRIPTOR d VALUE 1 :d_returned_octet_length = RETURNED_OCTET_LENGTH; printf("d_returned_octet_length = %d\n", d_returned_octet_length); /* Fetch the returned column as a string */ EXEC SQL GET DESCRIPTOR d VALUE 1 :d_data = DATA; printf("d_data = %s\n", d_data); /* Closing */ EXEC SQL CLOSE cur; EXEC SQL COMMIT; EXEC SQL DEALLOCATE DESCRIPTOR d; EXEC SQL DISCONNECT ALL; return 0; }
ru: int main(void) { EXEC SQL BEGIN DECLARE SECTION; int d_count; char d_data[1024]; int d_returned_octet_length; EXEC SQL END DECLARE SECTION; EXEC SQL CONNECT TO testdb AS con1 USER testuser; EXEC SQL ALLOCATE DESCRIPTOR d; /* Объявить, открыть курсор и присвоить ему дескриптор */ EXEC SQL DECLARE cur CURSOR FOR SELECT current_database(); EXEC SQL OPEN cur; EXEC SQL FETCH NEXT FROM cur INTO SQL DESCRIPTOR d; /* Получить общее число столбцов */ EXEC SQL GET DESCRIPTOR d :d_count = COUNT; printf("d_count = %d\n", d_count); /* Получить размер возвращённого столбца */ EXEC SQL GET DESCRIPTOR d VALUE 1 :d_returned_octet_length = RETURNED_OCTET_LENGTH; printf("d_returned_octet_length = %d\n", d_returned_octet_length); /* Выбрать возвращённый столбец в виде строки */ EXEC SQL GET DESCRIPTOR d VALUE 1 :d_data = DATA; printf("d_data = %s\n", d_data); /* Закрытие */ EXEC SQL CLOSE cur; EXEC SQL COMMIT; EXEC SQL DEALLOCATE DESCRIPTOR d; EXEC SQL DISCONNECT ALL; return 0; }

source: Here is an example for a whole procedure of executing <literal>SELECT current_database();</literal> and showing the number of columns, the column data length, and the column data: <placeholder-1/> When the example is executed, the result will look like this: <screen> d_count = 1 d_returned_octet_length = 6 d_data = testdb </screen>
ru: Следующий пример демонстрирует всю процедуру выполнения <literal>SELECT current_database();</literal> и вывода числа столбцов, длины данных в столбце и содержимого столбца: <placeholder-1/> При выполнении этого примера будет получен такой результат: <screen> d_count = 1 d_returned_octet_length = 6 d_data = testdb </screen>

source: <command>GET DESCRIPTOR</command> is specified in the SQL standard.
ru: Команда <command>GET DESCRIPTOR</command> описана в стандарте SQL.

source: open a dynamic cursor
ru: открыть динамический курсор

source: value
ru: значение

source: <command>OPEN</command> opens a cursor and optionally binds actual values to the placeholders in the cursor's declaration. The cursor must previously have been declared with the <command>DECLARE</command> command. The execution of <command>OPEN</command> causes the query to start executing on the server.
ru: <command>OPEN</command> открывает курсор и в дополнение может связывать фактические значения с местозаполнителями в объявлении курсора. Курсор должен быть предварительно объявлен командой <command>DECLARE</command>. Команда <command>OPEN</command> запускает выполнение запроса на сервере.

source: The name of the cursor to be opened. This can be an SQL identifier or a host variable.
ru: Имя открываемого курсора. Этот может быть идентификатор SQL или переменная среды.

source: A value to be bound to a placeholder in the cursor. This can be an SQL constant, a host variable, or a host variable with indicator.
ru: Значение, связываемое с местозаполнителем в курсоре. Это может быть константа SQL, переменная среды или переменная среды с индикатором.

source: The name of a descriptor containing values to be bound to the placeholders in the cursor. This can be an SQL identifier or a host variable.
ru: Имя дескриптора, содержащего значения, которые должны быть связаны с местозаполнителями в курсоре. Это может быть идентификатор SQL или переменная среды.

source: <command>OPEN</command> is specified in the SQL standard.
ru: Команда <command>OPEN</command> описана в стандарте SQL.

source: prepare a statement for execution
ru: подготовить оператор к выполнению

source: <command>PREPARE</command> prepares a statement dynamically specified as a string for execution. This is different from the direct SQL statement <xref linkend="sql-prepare"/>, which can also be used in embedded programs. The <xref linkend="sql-execute"/> command is used to execute either kind of prepared statement.
ru: Команда <command>PREPARE</command> подготавливает к выполнению динамический оператор, задаваемый в виде строки. Она отличается от обычного SQL-оператора <xref linkend="sql-prepare"/>, который также можно использовать во встраиваемых командах. Для обоих типов подготовленных операторов применяется команда <xref linkend="sql-execute"/>.

source: An identifier for the prepared query.
ru: Идентификатор для подготовленного запроса.

source: A literal C string or a host variable containing a preparable statement, one of the SELECT, INSERT, UPDATE, or DELETE.
ru: Строковая константа C или переменная среды, содержащая подготавливаемый оператор: SELECT, INSERT, UPDATE или DELETE.

source: <command>PREPARE</command> is specified in the SQL standard.
ru: Команда <command>PREPARE</command> описана в стандарте SQL.

source: set the autocommit behavior of the current session
ru: установить режим автофиксации для текущего сеанса

source: <command>SET AUTOCOMMIT</command> sets the autocommit behavior of the current database session. By default, embedded SQL programs are <emphasis>not</emphasis> in autocommit mode, so <command>COMMIT</command> needs to be issued explicitly when desired. This command can change the session to autocommit mode, where each individual statement is committed implicitly.
ru: <command>SET AUTOCOMMIT</command> устанавливает режим автофиксации для текущего сеанса использования базы данных. По умолчанию программы со встраиваемым SQL работают <emphasis>не</emphasis> в режиме автофиксации, так что в определённые моменты нужно явно выполнять <command>COMMIT</command>. Эта команда может переключить сеанс в режим автофиксации, когда неявно фиксируется каждый отдельный оператор.

source: <command>SET AUTOCOMMIT</command> is an extension of PostgreSQL ECPG.
ru: <command>SET AUTOCOMMIT</command> — расширение PostgreSQL ECPG.

source: select a database connection
ru: выбрать подключение к базе данных

source: <command>SET CONNECTION</command> sets the <quote>current</quote> database connection, which is the one that all commands use unless overridden.
ru: <command>SET CONNECTION</command> устанавливает <quote>текущее</quote> подключение к базе данных, которое будет использоваться командами, не задающими подключение явно.

source: Set the connection to the default connection.
ru: Устанавливает заданное подключение подключением по умолчанию.

source: <command>SET CONNECTION</command> is specified in the SQL standard.
ru: Команда <command>SET CONNECTION</command> описана в стандарте SQL.

source: set information in an SQL descriptor area
ru: внести информацию в область дескриптора SQL

source: number
ru: номер

source: <command>SET DESCRIPTOR</command> populates an SQL descriptor area with values. The descriptor area is then typically used to bind parameters in a prepared query execution.
ru: <command>SET DESCRIPTOR</command> заполняет область SQL-дескриптора значениями. Заполненная область дескриптора обычно применяется для привязывания параметров при выполнении подготовленного запроса.

source: This command has two forms: The first form applies to the descriptor <quote>header</quote>, which is independent of a particular datum. The second form assigns values to particular datums, identified by number.
ru: Эта команда имеет две формы: первая применяется к <quote>заголовку</quote> дескриптора, который не зависит от конкретных данных. Вторая форма устанавливает значения для определённых полей по номерам.

source: A token identifying which header information item to set. Only <literal>COUNT</literal>, to set the number of descriptor items, is currently supported.
ru: Идентификатор, определяющий, какой элемент заголовка нужно задать. В настоящее время поддерживается только <literal>COUNT</literal>, позволяющий задать число элементов в дескрипторе.

source: The number of the descriptor item to set. The count starts at 1.
ru: Номер элемента дескриптора, для которого задаётся значение. Нумерация начинается с 1.

source: A token identifying which item of information to set in the descriptor. See <xref linkend="ecpg-named-descriptors"/> for a list of supported items.
ru: Идентификатор, определяющий, какой элемент нужно установить в дескрипторе. Список поддерживаемых элементов приведён в <xref remap="6" linkend="ecpg-named-descriptors"/>.

source: A value to store into the descriptor item. This can be an SQL constant or a host variable.
ru: Значение, которое нужно поместить в элемент дескриптора. Это может быть константа SQL или переменная среды.

source: <command>SET DESCRIPTOR</command> is specified in the SQL standard.
ru: Команда <command>SET DESCRIPTOR</command> описана в стандарте SQL.

source: define a new data type
ru: создать новый тип данных

source: type_name
ru: имя_типа

source: ctype
ru: тип_С

source: The <command>TYPE</command> command defines a new C type. It is equivalent to putting a <literal>typedef</literal> into a declare section.
ru: Команда <command>TYPE</command> определяет новый тип C. Она равнозначна добавлению <literal>typedef</literal> в секции объявлений.

source: This command is only recognized when <command>ecpg</command> is run with the <option>-c</option> option.
ru: Эта команда принимается, только когда <command>ecpg</command> запускается с параметром <option>-c</option>.

source: The name for the new type. It must be a valid C type name.
ru: Имя нового типа. Это имя должно быть допустимым для типа в языке C.

source: A C type specification.
ru: Определение типа C.

source: Here is an example program that uses <command>EXEC SQL TYPE</command>: <placeholder-1/> The output from this program looks like this: <screen> t.v = testdb t.i = 256 t_ind.v_ind = 0 t_ind.i_ind = 0 </screen>
ru: Пример программы, в которой используется <command>EXEC SQL TYPE</command>: <placeholder-1/> Эта программа выдаёт следующее: <screen> t.v = testdb t.i = 256 t_ind.v_ind = 0 t_ind.i_ind = 0 </screen>

source: The <command>TYPE</command> command is a PostgreSQL extension.
ru: Команда <command>TYPE</command> — расширение PostgreSQL.

source: define a variable
ru: определить переменную

source: varname
ru: имя_переменной

source: The <command>VAR</command> command assigns a new C data type to a host variable. The host variable must be previously declared in a declare section.
ru: Команда <command>VAR</command> назначает переменной среды новый тип данных C. Переменная среды должна быть объявлена ранее в секции объявлений.

source: A C variable name.
ru: Имя переменной C.

source: The <command>VAR</command> command is a PostgreSQL extension.
ru: Команда <command>VAR</command> — расширение PostgreSQL.

source: specify the action to be taken when an SQL statement causes a specific class condition to be raised
ru: определить действие, которое должно выполняться, когда при обработке SQL-оператора возникает определённое условие

source: action
ru: действие

source: Define a behavior which is called on the special cases (Rows not found, SQL warnings or errors) in the result of SQL execution.
ru: Устанавливает поведение в случае определённых условий (строки не найдены, выданы предупреждения или ошибки SQL и т. д.), возникающих в ходе выполнения SQL.

source: See <xref linkend="ecpg-whenever"/> for a description of the parameters.
ru: Описание параметров приведено в <xref remap="6" linkend="ecpg-whenever"/>.

source: int main(void) { EXEC SQL CONNECT TO testdb AS con1; EXEC SQL ALLOCATE DESCRIPTOR d; EXEC SQL DECLARE cur CURSOR FOR SELECT current_database(), 'hoge', 256; EXEC SQL OPEN cur; /* when end of result set reached, break out of while loop */ EXEC SQL WHENEVER NOT FOUND DO BREAK; while (1) { EXEC SQL FETCH NEXT FROM cur INTO SQL DESCRIPTOR d; ... } EXEC SQL CLOSE cur; EXEC SQL COMMIT; EXEC SQL DEALLOCATE DESCRIPTOR d; EXEC SQL DISCONNECT ALL; return 0; }
ru: int main(void) { EXEC SQL CONNECT TO testdb AS con1; EXEC SQL ALLOCATE DESCRIPTOR d; EXEC SQL DECLARE cur CURSOR FOR SELECT current_database(), 'hoge', 256; EXEC SQL OPEN cur; /* по достижении конца набора результатов прервать цикл while */ EXEC SQL WHENEVER NOT FOUND DO BREAK; while (1) { EXEC SQL FETCH NEXT FROM cur INTO SQL DESCRIPTOR d; ... } EXEC SQL CLOSE cur; EXEC SQL COMMIT; EXEC SQL DEALLOCATE DESCRIPTOR d; EXEC SQL DISCONNECT ALL; return 0; }

source: A typical application is the use of <literal>WHENEVER NOT FOUND BREAK</literal> to handle looping through result sets: <placeholder-1/>
ru: Типичное применение конструкция <literal>WHENEVER NOT FOUND BREAK</literal> находит в обработке результатов запроса в цикле: <placeholder-1/>

source: <command>WHENEVER</command> is specified in the SQL standard, but most of the actions are PostgreSQL extensions.
ru: Команда <command>WHENEVER</command> описана в стандарте SQL, но большинство действий относятся к расширениям PostgreSQL.

source: <productname>Informix</productname> Compatibility Mode
ru: Режим совместимости с <productname>Informix</productname>

source: <command>ecpg</command> can be run in a so-called <firstterm>Informix compatibility mode</firstterm>. If this mode is active, it tries to behave as if it were the <productname>Informix</productname> precompiler for <productname>Informix</productname> E/SQL. Generally spoken this will allow you to use the dollar sign instead of the <literal>EXEC SQL</literal> primitive to introduce embedded SQL commands: <placeholder-1/>
ru: Препроцессор <command>ecpg</command> может работать в так называемом <firstterm>режиме совместимости с Informix</firstterm>. Если этот режим включён, <command>ecpg</command> старается работать как предкомпилятор <productname>Informix</productname> для кода <productname>Informix</productname> E/SQL. Вообще говоря, это позволяет записывать встраиваемые команды SQL, используя знак доллара вместо слов <literal>EXEC SQL</literal>: <placeholder-1/>

source: There must not be any white space between the <literal>$</literal> and a following preprocessor directive, that is, <literal>include</literal>, <literal>define</literal>, <literal>ifdef</literal>, etc. Otherwise, the preprocessor will parse the token as a host variable.
ru: Между <literal>$</literal> и последующей директивой препроцессора (в частности, <literal>include</literal>, <literal>define</literal>, <literal>ifdef</literal> и т. п.) не должно быть пробельных символов. В противном случае препроцессор воспримет следующее слово как имя переменной среды.

source: There are two compatibility modes: <literal>INFORMIX</literal>, <literal>INFORMIX_SE</literal>
ru: Поддерживаются два режима совместимости: <literal>INFORMIX</literal> и <literal>INFORMIX_SE</literal>

source: When linking programs that use this compatibility mode, remember to link against <literal>libcompat</literal> that is shipped with ECPG.
ru: При компоновке программ, использующих этот режим совместимости, обязательно подключите библиотеку <literal>libcompat</literal>, поставляемую с ECPG.

source: Besides the previously explained syntactic sugar, the <productname>Informix</productname> compatibility mode ports some functions for input, output and transformation of data as well as embedded SQL statements known from E/SQL to ECPG.
ru: Помимо ранее упомянутого синтаксического сахара, режим совместимости с <productname>Informix</productname> приносит из E/SQL в ECPG набор функций для ввода, вывода и преобразования данных, а также встраиваемые операторы SQL.

source: <productname>Informix</productname> compatibility mode is closely connected to the pgtypeslib library of ECPG. pgtypeslib maps SQL data types to data types within the C host program and most of the additional functions of the <productname>Informix</productname> compatibility mode allow you to operate on those C host program types. Note however that the extent of the compatibility is limited. It does not try to copy <productname>Informix</productname> behavior; it allows you to do more or less the same operations and gives you functions that have the same name and the same basic behavior but it is no drop-in replacement if you are using <productname>Informix</productname> at the moment. Moreover, some of the data types are different. For example, <productname>PostgreSQL's</productname> datetime and interval types do not know about ranges like for example <literal>YEAR TO MINUTE</literal> so you won't find support in ECPG for that either.
ru: Режим совместимости с <productname>Informix</productname> тесно связан с библиотекой pgtypeslib из ECPG. Библиотека pgtypeslib сопоставляет типы данных SQL с типами данных в ведущей программе на C, а большинство дополнительных функций режима совместимости с <productname>Informix</productname> позволяют работать с этими типами C. Заметьте, однако, что степень совместимости ограничена. ECPG не пытается копировать поведение <productname>Informix</productname>; вы можете выполнять примерно те же операции и пользоваться функции с теми же именами и с тем же поведением, но если вы используете <productname>Informix</productname>, просто заменить одно средство другим на данный момент нельзя. Более того, есть различия и в типах данных. В частности, типы даты и интервала в <productname>PostgreSQL</productname> не воспринимают диапазоны, как например, <literal>YEAR TO MINUTE</literal>, так что и в ECPG это не будет поддерживаться.

source: Additional Types
ru: Дополнительные типы

source: EXEC SQL BEGIN DECLARE SECTION; string userid; /* this variable will contain trimmed data */ EXEC SQL END DECLARE SECTION; EXEC SQL FETCH MYCUR INTO :userid;
ru: EXEC SQL BEGIN DECLARE SECTION; string userid; /* эта переменная будет содержать обрезанные данные */ EXEC SQL END DECLARE SECTION; EXEC SQL FETCH MYCUR INTO :userid;

source: The Informix-special "string" pseudo-type for storing right-trimmed character string data is now supported in Informix-mode without using <literal>typedef</literal>. In fact, in Informix-mode, ECPG refuses to process source files that contain <literal>typedef sometype string;</literal> <placeholder-1/>
ru: Теперь в режиме Informix без указания <literal>typedef</literal> поддерживается специальный псевдотип Informix "string" для хранения символьной строки, обрезаемой справа. На самом деле, в режиме Informix ECPG откажется обрабатывать исходные файлы, содержащие определение типа <literal>typedef некоторый_тип string;</literal> <placeholder-1/>

source: Additional/Missing Embedded SQL Statements
ru: Дополнительные/недостающие операторы встраиваемого SQL

source: $CLOSE DATABASE; /* close the current connection */ EXEC SQL CLOSE DATABASE;
ru: $CLOSE DATABASE; /* закрыть текущее подключение */ EXEC SQL CLOSE DATABASE;

source: This statement closes the current connection. In fact, this is a synonym for ECPG's <literal>DISCONNECT CURRENT</literal>: <placeholder-1/>
ru: Этот оператор закрывает текущее подключение. Фактически это синоним команды <literal>DISCONNECT CURRENT</literal> в ECPG: <placeholder-1/>

source: FREE cursor_name
ru: FREE имя_курсора

source: Due to the differences how ECPG works compared to Informix's ESQL/C (i.e. which steps are purely grammar transformations and which steps rely on the underlying run-time library) there is no <literal>FREE cursor_name</literal> statement in ECPG. This is because in ECPG, <literal>DECLARE CURSOR</literal> doesn't translate to a function call into the run-time library that uses to the cursor name. This means that there's no run-time bookkeeping of SQL cursors in the ECPG run-time library, only in the PostgreSQL server.
ru: Из-за различий в подходах ECPG и ESQL/C Informix (т. е. другого разделения на чисто грамматические преобразования и вызовы нижележащей библиотеки времени выполнения), в ECPG нет оператора <literal>FREE имя_курсора</literal>. Это связано с тем, что в ECPG команда <literal>DECLARE CURSOR</literal> не сводится к вызову функции в библиотеке времени выполнения, которая бы принимала имя курсора. Это значит, что курсоры SQL в библиотеке ECPG не требуют обслуживания, оно требуется только на уровне сервера PostgreSQL.

source: FREE statement_name
ru: FREE имя_оператора

source: <literal>FREE statement_name</literal> is a synonym for <literal>DEALLOCATE PREPARE statement_name</literal>.
ru: Команда <literal>FREE имя_оператора</literal> является синонимом команды <literal>DEALLOCATE PREPARE имя_оператора</literal>.

source: Informix-compatible SQLDA Descriptor Areas
ru: Области дескрипторов SQLDA, совместимые с Informix

source: Informix-compatible mode supports a different structure than the one described in <xref linkend="ecpg-sqlda-descriptors"/>. See below: <placeholder-1/>
ru: Режим совместимости с Informix поддерживает структуру, отличную от описанной в <xref remap="6" linkend="ecpg-sqlda-descriptors"/>. См. ниже: <placeholder-1/>

source: The number of fields in the <literal>SQLDA</literal> descriptor.
ru: Число полей в дескрипторе <literal>SQLDA</literal>.

source: Pointer to the per-field properties.
ru: Указатель на свойства по полям.

source: Unused, filled with zero-bytes.
ru: Не используется, заполняется нулями.

source: Size of the allocated structure.
ru: Размер структуры в памяти.

source: Pointer to the next SQLDA structure if the result set contains more than one record.
ru: Указатель на следующую структуру SQLDA, если набор результатов содержит больше одной записи.

source: Unused pointer, contains NULL. Kept for Informix-compatibility.
ru: Неиспользуемый указатель, содержит NULL. Сохраняется для совместимости с Informix.

source: Type of the field. Constants are in <literal>sqltypes.h</literal>
ru: Тип поля. Соответствующие константы представлены в <literal>sqltypes.h</literal>

source: Length of the field data.
ru: Длина данных поля.

source: Pointer to the field data. The pointer is of <literal>char *</literal> type, the data pointed by it is in a binary format. Example: <placeholder-1/>
ru: Указатель на данные поля. Этот указатель имеет тип <literal>char *</literal>, но он указывает на данные в двоичном формате. Например: <placeholder-1/>

source: Pointer to the NULL indicator. If returned by DESCRIBE or FETCH then it's always a valid pointer. If used as input for <literal>EXECUTE ... USING sqlda;</literal> then NULL-pointer value means that the value for this field is non-NULL. Otherwise a valid pointer and <literal>sqlitype</literal> has to be properly set. Example: <placeholder-1/>
ru: Указатель на индикатор NULL. Если возвращается командами DESCRIBE или FETCH, это всегда действительный указатель. Если передаётся на вход команде <literal>EXECUTE ... USING sqlda;</literal>, NULL вместо указателя означает, что значение этого поля отлично от NULL. Чтобы обозначить NULL в поле, необходимо корректно установить этот указатель и <literal>sqlitype</literal>. Например: <placeholder-1/>

source: Name of the field. 0-terminated string.
ru: Имя поля, в виде строки с завершающим 0.

source: Reserved in Informix, value of <function>PQfformat()</function> for the field.
ru: Зарезервировано в Informix, значение <function>PQfformat()</function> для данного поля.
