Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: Parse the textual representation of a date. <synopsis> int rstrdate(char *str, date *d); </synopsis> The function receives the textual representation of the date to convert (<literal>str</literal>) and a pointer to a variable of type date (<literal>d</literal>). This function does not allow you to specify a format mask. It uses the default format mask of <productname>Informix</productname> which is <literal>mm/dd/yyyy</literal>. Internally, this function is implemented by means of <function>rdefmtdate</function>. Therefore, <function>rstrdate</function> is not faster and if you have the choice you should opt for <function>rdefmtdate</function> which allows you to specify the format mask explicitly.
ru: Разбирает текстовое представление даты. <synopsis> int rstrdate(char *str, date *d); </synopsis> Эта функция получает текстовое представление (<literal>str</literal>) даты, которую нужно преобразовать, и указатель на переменную типа date (<literal>d</literal>). Для данной функции нельзя задать маску формата. Она использует стандартную маску формата <productname>Informix</productname>, а именно: <literal>mm/dd/yyyy</literal>. Внутри эта функция вызывает <function>rdefmtdate</function>. Таким образом, <function>rstrdate</function> не будет быстрее, и если у вас есть выбор, используйте функцию <function>rdefmtdate</function>, которая позволяет явно задать маску формата.

source: The function returns the same values as <function>rdefmtdate</function>.
ru: Эта функция возвращает те же значения, что и <function>rdefmtdate</function>.

source: Get the current date. <synopsis> void rtoday(date *d); </synopsis> The function receives a pointer to a date variable (<literal>d</literal>) that it sets to the current date.
ru: Выдаёт текущую дату. <synopsis> void rtoday(date *d); </synopsis> Эта функция получает указатель на переменную (<literal>d</literal>) типа date, в которую будет записана текущая дата.

source: Internally this function uses the <xref linkend="pgtypesdatetoday"/> function.
ru: Внутри эта функция вызывает <xref linkend="pgtypesdatetoday"/>.

source: Extract the values for the day, the month and the year from a variable of type date. <synopsis> int rjulmdy(date d, short mdy[3]); </synopsis> The function receives the date <literal>d</literal> and a pointer to an array of 3 short integer values <literal>mdy</literal>. The variable name indicates the sequential order: <literal>mdy[0]</literal> will be set to contain the number of the month, <literal>mdy[1]</literal> will be set to the value of the day and <literal>mdy[2]</literal> will contain the year.
ru: Извлекает значения дня, месяца и года из переменной типа date. <synopsis> int rjulmdy(date d, short mdy[3]); </synopsis> Эта функция получает дату <literal>d</literal> и указатель на 3 коротких целочисленных значения <literal>mdy</literal>. Имя переменной указывает на порядок значений: в <literal>mdy[0]</literal> записывается номер месяца, в <literal>mdy[1]</literal> — номер дня, а в <literal>mdy[2]</literal> — год.

source: The function always returns 0 at the moment.
ru: В текущем состоянии эта функция всегда возвращает 0.

source: Internally the function uses the <xref linkend="pgtypesdatejulmdy"/> function.
ru: Внутри эта функция вызывает <xref linkend="pgtypesdatejulmdy"/>.

source: Use a format mask to convert a character string to a value of type date. <synopsis> int rdefmtdate(date *d, char *fmt, char *str); </synopsis> The function receives a pointer to the date value that should hold the result of the operation (<literal>d</literal>), the format mask to use for parsing the date (<literal>fmt</literal>) and the C char* string containing the textual representation of the date (<literal>str</literal>). The textual representation is expected to match the format mask. However you do not need to have a 1:1 mapping of the string to the format mask. The function only analyzes the sequential order and looks for the literals <literal>yy</literal> or <literal>yyyy</literal> that indicate the position of the year, <literal>mm</literal> to indicate the position of the month and <literal>dd</literal> to indicate the position of the day.
ru: Преобразует символьную строку в значение типа date по маске формата. <synopsis> int rdefmtdate(date *d, char *fmt, char *str); </synopsis> Эта функция принимает указатель на переменную типа date (<literal>d</literal>), в которую будет помещён результат операции, маску формата для разбора даты (<literal>fmt</literal>) и строку C char*, содержащую текстовое представление даты (<literal>str</literal>). Ожидается, что текстовое представление будет соответствовать маске формата. Однако это соответствие не обязательно должно быть точным. Данная функция анализирует только порядок элементов и ищет в нём подстроки <literal>yy</literal> или <literal>yyyy</literal>, обозначающие позицию года, подстроку <literal>mm</literal>, обозначающую позицию месяца, и <literal>dd</literal>, обозначающую позицию дня.

source: 0 - The function terminated successfully.
ru: 0 — Функция выполнена успешно.

source: <literal>ECPG_INFORMIX_ENOSHORTDATE</literal> - The date does not contain delimiters between day, month and year. In this case the input string must be exactly 6 or 8 bytes long but isn't.
ru: <literal>ECPG_INFORMIX_ENOSHORTDATE</literal> — Дата не содержит разделителей между днём, месяцем и годом. С таким форматом входная строка должна быть длиной ровно 6 или 8 байт, но это не так.

source: <literal>ECPG_INFORMIX_ENOTDMY</literal> - The format string did not correctly indicate the sequential order of year, month and day.
ru: <literal>ECPG_INFORMIX_ENOTDMY</literal> — Строка формата не определяет корректно последовательный порядок года, месяца и дня.

source: <literal>ECPG_INFORMIX_BAD_DAY</literal> - The input string does not contain a valid day.
ru: <literal>ECPG_INFORMIX_BAD_DAY</literal> — Во входной строке отсутствует корректное указание дня.

source: <literal>ECPG_INFORMIX_BAD_MONTH</literal> - The input string does not contain a valid month.
ru: <literal>ECPG_INFORMIX_BAD_MONTH</literal> — Во входной строке отсутствует корректное указание месяца.

source: <literal>ECPG_INFORMIX_BAD_YEAR</literal> - The input string does not contain a valid year.
ru: <literal>ECPG_INFORMIX_BAD_YEAR</literal> — Во входной строке отсутствует корректное указание года.

source: The function returns the following values: <placeholder-1/>
ru: Эта функция возвращает следующие значения: <placeholder-1/>

source: Internally this function is implemented to use the <xref linkend="pgtypesdatedefmtasc"/> function. See the reference there for a table of example input.
ru: В реализации этой функции вызывается <xref linkend="pgtypesdatedefmtasc"/>. Примеры вводимых строк приведены в таблице в её описании.

source: Convert a variable of type date to its textual representation using a format mask. <synopsis> int rfmtdate(date d, char *fmt, char *str); </synopsis> The function receives the date to convert (<literal>d</literal>), the format mask (<literal>fmt</literal>) and the string that will hold the textual representation of the date (<literal>str</literal>).
ru: Преобразует переменную типа date в текстовое представление по маске формата. <synopsis> int rfmtdate(date d, char *fmt, char *str); </synopsis> Эта функция принимает дату для преобразования (<literal>d</literal>), маску формата (<literal>fmt</literal>) и строку, в которую будет помещено текстовое представление даты (<literal>str</literal>).

source: Internally this function uses the <xref linkend="pgtypesdatefmtasc"/> function, see the reference there for examples.
ru: Внутри эта функция вызывает <xref linkend="pgtypesdatefmtasc"/>, примеры форматов можно найти в её описании.

source: Create a date value from an array of 3 short integers that specify the day, the month and the year of the date. <synopsis> int rmdyjul(short mdy[3], date *d); </synopsis> The function receives the array of the 3 short integers (<literal>mdy</literal>) and a pointer to a variable of type date that should hold the result of the operation.
ru: Образует значение даты из массива 3 коротких целых, задающих день, месяц и год даты. <synopsis> int rmdyjul(short mdy[3], date *d); </synopsis> Эта функция получает в первом аргументе массив из 3 коротких целых (<literal>mdy</literal>), а во втором указатель на переменную типа date, в которую будет помещён результат операции.

source: Currently the function returns always 0.
ru: В настоящее время эта функция всегда возвращает 0.

source: Internally the function is implemented to use the function <xref linkend="pgtypesdatemdyjul"/>.
ru: В реализации этой функции вызывается <xref linkend="pgtypesdatemdyjul"/>.

source: Return a number representing the day of the week for a date value. <synopsis> int rdayofweek(date d); </synopsis> The function receives the date variable <literal>d</literal> as its only argument and returns an integer that indicates the day of the week for this date. <placeholder-1/>
ru: Возвращает число, представляющее день недели для заданной даты. <synopsis> int rdayofweek(date d); </synopsis> Эта функция принимает в единственном аргументе переменную <literal>d</literal> типа date и возвращает целое число, выражающее день недели для этой даты. <placeholder-1/>

source: Internally the function is implemented to use the function <xref linkend="pgtypesdatedayofweek"/>.
ru: В реализации этой функции вызывается <xref linkend="pgtypesdatedayofweek"/>.

source: Retrieve the current timestamp. <synopsis> void dtcurrent(timestamp *ts); </synopsis> The function retrieves the current timestamp and saves it into the timestamp variable that <literal>ts</literal> points to.
ru: Получает текущее время. <synopsis> void dtcurrent(timestamp *ts); </synopsis> Эта функция получает текущее время и сохраняет его в переменной типа timestamp, на которую указывает <literal>ts</literal>.

source: Parses a timestamp from its textual representation into a timestamp variable. <synopsis> int dtcvasc(char *str, timestamp *ts); </synopsis> The function receives the string to parse (<literal>str</literal>) and a pointer to the timestamp variable that should hold the result of the operation (<literal>ts</literal>).
ru: Разбирает время из текстового представления в переменную типа timestamp. <synopsis> int dtcvasc(char *str, timestamp *ts); </synopsis> Эта функция получает строку (<literal>str</literal>), которую нужно разобрать, и указатель на переменную типа timestamp, в которую будет помещён результат операции (<literal>ts</literal>).

source: Internally this function uses the <xref linkend="pgtypestimestampfromasc"/> function. See the reference there for a table with example inputs.
ru: Внутри эта функция вызывает <xref linkend="pgtypestimestampfromasc"/>. Примеры вводимых строк приведены в таблице в её описании.

source: Parses a timestamp from its textual representation using a format mask into a timestamp variable. <synopsis> dtcvfmtasc(char *inbuf, char *fmtstr, timestamp *dtvalue) </synopsis> The function receives the string to parse (<literal>inbuf</literal>), the format mask to use (<literal>fmtstr</literal>) and a pointer to the timestamp variable that should hold the result of the operation (<literal>dtvalue</literal>).
ru: Разбирает время из текстового представления в переменную типа timestamp по маске формата. <synopsis> dtcvfmtasc(char *inbuf, char *fmtstr, timestamp *dtvalue) </synopsis> Эта функция получает строку (<literal>inbuf</literal>), которую нужно разобрать, маску формата (<literal>fmtstr</literal>) и указатель на переменную timestamp, в которой будет содержаться результат операции (<literal>dtvalue</literal>).

source: This function is implemented by means of the <xref linkend="pgtypestimestampdefmtasc"/> function. See the documentation there for a list of format specifiers that can be used.
ru: В реализации этой функции используется <xref linkend="pgtypestimestampdefmtasc"/>. Список допустимых кодов формата приведён в её описании.

source: Subtract one timestamp from another and return a variable of type interval. <synopsis> int dtsub(timestamp *ts1, timestamp *ts2, interval *iv); </synopsis> The function will subtract the timestamp variable that <literal>ts2</literal> points to from the timestamp variable that <literal>ts1</literal> points to and will store the result in the interval variable that <literal>iv</literal> points to.
ru: Вычитает одно значение времени из другого и возвращает переменную типа interval. <synopsis> int dtsub(timestamp *ts1, timestamp *ts2, interval *iv); </synopsis> Эта функция вычитает значение timestamp, на которое указывает <literal>ts2</literal>, из значения timestamp, на которое указывает <literal>ts1</literal>, и сохраняет результат в переменной типа interval, на которую указывает <literal>iv</literal>.

source: Convert a timestamp variable to a C char* string. <synopsis> int dttoasc(timestamp *ts, char *output); </synopsis> The function receives a pointer to the timestamp variable to convert (<literal>ts</literal>) and the string that should hold the result of the operation (<literal>output</literal>). It converts <literal>ts</literal> to its textual representation according to the SQL standard, which is be <literal>YYYY-MM-DD HH:MM:SS</literal>.
ru: Преобразует переменную типа timestamp в строку C char*. <synopsis> int dttoasc(timestamp *ts, char *output); </synopsis> Эта функция получает указатель (<literal>ts</literal>) на переменную типа timestamp, которую нужно преобразовать, и строку (<literal>output</literal>) для сохранения результата операции. Она преобразует <literal>ts</literal> в текстовое представление согласно стандарту SQL, то есть по маске <literal>YYYY-MM-DD HH:MM:SS</literal>.

source: Convert a timestamp variable to a C char* using a format mask. <synopsis> int dttofmtasc(timestamp *ts, char *output, int str_len, char *fmtstr); </synopsis> The function receives a pointer to the timestamp to convert as its first argument (<literal>ts</literal>), a pointer to the output buffer (<literal>output</literal>), the maximal length that has been allocated for the output buffer (<literal>str_len</literal>) and the format mask to use for the conversion (<literal>fmtstr</literal>).
ru: Преобразует переменную типа timestamp в строку C char* по маске формата. <synopsis> int dttofmtasc(timestamp *ts, char *output, int str_len, char *fmtstr); </synopsis> Эта функция получает в первом аргументе (<literal>ts</literal>) указатель на переменную типа timestamp, а в последующих указатель на буфер вывода (<literal>output</literal>), максимальную длину строки, которую может принять буфер (<literal>str_len</literal>), и маску формата, с которой будет выполняться преобразование (<literal>fmtstr</literal>).

source: Internally, this function uses the <xref linkend="pgtypestimestampfmtasc"/> function. See the reference there for information on what format mask specifiers can be used.
ru: Внутри эта функция использует <xref linkend="pgtypestimestampfmtasc"/>. Примеры допустимых масок формата можно найти в её описании.

source: Convert an interval variable to a C char* string. <synopsis> int intoasc(interval *i, char *str); </synopsis> The function receives a pointer to the interval variable to convert (<literal>i</literal>) and the string that should hold the result of the operation (<literal>str</literal>). It converts <literal>i</literal> to its textual representation according to the SQL standard, which is be <literal>YYYY-MM-DD HH:MM:SS</literal>.
ru: Преобразует переменную типа interval в строку C char*. <synopsis> int intoasc(interval *i, char *str); </synopsis> Эта функция получает указатель (<literal>i</literal>) на переменную типа interval, которую нужно преобразовать, и строку (<literal>str</literal>) для сохранения результата операции. Она преобразует <literal>i</literal> в текстовое представление согласно стандарту SQL, то есть по маске <literal>YYYY-MM-DD HH:MM:SS</literal>.

source: Convert a long integer value to its textual representation using a format mask. <synopsis> int rfmtlong(long lng_val, char *fmt, char *outbuf); </synopsis> The function receives the long value <literal>lng_val</literal>, the format mask <literal>fmt</literal> and a pointer to the output buffer <literal>outbuf</literal>. It converts the long value according to the format mask to its textual representation.
ru: Преобразует длинное целое в текстовое представление по маске формата. <synopsis> int rfmtlong(long lng_val, char *fmt, char *outbuf); </synopsis> Эта функция принимает значение типа long (<literal>lng_val</literal>), маску формата (<literal>fmt</literal>) и указатель на выходной буфер (<literal>outbuf</literal>). Она преобразует длинное целое в его текстовое представление согласно заданной маске формата.

source: <literal>*</literal> (asterisk) - if this position would be blank otherwise, fill it with an asterisk.
ru: <literal>*</literal> (звёздочка) — если в данной позиции будет пусто, заполнить её звёздочкой.

source: <literal>&amp;</literal> (ampersand) - if this position would be blank otherwise, fill it with a zero.
ru: <literal>&amp;</literal> (амперсанд) — если в данной позиции будет пусто, заполнить её нулём.

source: <literal>#</literal> - turn leading zeroes into blanks.
ru: <literal>#</literal> — заменить ведущие нули пробелами.

source: <literal>&lt;</literal> - left-justify the number in the string.
ru: <literal>&lt;</literal> — выровнять число в строке по левой стороне.

source: <literal>,</literal> (comma) - group numbers of four or more digits into groups of three digits separated by a comma.
ru: <literal>,</literal> (запятая) — сгруппировать числа, содержащие четыре и более цифр, в группы по три цифры через запятую.

source: <literal>.</literal> (period) - this character separates the whole-number part of the number from the fractional part.
ru: <literal>.</literal> (точка) — этот символ отделяет целую часть числа от дробной.

source: <literal>-</literal> (minus) - the minus sign appears if the number is a negative value.
ru: <literal>-</literal> (минус) — с отрицательным числом должен выводиться знак минус.

source: <literal>+</literal> (plus) - the plus sign appears if the number is a positive value.
ru: <literal>+</literal> (плюс) — с положительным числом должен выводиться знак плюс.

source: <literal>(</literal> - this replaces the minus sign in front of the negative number. The minus sign will not appear.
ru: <literal>(</literal> — это символ заменяет знак минус перед отрицательным числом. Сам знак минус выводиться не будет.

source: <literal>)</literal> - this character replaces the minus and is printed behind the negative value.
ru: <literal>)</literal> — этот символ заменяет минус и выводится после отрицательного числа.

source: <literal>$</literal> - the currency symbol.
ru: <literal>$</literal> — символ денежной суммы.

source: The format mask can be composed of the following format specifying characters: <placeholder-1/>
ru: Маску формата можно составить из следующих символов, определяющих формат: <placeholder-1/>

source: Convert a string to upper case. <synopsis> void rupshift(char *str); </synopsis> The function receives a pointer to the string and transforms every lower case character to upper case.
ru: Приводит строку к верхнему регистру. <synopsis> void rupshift(char *str); </synopsis> Эта функция получает указатель на строку и приводит в ней каждый символ в нижнем регистре к верхнему регистру.

source: Return the number of characters in a string without counting trailing blanks. <synopsis> int byleng(char *str, int len); </synopsis> The function expects a fixed-length string as its first argument (<literal>str</literal>) and its length as its second argument (<literal>len</literal>). It returns the number of significant characters, that is the length of the string without trailing blanks.
ru: Возвращает число символов в строке, не считая завершающих пробелов. <synopsis> int byleng(char *str, int len); </synopsis> Эта функция принимает в первом аргументе (<literal>str</literal>) строку фиксированной длины, а во втором (<literal>len</literal>) её длину. Она возвращает число значимых символов, то есть длину строки без завершающих пробелов.

source: Copy a fixed-length string into a null-terminated string. <synopsis> void ldchar(char *src, int len, char *dest); </synopsis> The function receives the fixed-length string to copy (<literal>src</literal>), its length (<literal>len</literal>) and a pointer to the destination memory (<literal>dest</literal>). Note that you need to reserve at least <literal>len+1</literal> bytes for the string that <literal>dest</literal> points to. The function copies at most <literal>len</literal> bytes to the new location (less if the source string has trailing blanks) and adds the null-terminator.
ru: Копирует строку фиксированной длины в строку с завершающим нулём. <synopsis> void ldchar(char *src, int len, char *dest); </synopsis> Эта функция принимает строку фиксированной длины (<literal>src</literal>), которую нужно скопировать, её длину (<literal>len</literal>) и указатель на целевой буфер в памяти (<literal>dest</literal>). Учтите, что для буфера, на который указывает <literal>dest</literal>, необходимо выделить как минимум <literal>len+1</literal> байт. Данная функция копирует в новую область не больше <literal>len</literal> байт (меньше, если в исходной строке есть завершающие пробелы) и добавляет завершающий 0.

source: <synopsis> int rgetmsg(int msgnum, char *s, int maxsize); </synopsis> This function exists but is not implemented at the moment!
ru: <synopsis> int rgetmsg(int msgnum, char *s, int maxsize); </synopsis> Эта функция определена, но не реализована на данный момент!

source: <synopsis> int rtypalign(int offset, int type); </synopsis> This function exists but is not implemented at the moment!
ru: <synopsis> int rtypalign(int offset, int type); </synopsis> Эта функция определена, но не реализована на данный момент!

source: <synopsis> int rtypmsize(int type, int len); </synopsis> This function exists but is not implemented at the moment!
ru: <synopsis> int rtypmsize(int type, int len); </synopsis> Эта функция определена, но не реализована на данный момент!

source: <synopsis> int rtypwidth(int sqltype, int sqllen); </synopsis> This function exists but is not implemented at the moment!
ru: <synopsis> int rtypwidth(int sqltype, int sqllen); </synopsis> Эта функция определена, но не реализована на данный момент!

source: Set a variable to NULL. <synopsis> int rsetnull(int t, char *ptr); </synopsis> The function receives an integer that indicates the type of the variable and a pointer to the variable itself that is cast to a C char* pointer.
ru: Присваивает переменной NULL. <synopsis> int rsetnull(int t, char *ptr); </synopsis> Эта функция получает целое, определяющее тип переменной, и указатель на саму переменную, приведённый к указателю C char*.

source: <literal>CCHARTYPE</literal> - For a variable of type <type>char</type> or <type>char*</type>
ru: <literal>CCHARTYPE</literal> — для переменной типа <type>char</type> или <type>char*</type>

source: <literal>CSHORTTYPE</literal> - For a variable of type <type>short int</type>
ru: <literal>CSHORTTYPE</literal> — для переменной типа <type>short int</type>

source: <literal>CINTTYPE</literal> - For a variable of type <type>int</type>
ru: <literal>CINTTYPE</literal> — для переменной типа <type>int</type>

source: <literal>CBOOLTYPE</literal> - For a variable of type <type>boolean</type>
ru: <literal>CBOOLTYPE</literal> — для переменной типа <type>boolean</type>

source: <literal>CFLOATTYPE</literal> - For a variable of type <type>float</type>
ru: <literal>CFLOATTYPE</literal> — для переменной типа <type>float</type>

source: <literal>CLONGTYPE</literal> - For a variable of type <type>long</type>
ru: <literal>CLONGTYPE</literal> — для переменной типа <type>long</type>
