Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: An SQL descriptor area is a more sophisticated method for processing the result of a <command>SELECT</command>, <command>FETCH</command> or a <command>DESCRIBE</command> statement. An SQL descriptor area groups the data of one row of data together with metadata items into one data structure. The metadata is particularly useful when executing dynamic SQL statements, where the nature of the result columns might not be known ahead of time. PostgreSQL provides two ways to use Descriptor Areas: the named SQL Descriptor Areas and the C-structure SQLDAs.
ru: Области дескрипторов SQL дают возможности для более сложной обработки результатов операторов <command>SELECT</command>, <command>FETCH</command> и <command>DESCRIBE</command>. Область дескриптора SQL объединяет в одной структуре данные одной строки и элементы метаданных. Эти метаданные особенно полезны при выполнении динамических SQL-операторов, когда характер результирующих столбцов может быть неизвестен заранее. PostgreSQL предлагает два подхода к использованию областей дескрипторов: именованные области SQL-дескрипторов и области SQLDA в структурах C.

source: Named SQL Descriptor Areas
ru: Именованные области SQL-дескрипторов

source: A named SQL descriptor area consists of a header, which contains information concerning the entire descriptor, and one or more item descriptor areas, which basically each describe one column in the result row.
ru: Именованная область SQL-дескриптора состоит из заголовка, содержащего сведения обо всём дескрипторе, и одного или нескольких дескрипторов элементов, которые по сути описывают отдельные столбцы в строке результата.

source: EXEC SQL ALLOCATE DESCRIPTOR <replaceable>identifier</replaceable>;
ru: EXEC SQL ALLOCATE DESCRIPTOR <replaceable>идентификатор</replaceable>;

source: EXEC SQL DEALLOCATE DESCRIPTOR <replaceable>identifier</replaceable>;
ru: EXEC SQL DEALLOCATE DESCRIPTOR <replaceable>идентификатор</replaceable>;

source: Before you can use an SQL descriptor area, you need to allocate one: <placeholder-1/> The identifier serves as the <quote>variable name</quote> of the descriptor area. When you don't need the descriptor anymore, you should deallocate it: <placeholder-2/>
ru: Прежде чем вы сможете использовать область SQL-дескриптора, её нужно выделить: <placeholder-1/> Заданный идентификатор играет роль <quote>имени переменной</quote> области дескриптора. Когда дескриптор оказывается ненужным, его следует освободить: <placeholder-2/>

source: To use a descriptor area, specify it as the storage target in an <literal>INTO</literal> clause, instead of listing host variables: <placeholder-1/> If the result set is empty, the Descriptor Area will still contain the metadata from the query, i.e. the field names.
ru: Чтобы воспользоваться областью дескриптора, её нужно указать в качестве целевого объекта в предложении <literal>INTO</literal>, вместо перечисления переменных среды: <placeholder-1/> Если набор результатов пуст, в области дескриптора будут, тем не менее, содержаться метаданные из запроса, то есть имена полей.

source: For not yet executed prepared queries, the <command>DESCRIBE</command> statement can be used to get the metadata of the result set: <placeholder-1/>
ru: Получить метаданные набора результатов для ещё не выполненных подготовленных запросов можно, воспользовавшись оператором <command>DESCRIBE</command>: <placeholder-1/>

source: Before PostgreSQL 9.0, the <literal>SQL</literal> keyword was optional, so using <literal>DESCRIPTOR</literal> and <literal>SQL DESCRIPTOR</literal> produced named SQL Descriptor Areas. Now it is mandatory, omitting the <literal>SQL</literal> keyword produces SQLDA Descriptor Areas, see <xref linkend="ecpg-sqlda-descriptors"/>.
ru: До PostgreSQL версии 9.0 ключевое слово <literal>SQL</literal> было необязательным, так что предложения <literal>DESCRIPTOR</literal> и <literal>SQL DESCRIPTOR</literal> создавали именованные области SQL-дескрипторов. Теперь оно стало обязательным; без слова <literal>SQL</literal> создаются области SQLDA, см. <xref remap="4" linkend="ecpg-sqlda-descriptors"/>.

source: In <command>DESCRIBE</command> and <command>FETCH</command> statements, the <literal>INTO</literal> and <literal>USING</literal> keywords can be used to similarly: they produce the result set and the metadata in a Descriptor Area.
ru: В операторах <command>DESCRIBE</command> и <command>FETCH</command> ключевые слова <literal>INTO</literal> и <literal>USING</literal> действуют примерно одинаково: они указывают вывести набор результатов и метаданные в область дескриптора.

source: EXEC SQL GET DESCRIPTOR <replaceable>name</replaceable> :<replaceable>hostvar</replaceable> = <replaceable>field</replaceable>;
ru: EXEC SQL GET DESCRIPTOR <replaceable>имя</replaceable> :<replaceable>переменная_среды</replaceable> = <replaceable>поле</replaceable>;

source: EXEC SQL GET DESCRIPTOR <replaceable>name</replaceable> VALUE <replaceable>num</replaceable> :<replaceable>hostvar</replaceable> = <replaceable>field</replaceable>;
ru: EXEC SQL GET DESCRIPTOR <replaceable>имя</replaceable> VALUE <replaceable>номер</replaceable> :<replaceable>переменная_среды</replaceable> = <replaceable>поле</replaceable>;

source: number of rows in the result set
ru: число строк в наборе результатов

source: actual data item (therefore, the data type of this field depends on the query)
ru: собственно элемент данных (тип данных поля зависит от запроса)

source: <literal>DATETIME_INTERVAL_CODE</literal> (integer)
ru: <literal>DATETIME_INTERVAL_CODE</literal> (целое)

source: When <literal>TYPE</literal> is <literal>9</literal>, <literal>DATETIME_INTERVAL_CODE</literal> will have a value of <literal>1</literal> for <literal>DATE</literal>, <literal>2</literal> for <literal>TIME</literal>, <literal>3</literal> for <literal>TIMESTAMP</literal>, <literal>4</literal> for <literal>TIME WITH TIME ZONE</literal>, or <literal>5</literal> for <literal>TIMESTAMP WITH TIME ZONE</literal>.
ru: Когда <literal>TYPE</literal> равно <literal>9</literal>, <literal>DATETIME_INTERVAL_CODE</literal> содержит значение <literal>1</literal> для <literal>DATE</literal>, <literal>2</literal> для <literal>TIME</literal>, <literal>3</literal> для <literal>TIMESTAMP</literal>, <literal>4</literal> для <literal>TIME WITH TIME ZONE</literal>, либо <literal>5</literal> для <literal>TIMESTAMP WITH TIME ZONE</literal>.

source: <literal>DATETIME_INTERVAL_PRECISION</literal> (integer)
ru: <literal>DATETIME_INTERVAL_PRECISION</literal> (целое)

source: not implemented
ru: не реализовано

source: <literal>INDICATOR</literal> (integer)
ru: <literal>INDICATOR</literal> (целое)

source: the indicator (indicating a null value or a value truncation)
ru: индикатор (отмечающий значение NULL или усечение значения)

source: <literal>KEY_MEMBER</literal> (integer)
ru: <literal>KEY_MEMBER</literal> (целое)

source: <literal>LENGTH</literal> (integer)
ru: <literal>LENGTH</literal> (целое)

source: length of the datum in characters
ru: длина данных в символах

source: <literal>NAME</literal> (string)
ru: <literal>NAME</literal> (строка)

source: name of the column
ru: имя столбца

source: <literal>NULLABLE</literal> (integer)
ru: <literal>NULLABLE</literal> (целое)

source: <literal>OCTET_LENGTH</literal> (integer)
ru: <literal>OCTET_LENGTH</literal> (целое)

source: length of the character representation of the datum in bytes
ru: длина символьного представления данных в байтах

source: <literal>PRECISION</literal> (integer)
ru: <literal>PRECISION</literal> (целое)

source: precision (for type <type>numeric</type>)
ru: точность (для типа <type>numeric</type>)

source: <literal>RETURNED_LENGTH</literal> (integer)
ru: <literal>RETURNED_LENGTH</literal> (целое)

source: <literal>RETURNED_OCTET_LENGTH</literal> (integer)
ru: <literal>RETURNED_OCTET_LENGTH</literal> (целое)

source: <literal>SCALE</literal> (integer)
ru: <literal>SCALE</literal> (целое)

source: scale (for type <type>numeric</type>)
ru: масштаб (для типа <type>numeric</type>)

source: <literal>TYPE</literal> (integer)
ru: <literal>TYPE</literal> (целое)

source: numeric code of the data type of the column
ru: числовой код типа данных столбца

source: Now how do you get the data out of the descriptor area? You can think of the descriptor area as a structure with named fields. To retrieve the value of a field from the header and store it into a host variable, use the following command: <placeholder-1/> Currently, there is only one header field defined: <replaceable>COUNT</replaceable>, which tells how many item descriptor areas exist (that is, how many columns are contained in the result). The host variable needs to be of an integer type. To get a field from the item descriptor area, use the following command: <placeholder-2/> <replaceable>num</replaceable> can be a literal integer or a host variable containing an integer. Possible fields are: <placeholder-3/>
ru: Возникает вопрос: а как же получить данные из области дескриптора? Область дескриптора можно представить как структуру с именованными полями. Чтобы получить значение поля из заголовка и сохранить его в переменной среды, нужно выполнить команду: <placeholder-1/> В настоящее время определено только одно поле заголовка: <replaceable>COUNT</replaceable>, которое говорит, сколько областей дескрипторов элементов существует (то есть, сколько столбцов содержится в результате). Переменная среды должна иметь целочисленный тип. Чтобы получить поле из области дескриптора элемента, нужно выполнить команду: <placeholder-2/> В качестве <replaceable>num</replaceable> можно задать обычное целое или переменную среды, содержащую целое число. Допустимые поля: <placeholder-3/>

source: EXEC SQL SET DESCRIPTOR <replaceable>name</replaceable> VALUE <replaceable>num</replaceable> <replaceable>field</replaceable> = :<replaceable>hostvar</replaceable>;
ru: EXEC SQL SET DESCRIPTOR <replaceable>имя</replaceable> VALUE <replaceable>номер</replaceable> <replaceable>поле</replaceable> = :<replaceable>переменная_среды</replaceable>;

source: In <command>EXECUTE</command>, <command>DECLARE</command> and <command>OPEN</command> statements, the effect of the <literal>INTO</literal> and <literal>USING</literal> keywords are different. A Descriptor Area can also be manually built to provide the input parameters for a query or a cursor and <literal>USING SQL DESCRIPTOR <replaceable>name</replaceable></literal> is the way to pass the input parameters into a parameterized query. The statement to build a named SQL Descriptor Area is below: <placeholder-1/>
ru: В операторах <command>EXECUTE</command>, <command>DECLARE</command> и <command>OPEN</command> ключевые слова <literal>INTO</literal> и <literal>USING</literal> действуют по-разному. Область дескриптора также можно сформировать вручную, чтобы передать входные параметры запросу или курсору, а команда <literal>USING SQL DESCRIPTOR <replaceable>имя</replaceable></literal> даёт возможность передать входные аргументы параметризованному запросу. Оператор, формирующий именованную область SQL-дескриптора, выглядит так: <placeholder-1/>

source: PostgreSQL supports retrieving more that one record in one <command>FETCH</command> statement and storing the data in host variables in this case assumes that the variable is an array. E.g.: <placeholder-1/>
ru: PostgreSQL поддерживает выборку сразу нескольких записей в одном операторе <command>FETCH</command> и может сохранить их данные в переменной среды, если эта переменная — массив. Например: <placeholder-1/>

source: SQLDA Descriptor Areas
ru: Области дескрипторов SQLDA

source: An SQLDA Descriptor Area is a C language structure which can be also used to get the result set and the metadata of a query. One structure stores one record from the result set. <placeholder-1/> Note that the <literal>SQL</literal> keyword is omitted. The paragraphs about the use cases of the <literal>INTO</literal> and <literal>USING</literal> keywords in <xref linkend="ecpg-named-descriptors"/> also apply here with an addition. In a <command>DESCRIBE</command> statement the <literal>DESCRIPTOR</literal> keyword can be completely omitted if the <literal>INTO</literal> keyword is used: <placeholder-2/>
ru: Область дескриптора SQLDA представляет собой структуру языка C, в которую можно получить набор результатов и метаданные запроса. Одна такая структура содержит одну запись из набора данных. <placeholder-1/> Заметьте, что ключевое слово <literal>SQL</literal> в этом случае опускается. Замечания относительно применения ключевых слов <literal>INTO</literal> и <literal>USING</literal> в <xref remap="6" linkend="ecpg-named-descriptors"/> применимы и здесь, с дополнением. В операторе <command>DESCRIBE</command> можно полностью опустить ключевое слово <literal>DESCRIPTOR</literal>, если присутствует ключевое слово <literal>INTO</literal>: <placeholder-2/>

source: The general flow of a program that uses SQLDA is:
ru: Общая схема использования SQLDA выглядит так:

source: Prepare a query, and declare a cursor for it.
ru: Подготовить запрос и объявить курсор для него.

source: Declare an SQLDA for the result rows.
ru: Объявить SQLDA для строк результата.

source: Declare an SQLDA for the input parameters, and initialize them (memory allocation, parameter settings).
ru: Объявить SQLDA для входных параметров и инициализировать их (выделить память, задать параметры).

source: Open a cursor with the input SQLDA.
ru: Открыть курсор с входной SQLDA.

source: Fetch rows from the cursor, and store them into an output SQLDA.
ru: Выбрать строки из курсора и сохранить их в выходной SQLDA.

source: Read values from the output SQLDA into the host variables (with conversion if necessary).
ru: Прочитать значения из выходной SQLDA в переменные среды (и преобразовать при необходимости).

source: Close the cursor.
ru: Закрыть курсор.

source: Free the memory area allocated for the input SQLDA.
ru: Освободить область памяти, выделенную для входной SQLDA.

source: SQLDA Data Structure
ru: Структура данных SQLDA

source: SQLDA uses three data structure types: <type>sqlda_t</type>, <type>sqlvar_t</type>, and <type>struct sqlname</type>.
ru: Для SQLDA используются три типа данных: <type>sqlda_t</type>, <type>sqlvar_t</type> и <type>struct sqlname</type>.

source: PostgreSQL's SQLDA has a similar data structure to the one in IBM DB2 Universal Database, so some technical information on DB2's SQLDA could help understanding PostgreSQL's one better.
ru: Структура данных SQLDA в PostgreSQL подобна той, что используется в IBM DB2 Universal Database, так что часть технической информации по SQLDA в DB2 может быть полезна и для понимания устройства SQLDA в PostgreSQL.

source: sqlda_t Structure
ru: Структура sqlda_t

source: The structure type <type>sqlda_t</type> is the type of the actual SQLDA. It holds one record. And two or more <type>sqlda_t</type> structures can be connected in a linked list with the pointer in the <structfield>desc_next</structfield> field, thus representing an ordered collection of rows. So, when two or more rows are fetched, the application can read them by following the <structfield>desc_next</structfield> pointer in each <type>sqlda_t</type> node.
ru: Тип структуры <type>sqlda_t</type> представляет тип собственно SQLDA. Эта структура описывает одну запись. Две или более структур <type>sqlda_t</type> могут объединяться в связанный список по указателям в поле <structfield>desc_next</structfield>, и таким образом образовывать упорядоченный набор строк. Поэтому, когда выбираются две или более строк, приложение может прочитать их, проследуя по указателям <structfield>desc_next</structfield> во всех узлах <type>sqlda_t</type>.

source: It contains the literal string <literal>"SQLDA "</literal>.
ru: Содержит строковую константу <literal>"SQLDA "</literal>.

source: It contains the size of the allocated space in bytes.
ru: Содержит размер выделенного пространства в байтах.

source: It contains the number of input parameters for a parameterized query in case it's passed into <command>OPEN</command>, <command>DECLARE</command> or <command>EXECUTE</command> statements using the <literal>USING</literal> keyword. In case it's used as output of <command>SELECT</command>, <command>EXECUTE</command> or <command>FETCH</command> statements, its value is the same as <literal>sqld</literal> statement
ru: Содержит число входных параметров для параметризованного запроса, когда передаётся в операторы <command>OPEN</command>, <command>DECLARE</command> или <command>EXECUTE</command> с ключевым словом <literal>USING</literal>. В структуре, выводимой операторами <command>SELECT</command>, <command>EXECUTE</command> или <command>FETCH</command>, данное значение совпадает с <literal>sqld</literal>.

source: It contains the number of fields in a result set.
ru: Содержит число полей в наборе результатов.

source: If the query returns more than one record, multiple linked SQLDA structures are returned, and <literal>desc_next</literal> holds a pointer to the next entry in the list.
ru: Если запрос выдаёт несколько записей, возвращается несколько связанных структур SQLDA, а <literal>desc_next</literal> содержит указатель на следующую запись в списке.

source: This is the array of the columns in the result set.
ru: Это массив столбцов в наборе результатов.

source: The definition of <type>sqlda_t</type> is: <placeholder-1/> The meaning of the fields is: <placeholder-2/>
ru: Тип <type>sqlda_t</type> определяется так: <placeholder-1/> Его поля имеют следующее назначение: <placeholder-2/>

source: sqlvar_t Structure
ru: Структура sqlvar_t

source: Contains the type identifier of the field. For values, see <literal>enum ECPGttype</literal> in <literal>ecpgtype.h</literal>.
ru: Содержит идентификатор типа данного поля. Возможные значения перечислены в <literal>enum ECPGttype</literal> в <literal>ecpgtype.h</literal>.

source: Contains the binary length of the field. e.g. 4 bytes for <type>ECPGt_int</type>.
ru: Содержит двоичную длину поля, например, 4 байта для <type>ECPGt_int</type>.

source: Points to the data. The format of the data is described in <xref linkend="ecpg-variables-type-mapping"/>.
ru: Указывает на данные. Формат данных описан в <xref remap="6" linkend="ecpg-variables-type-mapping"/>.

source: Points to the null indicator. 0 means not null, -1 means null.
ru: Указывает на индикатор NULL. 0 соответствует значению не NULL, -1 — NULL.

source: The name of the field.
ru: Имя поля.

source: The structure type <type>sqlvar_t</type> holds a column value and metadata such as type and length. The definition of the type is: <placeholder-1/> The meaning of the fields is: <placeholder-2/>
ru: Тип структуры <type>sqlvar_t</type> содержит значение столбца и метаданные, в частности, тип и длину. Эта структура определяется так: <placeholder-1/> Её поля имеют следующее назначение: <placeholder-2/>

source: struct sqlname Structure
ru: Структура struct sqlname

source: Contains the length of the field name.
ru: Содержит длину имени поля.

source: Contains the actual field name.
ru: Содержит собственно имя поля.

source: A <type>struct sqlname</type> structure holds a column name. It is used as a member of the <type>sqlvar_t</type> structure. The definition of the structure is: <placeholder-1/> The meaning of the fields is: <placeholder-2/>
ru: Структура <type>struct sqlname</type> содержит имя столбца. Она включена в <type>sqlvar_t</type> в качестве члена. Эта структура определена так: <placeholder-1/> Её поля имеют следующее назначение: <placeholder-2/>

source: Retrieving a Result Set Using an SQLDA
ru: Получение набора результатов с применением SQLDA

source: The general steps to retrieve a query result set through an SQLDA are:
ru: Чтобы получить набор результатов запроса через SQLDA, нужно проделать примерно следующее:

source: Declare an <type>sqlda_t</type> structure to receive the result set.
ru: Объявить структуру <type>sqlda_t</type> для получения набора результатов.

source: Execute <command>FETCH</command>/<command>EXECUTE</command>/<command>DESCRIBE</command> commands to process a query specifying the declared SQLDA.
ru: Выполнить команды <command>FETCH</command>/<command>EXECUTE</command>/<command>DESCRIBE</command> для обработки запроса с указанной SQLDA.

source: Check the number of records in the result set by looking at <structfield>sqln</structfield>, a member of the <type>sqlda_t</type> structure.
ru: Определить число записей в наборе результатов, прочитав <structfield>sqln</structfield>, член структуры <type>sqlda_t</type>.

source: Get the values of each column from <literal>sqlvar[0]</literal>, <literal>sqlvar[1]</literal>, etc., members of the <type>sqlda_t</type> structure.
ru: Получить значения каждого столбца из элементов <literal>sqlvar[0]</literal>, <literal>sqlvar[1]</literal> и т. д., составляющих массив, включённый в структуру <type>sqlda_t</type>.

source: Go to next row (<type>sqlda_t</type> structure) by following the <structfield>desc_next</structfield> pointer, a member of the <type>sqlda_t</type> structure.
ru: Перейти к следующей строке (структуре <type>sqlda_t</type>) по указателю <structfield>desc_next</structfield>, члену структуры <type>sqlda_t</type>.

source: Repeat above as you need.
ru: При необходимости повторить эти действия.

source: Here is an example retrieving a result set through an SQLDA.
ru: Далее показывается, как получить набор результатов через SQLDA.

source: First, declare a <type>sqlda_t</type> structure to receive the result set. <placeholder-1/>
ru: Сначала объявите структуру <type>sqlda_t</type>, в которую будет помещён набор результатов. <placeholder-1/>

source: Next, specify the SQLDA in a command. This is a <command>FETCH</command> command example. <placeholder-1/>
ru: Затем укажите эту SQLDA в команде. В данном примере это команда <command>FETCH</command>. <placeholder-1/>

source: Run a loop following the linked list to retrieve the rows. <placeholder-1/>
ru: Обработайте все строки в цикле с переходом по связанному списку. <placeholder-1/>

source: Inside the loop, run another loop to retrieve each column data (<type>sqlvar_t</type> structure) of the row. <placeholder-1/>
ru: Внутри этого цикла реализуйте ещё один цикл чтения данных каждого столбца (структуры <type>sqlvar_t</type>) в строке. <placeholder-1/>

source: To get a column value, check the <structfield>sqltype</structfield> value, a member of the <type>sqlvar_t</type> structure. Then, switch to an appropriate way, depending on the column type, to copy data from the <structfield>sqlvar</structfield> field to a host variable. <placeholder-1/>
ru: Чтобы получить значение столбца, прочитайте значение поля <structfield>sqltype</structfield>, члена структуры <type>sqlvar_t</type>. Затем выберите подходящий способ, в зависимости от типа столбца, копирования данных из поля <structfield>sqlvar</structfield> в переменную среды. <placeholder-1/>

source: Passing Query Parameters Using an SQLDA
ru: Передача значений параметров через SQLDA

source: The general steps to use an SQLDA to pass input parameters to a prepared query are:
ru: Чтобы передать параметры подготовленному запросу через SQLDA, нужно проделать примерно следующее:

source: Create a prepared query (prepared statement)
ru: Создать подготовленный запрос (подготовленный оператор)

source: Declare a sqlda_t structure as an input SQLDA.
ru: Объявить структуру sqlda_t в качестве входной SQLDA.

source: Allocate memory area (as sqlda_t structure) for the input SQLDA.
ru: Выделить область памяти (структуру sqlda_t) для входной SQLDA.

source: Set (copy) input values in the allocated memory.
ru: Установить (скопировать) входные значения в выделенной памяти.

source: Open a cursor with specifying the input SQLDA.
ru: Открыть курсор, указав входную SQLDA.

source: Here is an example.
ru: Рассмотрим это на примере.
