Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: If a statement returns a single row, the application can call <literal>EXECUTE</literal> after <literal>PREPARE</literal> to execute the statement, supplying the actual values for the placeholders with a <literal>USING</literal> clause: <placeholder-1/>
ru: Если оператор возвращает одну строку, приложение может вызвать <literal>EXECUTE</literal> после <literal>PREPARE</literal> для выполнения этого оператора, указав фактические значения для местозаполнителей в предложении <literal>USING</literal>: <placeholder-1/>

source: EXEC SQL PREPARE stmt1 FROM "SELECT oid,datname FROM pg_database WHERE oid &gt; ?"; EXEC SQL DECLARE foo_bar CURSOR FOR stmt1; /* when end of result set reached, break out of while loop */ EXEC SQL WHENEVER NOT FOUND DO BREAK; EXEC SQL OPEN foo_bar USING 100; ... while (1) { EXEC SQL FETCH NEXT FROM foo_bar INTO :dboid, :dbname; ... } EXEC SQL CLOSE foo_bar;
ru: EXEC SQL PREPARE stmt1 FROM "SELECT oid,datname FROM pg_database WHERE oid &gt; ?"; EXEC SQL DECLARE foo_bar CURSOR FOR stmt1; /* по достижении конца набора результатов прервать цикл while */ EXEC SQL WHENEVER NOT FOUND DO BREAK; EXEC SQL OPEN foo_bar USING 100; ... while (1) { EXEC SQL FETCH NEXT FROM foo_bar INTO :dboid, :dbname; ... } EXEC SQL CLOSE foo_bar;

source: If a statement returns multiple rows, the application can use a cursor declared based on the prepared statement. To bind input parameters, the cursor must be opened with a <literal>USING</literal> clause: <placeholder-1/>
ru: Если оператор возвращает несколько строк, приложение может использовать курсор, объявленный на базе подготовленного оператора. Чтобы привязать входные параметры, курсор нужно открыть с предложением <literal>USING</literal>: <placeholder-1/>

source: EXEC SQL DEALLOCATE PREPARE <replaceable>name</replaceable>;
ru: EXEC SQL DEALLOCATE PREPARE <replaceable>имя</replaceable>;

source: When you don't need the prepared statement anymore, you should deallocate it: <placeholder-1/>
ru: Когда подготовленный оператор больше не нужен, его следует освободить: <placeholder-1/>

source: For more details about <literal>PREPARE</literal>, see <xref linkend="ecpg-sql-prepare"/>. Also see <xref linkend="ecpg-dynamic"/> for more details about using placeholders and input parameters.
ru: Подробнее оператор <literal>PREPARE</literal> описан в <xref remap="6" linkend="ecpg-sql-prepare"/>. Также обратитесь к <xref remap="3" linkend="ecpg-dynamic"/> за дополнительными сведениями о местозаполнителях и входных параметрах.

source: Using Host Variables
ru: Использование переменных среды

source: In <xref linkend="ecpg-commands"/> you saw how you can execute SQL statements from an embedded SQL program. Some of those statements only used fixed values and did not provide a way to insert user-supplied values into statements or have the program process the values returned by the query. Those kinds of statements are not really useful in real applications. This section explains in detail how you can pass data between your C program and the embedded SQL statements using a simple mechanism called <firstterm>host variables</firstterm>. In an embedded SQL program we consider the SQL statements to be <firstterm>guests</firstterm> in the C program code which is the <firstterm>host language</firstterm>. Therefore the variables of the C program are called <firstterm>host variables</firstterm>.
ru: В <xref remap="6" linkend="ecpg-commands"/> вы увидели, как можно выполнять операторы SQL в программе со встраиваемым SQL. Некоторые из этих операторов использовали только фиксированные значения и не давали возможности вставлять в операторы произвольные значения или обрабатывать значения, возвращённые запросом. Операторы такого вида не очень полезны в реальных приложениях. В этом разделе подробно описывается, как можно передавать данные между программой на C и встраиваемыми операторами SQL, используя простой механизм, так называемые <firstterm>переменные среды</firstterm>. В программе со встраиваемым SQL мы считаем SQL-операторы <firstterm>внедрёнными</firstterm> в код программы на C, <firstterm>языке среды</firstterm>. Таким образом, переменные программы на C называются <firstterm>переменными среды</firstterm>.

source: Another way to exchange values between PostgreSQL backends and ECPG applications is the use of SQL descriptors, described in <xref linkend="ecpg-descriptors"/>.
ru: Ещё один способ передать значения данных между сервером PostgreSQL и приложениями ECPG заключается в использовании дескрипторов SQL, как описано в <xref remap="6" linkend="ecpg-descriptors"/>.

source: Overview
ru: Обзор

source: Passing data between the C program and the SQL statements is particularly simple in embedded SQL. Instead of having the program paste the data into the statement, which entails various complications, such as properly quoting the value, you can simply write the name of a C variable into the SQL statement, prefixed by a colon. For example: <placeholder-1/> This statement refers to two C variables named <varname>v1</varname> and <varname>v2</varname> and also uses a regular SQL string literal, to illustrate that you are not restricted to use one kind of data or the other.
ru: Передавать данные между программой C и операторами SQL во встраиваемом SQL очень просто. Вместо того, чтобы вставлять данные в оператор, что влечёт дополнительные усложнения, в частности нужно правильно заключать значения в кавычки, можно просто записать имя переменной C в операторе SQL, предварив его двоеточием. Например: <placeholder-1/> Этот оператор обращается к двум переменным C с именами <varname>v1</varname> и <varname>v2</varname> и также использует обычную строковую константу SQL, показывая тем самым, что можно свободно сочетать разные виды данных.

source: This style of inserting C variables in SQL statements works anywhere a value expression is expected in an SQL statement.
ru: Этот метод включения переменных C в операторы SQL работает везде, где оператор SQL принимает выражение значения.

source: Declare Sections
ru: Секции объявлений

source: To pass data from the program to the database, for example as parameters in a query, or to pass data from the database back to the program, the C variables that are intended to contain this data need to be declared in specially marked sections, so the embedded SQL preprocessor is made aware of them.
ru: Чтобы передать данные из программы в базу данных, например, в виде параметров запроса, либо получить данные из базы данных в программе, переменные C, которые должны содержать эти данные, нужно объявить в специально помеченных секциях, чтобы препроцессор встраиваемого SQL знал о них.

source: This section starts with: <placeholder-1/> and ends with: <placeholder-2/> Between those lines, there must be normal C variable declarations, such as: <placeholder-3/> As you can see, you can optionally assign an initial value to the variable. The variable's scope is determined by the location of its declaring section within the program. You can also declare variables with the following syntax which implicitly creates a declare section: <placeholder-4/> You can have as many declare sections in a program as you like.
ru: Секция начинается с: <placeholder-1/> и заканчивается командой: <placeholder-2/> Между этими строками должны располагаться обычные объявления переменных C, например: <placeholder-3/> Как здесь показано, переменной можно присвоить начальное значение. Область видимости переменной определяется расположением секции, в которой она объявляется в программе. Вы также можете объявить переменную следующим образом (при этом неявно создаётся секция объявлений): <placeholder-4/> Вы можете включать в программу столько секций объявлений, сколько захотите.

source: The declarations are also echoed to the output file as normal C variables, so there's no need to declare them again. Variables that are not intended to be used in SQL commands can be declared normally outside these special sections.
ru: Эти объявления выводятся в результирующий файл как объявления обычных переменных C, так что эти переменные не нужно объявлять снова. Переменные, которые не предназначены для использования в командах SQL, можно объявить как обычно вне этих специальных секций.

source: The definition of a structure or union also must be listed inside a <literal>DECLARE</literal> section. Otherwise the preprocessor cannot handle these types since it does not know the definition.
ru: Определение структуры или объединения тоже должно размещаться в секции <literal>DECLARE</literal>. В противном случае препроцессор не сможет воспринять эти типы, так как не будет знать их определения.

source: Retrieving Query Results
ru: Получение результатов запроса

source: Now you should be able to pass data generated by your program into an SQL command. But how do you retrieve the results of a query? For that purpose, embedded SQL provides special variants of the usual commands <command>SELECT</command> and <command>FETCH</command>. These commands have a special <literal>INTO</literal> clause that specifies which host variables the retrieved values are to be stored in. <command>SELECT</command> is used for a query that returns only single row, and <command>FETCH</command> is used for a query that returns multiple rows, using a cursor.
ru: Теперь вы умеете передавать данные, подготовленные вашей программой, в команду SQL. Но как получить результаты запроса? Для этой цели во встраиваемом SQL есть особые вариации обычных команд <command>SELECT</command> и <command>FETCH</command>. У этих команд есть специальное предложение <literal>INTO</literal>, определяющее, в какие переменные среды будут помещены получаемые значения. <command>SELECT</command> используется для запросов, возвращающих только одну строку, а <command>FETCH</command> применяется с курсором для запросов, возвращающих несколько строк.

source: /* * assume this table: * CREATE TABLE test1 (a int, b varchar(50)); */ EXEC SQL BEGIN DECLARE SECTION; int v1; VARCHAR v2; EXEC SQL END DECLARE SECTION; ... EXEC SQL SELECT a, b INTO :v1, :v2 FROM test;
ru: /* * предполагается существование такой таблицы: * CREATE TABLE test1 (a int, b varchar(50)); */ EXEC SQL BEGIN DECLARE SECTION; int v1; VARCHAR v2; EXEC SQL END DECLARE SECTION; ... EXEC SQL SELECT a, b INTO :v1, :v2 FROM test;

source: Here is an example: <placeholder-1/> So the <literal>INTO</literal> clause appears between the select list and the <literal>FROM</literal> clause. The number of elements in the select list and the list after <literal>INTO</literal> (also called the target list) must be equal.
ru: Пример: <placeholder-1/> Предложение <literal>INTO</literal> размещается между списком выборки и предложением <literal>FROM</literal>. Число элементов в списке выборки должно равняться числу элементов в списке после <literal>INTO</literal> (также называемом целевым списком).

source: Here is an example using the command <command>FETCH</command>: <placeholder-1/> Here the <literal>INTO</literal> clause appears after all the normal clauses.
ru: Следующий пример демонстрирует использование команды <command>FETCH</command>: <placeholder-1/> Здесь предложение <literal>INTO</literal> размещается после всех остальных обычных предложений.

source: Type Mapping
ru: Сопоставление типов

source: When ECPG applications exchange values between the PostgreSQL server and the C application, such as when retrieving query results from the server or executing SQL statements with input parameters, the values need to be converted between PostgreSQL data types and host language variable types (C language data types, concretely). One of the main points of ECPG is that it takes care of this automatically in most cases.
ru: Когда приложения ECPG передают данные между сервером PostgreSQL и программой на C, например, получая результаты запроса с сервера или выполняя операторы SQL с входными параметрам, эти данные должны преобразовываться из типов PostgreSQL в типы переменных языка среды (а именно типы языка C) и наоборот. Одно из главных качеств ECPG состоит в том, что в большинстве случаев он делает это автоматически.

source: In this respect, there are two kinds of data types: Some simple PostgreSQL data types, such as <type>integer</type> and <type>text</type>, can be read and written by the application directly. Other PostgreSQL data types, such as <type>timestamp</type> and <type>numeric</type> can only be accessed through special library functions; see <xref linkend="ecpg-special-types"/>.
ru: В этом отношении можно выделить два вида типов данных. К первому относятся простые типы данных PostgreSQL, такие как <type>integer</type> и <type>text</type>, которые приложение может непосредственно читать и писать. С другими типами данных, такими как <type>timestamp</type> и <type>numeric</type>, можно работать только через специальные функции; см. <xref remap="4" linkend="ecpg-special-types"/>.

source: <xref linkend="ecpg-datatype-hostvars-table"/> shows which PostgreSQL data types correspond to which C data types. When you wish to send or receive a value of a given PostgreSQL data type, you should declare a C variable of the corresponding C data type in the declare section.
ru: В <xref remap="6" linkend="ecpg-datatype-hostvars-table"/> показано, как типы данных PostgreSQL соответствуют типам данных C. Когда нужно передать или получить значение определённого типа данных PostgreSQL, вы должны объявить переменную C соответствующего типа C в секции объявлений.

source: Mapping Between PostgreSQL Data Types and C Variable Types
ru: Соответствие между типами данных PostgreSQL и типами переменных C

source: PostgreSQL data type
ru: Тип данных PostgreSQL

source: Host variable type
ru: Тип переменной среды

source: This type can only be accessed through special library functions; see <xref linkend="ecpg-special-types"/>.
ru: С этим типом можно работать только через специальные функции; см. <xref remap="4" linkend="ecpg-special-types"/>.

source: declared in <filename>ecpglib.h</filename>
ru: объявляется в <filename>ecpglib.h</filename>

source: declared in <filename>ecpglib.h</filename> if not native
ru: объявляется в <filename>ecpglib.h</filename> при отсутствии стандартного объявления

source: Handling Character Strings
ru: Работа с символьными строками

source: To handle SQL character string data types, such as <type>varchar</type> and <type>text</type>, there are two possible ways to declare the host variables.
ru: Для обработки типов символьных строк SQL, таких как <type>varchar</type> и <type>text</type>, предлагаются два варианта объявления переменных среды.

source: One way is using <type>char[]</type>, an array of <type>char</type>, which is the most common way to handle character data in C. <placeholder-1/> Note that you have to take care of the length yourself. If you use this host variable as the target variable of a query which returns a string with more than 49 characters, a buffer overflow occurs.
ru: Первый способ заключается в использовании <type>char[]</type>, массива <type>char</type>, как чаще всего и представляются символьные данные в C. <placeholder-1/> Заметьте, что о длине этого массива вы должны подумать сами. Если вы укажете данную переменную среды в качестве целевой переменной запроса, возвращающего строку длиннее 49 символов, произойдёт переполнение буфера.

source: The other way is using the <type>VARCHAR</type> type, which is a special type provided by ECPG. The definition on an array of type <type>VARCHAR</type> is converted into a named <type>struct</type> for every variable. A declaration like: <placeholder-1/> is converted into: <placeholder-2/> The member <structfield>arr</structfield> hosts the string including a terminating zero byte. Thus, to store a string in a <type>VARCHAR</type> host variable, the host variable has to be declared with the length including the zero byte terminator. The member <structfield>len</structfield> holds the length of the string stored in the <structfield>arr</structfield> without the terminating zero byte. When a host variable is used as input for a query, if <literal>strlen(arr)</literal> and <structfield>len</structfield> are different, the shorter one is used.
ru: В качестве другого подхода можно использовать специальный тип <type>VARCHAR</type>, представленный в ECPG. Определение массива типа <type>VARCHAR</type> преобразуется в структуру (<type>struct</type>) с собственным именем для каждой переменной. Объявление вида: <placeholder-1/> преобразуется в: <placeholder-2/> Член структуры <structfield>arr</structfield> содержит строку, включающую завершающий нулевой байт. Таким образом, чтобы сохранить строку в переменной типа <type>VARCHAR</type>, эта переменная должна быть объявлена с длиной, учитывающей завершающий нулевой байт. Член структуры <structfield>len</structfield> содержит длину строки, сохранённой в <structfield>arr</structfield>, без завершающего нулевого байта. Когда на вход запросу подаётся переменная среды, у которой <literal>strlen(arr)</literal> отличается от <structfield>len</structfield>, применяется наименьшее значение.

source: <type>VARCHAR</type> can be written in upper or lower case, but not in mixed case.
ru: <type>VARCHAR</type> можно записать в верхнем или нижнем регистре, но не в смешанном.

source: <type>char</type> and <type>VARCHAR</type> host variables can also hold values of other SQL types, which will be stored in their string forms.
ru: Переменные <type>char</type> и <type>VARCHAR</type> также могут содержать значения других типов SQL в их строковом представлении.

source: Accessing Special Data Types
ru: Обработка специальных типов данных

source: ECPG contains some special types that help you to interact easily with some special data types from the PostgreSQL server. In particular, it has implemented support for the <type>numeric</type>, <type>decimal</type>, <type>date</type>, <type>timestamp</type>, and <type>interval</type> types. These data types cannot usefully be mapped to primitive host variable types (such as <type>int</type>, <type>long long int</type>, or <type>char[]</type>), because they have a complex internal structure. Applications deal with these types by declaring host variables in special types and accessing them using functions in the pgtypes library. The pgtypes library, described in detail in <xref linkend="ecpg-pgtypes"/> contains basic functions to deal with those types, such that you do not need to send a query to the SQL server just for adding an interval to a time stamp for example.
ru: ECPG представляет некоторые особые типы, которые должны помочь вам легко оперировать некоторыми специальными типами данных PostgreSQL. В частности, в нём реализована поддержка типов <type>numeric</type>, <type>decimal</type>, <type>date</type>, <type>timestamp</type> и <type>interval</type>. Для этих типов нельзя подобрать полезное соответствие с примитивными типами среды (например, <type>int</type>, <type>long long int</type> или <type>char[]</type>), так как они имеют сложную внутреннюю структуру. Приложения, работающие с этими типами, должны объявлять переменные особых типов и работать с ними, применяя функции из библиотеки pgtypes. Эта библиотека, подробно описанная в <xref remap="6" linkend="ecpg-pgtypes"/> содержит базовые функции для оперирования этими типами, чтобы вам не требовалось, например, передавать запрос SQL-серверу, когда нужно просто добавить интервал к значению времени.

source: The follow subsections describe these special data types. For more details about pgtypes library functions, see <xref linkend="ecpg-pgtypes"/>.
ru: Эти особые типы данных описаны в следующих подразделах. Чтобы подробнее узнать о функциях в библиотеке pgtypes, обратитесь к <xref remap="3" linkend="ecpg-pgtypes"/>.

source: Here is a pattern for handling <type>timestamp</type> variables in the ECPG host application.
ru: Для работы с переменными <type>timestamp</type> в приложении ECPG применяется следующая схема.

source: First, the program has to include the header file for the <type>timestamp</type> type: <placeholder-1/>
ru: Сначала в программу нужно включить заголовочный файл, чтобы получить определение типа <type>timestamp</type>: <placeholder-1/>

source: Next, declare a host variable as type <type>timestamp</type> in the declare section: <placeholder-1/>
ru: Затем объявите в секции объявлений переменную типа <type>timestamp</type>: <placeholder-1/>

source: And after reading a value into the host variable, process it using pgtypes library functions. In following example, the <type>timestamp</type> value is converted into text (ASCII) form with the <function>PGTYPEStimestamp_to_asc()</function> function: <placeholder-1/> This example will show some result like following: <screen> ts = 2010-06-27 18:03:56.949343 </screen>
ru: Прочитав значение в эту переменную, выполняйте действия с ним, используя функции в библиотеке pgtypes. В следующем примере значение <type>timestamp</type> преобразуется в текстовый вид (ASCII) с помощью функции <function>PGTYPEStimestamp_to_asc()</function>: <placeholder-1/> Этот пример выведет такой результат: <screen> ts = 2010-06-27 18:03:56.949343 </screen>

source: In addition, the DATE type can be handled in the same way. The program has to include <filename>pgtypes_date.h</filename>, declare a host variable as the date type and convert a DATE value into a text form using <function>PGTYPESdate_to_asc()</function> function. For more details about the pgtypes library functions, see <xref linkend="ecpg-pgtypes"/>.
ru: Таким же образом можно работать и с типом DATE. В программу нужно включить <filename>pgtypes_date.h</filename>, объявить переменную типа date, и затем можно будет преобразовать значение DATE в текстовый вид, используя функцию <function>PGTYPESdate_to_asc()</function>. Чтобы подробнее узнать о функциях в библиотеке pgtypes, обратитесь к <xref remap="3" linkend="ecpg-pgtypes"/>.

source: The handling of the <type>interval</type> type is also similar to the <type>timestamp</type> and <type>date</type> types. It is required, however, to allocate memory for an <type>interval</type> type value explicitly. In other words, the memory space for the variable has to be allocated in the heap memory, not in the stack memory.
ru: Принцип работы с типом <type>interval</type> тот же, что и с типами <type>timestamp</type> и <type>date</type>, однако для значения типа <type>interval</type> нужно явно выделить память. Другими словами, блок памяти для этой переменной должен размещаться в области кучи, а не в стеке.

source: Here is an example program: <placeholder-1/>
ru: Пример программы: <placeholder-1/>

source: The handling of the <type>numeric</type> and <type>decimal</type> types is similar to the <type>interval</type> type: It requires defining a pointer, allocating some memory space on the heap, and accessing the variable using the pgtypes library functions. For more details about the pgtypes library functions, see <xref linkend="ecpg-pgtypes"/>.
ru: Типы <type>numeric</type> и <type>decimal</type> обрабатываются так же, как и тип <type>interval</type>: вы должны определить указатель, выделить некоторое пространство памяти в куче и обращаться к переменной, используя функции в библиотеке pgtypes. Чтобы подробнее узнать о функциях в библиотеке pgtypes, обратитесь к <xref remap="3" linkend="ecpg-pgtypes"/>.

source: No functions are provided specifically for the <type>decimal</type> type. An application has to convert it to a <type>numeric</type> variable using a pgtypes library function to do further processing.
ru: Для типа <type>decimal</type> никакие специальные функции не реализованы. Для дальнейшей обработки приложение должно преобразовать его в переменную <type>numeric</type>, применив функцию из библиотеки pgtypes.
