Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: <application>ECPG</application> - Embedded <acronym>SQL</acronym> in C
ru: <application>ECPG</application> — встраиваемый <acronym>SQL</acronym> в C

source: <primary>embedded SQL</primary><secondary>in C</secondary>
ru: <primary>встраиваемый SQL</primary> <secondary>в C</secondary>

source: This chapter describes the embedded <acronym>SQL</acronym> package for <productname>PostgreSQL</productname>. It was written by Linus Tolke (<email>linus@epact.se</email>) and Michael Meskes (<email>meskes@postgresql.org</email>). Originally it was written to work with <acronym>C</acronym>. It also works with <acronym>C++</acronym>, but it does not recognize all <acronym>C++</acronym> constructs yet.
ru: В этой главе описывается встраиваемый <acronym>SQL</acronym> для <productname>PostgreSQL</productname>. Авторы этой разработки: Линус Толке (<email>linus@epact.se</email>) и Михаэль Мескес (<email>meskes@postgresql.org</email>). Изначально этот проект предназначался для <acronym>C</acronym>. Сейчас он также работает с <acronym>C++</acronym>, но пока не распознаёт все конструкции <acronym>C++</acronym>.

source: This documentation is quite incomplete. But since this interface is standardized, additional information can be found in many resources about SQL.
ru: Эта документация не абсолютно полная, но так как этот интерфейс стандартизирован, дополнительные сведения можно почерпнуть во многих ресурсах, посвящённых SQL.

source: The Concept
ru: Концепция

source: An embedded SQL program consists of code written in an ordinary programming language, in this case C, mixed with SQL commands in specially marked sections. To build the program, the source code (<filename>*.pgc</filename>) is first passed through the embedded SQL preprocessor, which converts it to an ordinary C program (<filename>*.c</filename>), and afterwards it can be processed by a C compiler. (For details about the compiling and linking see <xref linkend="ecpg-process"/>). Converted ECPG applications call functions in the libpq library through the embedded SQL library (ecpglib), and communicate with the PostgreSQL server using the normal frontend-backend protocol.
ru: Программа со встраиваемым SQL состоит из кода, написанного на обычном языке программирования, в данном случае, С, дополненного командами SQL в специально обозначенных секциях. Чтобы собрать программу, её исходный код (<filename>*.pgc</filename>) сначала нужно пропустить через препроцессор встраиваемого SQL, который превратит её в обычную программу на C (<filename>*.c</filename>), которую затем сможет обработать компилятор C. (Подробнее компиляция и компоновка описывается в <xref remap="6" linkend="ecpg-process"/>). Преобразованные приложения ECPG вызывают функции в библиотеке libpq через библиотеку встраиваемого SQL (ecpglib) и взаимодействуют с сервером PostgreSQL по обычному клиент-серверному протоколу.

source: Embedded <acronym>SQL</acronym> has advantages over other methods for handling <acronym>SQL</acronym> commands from C code. First, it takes care of the tedious passing of information to and from variables in your <acronym>C</acronym> program. Second, the SQL code in the program is checked at build time for syntactical correctness. Third, embedded <acronym>SQL</acronym> in C is specified in the <acronym>SQL</acronym> standard and supported by many other <acronym>SQL</acronym> database systems. The <productname>PostgreSQL</productname> implementation is designed to match this standard as much as possible, and it is usually possible to port embedded <acronym>SQL</acronym> programs written for other SQL databases to <productname>PostgreSQL</productname> with relative ease.
ru: Встраиваемый <acronym>SQL</acronym> имеет ряд преимуществ по сравнению с другими методами вызова команд <acronym>SQL</acronym> из кода C. Во-первых, этот механизм берёт на себя заботу о передаче информации через переменные в программе на <acronym>C</acronym>. Во-вторых, код SQL в программе проверяется на синтаксическую правильность во время сборки. В-третьих, встраиваемый <acronym>SQL</acronym> в C описан стандартом <acronym>SQL</acronym> и поддерживается многими другими СУБД <acronym>SQL</acronym>. Реализация в <productname>PostgreSQL</productname> разработана так, чтобы максимально соответствовать этому стандарту, поэтому обычно достаточно легко портировать в <productname>PostgreSQL</productname> программы с встраиваемым <acronym>SQL</acronym>, написанные для других СУБД.

source: As already stated, programs written for the embedded <acronym>SQL</acronym> interface are normal C programs with special code inserted to perform database-related actions. This special code always has the form: <placeholder-1/> These statements syntactically take the place of a C statement. Depending on the particular statement, they can appear at the global level or within a function. Embedded <acronym>SQL</acronym> statements follow the case-sensitivity rules of normal <acronym>SQL</acronym> code, and not those of C. Also they allow nested C-style comments that are part of the SQL standard. The C part of the program, however, follows the C standard of not accepting nested comments.
ru: Как уже сказано, программы, написанные для интерфейса встраиваемого <acronym>SQL</acronym>, представляют собой обычные программы на C с добавленным специальным кодом, который выполняет действия, связанные с базой данных. Этот специальный код всегда имеет следующую форму: <placeholder-1/> Такие операторы синтаксически занимают место операторов C. В зависимости от конкретного оператора, они могут размещаться на глобальном уровне или внутри функции. Встраиваемые операторы <acronym>SQL</acronym> следуют правилам учёта регистра, принятым в обычном коде <acronym>SQL</acronym>, а не в C. Они также допускают вложенные комментарии в стиле C, разрешённые стандартом SQL. Однако остальная часть программы, написанная на C, в соответствии со стандартом C содержать вложенные комментарии не может.

source: The following sections explain all the embedded SQL statements.
ru: Все встраиваемые операторы SQL рассматриваются в следующих разделах.

source: Managing Database Connections
ru: Управление подключениями к базе данных

source: This section describes how to open, close, and switch database connections.
ru: В этом разделе описывается, как открывать, закрывать и переключать подключения к базам данных.

source: Connecting to the Database Server
ru: Подключение к серверу баз данных

source: EXEC SQL CONNECT TO <replaceable>target</replaceable> <optional>AS <replaceable>connection-name</replaceable></optional> <optional>USER <replaceable>user-name</replaceable></optional>;
ru: EXEC SQL CONNECT TO <replaceable>цель-подключения</replaceable> <optional>AS <replaceable>имя-подключения</replaceable></optional> <optional>USER <replaceable>имя-пользователя</replaceable></optional>;

source: dbname
ru: имя_бд

source: hostname
ru: имя_сервера

source: port
ru: порт

source: options
ru: параметры

source: an SQL string literal containing one of the above forms
ru: строковая константа SQL, содержащая одну из вышеприведённых записей

source: a reference to a character variable containing one of the above forms (see examples)
ru: ссылка на символьную переменную, содержащую одну из вышеприведённых записей (см. примеры)

source: One connects to a database using the following statement: <placeholder-1/> The <replaceable>target</replaceable> can be specified in the following ways: <placeholder-2/> If you specify the connection target literally (that is, not through a variable reference) and you don't quote the value, then the case-insensitivity rules of normal SQL are applied. In that case you can also double-quote the individual parameters separately as needed. In practice, it is probably less error-prone to use a (single-quoted) string literal or a variable reference. The connection target <literal>DEFAULT</literal> initiates a connection to the default database under the default user name. No separate user name or connection name can be specified in that case.
ru: Подключение к базе данных выполняется следующим оператором: <placeholder-1/> <replaceable>Цель</replaceable> может задаваться следующими способами: <placeholder-2/> Если цель подключения задаётся буквально (то есть не через переменную) и значение не заключается в кавычки, регистр в этой строке не учитывается, как в обычном SQL. В этом случае при необходимости также можно заключить в двойные кавычки отдельные параметры. На практике, чтобы не провоцировать ошибки, лучше заключать строку в апострофы, либо передавать её в переменной. С целью подключения <literal>DEFAULT</literal> устанавливается подключение к базе данных по умолчанию с именем пользователя по умолчанию. Другое имя пользователя или имя подключения в этом случае указать нельзя.

source: username
ru: имя_пользователя

source: password
ru: пароль

source: There are also different ways to specify the user name: <placeholder-1/> As above, the parameters <replaceable>username</replaceable> and <replaceable>password</replaceable> can be an SQL identifier, an SQL string literal, or a reference to a character variable.
ru: Также разными способами можно указать имя пользователя: <placeholder-1/> В показанных выше строках <replaceable>имя_пользователя</replaceable> и <replaceable>пароль</replaceable> могут задаваться идентификатором или строковой константой SQL, либо ссылкой на символьную переменную.

source: The <replaceable>connection-name</replaceable> is used to handle multiple connections in one program. It can be omitted if a program uses only one connection. The most recently opened connection becomes the current connection, which is used by default when an SQL statement is to be executed (see later in this chapter).
ru: Указание <replaceable>имя-подключения</replaceable> применяется, когда в одной программе нужно использовать несколько подключений. Его можно опустить, если программа работает только с одним подключением. Соединение, открытое последним, становится текущим и будет использоваться по умолчанию при выполнении операторов SQL (это описывается далее в этой главе).

source: EXEC SQL CONNECT TO mydb@sql.mydomain.com; EXEC SQL CONNECT TO unix:postgresql://sql.mydomain.com/mydb AS myconnection USER john; EXEC SQL BEGIN DECLARE SECTION; const char *target = "mydb@sql.mydomain.com"; const char *user = "john"; const char *passwd = "secret"; EXEC SQL END DECLARE SECTION; ... EXEC SQL CONNECT TO :target USER :user USING :passwd; /* or EXEC SQL CONNECT TO :target USER :user/:passwd; */
ru: EXEC SQL CONNECT TO mydb@sql.mydomain.com; EXEC SQL CONNECT TO unix:postgresql://sql.mydomain.com/mydb AS myconnection USER john; EXEC SQL BEGIN DECLARE SECTION; const char *target = "mydb@sql.mydomain.com"; const char *user = "john"; const char *passwd = "secret"; EXEC SQL END DECLARE SECTION; ... EXEC SQL CONNECT TO :target USER :user USING :passwd; /* или EXEC SQL CONNECT TO :target USER :user/:passwd; */

source: Here are some examples of <command>CONNECT</command> statements: <placeholder-1/> The last form makes use of the variant referred to above as character variable reference. You will see in later sections how C variables can be used in SQL statements when you prefix them with a colon.
ru: Вот некоторые примеры оператора <command>CONNECT</command>: <placeholder-1/> В последней форме используется вариант, названный выше ссылкой на символьную переменную. В последующих разделах вы узнаете, как в SQL-операторах можно использовать переменные C, приставляя перед именем двоеточие.

source: Be advised that the format of the connection target is not specified in the SQL standard. So if you want to develop portable applications, you might want to use something based on the last example above to encapsulate the connection target string somewhere.
ru: Учтите, что формат цели подключения не описывается в стандарте SQL. Поэтому, если вы хотите разрабатывать переносимые приложения, имеет смысл применить подход, показанный в последнем примере, и сформировать строку подключения отдельно.

source: Choosing a Connection
ru: Выбор подключения

source: SQL statements in embedded SQL programs are by default executed on the current connection, that is, the most recently opened one. If an application needs to manage multiple connections, then there are two ways to handle this.
ru: SQL-операторы в программах со встраиваемым SQL по умолчанию выполняются с текущим подключением, то есть с подключением, которое было открыто последним. Если приложению нужно управлять несколькими подключениями, это можно сделать двумя способами.

source: EXEC SQL AT <replaceable>connection-name</replaceable> SELECT ...;
ru: EXEC SQL AT <replaceable>имя-подключения</replaceable> SELECT ...;

source: The first option is to explicitly choose a connection for each SQL statement, for example: <placeholder-1/> This option is particularly suitable if the application needs to use several connections in mixed order.
ru: Первый вариант — явно выбирать подключение для каждого SQL-оператора, например, так: <placeholder-1/> Этот вариант хорошо подходит для случаев, когда приложению нужно использовать несколько подключений в смешанном порядке.

source: If your application uses multiple threads of execution, they cannot share a connection concurrently. You must either explicitly control access to the connection (using mutexes) or use a connection for each thread.
ru: Если ваше приложение выполняется в нескольких потоках, они не могут использовать подключение одновременно. Поэтому вы должны либо явно управлять доступом (используя мьютексы), либо использовать отдельные подключения для каждого потока.

source: If your application uses multiple threads of execution, they cannot share a connection concurrently. You must either explicitly control access to the connection (using mutexes) or use a connection for each thread. If each thread uses its own connection, you will need to use the AT clause to specify which connection the thread will use.
ru: Если ваше приложение выполняется в нескольких потоках, они не могут использовать подключение одновременно. Поэтому вы должны либо явно управлять доступом (используя мьютексы), либо использовать отдельные подключения для каждого потока. Если для потока выделяется отдельное подключение, вам нужно будет добавить предложение AT и указать в нём подключение этого потока.

source: EXEC SQL SET CONNECTION <replaceable>connection-name</replaceable>;
ru: EXEC SQL SET CONNECTION <replaceable>имя-подключения</replaceable>;

source: The second option is to execute a statement to switch the current connection. That statement is: <placeholder-1/> This option is particularly convenient if many statements are to be executed on the same connection.
ru: Второй вариант — выполнять оператор, переключающий текущее подключение. Этот оператор записывается так: <placeholder-1/> Этот вариант особенно удобен, когда с одним подключением нужно выполнить несколько операторов.

source: Here is an example program managing multiple database connections: <placeholder-1/> This example would produce this output: <screen> current=testdb3 (should be testdb3) current=testdb2 (should be testdb2) current=testdb1 (should be testdb1) </screen>
ru: Следующий пример программы демонстрирует управление несколькими подключениями к базам данных: <placeholder-1/> Этот пример должен вывести следующее: <screen> current=testdb3 (should be testdb3) current=testdb2 (should be testdb2) current=testdb1 (should be testdb1) </screen>

source: Closing a Connection
ru: Закрытие подключения

source: EXEC SQL DISCONNECT <optional><replaceable>connection</replaceable></optional>;
ru: EXEC SQL DISCONNECT <optional><replaceable>подключение</replaceable></optional>;

source: connection-name
ru: имя-подключения

source: To close a connection, use the following statement: <placeholder-1/> The <replaceable>connection</replaceable> can be specified in the following ways: <placeholder-2/> If no connection name is specified, the current connection is closed.
ru: Чтобы закрыть подключение, примените следующий оператор: <placeholder-1/> <replaceable>Подключение</replaceable> можно задать следующими способами: <placeholder-2/> Если имя подключения не задано, закрывается текущее подключение.

source: It is good style that an application always explicitly disconnect from every connection it opened.
ru: Хорошим стилем считается, когда приложение явно закрывает каждое подключение, которое оно открыло.

source: Running SQL Commands
ru: Запуск команд SQL

source: Any SQL command can be run from within an embedded SQL application. Below are some examples of how to do that.
ru: В приложении со встраиваемым SQL можно запустить любую команду SQL. Ниже приведены несколько примеров, показывающих как это делать.

source: Executing SQL Statements
ru: Выполнение операторов SQL

source: Creating a table: <placeholder-1/>
ru: Создание таблицы: <placeholder-1/>

source: Inserting rows: <placeholder-1/>
ru: Добавление строк: <placeholder-1/>

source: Deleting rows: <placeholder-1/>
ru: Удаление строк: <placeholder-1/>

source: Updates: <placeholder-1/>
ru: Изменение: <placeholder-1/>

source: <literal>SELECT</literal> statements that return a single result row can also be executed using <literal>EXEC SQL</literal> directly. To handle result sets with multiple rows, an application has to use a cursor; see <xref linkend="ecpg-cursors"/> below. (As a special case, an application can fetch multiple rows at once into an array host variable; see <xref linkend="ecpg-variables-arrays"/>.)
ru: Операторы <literal>SELECT</literal>, возвращающие одну строку результата, также могут выполняться непосредственно командой <literal>EXEC SQL</literal>. Чтобы обработать наборы результатов с несколькими строками, приложение должно использовать курсоры; см. <xref remap="4" linkend="ecpg-cursors"/> ниже. (В отдельных случаях приложение может выбрать сразу несколько строк в переменную массива; см. <xref remap="4" linkend="ecpg-variables-arrays"/>.)

source: Single-row select: <placeholder-1/>
ru: Выборка одной строки: <placeholder-1/>

source: Also, a configuration parameter can be retrieved with the <literal>SHOW</literal> command: <placeholder-1/>
ru: Так же можно получить параметр конфигурации командой <literal>SHOW</literal>: <placeholder-1/>

source: The tokens of the form <literal>:<replaceable>something</replaceable></literal> are <firstterm>host variables</firstterm>, that is, they refer to variables in the C program. They are explained in <xref linkend="ecpg-variables"/>.
ru: Идентификаторы вида <literal>:<replaceable>имя</replaceable></literal> воспринимаются как <firstterm>переменные среды</firstterm>, то есть они ссылаются на переменные программы C. Они рассматриваются в <xref remap="6" linkend="ecpg-variables"/>.

source: Using Cursors
ru: Использование курсоров

source: To retrieve a result set holding multiple rows, an application has to declare a cursor and fetch each row from the cursor. The steps to use a cursor are the following: declare a cursor, open it, fetch a row from the cursor, repeat, and finally close it.
ru: Чтобы получить набор результатов, содержащий несколько строк, приложение должно объявить курсор и выбирать каждую строку через него. Использование курсора подразумевает следующие шаги: объявление курсора, открытие его, выборку строки через курсор, повторение предыдущего шага, и наконец, закрытие курсора.

source: Select using cursors: <placeholder-1/>
ru: Выборка с использованием курсоров: <placeholder-1/>

source: For more details about declaration of the cursor, see <xref linkend="ecpg-sql-declare"/>, and see <xref linkend="sql-fetch"/> for <literal>FETCH</literal> command details.
ru: Более подробно объявление курсора описывается в <xref remap="6" linkend="ecpg-sql-declare"/>, а команда <literal>FETCH</literal> описана в <xref remap="6" linkend="sql-fetch"/>.

source: The ECPG <command>DECLARE</command> command does not actually cause a statement to be sent to the PostgreSQL backend. The cursor is opened in the backend (using the backend's <command>DECLARE</command> command) at the point when the <command>OPEN</command> command is executed.
ru: Команда <command>DECLARE</command> в ECPG на самом деле не передаёт этот оператор серверу PostgreSQL. Курсор открывается на сервере (командой сервера <command>DECLARE</command>) в момент, когда выполняется команда <command>OPEN</command>.

source: Managing Transactions
ru: Управление транзакциями

source: In the default mode, statements are committed only when <command>EXEC SQL COMMIT</command> is issued. The embedded SQL interface also supports autocommit of transactions (similar to <application>psql</application>'s default behavior) via the <option>-t</option> command-line option to <command>ecpg</command> (see <xref linkend="app-ecpg"/>) or via the <literal>EXEC SQL SET AUTOCOMMIT TO ON</literal> statement. In autocommit mode, each command is automatically committed unless it is inside an explicit transaction block. This mode can be explicitly turned off using <literal>EXEC SQL SET AUTOCOMMIT TO OFF</literal>.
ru: В режиме по умолчанию операторы фиксируются только когда выполняется <command>EXEC SQL COMMIT</command>. Интерфейс встраиваемого SQL также поддерживает автофиксацию транзакций (так работает <application>libpq</application> по умолчанию); она включается аргументом командной строки <option>-t</option> программы <command>ecpg</command> (см. <xref remap="4" linkend="app-ecpg"/>) либо оператором <literal>EXEC SQL SET AUTOCOMMIT TO ON</literal>. В режиме автофиксации каждая команда фиксируется автоматически, если только она не помещена в явный блок транзакции. Этот режим можно выключить явным образом, выполнив <literal>EXEC SQL SET AUTOCOMMIT TO OFF</literal>.

source: Commit an in-progress transaction.
ru: Зафиксировать текущую транзакцию.

source: Roll back an in-progress transaction.
ru: Откатить текущую транзакцию.

source: transaction_id
ru: ид_транзакции

source: Prepare the current transaction for two-phase commit.
ru: Подготовить текущую транзакцию для двухфазной фиксации.

source: Commit a transaction that is in prepared state.
ru: Зафиксировать транзакцию в подготовленном состоянии.

source: Roll back a transaction that is in prepared state.
ru: Откатить транзакцию в подготовленном состоянии.

source: Enable autocommit mode.
ru: Включить режим автофиксации.

source: Disable autocommit mode. This is the default.
ru: Отключить режим автофиксации. По умолчанию он отключён.

source: The following transaction management commands are available: <placeholder-1/>
ru: Поддерживаются следующие команды управления транзакциями: <placeholder-1/>

source: Prepared Statements
ru: Подготовленные операторы

source: When the values to be passed to an SQL statement are not known at compile time, or the same statement is going to be used many times, then prepared statements can be useful.
ru: Когда значения, передаваемые оператору SQL, неизвестны во время компиляции, или один и тот же оператор будет использоваться многократно, могут быть полезны подготовленные операторы.

source: The statement is prepared using the command <literal>PREPARE</literal>. For the values that are not known yet, use the placeholder <quote><literal>?</literal></quote>: <placeholder-1/>
ru: Оператор подготавливается командой <literal>PREPARE</literal>. Вместо значений, которые ещё неизвестны, вставляются местозаполнители <quote><literal>?</literal></quote>: <placeholder-1/>
