Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: Note that <command>EXEC SQL INCLUDE</command> is <emphasis>not</emphasis> the same as: <placeholder-1/> because this file would not be subject to SQL command preprocessing. Naturally, you can continue to use the C <literal>#include</literal> directive to include other header files.
ru: Заметьте, что команда <command>EXEC SQL INCLUDE</command> <emphasis>не</emphasis> равнозначна включению: <placeholder-1/> так как во втором случае включаемый файл не проходит через препроцессор SQL-команд. Естественно, директиву C <literal>#include</literal> можно по-прежнему применять для включения других заголовочных файлов.

source: The include file name is case-sensitive, even though the rest of the <literal>EXEC SQL INCLUDE</literal> command follows the normal SQL case-sensitivity rules.
ru: Имя включаемого файла чувствительно к регистру, несмотря на то, что остальная команда <literal>EXEC SQL INCLUDE</literal> подчиняется обычным правилам чувствительности к регистру SQL.

source: The define and undef Directives
ru: Директивы define и undef

source: EXEC SQL DEFINE <replaceable>name</replaceable>; EXEC SQL DEFINE <replaceable>name</replaceable> <replaceable>value</replaceable>;
ru: EXEC SQL DEFINE <replaceable>имя</replaceable>; EXEC SQL DEFINE <replaceable>имя</replaceable> <replaceable>значение</replaceable>;

source: Similar to the directive <literal>#define</literal> that is known from C, embedded SQL has a similar concept: <placeholder-1/> So you can define a name: <placeholder-2/> And you can also define constants: <placeholder-3/> Use <literal>undef</literal> to remove a previous definition: <placeholder-4/>
ru: Во встраиваемом SQL есть конструкция, подобная директиве <literal>#define</literal>, известной в C: <placeholder-1/> Используя её, можно определить имя: <placeholder-2/> И также можно определить константы: <placeholder-3/> Удалить предыдущее определение позволяет команда <literal>undef</literal>: <placeholder-4/>

source: Of course you can continue to use the C versions <literal>#define</literal> and <literal>#undef</literal> in your embedded SQL program. The difference is where your defined values get evaluated. If you use <literal>EXEC SQL DEFINE</literal> then the <command>ecpg</command> preprocessor evaluates the defines and substitutes the values. For example if you write: <placeholder-1/> then <command>ecpg</command> will already do the substitution and your C compiler will never see any name or identifier <literal>MYNUMBER</literal>. Note that you cannot use <literal>#define</literal> for a constant that you are going to use in an embedded SQL query because in this case the embedded SQL precompiler is not able to see this declaration.
ru: Разумеется, в программе со встраиваемым SQL можно продолжать использовать версии <literal>#define</literal> и <literal>#undef</literal> языка C. Отличие состоит в том, когда вычисляются определяемые значения. Когда применяется команда <literal>EXEC SQL DEFINE</literal>, вычислять определения и подставлять значения будет препроцессор <command>ecpg</command>. Например, если написать: <placeholder-1/> подстановку выполнит <command>ecpg</command> и компилятор C никогда не увидит имени или идентификатора <literal>MYNUMBER</literal>. Заметьте, что с другой стороны <literal>#define</literal> не подходит для определения константы, которую вы хотите использовать во встраиваемом SQL, так как препроцессор встраиваемого SQL не сможет увидеть это определение.

source: ifdef, ifndef, else, elif, and endif Directives
ru: Директивы ifdef, ifndef, else, elif и endif

source: Checks a <replaceable>name</replaceable> and processes subsequent lines if <replaceable>name</replaceable> has been created with <literal>EXEC SQL define <replaceable>name</replaceable></literal>.
ru: Проверяет <replaceable>имя</replaceable> и обрабатывает последующие строки, если <replaceable>имя</replaceable> было определено командой <literal>EXEC SQL define <replaceable>имя</replaceable></literal>.

source: Checks a <replaceable>name</replaceable> and processes subsequent lines if <replaceable>name</replaceable> has <emphasis>not</emphasis> been created with <literal>EXEC SQL define <replaceable>name</replaceable></literal>.
ru: Проверяет <replaceable>имя</replaceable> и обрабатывает последующие строки, если <replaceable>имя</replaceable> <emphasis>не</emphasis> было определено командой <literal>EXEC SQL define <replaceable>имя</replaceable></literal>.

source: Starts processing an alternative section to a section introduced by either <literal>EXEC SQL ifdef <replaceable>name</replaceable></literal> or <literal>EXEC SQL ifndef <replaceable>name</replaceable></literal>.
ru: Начинает альтернативную ветвь условия, открытого командой <literal>EXEC SQL ifdef <replaceable>имя</replaceable></literal> или <literal>EXEC SQL ifndef <replaceable>имя</replaceable></literal>.

source: Checks <replaceable>name</replaceable> and starts an alternative section if <replaceable>name</replaceable> has been created with <literal>EXEC SQL define <replaceable>name</replaceable></literal>.
ru: Проверяет <replaceable>имя</replaceable> и начинает альтернативную ветвь условия, если <replaceable>имя</replaceable> было определено командой <literal>EXEC SQL define <replaceable>имя</replaceable></literal>.

source: Ends an alternative section.
ru: Завершает ветвь условия.

source: You can use the following directives to compile code sections conditionally: <placeholder-1/>
ru: Для условной компиляции блоков кода можно использовать следующие указания: <placeholder-1/>

source: Example: <placeholder-1/>
ru: Пример: <placeholder-1/>

source: Processing Embedded SQL Programs
ru: Компиляция программ со встраиваемым SQL

source: Now that you have an idea how to form embedded SQL C programs, you probably want to know how to compile them. Before compiling you run the file through the embedded <acronym>SQL</acronym> <acronym>C</acronym> preprocessor, which converts the <acronym>SQL</acronym> statements you used to special function calls. After compiling, you must link with a special library that contains the needed functions. These functions fetch information from the arguments, perform the <acronym>SQL</acronym> command using the <application>libpq</application> interface, and put the result in the arguments specified for output.
ru: Теперь, когда вы получили представление, как писать программы на C со встраиваемым SQL, вы наверное хотите узнать, как их компилировать. Прежде чем компилировать код C, необходимо пропустить исходный файл через препроцессор встраиваемого <acronym>SQL</acronym> в <acronym>C</acronym>, который преобразует записанные вами операторы <acronym>SQL</acronym> в вызовы специальных функций. После компиляции полученный объектный код нужно скомпоновать со специальной библиотекой, содержащей необходимые функции. Эти функции получают информацию из аргументов, выполняют команды <acronym>SQL</acronym> через интерфейс <application>libpq</application>, и помещают результат в аргументы, заданные для вывода.

source: The preprocessor program is called <filename>ecpg</filename> and is included in a normal <productname>PostgreSQL</productname> installation. Embedded SQL programs are typically named with an extension <filename>.pgc</filename>. If you have a program file called <filename>prog1.pgc</filename>, you can preprocess it by simply calling: <placeholder-1/> This will create a file called <filename>prog1.c</filename>. If your input files do not follow the suggested naming pattern, you can specify the output file explicitly using the <option>-o</option> option.
ru: Программа препроцессора называется <filename>ecpg</filename> и входит в состав обычной инсталляции <productname>PostgreSQL</productname>. Программам со встраиваемым SQL, как правило, даются имена с расширением <filename>.pgc</filename>. Если вы создали код программы в файле <filename>prog1.pgc</filename>, вы можете обработать его, просто выполнив: <placeholder-1/> При этом будет создан файл <filename>prog1.c</filename>. Если имена входных файлов не следуют этому соглашению, имя выходного файла можно задать явно в аргументе <option>-o</option>.

source: The preprocessed file can be compiled normally, for example: <placeholder-1/> The generated C source files include header files from the <productname>PostgreSQL</productname> installation, so if you installed <productname>PostgreSQL</productname> in a location that is not searched by default, you have to add an option such as <literal>-I/usr/local/pgsql/include</literal> to the compilation command line.
ru: Обработанный препроцессором файл можно скомпилировать обычным образом, например, так: <placeholder-1/> В сгенерированные исходные файлы C включаются заголовочные файлы из инсталляции <productname>PostgreSQL</productname>, поэтому если вы установили <productname>PostgreSQL</productname> так, что соответствующий каталог не просматривается по умолчанию, вам придётся добавить указание вида <literal>-I/usr/local/pgsql/include</literal> в командную строку компиляции.

source: To link an embedded SQL program, you need to include the <filename>libecpg</filename> library, like so: <placeholder-1/> Again, you might have to add an option like <literal>-L/usr/local/pgsql/lib</literal> to that command line.
ru: Чтобы скомпоновать программу со встраиваемым SQL, необходимо подключить библиотеку <filename>libecpg</filename> примерно так: <placeholder-1/> Возможно, и для этого понадобится добавить в командную строку указание вида <literal>-L/usr/local/pgsql/lib</literal>.

source: <primary>pg_config</primary><secondary sortas="ecpg">with ecpg</secondary>
ru: <primary>pg_config</primary> <secondary sortas="ecpg">с ecpg</secondary>

source: <primary>pkg-config</primary><secondary sortas="ecpg">with ecpg</secondary>
ru: <primary>pkg-config</primary> <secondary sortas="ecpg">с ecpg</secondary>

source: You can use <command>pg_config</command><placeholder-1/> or <command>pkg-config</command><placeholder-2/> with package name <literal>libecpg</literal> to get the paths for your installation.
ru: Чтобы узнать пути вашей инсталляции, можно воспользоваться командой <command>pg_config</command><placeholder-1/> или <command>pkg-config</command><placeholder-2/> (в качестве имени пакета нужно указать <literal>libecpg</literal>).

source: If you manage the build process of a larger project using <application>make</application>, it might be convenient to include the following implicit rule to your makefiles: <placeholder-1/>
ru: Если вы организуете процесс сборки большого проекта с применением <application>make</application>, может быть удобно включить в ваши сборочные файлы следующее неявное правило: <placeholder-1/>

source: The complete syntax of the <command>ecpg</command> command is detailed in <xref linkend="app-ecpg"/>.
ru: Полный синтаксис вызова команды <command>ecpg</command> приведён в описании <xref linkend="app-ecpg"/>.

source: The <application>ecpg</application> library is thread-safe by default. However, you might need to use some threading command-line options to compile your client code.
ru: Библиотека <application>ecpg</application> по умолчанию потокобезопасна. Однако для компиляции клиентского кода могут потребоваться параметры командной строки для настройки многопоточности.

source: Library Functions
ru: Библиотечные функции

source: The <filename>libecpg</filename> library primarily contains <quote>hidden</quote> functions that are used to implement the functionality expressed by the embedded SQL commands. But there are some functions that can usefully be called directly. Note that this makes your code unportable.
ru: Библиотека <filename>libecpg</filename> в основном содержит <quote>скрытые</quote> функции, применяемые для реализации функциональности, выражаемой встраиваемыми командами SQL. Но есть также некоторые функции, которые можно вызывать напрямую. Заметьте, что код, задействующий эти функции, будет непереносимым.

source: <function>ECPGdebug(int <replaceable>on</replaceable>, FILE *<replaceable>stream</replaceable>)</function> turns on debug logging if called with the first argument non-zero. Debug logging is done on <replaceable>stream</replaceable>. The log contains all <acronym>SQL</acronym> statements with all the input variables inserted, and the results from the <productname>PostgreSQL</productname> server. This can be very useful when searching for errors in your <acronym>SQL</acronym> statements.
ru: <function>ECPGdebug(int <replaceable>вкл</replaceable>, FILE *<replaceable>поток</replaceable>)</function> с первым аргументом, отличным от нуля, включает вывод отладочных сообщений в заданный <replaceable>поток</replaceable>. Журнал сообщений, полученный таким образом, будет содержать все операторы <acronym>SQL</acronym> с заданными входными переменными и результаты, выданные сервером <productname>PostgreSQL</productname>. Это может быть очень полезно для поиска ошибок в командах <acronym>SQL</acronym>.

source: On Windows, if the <application>ecpg</application> libraries and an application are compiled with different flags, this function call will crash the application because the internal representation of the <literal>FILE</literal> pointers differ. Specifically, multithreaded/single-threaded, release/debug, and static/dynamic flags should be the same for the library and all applications using that library.
ru: В Windows, если библиотека <application>ecpg</application> и приложение скомпилированы с разными флагами, эта функция может вызвать крах приложения из-за различий внутреннего представления указателей <literal>FILE</literal>. В частности, флаги многопоточной/однопоточной, выпускаемой/отладочной или статической/динамической сборки должны быть одинаковыми для библиотеки и всех использующих её приложений.

source: <function>ECPGget_PGconn(const char *<replaceable>connection_name</replaceable>) </function> returns the library database connection handle identified by the given name. If <replaceable>connection_name</replaceable> is set to <literal>NULL</literal>, the current connection handle is returned. If no connection handle can be identified, the function returns <literal>NULL</literal>. The returned connection handle can be used to call any other functions from <application>libpq</application>, if necessary.
ru: <function>ECPGget_PGconn(const char *<replaceable>имя_подключения</replaceable>) </function> возвращает указатель на подключение к базе данных, имеющее заданное имя. Если аргумент <replaceable>имя_подключения</replaceable> равен <literal>NULL</literal>, возвращается указатель на текущее подключение. Если определить подключение не удаётся, возвращается <literal>NULL</literal>. Полученный указатель на подключение, если требуется, можно использовать при вызове любых других функций <application>libpq</application>.

source: It is a bad idea to manipulate database connection handles made from <application>ecpg</application> directly with <application>libpq</application> routines.
ru: Манипулировать подключениями, открытыми средствами <application>ecpg</application>, напрямую через <application>libpq</application> не следует.

source: <function>ECPGtransactionStatus(const char *<replaceable>connection_name</replaceable>)</function> returns the current transaction status of the given connection identified by <replaceable>connection_name</replaceable>. See <xref linkend="libpq-status"/> and libpq's <function>PQtransactionStatus()</function> for details about the returned status codes.
ru: <function>ECPGtransactionStatus(const char *<replaceable>имя_подключения</replaceable>)</function> возвращает состояние текущей транзакции для подключения, на которое указывает <replaceable>имя_подключения</replaceable>. Возвращаемые коды состояния перечислены в описании входящей в libpq функции <function>PQtransactionStatus()</function> в <xref remap="6" linkend="libpq-status"/>.

source: <function>ECPGstatus(int <replaceable>lineno</replaceable>, const char* <replaceable>connection_name</replaceable>)</function> returns true if you are connected to a database and false if not. <replaceable>connection_name</replaceable> can be <literal>NULL</literal> if a single connection is being used.
ru: <function>ECPGstatus(int <replaceable>номер_строки</replaceable>, const char* <replaceable>имя_подключения</replaceable>)</function> возвращает true при наличии подключения к базе данных и false в противном случае. В аргументе <replaceable>имя_подключения</replaceable> можно передать <literal>NULL</literal>, если применяется одно подключение.

source: Large Objects
ru: Большие объекты

source: Large objects are not directly supported by ECPG, but ECPG application can manipulate large objects through the libpq large object functions, obtaining the necessary <type>PGconn</type> object by calling the <function>ECPGget_PGconn()</function> function. (However, use of the <function>ECPGget_PGconn()</function> function and touching <type>PGconn</type> objects directly should be done very carefully and ideally not mixed with other ECPG database access calls.)
ru: ECPG не поддерживает большие объекты напрямую, но приложение на базе ECPG может работать с большими объектами, используя предназначенные для этого функции, получив необходимый объект <type>PGconn</type> в результате вызова <function>ECPGget_PGconn()</function>. (Однако использовать функцию <function>ECPGget_PGconn()</function> и напрямую воздействовать на объекты <type>PGconn</type> следует очень осторожно; в идеале стоит исключить при этом другие обращения к базе данных через ECPG.)

source: For more details about the <function>ECPGget_PGconn()</function>, see <xref linkend="ecpg-library"/>. For information about the large object function interface, see <xref linkend="largeobjects"/>.
ru: Подробнее функция <function>ECPGget_PGconn()</function> описана в <xref remap="6" linkend="ecpg-library"/>. Интерфейс функций для работы с большими объектами рассмотрен в <xref remap="6" linkend="largeobjects"/>.

source: Large object functions have to be called in a transaction block, so when autocommit is off, <command>BEGIN</command> commands have to be issued explicitly.
ru: Функции для работы с большими объектами должны вызываться в блоке транзакций, поэтому если режим автофиксации отключён, необходимо явно выдавать команды <command>BEGIN</command>.

source: <xref linkend="ecpg-lo-example"/> shows an example program that illustrates how to create, write, and read a large object in an ECPG application.
ru: В <xref remap="6" linkend="ecpg-lo-example"/> приведён пример программы, показывающий, как создать, записать и прочитать большой объект в приложении ECPG.

source: ECPG Program Accessing Large Objects
ru: Программа на базе ECPG, работающая с большими объектами

source: <acronym>C++</acronym> Applications
ru: Приложения на <acronym>C++</acronym>

source: ECPG has some limited support for C++ applications. This section describes some caveats.
ru: ECPG обеспечивает поддержку языка C++ в ограниченном объёме. Некоторые её особенности описаны в этом разделе.

source: The <command>ecpg</command> preprocessor takes an input file written in C (or something like C) and embedded SQL commands, converts the embedded SQL commands into C language chunks, and finally generates a <filename>.c</filename> file. The header file declarations of the library functions used by the C language chunks that <command>ecpg</command> generates are wrapped in <literal>extern "C" { ... }</literal> blocks when used under C++, so they should work seamlessly in C++.
ru: Препроцессор <command>ecpg</command> принимает входной файл, написанный на C (или языке, подобном C) со встраиваемыми командами SQL, преобразует встроенные команды SQL в конструкции языка C и в результате формирует файл <filename>.c</filename>. Объявления библиотечных функций, вызываемых в конструкциях C, которые генерирует <command>ecpg</command>, заворачиваются в блоки <literal>extern "C" { ... }</literal> при использовании C++, так что они должны прозрачно работать в C++.

source: In general, however, the <command>ecpg</command> preprocessor only understands C; it does not handle the special syntax and reserved words of the C++ language. So, some embedded SQL code written in C++ application code that uses complicated features specific to C++ might fail to be preprocessed correctly or might not work as expected.
ru: Однако вообще говоря, препроцессор <command>ecpg</command> понимает только C; он не воспринимает особый синтаксис и зарезервированные слова языка C++. Поэтому какой-то код SQL, встроенный в код приложения на C++, в котором используются сложные особенности C++, может корректно не обработаться препроцессором или не работать как ожидается.

source: A safe way to use the embedded SQL code in a C++ application is hiding the ECPG calls in a C module, which the C++ application code calls into to access the database, and linking that together with the rest of the C++ code. See <xref linkend="ecpg-cpp-and-c"/> about that.
ru: Надёжный подход к применению внедрённого кода SQL в приложении на C++ заключается в том, чтобы скрыть вызовы ECPG в модуле C, который будет вызываться приложением на C++ для работы с базой данных и который будет скомпонован с остальным кодом C++. Подробнее это описано в <xref remap="6" linkend="ecpg-cpp-and-c"/>.

source: Scope for Host Variables
ru: Область видимости переменных среды

source: The <command>ecpg</command> preprocessor understands the scope of variables in C. In the C language, this is rather simple because the scopes of variables is based on their code blocks. In C++, however, the class member variables are referenced in a different code block from the declared position, so the <command>ecpg</command> preprocessor will not understand the scope of the class member variables.
ru: Препроцессор <command>ecpg</command> имеет понимание области видимости переменных в C. С языком C это довольно просто, так как область видимости переменных определяется их блоками кода. В C++, однако, переменные-члены класса задействуются не в том блоке кода, в каком они объявлены, так что препроцессор <command>ecpg</command> не сможет корректно определить область видимости таких переменных.

source: For example, in the following case, the <command>ecpg</command> preprocessor cannot find any declaration for the variable <literal>dbname</literal> in the <literal>test</literal> method, so an error will occur. <placeholder-1/> This code will result in an error like this: <screen> <userinput>ecpg test_cpp.pgc</userinput> test_cpp.pgc:28: ERROR: variable "dbname" is not declared </screen>
ru: Например, в следующем случае препроцессор <command>ecpg</command> не сможет найти определение переменной <literal>dbname</literal> в методе <literal>test</literal>, так что произойдёт ошибка. <placeholder-1/> При обработке данного кода будет выдано сообщение: <screen> <userinput>ecpg test_cpp.pgc</userinput> test_cpp.pgc:28: ERROR: variable "dbname" is not declared </screen> (test_cpp.pgc:28: ОШИБКА: переменная "dbname" не объявлена)

source: To avoid this scope issue, the <literal>test</literal> method could be modified to use a local variable as intermediate storage. But this approach is only a poor workaround, because it uglifies the code and reduces performance. <placeholder-1/>
ru: Для решения этой проблемы можно немного изменить метод <literal>test</literal> и задействовать в нём локальную переменную для промежуточного хранения. Но предложенный подход нельзя считать хорошим, так как это портит код и снижает производительность. <placeholder-1/>

source: C++ Application Development with External C Module
ru: Разработка приложения на C++ с внешним модулем на C
