Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: First, create a prepared statement. <placeholder-1/>
ru: Сначала создайте подготовленный оператор. <placeholder-1/>

source: sqlda_t *sqlda2; sqlda2 = (sqlda_t *) malloc(sizeof(sqlda_t) + sizeof(sqlvar_t)); memset(sqlda2, 0, sizeof(sqlda_t) + sizeof(sqlvar_t)); sqlda2-&gt;sqln = 2; /* number of input variables */
ru: sqlda_t *sqlda2; sqlda2 = (sqlda_t *) malloc(sizeof(sqlda_t) + sizeof(sqlvar_t)); memset(sqlda2, 0, sizeof(sqlda_t) + sizeof(sqlvar_t)); sqlda2-&gt;sqln = 2; /* число входных переменных */

source: Next, allocate memory for an SQLDA, and set the number of input parameters in <structfield>sqln</structfield>, a member variable of the <type>sqlda_t</type> structure. When two or more input parameters are required for the prepared query, the application has to allocate additional memory space which is calculated by (nr. of params - 1) * sizeof(sqlvar_t). The example shown here allocates memory space for two input parameters. <placeholder-1/>
ru: Затем выделите память для SQLDA и установите число входных параметров в поле <structfield>sqln</structfield>, члене структуры <type>sqlda_t</type>. Когда для подготовленного запроса требуются два или более входных параметров, приложение должно выделить дополнительное место в памяти, размер которого вычисляется как (число параметров - 1) * sizeof(sqlvar_t). В показанном здесь примере выделяется место для двух параметров. <placeholder-1/>

source: After memory allocation, store the parameter values into the <literal>sqlvar[]</literal> array. (This is same array used for retrieving column values when the SQLDA is receiving a result set.) In this example, the input parameters are <literal>"postgres"</literal>, having a string type, and <literal>1</literal>, having an integer type. <placeholder-1/>
ru: Выделив память, сохраните значения параметров в массиве <literal>sqlvar[]</literal>. (Этот же массив используется для значений столбцов, когда SQLDA получает набор результатов.) В данном примере передаются два параметра: <literal>"postgres"</literal> (строкового типа) и <literal>1</literal> (целочисленного типа). <placeholder-1/>

source: By opening a cursor and specifying the SQLDA that was set up beforehand, the input parameters are passed to the prepared statement. <placeholder-1/>
ru: Откройте курсор с указанием ранее созданной SQLDA, чтобы входные параметры были переданы подготовленному оператору. <placeholder-1/>

source: Finally, after using input SQLDAs, the allocated memory space must be freed explicitly, unlike SQLDAs used for receiving query results. <placeholder-1/>
ru: Наконец, закончив использование входных SQLDA, необходимо явно освободить выделенную для них память, в отличие от SQLDA, получающих результаты запросов. <placeholder-1/>

source: A Sample Application Using SQLDA
ru: Пример приложения, использующего SQLDA

source: Here is an example program, which describes how to fetch access statistics of the databases, specified by the input parameters, from the system catalogs.
ru: Представленный здесь пример программы показывает, как выбрать из системных каталогов статистику доступа к базам данных, определённых входными параметрами.

source: This application joins two system tables, pg_database and pg_stat_database on the database OID, and also fetches and shows the database statistics which are retrieved by two input parameters (a database <literal>postgres</literal>, and OID <literal>1</literal>).
ru: Это приложение соединяет записи двух системных таблиц, pg_database и pg_stat_database по OID базы данных, и также выбирает и показывает статистику, принимая два входных параметра (база данных <literal>postgres</literal> и OID <literal>1</literal>).

source: EXEC SQL include sqlda.h; sqlda_t *sqlda1; /* an output descriptor */ sqlda_t *sqlda2; /* an input descriptor */
ru: EXEC SQL include sqlda.h; sqlda_t *sqlda1; /* выходной дескриптор */ sqlda_t *sqlda2; /* входной дескриптор */

source: First, declare an SQLDA for input and an SQLDA for output. <placeholder-1/>
ru: Сначала создайте SQLDA для ввода параметров и SQLDA для вывода результатов. <placeholder-1/>

source: Next, connect to the database, prepare a statement, and declare a cursor for the prepared statement. <placeholder-1/>
ru: Затем подключитесь к базе данных, подготовьте оператор и объявите курсор для подготовленного оператора. <placeholder-1/>

source: /* Create SQLDA structure for input parameters. */ sqlda2 = (sqlda_t *) malloc(sizeof(sqlda_t) + sizeof(sqlvar_t)); memset(sqlda2, 0, sizeof(sqlda_t) + sizeof(sqlvar_t)); sqlda2-&gt;sqln = 2; /* number of input variables */ sqlda2-&gt;sqlvar[0].sqltype = ECPGt_char; sqlda2-&gt;sqlvar[0].sqldata = "postgres"; sqlda2-&gt;sqlvar[0].sqllen = 8; intval = 1; sqlda2-&gt;sqlvar[1].sqltype = ECPGt_int; sqlda2-&gt;sqlvar[1].sqldata = (char *)&amp;intval; sqlda2-&gt;sqlvar[1].sqllen = sizeof(intval);
ru: /* Создать структуру SQLDA для входных параметров. */ sqlda2 = (sqlda_t *) malloc(sizeof(sqlda_t) + sizeof(sqlvar_t)); memset(sqlda2, 0, sizeof(sqlda_t) + sizeof(sqlvar_t)); sqlda2-&gt;sqln = 2; /* number of input variables */ sqlda2-&gt;sqlvar[0].sqltype = ECPGt_char; sqlda2-&gt;sqlvar[0].sqldata = "postgres"; sqlda2-&gt;sqlvar[0].sqllen = 8; intval = 1; sqlda2-&gt;sqlvar[1].sqltype = ECPGt_int; sqlda2-&gt;sqlvar[1].sqldata = (char *)&amp;intval; sqlda2-&gt;sqlvar[1].sqllen = sizeof(intval);

source: Next, put some values in the input SQLDA for the input parameters. Allocate memory for the input SQLDA, and set the number of input parameters to <literal>sqln</literal>. Store type, value, and value length into <literal>sqltype</literal>, <literal>sqldata</literal>, and <literal>sqllen</literal> in the <literal>sqlvar</literal> structure. <placeholder-1/>
ru: Затем запишите некоторые значения параметров во входную SQLDA. Выделите память для входной SQLDA и установите количество параметров в <literal>sqln</literal>. Запишите тип, значение и длину значения в поля <literal>sqltype</literal>, <literal>sqldata</literal> и <literal>sqllen</literal> структуры <literal>sqlvar</literal>. <placeholder-1/>

source: /* Open a cursor with input parameters. */ EXEC SQL OPEN cur1 USING DESCRIPTOR sqlda2;
ru: /* Открыть курсор с входными параметрами. */ EXEC SQL OPEN cur1 USING DESCRIPTOR sqlda2;

source: After setting up the input SQLDA, open a cursor with the input SQLDA. <placeholder-1/>
ru: Подготовив входную SQLDA, откройте курсор с ней. <placeholder-1/>

source: while (1) { sqlda_t *cur_sqlda; /* Assign descriptor to the cursor */ EXEC SQL FETCH NEXT FROM cur1 INTO DESCRIPTOR sqlda1;
ru: while (1) { sqlda_t *cur_sqlda; /* Назначить дескриптор курсору */ EXEC SQL FETCH NEXT FROM cur1 INTO DESCRIPTOR sqlda1;

source: Fetch rows into the output SQLDA from the opened cursor. (Generally, you have to call <command>FETCH</command> repeatedly in the loop, to fetch all rows in the result set.) <placeholder-1/>
ru: Выберите строки из открытого курсора в выходную SQLDA. (Обычно, чтобы выбрать все строки в наборе результатов, нужно повторять <command>FETCH</command> в цикле.) <placeholder-1/>

source: Next, retrieve the fetched records from the SQLDA, by following the linked list of the <type>sqlda_t</type> structure. <placeholder-1/>
ru: Затем прочитайте выбранные записи из SQLDA, следуя по связанному списку структуры <type>sqlda_t</type>. <placeholder-1/>

source: /* Print every column in a row. */ for (i = 0; i &lt; sqlda1-&gt;sqld; i++) { sqlvar_t v = sqlda1-&gt;sqlvar[i]; char *sqldata = v.sqldata; short sqllen = v.sqllen; strncpy(name_buf, v.sqlname.data, v.sqlname.length); name_buf[v.sqlname.length] = '\0';
ru: /* Вывести каждый столбец в строке. */ for (i = 0; i &lt; sqlda1-&gt;sqld; i++) { sqlvar_t v = sqlda1-&gt;sqlvar[i]; char *sqldata = v.sqldata; short sqllen = v.sqllen; strncpy(name_buf, v.sqlname.data, v.sqlname.length); name_buf[v.sqlname.length] = '\0';

source: Read each columns in the first record. The number of columns is stored in <structfield>sqld</structfield>, the actual data of the first column is stored in <literal>sqlvar[0]</literal>, both members of the <type>sqlda_t</type> structure. <placeholder-1/>
ru: Прочитайте все столбцы первой записи. Количество столбцов хранится в поле <structfield>sqld</structfield>, а данные первого столбца в <literal>sqlvar[0]</literal>, оба эти поля — члены структуры <type>sqlda_t</type>. <placeholder-1/>

source: Now, the column data is stored in the variable <varname>v</varname>. Copy every datum into host variables, looking at <literal>v.sqltype</literal> for the type of the column. <placeholder-1/>
ru: Теперь данные столбцов сохранены в переменной <varname>v</varname>. Скопируйте все элементы данных в переменные среды, определив тип столбца по полю <literal>v.sqltype</literal>. <placeholder-1/>

source: Close the cursor after processing all of records, and disconnect from the database. <placeholder-1/>
ru: Закончив обработку всех записей, закройте курсор и отключитесь от базы данных. <placeholder-1/>

source: The whole program is shown in <xref linkend="ecpg-sqlda-example-example"/>.
ru: Вся программа показана в <xref remap="6" linkend="ecpg-sqlda-example-example"/>.

source: Example SQLDA Program
ru: Пример программы на базе SQLDA

source: #include &lt;stdlib.h&gt; #include &lt;string.h&gt; #include &lt;stdlib.h&gt; #include &lt;stdio.h&gt; #include &lt;unistd.h&gt; EXEC SQL include sqlda.h; sqlda_t *sqlda1; /* descriptor for output */ sqlda_t *sqlda2; /* descriptor for input */ EXEC SQL WHENEVER NOT FOUND DO BREAK; EXEC SQL WHENEVER SQLERROR STOP; int main(void) { EXEC SQL BEGIN DECLARE SECTION; char query[1024] = "SELECT d.oid,* FROM pg_database d, pg_stat_database s WHERE d.oid=s.datid AND ( d.datname=? OR d.oid=? )"; int intval; unsigned long long int longlongval; EXEC SQL END DECLARE SECTION; EXEC SQL CONNECT TO uptimedb AS con1 USER uptime; EXEC SQL PREPARE stmt1 FROM :query; EXEC SQL DECLARE cur1 CURSOR FOR stmt1; /* Create a SQLDA structure for an input parameter */ sqlda2 = (sqlda_t *)malloc(sizeof(sqlda_t) + sizeof(sqlvar_t)); memset(sqlda2, 0, sizeof(sqlda_t) + sizeof(sqlvar_t)); sqlda2-&gt;sqln = 2; /* a number of input variables */ sqlda2-&gt;sqlvar[0].sqltype = ECPGt_char; sqlda2-&gt;sqlvar[0].sqldata = "postgres"; sqlda2-&gt;sqlvar[0].sqllen = 8; intval = 1; sqlda2-&gt;sqlvar[1].sqltype = ECPGt_int; sqlda2-&gt;sqlvar[1].sqldata = (char *) &amp;intval; sqlda2-&gt;sqlvar[1].sqllen = sizeof(intval); /* Open a cursor with input parameters. */ EXEC SQL OPEN cur1 USING DESCRIPTOR sqlda2; while (1) { sqlda_t *cur_sqlda; /* Assign descriptor to the cursor */ EXEC SQL FETCH NEXT FROM cur1 INTO DESCRIPTOR sqlda1; for (cur_sqlda = sqlda1 ; cur_sqlda != NULL ; cur_sqlda = cur_sqlda-&gt;desc_next) { int i; char name_buf[1024]; char var_buf[1024]; /* Print every column in a row. */ for (i=0 ; i&lt;cur_sqlda-&gt;sqld ; i++) { sqlvar_t v = cur_sqlda-&gt;sqlvar[i]; char *sqldata = v.sqldata; short sqllen = v.sqllen; strncpy(name_buf, v.sqlname.data, v.sqlname.length); name_buf[v.sqlname.length] = '\0'; switch (v.sqltype) { case ECPGt_char: memset(&amp;var_buf, 0, sizeof(var_buf)); memcpy(&amp;var_buf, sqldata, (sizeof(var_buf)&lt;=sqllen ? sizeof(var_buf)-1 : sqllen) ); break; case ECPGt_int: /* integer */ memcpy(&amp;intval, sqldata, sqllen); snprintf(var_buf, sizeof(var_buf), "%d", intval); break; case ECPGt_long_long: /* bigint */ memcpy(&amp;longlongval, sqldata, sqllen); snprintf(var_buf, sizeof(var_buf), "%lld", longlongval); break; default: { int i; memset(var_buf, 0, sizeof(var_buf)); for (i = 0; i &lt; sqllen; i++) { char tmpbuf[16]; snprintf(tmpbuf, sizeof(tmpbuf), "%02x ", (unsigned char) sqldata[i]); strncat(var_buf, tmpbuf, sizeof(var_buf)); } } break; } printf("%s = %s (type: %d)\n", name_buf, var_buf, v.sqltype); } printf("\n"); } } EXEC SQL CLOSE cur1; EXEC SQL COMMIT; EXEC SQL DISCONNECT ALL; return 0; }
ru: #include &lt;stdlib.h&gt; #include &lt;string.h&gt; #include &lt;stdlib.h&gt; #include &lt;stdio.h&gt; #include &lt;unistd.h&gt; EXEC SQL include sqlda.h; sqlda_t *sqlda1; /* дескриптор для выходных данных */ sqlda_t *sqlda2; /* дескриптор для входных данных */ EXEC SQL WHENEVER NOT FOUND DO BREAK; EXEC SQL WHENEVER SQLERROR STOP; int main(void) { EXEC SQL BEGIN DECLARE SECTION; char query[1024] = "SELECT d.oid,* FROM pg_database d, pg_stat_database s WHERE d.oid=s.datid AND ( d.datname=? OR d.oid=? )"; int intval; unsigned long long int longlongval; EXEC SQL END DECLARE SECTION; EXEC SQL CONNECT TO uptimedb AS con1 USER uptime; EXEC SQL PREPARE stmt1 FROM :query; EXEC SQL DECLARE cur1 CURSOR FOR stmt1; /* Создать структуру SQLDA для входных параметров */ sqlda2 = (sqlda_t *)malloc(sizeof(sqlda_t) + sizeof(sqlvar_t)); memset(sqlda2, 0, sizeof(sqlda_t) + sizeof(sqlvar_t)); sqlda2-&gt;sqln = 2; /* число входных переменных */ sqlda2-&gt;sqlvar[0].sqltype = ECPGt_char; sqlda2-&gt;sqlvar[0].sqldata = "postgres"; sqlda2-&gt;sqlvar[0].sqllen = 8; intval = 1; sqlda2-&gt;sqlvar[1].sqltype = ECPGt_int; sqlda2-&gt;sqlvar[1].sqldata = (char *) &amp;intval; sqlda2-&gt;sqlvar[1].sqllen = sizeof(intval); /* Открыть курсор с входными параметрами. */ EXEC SQL OPEN cur1 USING DESCRIPTOR sqlda2; while (1) { sqlda_t *cur_sqlda; /* Присвоить дескриптор курсору */ EXEC SQL FETCH NEXT FROM cur1 INTO DESCRIPTOR sqlda1; for (cur_sqlda = sqlda1 ; cur_sqlda != NULL ; cur_sqlda = cur_sqlda-&gt;desc_next) { int i; char name_buf[1024]; char var_buf[1024]; /* Напечатать каждый столбец в строке. */ for (i=0 ; i&lt;cur_sqlda-&gt;sqld ; i++) { sqlvar_t v = cur_sqlda-&gt;sqlvar[i]; char *sqldata = v.sqldata; short sqllen = v.sqllen; strncpy(name_buf, v.sqlname.data, v.sqlname.length); name_buf[v.sqlname.length] = '\0'; switch (v.sqltype) { case ECPGt_char: memset(&amp;var_buf, 0, sizeof(var_buf)); memcpy(&amp;var_buf, sqldata, (sizeof(var_buf)&lt;=sqllen ? sizeof(var_buf)-1 : sqllen) ); break; case ECPGt_int: /* integer */ memcpy(&amp;intval, sqldata, sqllen); snprintf(var_buf, sizeof(var_buf), "%d", intval); break; case ECPGt_long_long: /* bigint */ memcpy(&amp;longlongval, sqldata, sqllen); snprintf(var_buf, sizeof(var_buf), "%lld", longlongval); break; default: { int i; memset(var_buf, 0, sizeof(var_buf)); for (i = 0; i &lt; sqllen; i++) { char tmpbuf[16]; snprintf(tmpbuf, sizeof(tmpbuf), "%02x ", (unsigned char) sqldata[i]); strncat(var_buf, tmpbuf, sizeof(var_buf)); } } break; } printf("%s = %s (type: %d)\n", name_buf, var_buf, v.sqltype); } printf("\n"); } } EXEC SQL CLOSE cur1; EXEC SQL COMMIT; EXEC SQL DISCONNECT ALL; return 0; }

source: The output of this example should look something like the following (some numbers will vary).
ru: Вывод этой программы должен быть примерно таким (некоторые числа будут меняться).

source: Error Handling
ru: Обработка ошибок

source: Callbacks can be configured to handle warning and error conditions using the <literal>WHENEVER</literal> command.
ru: Можно настроить функции-обработчики для обработки предупреждений и ошибок, воспользовавшись командой <literal>WHENEVER</literal>.

source: Detailed information about the error or warning can be obtained from the <varname>sqlca</varname> variable.
ru: Подробную информацию об ошибке или предупреждении можно получить через переменную <varname>sqlca</varname>.

source: This section describes how you can handle exceptional conditions and warnings in an embedded SQL program. There are two nonexclusive facilities for this. <placeholder-1/>
ru: В этом разделе описывается, как можно обрабатывать исключительные условия и предупреждения в программе со встраиваемым SQL. Для этого предназначены два средства, которые могут дополнять друг друга. <placeholder-1/>

source: Setting Callbacks
ru: Установка обработчиков

source: EXEC SQL WHENEVER <replaceable>condition</replaceable> <replaceable>action</replaceable>;
ru: EXEC SQL WHENEVER <replaceable>условие</replaceable> <replaceable>действие</replaceable>;

source: One simple method to catch errors and warnings is to set a specific action to be executed whenever a particular condition occurs. In general: <placeholder-1/>
ru: Один простой метод перехвата ошибок и предупреждений заключается в назначении определённого действия, которое будет выполняться при некотором условии. В общем виде: <placeholder-1/>

source: The specified action is called whenever an error occurs during the execution of an SQL statement.
ru: Указанное действие вызывается, когда при выполнении оператора SQL происходит ошибка.

source: The specified action is called whenever a warning occurs during the execution of an SQL statement.
ru: Указанное действие вызывается, когда при выполнении оператора SQL выдаётся предупреждение.

source: The specified action is called whenever an SQL statement retrieves or affects zero rows. (This condition is not an error, but you might be interested in handling it specially.)
ru: Указанное действие вызывается, когда оператор SQL получает или обрабатывает ноль строк. (Это обстоятельство не считается ошибкой, но бывает полезно отследить его.)

source: <replaceable>condition</replaceable> can be one of the following: <placeholder-1/>
ru: Здесь <replaceable>условие</replaceable> может быть следующим: <placeholder-1/>

source: This effectively means that the condition is ignored. This is the default.
ru: Это фактически означает, что условие игнорируется. Это поведение по умолчанию.

source: label
ru: метка

source: Jump to the specified label (using a C <literal>goto</literal> statement).
ru: Перейти к указанной метке (используя оператор <literal>goto</literal> языка C).

source: Print a message to standard error. This is useful for simple programs or during prototyping. The details of the message cannot be configured.
ru: Вывести сообщение в устройство стандартного вывода. Это полезно для простых программ или при разработке прототипов. Содержание этого сообщения не настраивается.

source: Call <literal>exit(1)</literal>, which will terminate the program.
ru: Вызвать <literal>exit(1)</literal>, что приведёт к завершению программы.

source: Execute the C statement <literal>break</literal>. This should only be used in loops or <literal>switch</literal> statements.
ru: Выполнить оператор <literal>break</literal> языка C. Этот вариант следует использовать только в циклах или операторах <literal>switch</literal>.

# replaceable
source: name
ru: имя

source: args
ru: аргументы

source: Call the specified C functions with the specified arguments.
ru: Вызвать указанные функции C с заданными аргументами.

source: <replaceable>action</replaceable> can be one of the following: <placeholder-1/> The SQL standard only provides for the actions <literal>CONTINUE</literal> and <literal>GOTO</literal> (and <literal>GO TO</literal>).
ru: <replaceable>действие</replaceable> может быть следующим: <placeholder-1/> В стандарте SQL описаны только действия <literal>CONTINUE</literal> и <literal>GOTO</literal> (и <literal>GO TO</literal>).

source: Here is an example that you might want to use in a simple program. It prints a simple message when a warning occurs and aborts the program when an error happens: <placeholder-1/>
ru: Ниже показан простой пример использования этих команд. Эта конструкция выводит простое сообщение при выдаче предупреждения и прерывает программу в случае ошибки: <placeholder-1/>

source: /* * WRONG */ int main(int argc, char *argv[]) { ... if (verbose) { EXEC SQL WHENEVER SQLWARNING SQLPRINT; } ... EXEC SQL SELECT ...; ... }
ru: /* * НЕПРАВИЛЬНО */ int main(int argc, char *argv[]) { ... if (verbose) { EXEC SQL WHENEVER SQLWARNING SQLPRINT; } ... EXEC SQL SELECT ...; ... }

source: /* * WRONG */ int main(int argc, char *argv[]) { ... set_error_handler(); ... EXEC SQL SELECT ...; ... } static void set_error_handler(void) { EXEC SQL WHENEVER SQLERROR STOP; }
ru: /* * НЕПРАВИЛЬНО */ int main(int argc, char *argv[]) { ... set_error_handler(); ... EXEC SQL SELECT ...; ... } static void set_error_handler(void) { EXEC SQL WHENEVER SQLERROR STOP; }

source: The statement <literal>EXEC SQL WHENEVER</literal> is a directive of the SQL preprocessor, not a C statement. The error or warning actions that it sets apply to all embedded SQL statements that appear below the point where the handler is set, unless a different action was set for the same condition between the first <literal>EXEC SQL WHENEVER</literal> and the SQL statement causing the condition, regardless of the flow of control in the C program. So neither of the two following C program excerpts will have the desired effect: <placeholder-1/> <placeholder-2/>
ru: Оператор <literal>EXEC SQL WHENEVER</literal> является директивой препроцессора SQL, а не оператором языка C. Устанавливаемое им действие при ошибках или предупреждениях применяется ко всем встраиваемым операторам SQL ниже точки, где устанавливается обработчик, если только это действие не было изменено после первой команды <literal>EXEC SQL WHENEVER</literal>, и до SQL-оператора, вызвавшего это условие, вне зависимости от хода выполнения программы на C. Поэтому обе следующие программы на C не дадут желаемого эффекта: <placeholder-1/> <placeholder-2/>

source: For more powerful error handling, the embedded SQL interface provides a global variable with the name <varname>sqlca</varname> (SQL communication area) that has the following structure: <placeholder-1/> (In a multithreaded program, every thread automatically gets its own copy of <varname>sqlca</varname>. This works similarly to the handling of the standard C global variable <varname>errno</varname>.)
ru: Для более гибкой обработки ошибок в интерфейсе встраиваемого SQL представлена глобальная переменная с именем <varname>sqlca</varname> (SQL Communication Area, Область сведений SQL), имеющая следующую структуру: <placeholder-1/> (В многопоточной программе каждый поток автоматически получает собственную копию <varname>sqlca</varname>. Это работает подобно стандартной в C глобальной переменной <varname>errno</varname>.)

source: <varname>sqlca</varname> covers both warnings and errors. If multiple warnings or errors occur during the execution of a statement, then <varname>sqlca</varname> will only contain information about the last one.
ru: Структура <varname>sqlca</varname> покрывает и предупреждения, и ошибки. Если в процессе выполнения оператора выдаётся несколько предупреждений или ошибок, <varname>sqlca</varname> будет содержать сведения только о последнем(ей) из них.

source: If no error occurred in the last <acronym>SQL</acronym> statement, <literal>sqlca.sqlcode</literal> will be 0 and <literal>sqlca.sqlstate</literal> will be <literal>"00000"</literal>. If a warning or error occurred, then <literal>sqlca.sqlcode</literal> will be negative and <literal>sqlca.sqlstate</literal> will be different from <literal>"00000"</literal>. A positive <literal>sqlca.sqlcode</literal> indicates a harmless condition, such as that the last query returned zero rows. <literal>sqlcode</literal> and <literal>sqlstate</literal> are two different error code schemes; details appear below.
ru: Если последний оператор <acronym>SQL</acronym> выполняется без ошибки, <literal>sqlca.sqlcode</literal> будет содержать 0, а <literal>sqlca.sqlstate</literal> — <literal>"00000"</literal>. Если выдаётся предупреждение или ошибка, в <literal>sqlca.sqlcode</literal> будет содержаться отрицательное число, а <literal>sqlca.sqlstate</literal> будет отличаться от <literal>"00000"</literal>. Положительное значение <literal>sqlca.sqlcode</literal> устанавливается при нейтральном событии, например, когда последний запрос возвращает ноль строк. Поля <literal>sqlcode</literal> и <literal>sqlstate</literal> представляют две различные схемы кодов ошибок; подробнее они описаны ниже.
