Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: #include &lt;stdio.h&gt; #include &lt;stdlib.h&gt; #include &lt;pgtypes_numeric.h&gt; EXEC SQL WHENEVER SQLERROR STOP; int main(void) { EXEC SQL BEGIN DECLARE SECTION; numeric *num; numeric *num2; decimal *dec; EXEC SQL END DECLARE SECTION; EXEC SQL CONNECT TO testdb; num = PGTYPESnumeric_new(); dec = PGTYPESdecimal_new(); EXEC SQL SELECT 12.345::numeric(4,2), 23.456::decimal(4,2) INTO :num, :dec; printf("numeric = %s\n", PGTYPESnumeric_to_asc(num, 0)); printf("numeric = %s\n", PGTYPESnumeric_to_asc(num, 1)); printf("numeric = %s\n", PGTYPESnumeric_to_asc(num, 2)); /* Convert decimal to numeric to show a decimal value. */ num2 = PGTYPESnumeric_new(); PGTYPESnumeric_from_decimal(dec, num2); printf("decimal = %s\n", PGTYPESnumeric_to_asc(num2, 0)); printf("decimal = %s\n", PGTYPESnumeric_to_asc(num2, 1)); printf("decimal = %s\n", PGTYPESnumeric_to_asc(num2, 2)); PGTYPESnumeric_free(num2); PGTYPESdecimal_free(dec); PGTYPESnumeric_free(num); EXEC SQL COMMIT; EXEC SQL DISCONNECT ALL; return 0; }
ru: #include &lt;stdio.h&gt; #include &lt;stdlib.h&gt; #include &lt;pgtypes_numeric.h&gt; EXEC SQL WHENEVER SQLERROR STOP; int main(void) { EXEC SQL BEGIN DECLARE SECTION; numeric *num; numeric *num2; decimal *dec; EXEC SQL END DECLARE SECTION; EXEC SQL CONNECT TO testdb; num = PGTYPESnumeric_new(); dec = PGTYPESdecimal_new(); EXEC SQL SELECT 12.345::numeric(4,2), 23.456::decimal(4,2) INTO :num, :dec; printf("numeric = %s\n", PGTYPESnumeric_to_asc(num, 0)); printf("numeric = %s\n", PGTYPESnumeric_to_asc(num, 1)); printf("numeric = %s\n", PGTYPESnumeric_to_asc(num, 2)); /* Преобразовать decimal в numeric, чтобы вывести десятичное значение. */ num2 = PGTYPESnumeric_new(); PGTYPESnumeric_from_decimal(dec, num2); printf("decimal = %s\n", PGTYPESnumeric_to_asc(num2, 0)); printf("decimal = %s\n", PGTYPESnumeric_to_asc(num2, 1)); printf("decimal = %s\n", PGTYPESnumeric_to_asc(num2, 2)); PGTYPESnumeric_free(num2); PGTYPESdecimal_free(dec); PGTYPESnumeric_free(num); EXEC SQL COMMIT; EXEC SQL DISCONNECT ALL; return 0; }

source: Here is an example program handling <type>numeric</type> and <type>decimal</type> type variables. <placeholder-1/>
ru: Следующий пример демонстрирует работу с переменными типов <type>numeric</type> и <type>decimal</type>. <placeholder-1/>

source: Host Variables with Nonprimitive Types
ru: Переменные среды для непримитивных типов

source: As a host variable you can also use arrays, typedefs, structs, and pointers.
ru: В качестве переменных среды также можно использовать массивы, определения типов, структуры и указатели.

source: Arrays
ru: Массивы

source: There are two use cases for arrays as host variables. The first is a way to store some text string in <type>char[]</type> or <type>VARCHAR[]</type>, as explained in <xref linkend="ecpg-char"/>. The second use case is to retrieve multiple rows from a query result without using a cursor. Without an array, to process a query result consisting of multiple rows, it is required to use a cursor and the <command>FETCH</command> command. But with array host variables, multiple rows can be received at once. The length of the array has to be defined to be able to accommodate all rows, otherwise a buffer overflow will likely occur.
ru: Для применения массивов в качестве переменных среды есть два варианта использования. Во-первых, в массиве <type>char[]</type> или <type>VARCHAR[]</type> можно сохранить текстовую строку, как рассказывалось в <xref remap="6" linkend="ecpg-char"/>. Во-вторых, в массив можно получить несколько строк из результата запроса, не используя курсор. Чтобы не применяя массивы, обработать результат запроса, состоящий из нескольких строк, нужно использовать курсор и команду <command>FETCH</command>. Но с переменными-массивами несколько строк можно получить сразу. Длина определяемого массива должна быть достаточной для размещения всех строк, иначе скорее всего произойдёт переполнение буфера.

source: int main(void) { EXEC SQL BEGIN DECLARE SECTION; int dbid[8]; char dbname[8][16]; int i; EXEC SQL END DECLARE SECTION; memset(dbname, 0, sizeof(char)* 16 * 8); memset(dbid, 0, sizeof(int) * 8); EXEC SQL CONNECT TO testdb; /* Retrieve multiple rows into arrays at once. */ EXEC SQL SELECT oid,datname INTO :dbid, :dbname FROM pg_database; for (i = 0; i &lt; 8; i++) printf("oid=%d, dbname=%s\n", dbid[i], dbname[i]); EXEC SQL COMMIT; EXEC SQL DISCONNECT ALL; return 0; }
ru: int main(void) { EXEC SQL BEGIN DECLARE SECTION; int dbid[8]; char dbname[8][16]; int i; EXEC SQL END DECLARE SECTION; memset(dbname, 0, sizeof(char)* 16 * 8); memset(dbid, 0, sizeof(int) * 8); EXEC SQL CONNECT TO testdb; /* Получить в массивы сразу несколько строк. */ EXEC SQL SELECT oid,datname INTO :dbid, :dbname FROM pg_database; for (i = 0; i &lt; 8; i++) printf("oid=%d, dbname=%s\n", dbid[i], dbname[i]); EXEC SQL COMMIT; EXEC SQL DISCONNECT ALL; return 0; }

source: Following example scans the <literal>pg_database</literal> system table and shows all OIDs and names of the available databases: <placeholder-1/> This example shows following result. (The exact values depend on local circumstances.) <screen> oid=1, dbname=template1 oid=11510, dbname=template0 oid=11511, dbname=postgres oid=313780, dbname=testdb oid=0, dbname= oid=0, dbname= oid=0, dbname= </screen>
ru: Следующий пример сканирует системную таблицу <literal>pg_database</literal> и показывает все OID и имена доступных баз данных: <placeholder-1/> Этот пример выводит следующий результат. (Точные значения зависят от локальных обстоятельств.) <screen> oid=1, dbname=template1 oid=11510, dbname=template0 oid=11511, dbname=postgres oid=313780, dbname=testdb oid=0, dbname= oid=0, dbname= oid=0, dbname= </screen>

source: Structures
ru: Структуры

source: A structure whose member names match the column names of a query result, can be used to retrieve multiple columns at once. The structure enables handling multiple column values in a single host variable.
ru: Для получения значений сразу нескольких столбцов можно применить структуру, имена членов которой совпадают с именами столбцов результата запроса. Структура позволяет обрабатывать значения нескольких столбцов в одной переменной среды.

source: EXEC SQL BEGIN DECLARE SECTION; typedef struct { int oid; char datname[65]; long long int size; } dbinfo_t; dbinfo_t dbval; EXEC SQL END DECLARE SECTION; memset(&amp;dbval, 0, sizeof(dbinfo_t)); EXEC SQL DECLARE cur1 CURSOR FOR SELECT oid, datname, pg_database_size(oid) AS size FROM pg_database; EXEC SQL OPEN cur1; /* when end of result set reached, break out of while loop */ EXEC SQL WHENEVER NOT FOUND DO BREAK; while (1) { /* Fetch multiple columns into one structure. */ EXEC SQL FETCH FROM cur1 INTO :dbval; /* Print members of the structure. */ printf("oid=%d, datname=%s, size=%lld\n", dbval.oid, dbval.datname, dbval.size); } EXEC SQL CLOSE cur1;
ru: EXEC SQL BEGIN DECLARE SECTION; typedef struct { int oid; char datname[65]; long long int size; } dbinfo_t; dbinfo_t dbval; EXEC SQL END DECLARE SECTION; memset(&amp;dbval, 0, sizeof(dbinfo_t)); EXEC SQL DECLARE cur1 CURSOR FOR SELECT oid, datname, pg_database_size(oid) AS size FROM pg_database; EXEC SQL OPEN cur1; /* по достижении конца набора результатов прервать цикл while */ EXEC SQL WHENEVER NOT FOUND DO BREAK; while (1) { /* Выбрать несколько столбцов в одну структуру. */ EXEC SQL FETCH FROM cur1 INTO :dbval; /* Напечатать члены структуры. */ printf("oid=%d, datname=%s, size=%lld\n", dbval.oid, dbval.datname, dbval.size); } EXEC SQL CLOSE cur1;

source: The following example retrieves OIDs, names, and sizes of the available databases from the <literal>pg_database</literal> system table and using the <function>pg_database_size()</function> function. In this example, a structure variable <varname>dbinfo_t</varname> with members whose names match each column in the <literal>SELECT</literal> result is used to retrieve one result row without putting multiple host variables in the <literal>FETCH</literal> statement. <placeholder-1/>
ru: Следующий пример получает значения OID, имена и размеры имеющихся баз данных из системной таблицы <literal>pg_database</literal>, используя при этом функцию <function>pg_database_size()</function>. В этом примере переменная типа структуры <varname>dbinfo_t</varname> с членами, имена которых соответствуют именам всех столбцов результата <literal>SELECT</literal>, применяется для получения одной строки результата без вовлечения в оператор <literal>FETCH</literal> нескольких переменных среды. <placeholder-1/>

source: This example shows following result. (The exact values depend on local circumstances.) <screen> oid=1, datname=template1, size=4324580 oid=11510, datname=template0, size=4243460 oid=11511, datname=postgres, size=4324580 oid=313780, datname=testdb, size=8183012 </screen>
ru: Этот пример показывает следующий результат. (Точные значения зависят от локальных обстоятельств.) <screen> oid=1, datname=template1, size=4324580 oid=11510, datname=template0, size=4243460 oid=11511, datname=postgres, size=4324580 oid=313780, datname=testdb, size=8183012 </screen>

source: EXEC SQL BEGIN DECLARE SECTION; typedef struct { int oid; char datname[65]; } dbinfo_t; dbinfo_t dbval; long long int size; EXEC SQL END DECLARE SECTION; memset(&amp;dbval, 0, sizeof(dbinfo_t)); EXEC SQL DECLARE cur1 CURSOR FOR SELECT oid, datname, pg_database_size(oid) AS size FROM pg_database; EXEC SQL OPEN cur1; /* when end of result set reached, break out of while loop */ EXEC SQL WHENEVER NOT FOUND DO BREAK; while (1) { /* Fetch multiple columns into one structure. */ EXEC SQL FETCH FROM cur1 INTO :dbval, :size; /* Print members of the structure. */ printf("oid=%d, datname=%s, size=%lld\n", dbval.oid, dbval.datname, size); } EXEC SQL CLOSE cur1;
ru: EXEC SQL BEGIN DECLARE SECTION; typedef struct { int oid; char datname[65]; } dbinfo_t; dbinfo_t dbval; long long int size; EXEC SQL END DECLARE SECTION; memset(&amp;dbval, 0, sizeof(dbinfo_t)); EXEC SQL DECLARE cur1 CURSOR FOR SELECT oid, datname, pg_database_size(oid) AS size FROM pg_database; EXEC SQL OPEN cur1; /* по достижении конца набора результатов прервать цикл while */ EXEC SQL WHENEVER NOT FOUND DO BREAK; while (1) { /* Выбрать несколько столбцов в одну структуру. */ EXEC SQL FETCH FROM cur1 INTO :dbval, :size; /* Напечатать члены структуры. */ printf("oid=%d, datname=%s, size=%lld\n", dbval.oid, dbval.datname, size); } EXEC SQL CLOSE cur1;

source: Structure host variables <quote>absorb</quote> as many columns as the structure as fields. Additional columns can be assigned to other host variables. For example, the above program could also be restructured like this, with the <varname>size</varname> variable outside the structure: <placeholder-1/>
ru: Переменные среды типа структуры <quote>вбирают в себя</quote> столько столбцов, сколько полей содержит структура. Значения дополнительных столбцов можно присвоить другим переменным среды. Например, приведённую выше программу можно видоизменить следующим образом, разместив переменную <varname>size</varname> вне структуры: <placeholder-1/>

source: Typedefs
ru: Определения типов

source: Use the <literal>typedef</literal> keyword to map new types to already existing types. <placeholder-1/> Note that you could also use: <placeholder-2/> This declaration does not need to be part of a declare section.
ru: Чтобы сопоставить новые типы с уже существующими, используйте ключевое слово <literal>typedef</literal>. <placeholder-1/> Заметьте, что вы также можете написать: <placeholder-2/> Это объявление не обязательно должно находиться в секции объявлений.

source: Pointers
ru: Указатели

source: You can declare pointers to the most common types. Note however that you cannot use pointers as target variables of queries without auto-allocation. See <xref linkend="ecpg-descriptors"/> for more information on auto-allocation.
ru: Вы можете объявлять указатели на самые распространённые типы. Учтите, однако, что указатели нельзя использовать в качестве целевых переменных запросов без автовыделения. За дополнительными сведениями об автовыделении обратитесь к <xref remap="3" linkend="ecpg-descriptors"/>.

source: Handling Nonprimitive SQL Data Types
ru: Обработка непримитивных типов данных SQL

source: This section contains information on how to handle nonscalar and user-defined SQL-level data types in ECPG applications. Note that this is distinct from the handling of host variables of nonprimitive types, described in the previous section.
ru: В этом разделе описывается как работать с нескалярными и пользовательскими типами уровня SQL в приложениях ECPG. Заметьте, что этот подход отличается от использования переменных непримитивных типов, описанного в предыдущем разделе.

source: Multi-dimensional SQL-level arrays are not directly supported in ECPG. One-dimensional SQL-level arrays can be mapped into C array host variables and vice-versa. However, when creating a statement ecpg does not know the types of the columns, so that it cannot check if a C array is input into a corresponding SQL-level array. When processing the output of a SQL statement, ecpg has the necessary information and thus checks if both are arrays.
ru: Многомерные массивы уровня SQL в ECPG напрямую не поддерживаются, но одномерные массивы уровня SQL могут быть сопоставлены с переменными-массивами среды C и наоборот. Однако учтите, что когда создаётся оператор, ecpg не знает типов столбцов, поэтому не может проверить, вводится ли массив C в соответствующий массив уровня SQL. Обрабатывая результат оператора SQL, ecpg имеет необходимую информацию и таким образом может убедиться, что с обеих сторон массивы.

source: If a query accesses <emphasis>elements</emphasis> of an array separately, then this avoids the use of arrays in ECPG. Then, a host variable with a type that can be mapped to the element type should be used. For example, if a column type is array of <type>integer</type>, a host variable of type <type>int</type> can be used. Also if the element type is <type>varchar</type> or <type>text</type>, a host variable of type <type>char[]</type> or <type>VARCHAR[]</type> can be used.
ru: Если запрос обращается к отдельным <emphasis>элементам</emphasis> массива, это избавляет от необходимости применять массивы в ECPG. В этом случае следует использовать переменную среды, имеющую тип, который можно сопоставить типу элемента. Например, если типом столбца является массив <type>integer</type>, можно использовать переменную среды типа <type>int</type>. Аналогично, если тип элемента — <type>varchar</type> или <type>text</type>, можно использовать переменную типа <type>char[]</type> или <type>VARCHAR[]</type>.

source: Here is an example. Assume the following table: <placeholder-1/> The following example program retrieves the 4th element of the array and stores it into a host variable of type <type>int</type>: <placeholder-2/> This example shows the following result: <screen> ii=4 </screen>
ru: Предположим, что у нас есть таблица: <placeholder-1/> Следующая программа получает 4-ый элемент массива и сохраняет его в переменной среды, имеющей тип <type>int</type>: <placeholder-2/> Этот пример выводит следующий результат: <screen> ii=4 </screen>

source: To map multiple array elements to the multiple elements in an array type host variables each element of array column and each element of the host variable array have to be managed separately, for example: <placeholder-1/>
ru: Чтобы сопоставить несколько элементов массива с несколькими элементами переменной-массивом среды, каждый элемент массива SQL нужно по отдельности связать с каждым элементом массива среды, например: <placeholder-1/>

source: EXEC SQL BEGIN DECLARE SECTION; int ii_a[8]; EXEC SQL END DECLARE SECTION; EXEC SQL DECLARE cur1 CURSOR FOR SELECT ii FROM t3; EXEC SQL OPEN cur1; EXEC SQL WHENEVER NOT FOUND DO BREAK; while (1) { /* WRONG */ EXEC SQL FETCH FROM cur1 INTO :ii_a; ... }
ru: EXEC SQL BEGIN DECLARE SECTION; int ii_a[8]; EXEC SQL END DECLARE SECTION; EXEC SQL DECLARE cur1 CURSOR FOR SELECT ii FROM t3; EXEC SQL OPEN cur1; EXEC SQL WHENEVER NOT FOUND DO BREAK; while (1) { /* НЕПРАВИЛЬНО */ EXEC SQL FETCH FROM cur1 INTO :ii_a; ... }

source: Note again that <placeholder-1/> would not work correctly in this case, because you cannot map an array type column to an array host variable directly.
ru: Ещё раз обратите внимание, что в этом случае вариант <placeholder-1/> не будет работать корректно, так как столбец с типом массива нельзя напрямую сопоставить с переменной-массивом среды.

source: Another workaround is to store arrays in their external string representation in host variables of type <type>char[]</type> or <type>VARCHAR[]</type>. For more details about this representation, see <xref linkend="arrays-input"/>. Note that this means that the array cannot be accessed naturally as an array in the host program (without further processing that parses the text representation).
ru: Можно также применить обходное решение — хранить массивы в их внешнем строковом представлении в переменных среды типа <type>char[]</type> или <type>VARCHAR[]</type>. Более подробно это представление описывается в <xref remap="6" linkend="arrays-input"/>. Заметьте, это означает, что с таким массивом в программе нельзя будет работать естественным образом (без дополнительного разбора текстового представления).

source: Composite Types
ru: Составные типы

source: Composite types are not directly supported in ECPG, but an easy workaround is possible. The available workarounds are similar to the ones described for arrays above: Either access each attribute separately or use the external string representation.
ru: Составные типы в ECPG напрямую не поддерживаются, но есть простое обходное решение. Для решения этой проблемы можно применить те же подходы, что были описаны выше для массивов: обращаться к каждому атрибуту по отдельности или использовать внешнее строковое представление.

source: EXEC SQL BEGIN DECLARE SECTION; int intval; varchar textval[33]; EXEC SQL END DECLARE SECTION; /* Put each element of the composite type column in the SELECT list. */ EXEC SQL DECLARE cur1 CURSOR FOR SELECT (compval).intval, (compval).textval FROM t4; EXEC SQL OPEN cur1; EXEC SQL WHENEVER NOT FOUND DO BREAK; while (1) { /* Fetch each element of the composite type column into host variables. */ EXEC SQL FETCH FROM cur1 INTO :intval, :textval; printf("intval=%d, textval=%s\n", intval, textval.arr); } EXEC SQL CLOSE cur1;
ru: EXEC SQL BEGIN DECLARE SECTION; int intval; varchar textval[33]; EXEC SQL END DECLARE SECTION; /* Указать каждый элемент столбца составного типа в списке SELECT. */ EXEC SQL DECLARE cur1 CURSOR FOR SELECT (compval).intval, (compval).textval FROM t4; EXEC SQL OPEN cur1; EXEC SQL WHENEVER NOT FOUND DO BREAK; while (1) { /* Выбрать каждый элемент столбца составного типа в переменную среды. */ EXEC SQL FETCH FROM cur1 INTO :intval, :textval; printf("intval=%d, textval=%s\n", intval, textval.arr); } EXEC SQL CLOSE cur1;

source: For the following examples, assume the following type and table: <placeholder-1/> The most obvious solution is to access each attribute separately. The following program retrieves data from the example table by selecting each attribute of the type <type>comp_t</type> separately: <placeholder-2/>
ru: Для следующих примеров предполагается, что существует такой тип и таблица: <placeholder-1/> Самое очевидное решение заключается в обращении к каждому атрибуту по отдельности. Следующая программа получает данные из тестовой таблицы, выбирая атрибуты типа <type>comp_t</type> по одному: <placeholder-2/>

source: EXEC SQL BEGIN DECLARE SECTION; typedef struct { int intval; varchar textval[33]; } comp_t; comp_t compval; EXEC SQL END DECLARE SECTION; /* Put each element of the composite type column in the SELECT list. */ EXEC SQL DECLARE cur1 CURSOR FOR SELECT (compval).intval, (compval).textval FROM t4; EXEC SQL OPEN cur1; EXEC SQL WHENEVER NOT FOUND DO BREAK; while (1) { /* Put all values in the SELECT list into one structure. */ EXEC SQL FETCH FROM cur1 INTO :compval; printf("intval=%d, textval=%s\n", compval.intval, compval.textval.arr); } EXEC SQL CLOSE cur1;
ru: EXEC SQL BEGIN DECLARE SECTION; typedef struct { int intval; varchar textval[33]; } comp_t; comp_t compval; EXEC SQL END DECLARE SECTION; /* Поместить каждый элемент составного типа в список SELECT. */ EXEC SQL DECLARE cur1 CURSOR FOR SELECT (compval).intval, (compval).textval FROM t4; EXEC SQL OPEN cur1; EXEC SQL WHENEVER NOT FOUND DO BREAK; while (1) { /* Поместить все значения списка SELECT в одну структуру. */ EXEC SQL FETCH FROM cur1 INTO :compval; printf("intval=%d, textval=%s\n", compval.intval, compval.textval.arr); } EXEC SQL CLOSE cur1;

source: ... EXEC SQL DECLARE cur1 CURSOR FOR SELECT (compval).* FROM t4; EXEC SQL OPEN cur1; EXEC SQL WHENEVER NOT FOUND DO BREAK; while (1) { /* Put all values in the SELECT list into one structure. */ EXEC SQL FETCH FROM cur1 INTO :compval; printf("intval=%d, textval=%s\n", compval.intval, compval.textval.arr); } ...
ru: ... EXEC SQL DECLARE cur1 CURSOR FOR SELECT (compval).* FROM t4; EXEC SQL OPEN cur1; EXEC SQL WHENEVER NOT FOUND DO BREAK; while (1) { /* Выбрать все значения в списке SELECT в одну структуру. */ EXEC SQL FETCH FROM cur1 INTO :compval; printf("intval=%d, textval=%s\n", compval.intval, compval.textval.arr); } ...

source: To enhance this example, the host variables to store values in the <command>FETCH</command> command can be gathered into one structure. For more details about the host variable in the structure form, see <xref linkend="ecpg-variables-struct"/>. To switch to the structure, the example can be modified as below. The two host variables, <varname>intval</varname> and <varname>textval</varname>, become members of the <structname>comp_t</structname> structure, and the structure is specified on the <command>FETCH</command> command. <placeholder-1/> Although a structure is used in the <command>FETCH</command> command, the attribute names in the <command>SELECT</command> clause are specified one by one. This can be enhanced by using a <literal>*</literal> to ask for all attributes of the composite type value. <placeholder-2/> This way, composite types can be mapped into structures almost seamlessly, even though ECPG does not understand the composite type itself.
ru: В развитие этого примера, переменные среды, в которые помещаются результаты команды <command>FETCH</command>, можно собрать в одну структуру. Подробнее переменные среды в форме структуры описываются в <xref remap="6" linkend="ecpg-variables-struct"/>. Чтобы перейти к структуре, пример можно изменить как показано ниже. Переменные среды, <varname>intval</varname> и <varname>textval</varname>, становятся членами структуры <structname>comp_t</structname>, и эта структура указывается в команде <command>FETCH</command>. <placeholder-1/> Хотя в команде <command>FETCH</command> используется структура, имена атрибутов в предложении <command>SELECT</command> задаются по одному. Это можно дополнительно улучшить, написав <literal>*</literal>, что будет обозначать все атрибуты значения составного типа. <placeholder-2/> Таким образом составные типы можно сопоставить со структурами практически прозрачно, хотя ECPG и не понимает составные типы.

source: Finally, it is also possible to store composite type values in their external string representation in host variables of type <type>char[]</type> or <type>VARCHAR[]</type>. But that way, it is not easily possible to access the fields of the value from the host program.
ru: Наконец, также можно сохранить значения составного типа в их внешнем строковом представлении в переменных среды типа <type>char[]</type> или <type>VARCHAR[]</type>. Однако при таком подходе нет простой возможности обращаться из программы к полям значения.

source: User-defined Base Types
ru: Пользовательские базовые типы
