Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: <literal>%G</literal> - is replaced by a year as a decimal number with century. This year is the one that contains the greater part of the week (Monday as the first day of the week).
ru: <literal>%G</literal> — заменяется годом в виде десятичного числа (со столетием). При этом годом считается тот, что содержит наибольшую часть недели (дни недели начинаются с понедельника).

source: <literal>%g</literal> - is replaced by the same year as in <literal>%G</literal>, but as a decimal number without century (00-99).
ru: <literal>%g</literal> — заменяется тем же годом, что и <literal>%G</literal>, но в виде десятичного числа без столетия (00-99).

source: <literal>%H</literal> - is replaced by the hour (24-hour clock) as a decimal number (00-23).
ru: <literal>%H</literal> — заменяется часами (в 24-часовом формате) в виде десятичного числа (00-23).

source: <literal>%h</literal> - the same as <literal>%b</literal>.
ru: <literal>%h</literal> — равнозначно <literal>%b</literal>.

source: <literal>%I</literal> - is replaced by the hour (12-hour clock) as a decimal number (01-12).
ru: <literal>%I</literal> — заменяется часами (в 12-часовом формате) в виде десятичного числа (01-12).

source: <literal>%j</literal> - is replaced by the day of the year as a decimal number (001-366).
ru: <literal>%j</literal> — заменяется днём года в виде десятичного числа (001-366).

source: <literal>%k</literal> - is replaced by the hour (24-hour clock) as a decimal number (0-23); single digits are preceded by a blank.
ru: <literal>%k</literal> — заменяется часами (в 24-часовом формате) в виде десятичного числа (0-23); одиночная цифра предваряется пробелом.

source: <literal>%l</literal> - is replaced by the hour (12-hour clock) as a decimal number (1-12); single digits are preceded by a blank.
ru: <literal>%l</literal> — заменяется часами (в 12-часовом формате) в виде десятичного числа (1-12); одиночная цифра предваряется пробелом.

source: <literal>%M</literal> - is replaced by the minute as a decimal number (00-59).
ru: <literal>%M</literal> — заменяется минутами в виде десятичного числа (00-59).

source: <literal>%m</literal> - is replaced by the month as a decimal number (01-12).
ru: <literal>%m</literal> — заменяется номером месяца в виде десятичного числа (01-12).

source: <literal>%n</literal> - is replaced by a newline.
ru: <literal>%n</literal> — заменяется символом новой строки.

source: <literal>%O*</literal> - the same as <literal>%E*</literal>.
ru: <literal>%O*</literal> — равнозначно <literal>%E*</literal>.

source: <literal>%p</literal> - is replaced by national representation of either <quote>ante meridiem</quote> or <quote>post meridiem</quote> as appropriate.
ru: <literal>%p</literal> — заменяется локализованным представлением <quote>до полудня</quote> или <quote>после полудня</quote> в зависимости от времени.

source: <literal>%R</literal> - is equivalent to <literal>%H:%M</literal>.
ru: <literal>%R</literal> — равнозначно <literal>%H:%M</literal>.

source: <literal>%r</literal> - is equivalent to <literal>%I:%M:%S %p</literal>.
ru: <literal>%r</literal> — равнозначно <literal>%I:%M:%S %p</literal>.

source: <literal>%S</literal> - is replaced by the second as a decimal number (00-60).
ru: <literal>%S</literal> — заменяется секундами в виде десятичного числа (00-60).

source: <literal>%s</literal> - is replaced by the number of seconds since the Epoch, UTC.
ru: <literal>%s</literal> — заменяется числом секунд с начала эпохи, по мировому времени (UTC).

source: <literal>%T</literal> - is equivalent to <literal>%H:%M:%S</literal>
ru: <literal>%T</literal> — равнозначно <literal>%H:%M:%S</literal>

source: <literal>%t</literal> - is replaced by a tab.
ru: <literal>%t</literal> — заменяется символом табуляции.

source: <literal>%U</literal> - is replaced by the week number of the year (Sunday as the first day of the week) as a decimal number (00-53).
ru: <literal>%U</literal> — заменяется номером недели в году (первым днём недели считается воскресенье) в виде десятичного числа (00-53).

source: <literal>%u</literal> - is replaced by the weekday (Monday as the first day of the week) as a decimal number (1-7).
ru: <literal>%u</literal> — заменяется номером дня недели (первым днём недели считается понедельник) в виде десятичного числа (1-7).

source: <literal>%V</literal> - is replaced by the week number of the year (Monday as the first day of the week) as a decimal number (01-53). If the week containing January 1 has four or more days in the new year, then it is week 1; otherwise it is the last week of the previous year, and the next week is week 1.
ru: <literal>%V</literal> — заменяется номером недели в году (первым днём недели считается понедельник) в виде десятичного числа (01-53). Если к недели, включающей 1 января, относятся 4 или больше дней нового года, она считается неделей с номером 1; в противном случае это последняя неделя предыдущего года, а неделей под номером 1 будет следующая.

source: <literal>%v</literal> - is equivalent to <literal>%e-%b-%Y</literal>.
ru: <literal>%v</literal> — равнозначно <literal>%e-%b-%Y</literal>.

source: <literal>%W</literal> - is replaced by the week number of the year (Monday as the first day of the week) as a decimal number (00-53).
ru: <literal>%W</literal> — заменяется номером недели в году (первым днём недели считается понедельник) в виде десятичного числа (00-53).

source: <literal>%w</literal> - is replaced by the weekday (Sunday as the first day of the week) as a decimal number (0-6).
ru: <literal>%w</literal> — заменяется номером дня недели (первым днём недели считается воскресенье) в виде десятичного числа (0-6).

source: <literal>%X</literal> - is replaced by national representation of the time.
ru: <literal>%X</literal> — заменяется локализованным представлением времени.

source: <literal>%x</literal> - is replaced by national representation of the date.
ru: <literal>%x</literal> — заменяется локализованным представлением даты.

source: <literal>%Y</literal> - is replaced by the year with century as a decimal number.
ru: <literal>%Y</literal> — заменяется годом со столетием в виде десятичного числа.

source: <literal>%y</literal> - is replaced by the year without century as a decimal number (00-99).
ru: <literal>%y</literal> — заменяется годом без столетия в виде десятичного числа (00-99).

source: <literal>%Z</literal> - is replaced by the time zone name.
ru: <literal>%Z</literal> — заменяется названием часового пояса.

source: <literal>%z</literal> - is replaced by the time zone offset from UTC; a leading plus sign stands for east of UTC, a minus sign for west of UTC, hours and minutes follow with two digits each and no delimiter between them (common form for RFC 822 date headers).
ru: <literal>%z</literal> — заменяется смещением часового пояса от UTC; ведущий знак плюс обозначает смещение к востоку от UTC, а знак минус — к западу, часы и минуты задаются парами цифр без разделителя между ними (эта форма установлена для даты в RFC 822).

source: <literal>%+</literal> - is replaced by national representation of the date and time.
ru: <literal>%+</literal> — заменяется локализованным представлением даты и времени.

source: <literal>%-*</literal> - GNU libc extension. Do not do any padding when performing numerical outputs.
ru: <literal>%-*</literal> — расширение GNU libc. Отключает дополнение чисел по ширине при выводе.

source: $_* - GNU libc extension. Explicitly specify space for padding.
ru: $_* — расширение GNU libc. Явно включает дополнение пробелами.

source: <literal>%0*</literal> - GNU libc extension. Explicitly specify zero for padding.
ru: <literal>%0*</literal> — расширение GNU libc. Явно включает дополнение нулями.

source: <literal>%%</literal> - is replaced by <literal>%</literal>.
ru: <literal>%%</literal> — заменяется символом <literal>%</literal>.

source: You can use the following format specifiers for the format mask. The format specifiers are the same ones that are used in the <function>strftime</function> function in <productname>libc</productname>. Any non-format specifier will be copied into the output buffer. <placeholder-1/>
ru: В маске формата можно использовать коды формата, перечисленные ниже. Эти же коды принимает функция <function>strftime</function> из библиотеки <productname>libc</productname>. Любые символы, не относящиеся к кодам формата, будут просто скопированы в буфер вывода. <placeholder-1/>

source: Subtract one timestamp from another one and save the result in a variable of type interval. <synopsis> int PGTYPEStimestamp_sub(timestamp *ts1, timestamp *ts2, interval *iv); </synopsis> The function will subtract the timestamp variable that <literal>ts2</literal> points to from the timestamp variable that <literal>ts1</literal> points to and will store the result in the interval variable that <literal>iv</literal> points to.
ru: Вычитает одно значение времени из другого и сохраняет результат в переменной типа interval. <synopsis> int PGTYPEStimestamp_sub(timestamp *ts1, timestamp *ts2, interval *iv); </synopsis> Эта функция вычитает значение типа timestamp, на которое указывает <literal>ts2</literal>, из значения timestamp, на которое указывает <literal>ts1</literal>, и сохраняет результат в переменной типа interval, на которую указывает <literal>iv</literal>.

source: Parse a timestamp value from its textual representation using a formatting mask. <synopsis> int PGTYPEStimestamp_defmt_asc(char *str, char *fmt, timestamp *d); </synopsis> The function receives the textual representation of a timestamp in the variable <literal>str</literal> as well as the formatting mask to use in the variable <literal>fmt</literal>. The result will be stored in the variable that <literal>d</literal> points to.
ru: Разбирает значение типа timestamp из текстового представления с заданной маской формата. <synopsis> int PGTYPEStimestamp_defmt_asc(char *str, char *fmt, timestamp *d); </synopsis> Эта функция получает текстовое представление даты/времени в переменной <literal>str</literal>, а также маску формата для разбора в переменной <literal>fmt</literal>. Результат будет сохранён в переменной, на которую указывает <literal>d</literal>.

source: If the formatting mask <literal>fmt</literal> is NULL, the function will fall back to the default formatting mask which is <literal>%Y-%m-%d %H:%M:%S</literal>.
ru: Если вместо маски формата <literal>fmt</literal> передаётся NULL, эта функция переходит к стандартной маске форматирования, а именно: <literal>%Y-%m-%d %H:%M:%S</literal>.

source: This is the reverse function to <xref linkend="pgtypestimestampfmtasc"/>. See the documentation there in order to find out about the possible formatting mask entries.
ru: Данная функция является обратной к функции <xref linkend="pgtypestimestampfmtasc"/>. Обратитесь к её документации, чтобы узнать о возможных вариантах маски формата.

source: Add an interval variable to a timestamp variable. <synopsis> int PGTYPEStimestamp_add_interval(timestamp *tin, interval *span, timestamp *tout); </synopsis> The function receives a pointer to a timestamp variable <literal>tin</literal> and a pointer to an interval variable <literal>span</literal>. It adds the interval to the timestamp and saves the resulting timestamp in the variable that <literal>tout</literal> points to.
ru: Добавляет переменную типа interval к переменной типа timestamp. <synopsis> int PGTYPEStimestamp_add_interval(timestamp *tin, interval *span, timestamp *tout); </synopsis> Эта функция получает указатель на переменную <literal>tin</literal> типа timestamp и указатель на переменную <literal>span</literal> типа interval. Она добавляет временной интервал к значению даты/времени и сохраняет полученную дату/время в переменной типа timestamp, на которую указывает <literal>tout</literal>.

source: Subtract an interval variable from a timestamp variable. <synopsis> int PGTYPEStimestamp_sub_interval(timestamp *tin, interval *span, timestamp *tout); </synopsis> The function subtracts the interval variable that <literal>span</literal> points to from the timestamp variable that <literal>tin</literal> points to and saves the result into the variable that <literal>tout</literal> points to.
ru: Вычитает переменную типа interval из переменной типа timestamp. <synopsis> int PGTYPEStimestamp_sub_interval(timestamp *tin, interval *span, timestamp *tout); </synopsis> Эта функция вычитает значение типа interval, на которое указывает <literal>span</literal>, из значения типа timestamp, на которое указывает <literal>tin</literal>, и сохраняет результат в переменной, на которую указывает <literal>tout</literal>.

source: The following functions can be used to work with the timestamp type: <placeholder-1/>
ru: Для работы с типом timestamp можно использовать следующие функции: <placeholder-1/>

source: The interval Type
ru: Тип interval

source: The interval type in C enables your programs to deal with data of the SQL type interval. See <xref linkend="datatype-datetime"/> for the equivalent type in the <productname>PostgreSQL</productname> server.
ru: Тип interval, реализованный в C, позволяет программам работать с данными типа interval в SQL. Соответствующий тип сервера <productname>PostgreSQL</productname> описан в <xref remap="6" linkend="datatype-datetime"/>.

source: Return a pointer to a newly allocated interval variable. <synopsis> interval *PGTYPESinterval_new(void); </synopsis>
ru: Возвращает указатель на новую переменную interval, размещённую в памяти. <synopsis> interval *PGTYPESinterval_new(void); </synopsis>

source: Release the memory of a previously allocated interval variable. <synopsis> void PGTYPESinterval_new(interval *intvl); </synopsis>
ru: Освобождает место, занимаемое ранее размещённой в памяти переменной типа interval. <synopsis> void PGTYPESinterval_new(interval *intvl); </synopsis>

source: Parse an interval from its textual representation. <synopsis> interval *PGTYPESinterval_from_asc(char *str, char **endptr); </synopsis> The function parses the input string <literal>str</literal> and returns a pointer to an allocated interval variable. At the moment ECPG always parses the complete string and so it currently does not support to store the address of the first invalid character in <literal>*endptr</literal>. You can safely set <literal>endptr</literal> to NULL.
ru: Разбирает значение типа interval из его текстового представления. <synopsis> interval *PGTYPESinterval_from_asc(char *str, char **endptr); </synopsis> Эта функция разбирает входную строку <literal>str</literal> и возвращает указатель на размещённую в памяти переменную типа interval. На данный момент ECPG всегда разбирает строку до конца, так что эта функция не может вернуть адрес первого недопустимого символа в <literal>*endptr</literal>. Поэтому в <literal>endptr</literal> свободно можно передать NULL.

source: Convert a variable of type interval to its textual representation. <synopsis> char *PGTYPESinterval_to_asc(interval *span); </synopsis> The function converts the interval variable that <literal>span</literal> points to into a C char*. The output looks like this example: <literal>@ 1 day 12 hours 59 mins 10 secs</literal>.
ru: Преобразует переменную типа interval в текстовое представление. <synopsis> char *PGTYPESinterval_to_asc(interval *span); </synopsis> Эта функция преобразует переменную типа interval, на которую указывает <literal>span</literal>, в строку C char*. Её вывод выглядит примерно так: <literal>@ 1 day 12 hours 59 mins 10 secs</literal>.

source: Copy a variable of type interval. <synopsis> int PGTYPESinterval_copy(interval *intvlsrc, interval *intvldest); </synopsis> The function copies the interval variable that <literal>intvlsrc</literal> points to into the variable that <literal>intvldest</literal> points to. Note that you need to allocate the memory for the destination variable before.
ru: Копирует переменную типа interval. <synopsis> int PGTYPESinterval_copy(interval *intvlsrc, interval *intvldest); </synopsis> Эта функция копирует переменную типа interval, на которую указывает <literal>intvlsrc</literal>, в переменную, на которую указывает <literal>intvldest</literal>. Заметьте, что для целевой переменной необходимо предварительно выделить память.

source: The following functions can be used to work with the interval type: <placeholder-1/>
ru: Для работы с типом interval можно использовать следующие функции: <placeholder-1/>

source: The decimal Type
ru: Тип decimal

source: The decimal type is similar to the numeric type. However it is limited to a maximum precision of 30 significant digits. In contrast to the numeric type which can be created on the heap only, the decimal type can be created either on the stack or on the heap (by means of the functions <function>PGTYPESdecimal_new</function> and <function>PGTYPESdecimal_free</function>). There are a lot of other functions that deal with the decimal type in the <productname>Informix</productname> compatibility mode described in <xref linkend="ecpg-informix-compat"/>.
ru: Тип decimal похож на тип numeric, однако его максимальная точность ограничена 30 значащими цифрами. В отличие от типа numeric, который можно создать только в области кучи, тип decimal можно создать и в стеке, и в области кучи (посредством функций <function>PGTYPESdecimal_new</function> и <function>PGTYPESdecimal_free</function>). Для работы с типом decimal есть много других функций, подключаемых в режиме совместимости с <productname>Informix</productname>, описанном в <xref remap="6" linkend="ecpg-informix-compat"/>.

source: Request a pointer to a newly allocated decimal variable. <synopsis> decimal *PGTYPESdecimal_new(void); </synopsis>
ru: Запрашивает указатель на новую переменную decimal, размещённую в памяти. <synopsis> decimal *PGTYPESdecimal_new(void); </synopsis>

source: Free a decimal type, release all of its memory. <synopsis> void PGTYPESdecimal_free(decimal *var); </synopsis>
ru: Освобождает переменную типа decimal, высвобождая всю её память. <synopsis> void PGTYPESdecimal_free(decimal *var); </synopsis>

source: The following functions can be used to work with the decimal type and are not only contained in the <literal>libcompat</literal> library. <placeholder-1/>
ru: Для работы с типом decimal можно использовать следующие функции (содержащиеся не в библиотеке <literal>libcompat</literal>). <placeholder-1/>

source: errno Values of pgtypeslib
ru: Значения errno, которые устанавливает pgtypeslib

source: An argument should contain a numeric variable (or point to a numeric variable) but in fact its in-memory representation was invalid.
ru: Аргумент должен содержать переменную типа numeric (либо указывать на переменную типа numeric), но представление этого типа в памяти оказалось некорректным.

source: An overflow occurred. Since the numeric type can deal with almost arbitrary precision, converting a numeric variable into other types might cause overflow.
ru: Произошло переполнение. Так как тип numeric может принимать значения практически любой точности, при преобразовании этого типа в другие типы возможно переполнение.

source: An underflow occurred. Since the numeric type can deal with almost arbitrary precision, converting a numeric variable into other types might cause underflow.
ru: Произошло антипереполнение. Так как тип numeric может принимать значения практически любой точности, при преобразовании переменной этого типа в другие типы возможно антипереполнение.

source: A division by zero has been attempted.
ru: Имела место попытка деления на ноль.

source: An invalid date string was passed to the <function>PGTYPESdate_from_asc</function> function.
ru: Функции <function>PGTYPESdate_from_asc</function> передана некорректная строка даты.

source: Invalid arguments were passed to the <function>PGTYPESdate_defmt_asc</function> function.
ru: Функции <function>PGTYPESdate_defmt_asc</function> переданы некорректные аргументы.

source: An invalid token in the input string was found by the <function>PGTYPESdate_defmt_asc</function> function.
ru: В строке, переданной функции <function>PGTYPESdate_defmt_asc</function>, оказался неправильный компонент даты.

source: An invalid interval string was passed to the <function>PGTYPESinterval_from_asc</function> function, or an invalid interval value was passed to the <function>PGTYPESinterval_to_asc</function> function.
ru: Функции <function>PGTYPESinterval_from_asc</function> передана некорректная строка, задающая интервал, либо функции <function>PGTYPESinterval_to_asc</function> передано некорректное значение интервала.

source: There was a mismatch in the day/month/year assignment in the <function>PGTYPESdate_defmt_asc</function> function.
ru: Обнаружено несоответствие при выводе компонентов день/месяц/год в функции <function>PGTYPESdate_defmt_asc</function>.

source: An invalid day of the month value was found by the <function>PGTYPESdate_defmt_asc</function> function.
ru: Функция <function>PGTYPESdate_defmt_asc</function> обнаружила некорректное значение дня месяца.

source: An invalid month value was found by the <function>PGTYPESdate_defmt_asc</function> function.
ru: Функция <function>PGTYPESdate_defmt_asc</function> обнаружила некорректное значение месяца.

source: An invalid timestamp string pass passed to the <function>PGTYPEStimestamp_from_asc</function> function, or an invalid timestamp value was passed to the <function>PGTYPEStimestamp_to_asc</function> function.
ru: Функции <function>PGTYPEStimestamp_from_asc</function> передана некорректная строка даты/времени, либо функции <function>PGTYPEStimestamp_to_asc</function> передано некорректное значение типа timestamp.

source: An infinite timestamp value was encountered in a context that cannot handle it.
ru: Значение типа timestamp, представляющее бесконечность, получено в недопустимом контексте.

source: Special Constants of pgtypeslib
ru: Специальные константы pgtypeslib

source: A value of type timestamp representing an invalid time stamp. This is returned by the function <function>PGTYPEStimestamp_from_asc</function> on parse error. Note that due to the internal representation of the <type>timestamp</type> data type, <literal>PGTYPESInvalidTimestamp</literal> is also a valid timestamp at the same time. It is set to <literal>1899-12-31 23:59:59</literal>. In order to detect errors, make sure that your application does not only test for <literal>PGTYPESInvalidTimestamp</literal> but also for <literal>errno != 0</literal> after each call to <function>PGTYPEStimestamp_from_asc</function>.
ru: Значение типа timestamp, представляющее недопустимое время. Это значение возвращает функция <function>PGTYPEStimestamp_from_asc</function> при ошибке разбора. Заметьте, что вследствие особенности внутреннего представления типа <type>timestamp</type>, значение <literal>PGTYPESInvalidTimestamp</literal> в то же время представляет корректное время (<literal>1899-12-31 23:59:59</literal>). Поэтому для выявления ошибок необходимо, чтобы приложение не только сравнивало результат функции с <literal>PGTYPESInvalidTimestamp</literal>, но и проверяло условие <literal>errno != 0</literal> после каждого вызова <function>PGTYPEStimestamp_from_asc</function>.

source: Using Descriptor Areas
ru: Использование областей дескрипторов
