Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: <literal>CDOUBLETYPE</literal> - For a variable of type <type>double</type>
ru: <literal>CDOUBLETYPE</literal> — для переменной типа <type>double</type>

source: <literal>CDECIMALTYPE</literal> - For a variable of type <type>decimal</type>
ru: <literal>CDECIMALTYPE</literal> — для переменной типа <type>decimal</type>

source: <literal>CDATETYPE</literal> - For a variable of type <type>date</type>
ru: <literal>CDATETYPE</literal> — для переменной типа <type>date</type>

source: <literal>CDTIMETYPE</literal> - For a variable of type <type>timestamp</type>
ru: <literal>CDTIMETYPE</literal> — для переменной типа <type>timestamp</type>

source: The following types exist: <placeholder-1/>
ru: Определены следующие типы: <placeholder-1/>

source: Here is an example of a call to this function: <placeholder-1/>
ru: Примеры вызова этой функции: <placeholder-1/>

source: Test if a variable is NULL. <synopsis> int risnull(int t, char *ptr); </synopsis> The function receives the type of the variable to test (<literal>t</literal>) as well a pointer to this variable (<literal>ptr</literal>). Note that the latter needs to be cast to a char*. See the function <xref linkend="rsetnull"/> for a list of possible variable types.
ru: Проверяет содержимое переменной на NULL. <synopsis> int risnull(int t, char *ptr); </synopsis> Эта функция получает тип проверяемой переменной (<literal>t</literal>), а также указатель на неё (<literal>ptr</literal>). Заметьте, что этот указатель нужно привести к char*. Список возможных типов переменных приведён в описании функции <xref linkend="rsetnull"/>.

source: Here is an example of how to use this function: <placeholder-1/>
ru: Примеры использования этой функции: <placeholder-1/>

source: Additional Constants
ru: Дополнительные константы

source: Functions return this value if an overflow occurred in a calculation. Internally it is defined as -1200 (the <productname>Informix</productname> definition).
ru: Функции возвращают это значение, если при вычислении происходит переполнение. Внутри оно представляется числом -1200 (определение <productname>Informix</productname>).

source: Functions return this value if an underflow occurred in a calculation. Internally it is defined as -1201 (the <productname>Informix</productname> definition).
ru: Функции возвращают это значение, если при вычислении происходит антипереполнение. Внутри оно представляется числом -1201 (определение <productname>Informix</productname>).

source: Functions return this value if an attempt to divide by zero is observed. Internally it is defined as -1202 (the <productname>Informix</productname> definition).
ru: Функции возвращают это значение при попытке деления на ноль. Внутри оно представляется числом -1202 (определение <productname>Informix</productname>).

source: Functions return this value if a bad value for a year was found while parsing a date. Internally it is defined as -1204 (the <productname>Informix</productname> definition).
ru: Функции возвращают это значение, если при разборе даты встретилось некорректное указание года. Внутри оно представляется числом -1204 (определение <productname>Informix</productname>).

source: Functions return this value if a bad value for a month was found while parsing a date. Internally it is defined as -1205 (the <productname>Informix</productname> definition).
ru: Функции возвращают это значение, если при разборе даты встретилось некорректное указание месяца. Внутри оно представляется числом -1205 (определение <productname>Informix</productname>).

source: Functions return this value if a bad value for a day was found while parsing a date. Internally it is defined as -1206 (the <productname>Informix</productname> definition).
ru: Функции возвращают это значение, если при разборе даты встретилось некорректное указание дня. Внутри оно представляется числом -1206 (определение <productname>Informix</productname>).

source: Functions return this value if a parsing routine needs a short date representation but did not get the date string in the right length. Internally it is defined as -1209 (the <productname>Informix</productname> definition).
ru: Функции возвращают это значение, если процедуре разбора даты требуется короткая запись даты, но строка даты имеет неподходящую длину. Внутри оно представляется числом -1209 (определение <productname>Informix</productname>).

source: Functions return this value if an error occurred during date formatting. Internally it is defined as -1210 (the <productname>Informix</productname> definition).
ru: Функции возвращают это значение, если при форматировании даты происходит ошибка. Внутри оно представляется числом -1210 (определение <productname>Informix</productname>).

source: Functions return this value if memory was exhausted during their operation. Internally it is defined as -1211 (the <productname>Informix</productname> definition).
ru: Функции возвращают это значение, если им не хватает памяти для выполнения операций. Внутри оно представляется числом -1211 (определение <productname>Informix</productname>).

source: Functions return this value if a parsing routine was supposed to get a format mask (like <literal>mmddyy</literal>) but not all fields were listed correctly. Internally it is defined as -1212 (the <productname>Informix</productname> definition).
ru: Функции возвращают это значение, если процедура разбора должна была получить маску формата (например, <literal>mmddyy</literal>), но не все поля были записаны правильно. Внутри оно представляется числом -1212 (определение <productname>Informix</productname>).

source: Functions return this value either if a parsing routine cannot parse the textual representation for a numeric value because it contains errors or if a routine cannot complete a calculation involving numeric variables because at least one of the numeric variables is invalid. Internally it is defined as -1213 (the <productname>Informix</productname> definition).
ru: Функции возвращают это значение, если процедура разбора не может получить числовое значение из текстового представления, потому что оно некорректно, либо если процедура вычисления не может произвести операцию с числовыми переменными из-за недопустимого значения минимум одной из этих переменных. Внутри оно представляется числом -1213 (определение <productname>Informix</productname>).

source: Functions return this value if a parsing routine cannot parse an exponent. Internally it is defined as -1216 (the <productname>Informix</productname> definition).
ru: Функции возвращают это значение, если процедура разбора не может воспринять экспоненту в числе. Внутри оно представляется числом -1216 (определение <productname>Informix</productname>).

source: Functions return this value if a parsing routine cannot parse a date. Internally it is defined as -1218 (the <productname>Informix</productname> definition).
ru: Функции возвращают это значение, если процедура разбора не может разобрать дату. Внутри оно представляется числом -1218 (определение <productname>Informix</productname>).

source: Functions return this value if a parsing routine is passed extra characters it cannot parse. Internally it is defined as -1264 (the <productname>Informix</productname> definition).
ru: Функции возвращают это значение, если процедуре разбора передаются посторонние символы, которая она не может разобрать. Внутри оно представляется числом -1264 (определение <productname>Informix</productname>).

source: Note that all constants here describe errors and all of them are defined to represent negative values. In the descriptions of the different constants you can also find the value that the constants represent in the current implementation. However you should not rely on this number. You can however rely on the fact all of them are defined to represent negative values. <placeholder-1/>
ru: Заметьте, что все эти константы относятся к ошибкам и все они представлены отрицательными значениями. Из описаний различных констант вы также можете узнать, какими именно числами они представлены в текущей реализации. Однако полагаться на эти числа не следует. Тем не менее, вы можете рассчитывать на то, что все эти значения будут отрицательными. <placeholder-1/>

source: Internals
ru: Внутреннее устройство

source: This section explains how <application>ECPG</application> works internally. This information can occasionally be useful to help users understand how to use <application>ECPG</application>.
ru: В этом разделе рассказывается, как препроцессор <application>ECPG</application> устроен внутри. Эта информация может оказаться полезной для пользователей, желающих понять, как использовать <application>ECPG</application>.

source: The first four lines written by <command>ecpg</command> to the output are fixed lines. Two are comments and two are include lines necessary to interface to the library. Then the preprocessor reads through the file and writes output. Normally it just echoes everything to the output.
ru: Первые четыре строки, которые <command>ecpg</command> записывает в вывод, фиксированы. Первые две строки содержат комментарии, а следующие две директивы включения, подключающие интерфейс к библиотеке. Затем препроцессор прочитывает файл и продолжает запись в вывод. Обычно он просто печатает всё в устройство вывода.

source: When it sees an <command>EXEC SQL</command> statement, it intervenes and changes it. The command starts with <command>EXEC SQL</command> and ends with <command>;</command>. Everything in between is treated as an <acronym>SQL</acronym> statement and parsed for variable substitution.
ru: Встречая команду <command>EXEC SQL</command>, он вмешивается и изменяет её. Данная команда начинается со слов <command>EXEC SQL</command> и заканчивается знаком <command>;</command>. Всё между ними воспринимается как оператор <acronym>SQL</acronym> и разбирается для подстановки переменных.

source: Variable substitution occurs when a symbol starts with a colon (<literal>:</literal>). The variable with that name is looked up among the variables that were previously declared within a <literal>EXEC SQL DECLARE</literal> section.
ru: Подстановка переменных имеет место, когда символ начинается с двоеточия (<literal>:</literal>). ECPG будет искать переменную с таким именем среди переменных, ранее объявленных в секции <literal>EXEC SQL DECLARE</literal>.

source: The most important function in the library is <function>ECPGdo</function>, which takes care of executing most commands. It takes a variable number of arguments. This can easily add up to 50 or so arguments, and we hope this will not be a problem on any platform.
ru: Самая важная функция в библиотеке — <function>ECPGdo</function>, которая осуществляет выполнение большинства команд. Она принимает переменное число аргументов (это число легко может достигать 50, и мы надеемся, что это не приведёт к проблемам ни на какой платформе).

source: A line number
ru: Номер строки

source: This is the line number of the original line; used in error messages only.
ru: Номер исходной строки; используется только в сообщениях об ошибках.

source: A string
ru: Строка

source: This is the <acronym>SQL</acronym> command that is to be issued. It is modified by the input variables, i.e., the variables that where not known at compile time but are to be entered in the command. Where the variables should go the string contains <literal>?</literal>.
ru: Команда <acronym>SQL</acronym>, которая должна быть выполнена. На её содержимое влияют входные переменные, то есть переменные, добавленные в команду, но неизвестные во время компиляции. Места, в которые должны вставляться переменные, обозначаются знаками <literal>?</literal>.

source: Input variables
ru: Входные переменные

source: Every input variable causes ten arguments to be created. (See below.)
ru: Для каждой входной переменной формируются десять аргументов. (См. ниже.)

source: An <type>enum</type> telling that there are no more input variables.
ru: Перечисление (<type>enum</type>), показывающее, что больше входных переменных нет.

source: Output variables
ru: Выходные переменные

source: Every output variable causes ten arguments to be created. (See below.) These variables are filled by the function.
ru: Для каждой входной переменной формируются десять аргументов. (См. ниже.) Эти переменные заполняются данной функцией.

source: An <type>enum</type> telling that there are no more variables.
ru: Перечисление (<type>enum</type>), показывающее, что больше выходных переменных нет.

source: The arguments are: <placeholder-1/>
ru: Ей передаются следующие аргументы: <placeholder-1/>

source: The type as a special symbol.
ru: Тип в виде специального символа.

source: A pointer to the value or a pointer to the pointer.
ru: Указатель на значение или указатель на указатель.

source: The size of the variable if it is a <type>char</type> or <type>varchar</type>.
ru: Размер переменной, если она имеет тип <type>char</type> или <type>varchar</type>.

source: The number of elements in the array (for array fetches).
ru: Число элементов в массиве (при выборке данных в массив).

source: The offset to the next element in the array (for array fetches).
ru: Смещение следующего элемента в массиве (при выборке данных в массив).

source: The type of the indicator variable as a special symbol.
ru: Тип переменной-индикатора в виде специального символа.

source: A pointer to the indicator variable.
ru: Указатель на переменную-индикатор.

source: The number of elements in the indicator array (for array fetches).
ru: Число элементов в массиве индикаторов (при выборке данных в массив).

source: The offset to the next element in the indicator array (for array fetches).
ru: Смещение следующего элемента в массиве индикаторов (при выборке данных в массив).

source: For every variable that is part of the <acronym>SQL</acronym> command, the function gets ten arguments: <placeholder-1/>
ru: Для каждой переменной, включённой в команду <acronym>SQL</acronym>, эта функция принимает десять аргументов: <placeholder-1/>

source: EXEC SQL OPEN <replaceable>cursor</replaceable>;
ru: EXEC SQL OPEN <replaceable>курсор</replaceable>;

source: Note that not all SQL commands are treated in this way. For instance, an open cursor statement like: <placeholder-1/> is not copied to the output. Instead, the cursor's <command>DECLARE</command> command is used at the position of the <command>OPEN</command> command because it indeed opens the cursor.
ru: Заметьте, что не все команды SQL обрабатываются таким образом. Например, команда открытия курсора вида: <placeholder-1/> не копируется в вывод. Вместо этого в позиции команды <command>OPEN</command> применяется команда <command>DECLARE</command> этого курсора, так как на самом деле курсор открывает она.

source: Here is a complete example describing the output of the preprocessor of a file <filename>foo.pgc</filename> (details might change with each particular version of the preprocessor): <placeholder-1/> is translated into: <placeholder-2/> (The indentation here is added for readability and not something the preprocessor does.)
ru: Ниже показан полный пример, демонстрирующий результат обработки препроцессором файла <filename>foo.pgc</filename> (детали могут меняться от версии к версии препроцессора): <placeholder-1/> преобразуется в: <placeholder-2/> (Отступы здесь добавлены для читаемости, препроцессор их не вставляет.)

source: The second option is to execute a statement to switch the current connection. That statement is: <placeholder-1/> This option is particularly convenient if many statements are to be executed on the same connection. It is not thread-aware.
ru: Второй вариант — выполнять оператор, переключающий текущее подключение. Этот оператор записывается так: <placeholder-1/> Этот вариант особенно удобен, когда с одним подключением нужно выполнить несколько операторов. Он не является потокобезопасным.

source: Before you can use an SQL descriptor area, you need to allocate one: <placeholder-1/> The identifier serves as the <quote>variable name</quote> of the descriptor area. <remark>The scope of the allocated descriptor is WHAT?.</remark> When you don't need the descriptor anymore, you should deallocate it: <placeholder-2/>
ru: Прежде чем вы сможете использовать область SQL-дескриптора, её нужно выделить: <placeholder-1/> Заданный идентификатор играет роль <quote>имени переменной</quote> области дескриптора. <remark>Какова область видимости выделенного дескриптора?</remark> Когда дескриптор оказывается ненужным, его следует освободить: <placeholder-2/>
