Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: New user-defined base types are not directly supported by ECPG. You can use the external string representation and host variables of type <type>char[]</type> or <type>VARCHAR[]</type>, and this solution is indeed appropriate and sufficient for many types.
ru: Определяемые пользователем базовые типы не поддерживаются ECPG напрямую. Для них можно использовать внешнее строковое представление и переменные среды типа <type>char[]</type> или <type>VARCHAR[]</type>, и это решение действительно будет подходящим и достаточным для большинства типов.

source: Here is an example using the data type <type>complex</type> from the example in <xref linkend="xtypes"/>. The external string representation of that type is <literal>(%lf,%lf)</literal>, which is defined in the functions <function>complex_in()</function> and <function>complex_out()</function> functions in <xref linkend="xtypes"/>. The following example inserts the complex type values <literal>(1,1)</literal> and <literal>(3,3)</literal> into the columns <literal>a</literal> and <literal>b</literal>, and select them from the table after that. <placeholder-1/> This example shows following result: <screen> a=(1,1), b=(3,3) </screen>
ru: Следующий фрагмент кода демонстрирует использование типа данных <type>complex</type> из примера в <xref remap="6" linkend="xtypes"/>. Внешнее строковое представление этого типа имеет форму <literal>(%lf,%lf)</literal> и определено в функциях <function>complex_in()</function> и <function>complex_out()</function> в <xref remap="6" linkend="xtypes"/>. Следующий пример вставляет значения комплексного типа <literal>(1,1)</literal> и <literal>(3,3)</literal> в столбцы <literal>a</literal> и <literal>b</literal>, а затем выбирает их из таблицы. <placeholder-1/> Этот пример выводит следующий результат: <screen> a=(1,1), b=(3,3) </screen>

source: Another workaround is avoiding the direct use of the user-defined types in ECPG and instead create a function or cast that converts between the user-defined type and a primitive type that ECPG can handle. Note, however, that type casts, especially implicit ones, should be introduced into the type system very carefully.
ru: Другое обходное решение состоит в том, чтобы избегать прямого использования пользовательских типов в ECPG, а вместо этого создать функцию или приведение, выполняющее преобразование между пользовательским типом и примитивным типом, который может обработать ECPG. Заметьте однако, что приведения типов, особенно неявные, нужно добавлять в систему типов очень осторожно.

source: For example, <placeholder-1/> After this definition, the following <placeholder-2/> has the same effect as <placeholder-3/>
ru: Например: <placeholder-1/> После такого определения следующий код <placeholder-2/> будет работать так же, как <placeholder-3/>

source: Indicators
ru: Индикаторы

source: The examples above do not handle null values. In fact, the retrieval examples will raise an error if they fetch a null value from the database. To be able to pass null values to the database or retrieve null values from the database, you need to append a second host variable specification to each host variable that contains data. This second host variable is called the <firstterm>indicator</firstterm> and contains a flag that tells whether the datum is null, in which case the value of the real host variable is ignored. Here is an example that handles the retrieval of null values correctly: <placeholder-1/> The indicator variable <varname>val_ind</varname> will be zero if the value was not null, and it will be negative if the value was null.
ru: Приведённые выше примеры никак не обрабатывали значения NULL. На самом деле, в примерах с извлечением данных возникнет ошибка, если они выберут из базы данных значение NULL. Чтобы можно было передавать значения NULL в базу данных или получать их из базы данных, вы должны добавить объявление второй переменной среды для каждой переменной среды, содержащей данные. Эта вторая переменная среды называется <firstterm>индикатором</firstterm> и содержит флаг, показывающий, что в данных передаётся NULL, и при этом значение основной переменной среды игнорируется. Следующий пример демонстрирует правильную обработку значений NULL: <placeholder-1/> Переменная индикатора <varname>val_ind</varname> будет равна нулю, если значение не NULL, или отрицательному числу, если NULL.

source: The indicator has another function: if the indicator value is positive, it means that the value is not null, but it was truncated when it was stored in the host variable.
ru: Индикатор выполняет ещё одну функцию: если он содержит положительное число, это означает, что значение не NULL, но оно было обрезано, когда сохранялось в переменной среды.

source: If the argument <literal>-r no_indicator</literal> is passed to the preprocessor <command>ecpg</command>, it works in <quote>no-indicator</quote> mode. In no-indicator mode, if no indicator variable is specified, null values are signaled (on input and output) for character string types as empty string and for integer types as the lowest possible value for type (for example, <symbol>INT_MIN</symbol> for <type>int</type>).
ru: Если препроцессору <command>ecpg</command> передаётся аргумент <literal>-r no_indicator</literal>, он работает в режиме <quote>без индикатора</quote>. В этом режиме, если переменная индикатора не определена, значения NULL обозначаются (при вводе и выводе) для символьных строк пустой строкой, а для целочисленных типов наименьшим возможным значением этого типа (например, <symbol>INT_MIN</symbol> для <type>int</type>).

source: Dynamic SQL
ru: Динамический SQL

source: In many cases, the particular SQL statements that an application has to execute are known at the time the application is written. In some cases, however, the SQL statements are composed at run time or provided by an external source. In these cases you cannot embed the SQL statements directly into the C source code, but there is a facility that allows you to call arbitrary SQL statements that you provide in a string variable.
ru: Во многих случаях конкретные операторы SQL, которые должно выполнять приложение, известны в момент написания приложения. В некоторых случаях, однако, операторы SQL формируются во время выполнения или поступают из внешнего источника. В этих случаях операторы SQL нельзя внедрить непосредственно в исходный код C, но есть средство, позволяющее вызывать произвольные операторы SQL, передаваемые в строковой переменной.

source: Executing Statements without a Result Set
ru: Выполнение операторов без набора результатов

source: The simplest way to execute an arbitrary SQL statement is to use the command <command>EXECUTE IMMEDIATE</command>. For example: <placeholder-1/> <command>EXECUTE IMMEDIATE</command> can be used for SQL statements that do not return a result set (e.g., DDL, <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>). You cannot execute statements that retrieve data (e.g., <command>SELECT</command>) this way. The next section describes how to do that.
ru: Самый простой способ выполнить произвольный оператор SQL — применить команду <command>EXECUTE IMMEDIATE</command>. Например: <placeholder-1/> <command>EXECUTE IMMEDIATE</command> можно применять для SQL-операторов, которые не возвращают набор результатов (например, DDL, <command>INSERT</command>, <command>UPDATE</command>, <command>DELETE</command>). Выполнять операторы, которые получают данные, (например, <command>SELECT</command>) таким образом нельзя. Как выполнять такие операторы, рассказывается в следующем разделе.

source: Executing a Statement with Input Parameters
ru: Выполнение оператора с входными параметрами

source: A more powerful way to execute arbitrary SQL statements is to prepare them once and execute the prepared statement as often as you like. It is also possible to prepare a generalized version of a statement and then execute specific versions of it by substituting parameters. When preparing the statement, write question marks where you want to substitute parameters later. For example: <placeholder-1/>
ru: Более эффективно выполнять произвольный оператор SQL можно, подготовив его один раз, а затем запуская подготовленный оператор столько, сколько нужно. Также можно подготовить обобщённую версию оператора, а затем выполнять специализированные его версии, подставляя в него параметры. Подготавливая оператор, поставьте знаки вопроса там, где позже хотите подставить параметры. Например: <placeholder-1/>

source: Executing a Statement with a Result Set
ru: Выполнение оператора с набором результатов

source: To execute an SQL statement with a single result row, <command>EXECUTE</command> can be used. To save the result, add an <literal>INTO</literal> clause. <placeholder-1/> An <command>EXECUTE</command> command can have an <literal>INTO</literal> clause, a <literal>USING</literal> clause, both, or neither.
ru: Для выполнения оператора SQL с одной строкой результата можно применить команду <command>EXECUTE</command>. Чтобы сохранить результат, добавьте предложение <literal>INTO</literal>. <placeholder-1/> Команда <command>EXECUTE</command> может содержать предложение <literal>INTO</literal> и/или предложение <literal>USING</literal>, либо не содержать ни того, ни другого.

source: If a query is expected to return more than one result row, a cursor should be used, as in the following example. (See <xref linkend="ecpg-cursors"/> for more details about the cursor.) <placeholder-1/>
ru: Если ожидается, что запрос вернёт более одной строки результата, следует применять курсор, как показано в следующем примере. (Подробно курсоры описываются в <xref remap="6" linkend="ecpg-cursors"/>.) <placeholder-1/>

source: pgtypes Library
ru: Библиотека pgtypes

source: The pgtypes library maps <productname>PostgreSQL</productname> database types to C equivalents that can be used in C programs. It also offers functions to do basic calculations with those types within C, i.e., without the help of the <productname>PostgreSQL</productname> server. See the following example: <placeholder-1/>
ru: Библиотека pgtypes сопоставляет типы базы данных <productname>PostgreSQL</productname> с их эквивалентами в C, которые можно использовать в программах на C. Она также предлагает функции для выполнения простых вычислений с этими типами в C, то есть без помощи сервера <productname>PostgreSQL</productname>. Рассмотрите следующий пример: <placeholder-1/>

source: The numeric Type
ru: Тип numeric

source: The numeric type offers to do calculations with arbitrary precision. See <xref linkend="datatype-numeric"/> for the equivalent type in the <productname>PostgreSQL</productname> server. Because of the arbitrary precision this variable needs to be able to expand and shrink dynamically. That's why you can only create numeric variables on the heap, by means of the <function>PGTYPESnumeric_new</function> and <function>PGTYPESnumeric_free</function> functions. The decimal type, which is similar but limited in precision, can be created on the stack as well as on the heap.
ru: Тип numeric позволяет производить вычисления с произвольной точностью. Эквивалентный ему тип на сервере <productname>PostgreSQL</productname> описан в <xref remap="6" linkend="datatype-numeric"/>. Ввиду того, что переменная имеет произвольную точность, она должна расширяться и сжиматься динамически. Поэтому такие переменные можно создавать только в области кучи, используя функции <function>PGTYPESnumeric_new</function> и <function>PGTYPESnumeric_free</function>. Тип decimal подобен numeric, но имеет ограниченную точность, и поэтому может размещаться и в области кучи, и в стеке.

source: Request a pointer to a newly allocated numeric variable. <synopsis> numeric *PGTYPESnumeric_new(void); </synopsis>
ru: Запрашивает указатель на новую переменную, размещённую в памяти. <synopsis> numeric *PGTYPESnumeric_new(void); </synopsis>

source: Free a numeric type, release all of its memory. <synopsis> void PGTYPESnumeric_free(numeric *var); </synopsis>
ru: Освобождает переменную типа numeric, высвобождая всю её память. <synopsis> void PGTYPESnumeric_free(numeric *var); </synopsis>

source: Parse a numeric type from its string notation. <synopsis> numeric *PGTYPESnumeric_from_asc(char *str, char **endptr); </synopsis> Valid formats are for example: <literal>-2</literal>, <literal>.794</literal>, <literal>+3.44</literal>, <literal>592.49E07</literal> or <literal>-32.84e-4</literal>. If the value could be parsed successfully, a valid pointer is returned, else the NULL pointer. At the moment ECPG always parses the complete string and so it currently does not support to store the address of the first invalid character in <literal>*endptr</literal>. You can safely set <literal>endptr</literal> to NULL.
ru: Разбирает числовой тип из строковой записи. <synopsis> numeric *PGTYPESnumeric_from_asc(char *str, char **endptr); </synopsis> Допускаются в частности следующие форматы: <literal>-2</literal>, <literal>.794</literal>, <literal>+3.44</literal>, <literal>592.49E07</literal> и <literal>-32.84e-4</literal>. Если значение удаётся разобрать успешно, возвращается действительный указатель, в противном случае указатель NULL. На данный момент ECPG всегда разбирает строку до конца, так что эта функция не может вернуть адрес первого недопустимого символа в <literal>*endptr</literal>. Поэтому в <literal>endptr</literal> свободно можно передать NULL.

source: Returns a pointer to a string allocated by <function>malloc</function> that contains the string representation of the numeric type <literal>num</literal>. <synopsis> char *PGTYPESnumeric_to_asc(numeric *num, int dscale); </synopsis> The numeric value will be printed with <literal>dscale</literal> decimal digits, with rounding applied if necessary.
ru: Возвращает указатель на строку, выделенную функцией <function>malloc</function> и содержащую строковое представление значения <literal>num</literal> числового типа. <synopsis> char *PGTYPESnumeric_to_asc(numeric *num, int dscale); </synopsis> Числовое значение будет выводиться с заданным в <literal>dscale</literal> количеством цифр после запятой, округлённое при необходимости.

source: Add two numeric variables into a third one. <synopsis> int PGTYPESnumeric_add(numeric *var1, numeric *var2, numeric *result); </synopsis> The function adds the variables <literal>var1</literal> and <literal>var2</literal> into the result variable <literal>result</literal>. The function returns 0 on success and -1 in case of error.
ru: Суммирует две числовые переменные и возвращает результат в третьей. <synopsis> int PGTYPESnumeric_add(numeric *var1, numeric *var2, numeric *result); </synopsis> Эта функция суммирует переменные <literal>var1</literal> и <literal>var2</literal> в результирующую переменную <literal>result</literal>. Функция возвращает 0 в случае успеха и -1 при ошибке.

source: Subtract two numeric variables and return the result in a third one. <synopsis> int PGTYPESnumeric_sub(numeric *var1, numeric *var2, numeric *result); </synopsis> The function subtracts the variable <literal>var2</literal> from the variable <literal>var1</literal>. The result of the operation is stored in the variable <literal>result</literal>. The function returns 0 on success and -1 in case of error.
ru: Вычисляет разность двух числовых переменных и возвращает результат в третьей. <synopsis> int PGTYPESnumeric_sub(numeric *var1, numeric *var2, numeric *result); </synopsis> Эта функция вычитает переменную <literal>var2</literal> из <literal>var1</literal>. Результат операции помещается в переменную <literal>result</literal>. Функция возвращает 0 в случае успеха и -1 при ошибке.

source: Multiply two numeric variables and return the result in a third one. <synopsis> int PGTYPESnumeric_mul(numeric *var1, numeric *var2, numeric *result); </synopsis> The function multiplies the variables <literal>var1</literal> and <literal>var2</literal>. The result of the operation is stored in the variable <literal>result</literal>. The function returns 0 on success and -1 in case of error.
ru: Перемножает две числовые переменные и возвращает результат в третьей. <synopsis> int PGTYPESnumeric_mul(numeric *var1, numeric *var2, numeric *result); </synopsis> Эта функция перемножает переменные <literal>var1</literal> и <literal>var2</literal>. Результат операции сохраняется в переменной <literal>result</literal>. Функция возвращает 0 в случае успеха и -1 при ошибке.

source: Divide two numeric variables and return the result in a third one. <synopsis> int PGTYPESnumeric_div(numeric *var1, numeric *var2, numeric *result); </synopsis> The function divides the variables <literal>var1</literal> by <literal>var2</literal>. The result of the operation is stored in the variable <literal>result</literal>. The function returns 0 on success and -1 in case of error.
ru: Вычисляет частное двух числовых переменных и возвращает результат в третьей. <synopsis> int PGTYPESnumeric_div(numeric *var1, numeric *var2, numeric *result); </synopsis> Эта функция делит переменную <literal>var1</literal> на <literal>var2</literal>. Результат операции сохраняется в переменной <literal>result</literal>. Функция возвращает 0 в случае успеха и -1 при ошибке.

source: 1, if <literal>var1</literal> is bigger than <literal>var2</literal>
ru: 1, если <literal>var1</literal> больше <literal>var2</literal>

source: -1, if <literal>var1</literal> is smaller than <literal>var2</literal>
ru: -1, если <literal>var1</literal> меньше <literal>var2</literal>

source: 0, if <literal>var1</literal> and <literal>var2</literal> are equal
ru: 0, если <literal>var1</literal> и <literal>var2</literal> равны

source: Compare two numeric variables. <synopsis> int PGTYPESnumeric_cmp(numeric *var1, numeric *var2) </synopsis> This function compares two numeric variables. In case of error, <literal>INT_MAX</literal> is returned. On success, the function returns one of three possible results: <placeholder-1/>
ru: Сравнивает две числовые переменные. <synopsis> int PGTYPESnumeric_cmp(numeric *var1, numeric *var2) </synopsis> Эта функция производит сравнение двух числовых переменных. При ошибке возвращается <literal>INT_MAX</literal>. В случае успеха функция возвращает одно из трёх возможных значений: <placeholder-1/>

source: Convert an int variable to a numeric variable. <synopsis> int PGTYPESnumeric_from_int(signed int int_val, numeric *var); </synopsis> This function accepts a variable of type signed int and stores it in the numeric variable <literal>var</literal>. Upon success, 0 is returned and -1 in case of a failure.
ru: Преобразует переменную int в переменную numeric. <synopsis> int PGTYPESnumeric_from_int(signed int int_val, numeric *var); </synopsis> Эта функция принимает целочисленную переменную со знаком типа signed int и сохраняет её значение в переменной <literal>var</literal> типа numeric. Функция возвращает 0 в случае успеха и -1 при ошибке.

source: Convert a long int variable to a numeric variable. <synopsis> int PGTYPESnumeric_from_long(signed long int long_val, numeric *var); </synopsis> This function accepts a variable of type signed long int and stores it in the numeric variable <literal>var</literal>. Upon success, 0 is returned and -1 in case of a failure.
ru: Преобразует переменную long int в переменную numeric. <synopsis> int PGTYPESnumeric_from_long(signed long int long_val, numeric *var); </synopsis> Эта функция принимает целочисленную переменную со знаком типа signed long int и сохраняет её значение в переменной <literal>var</literal> типа numeric. Функция возвращает 0 в случае успеха и -1 при ошибке.

source: Copy over one numeric variable into another one. <synopsis> int PGTYPESnumeric_copy(numeric *src, numeric *dst); </synopsis> This function copies over the value of the variable that <literal>src</literal> points to into the variable that <literal>dst</literal> points to. It returns 0 on success and -1 if an error occurs.
ru: Копирует одну числовую переменную в другую. <synopsis> int PGTYPESnumeric_copy(numeric *src, numeric *dst); </synopsis> Эта функция копирует значение переменной, на которую указывает <literal>src</literal>, в переменную, на которую указывает <literal>dst</literal>. Она возвращает 0 в случае успеха и -1 при ошибке.

source: Convert a variable of type double to a numeric. <synopsis> int PGTYPESnumeric_from_double(double d, numeric *dst); </synopsis> This function accepts a variable of type double and stores the result in the variable that <literal>dst</literal> points to. It returns 0 on success and -1 if an error occurs.
ru: Преобразует переменную типа double в переменную numeric. <synopsis> int PGTYPESnumeric_from_double(double d, numeric *dst); </synopsis> Эта функция принимает переменную типа double и сохраняет преобразованное значение в переменной, на которую указывает <literal>dst</literal>. Она возвращает 0 в случае успеха и -1 при ошибке.

source: Convert a variable of type numeric to double. <synopsis> int PGTYPESnumeric_to_double(numeric *nv, double *dp) </synopsis> The function converts the numeric value from the variable that <literal>nv</literal> points to into the double variable that <literal>dp</literal> points to. It returns 0 on success and -1 if an error occurs, including overflow. On overflow, the global variable <literal>errno</literal> will be set to <literal>PGTYPES_NUM_OVERFLOW</literal> additionally.
ru: Преобразует переменную типа numeric в переменную double. <synopsis> int PGTYPESnumeric_to_double(numeric *nv, double *dp) </synopsis> Эта функция преобразует значение типа numeric переменной, на которую указывает <literal>nv</literal>, в переменную типа double, на которую указывает <literal>dp</literal>. Она возвращает 0 в случае успеха и -1 при ошибке, в том числе при переполнении. Если происходит переполнение, в глобальной переменной <literal>errno</literal> дополнительно устанавливается значение <literal>PGTYPES_NUM_OVERFLOW</literal>.

source: Convert a variable of type numeric to int. <synopsis> int PGTYPESnumeric_to_int(numeric *nv, int *ip); </synopsis> The function converts the numeric value from the variable that <literal>nv</literal> points to into the integer variable that <literal>ip</literal> points to. It returns 0 on success and -1 if an error occurs, including overflow. On overflow, the global variable <literal>errno</literal> will be set to <literal>PGTYPES_NUM_OVERFLOW</literal> additionally.
ru: Преобразует переменную типа numeric в переменную int. <synopsis> int PGTYPESnumeric_to_int(numeric *nv, int *ip); </synopsis> Эта функция преобразует значение типа numeric переменной, на которую указывает <literal>nv</literal>, в целочисленную переменную, на которую указывает <literal>ip</literal>. Она возвращает 0 в случае успеха и -1 при ошибке, в том числе при переполнении. Если происходит переполнение, в глобальной переменной <literal>errno</literal> дополнительно устанавливается значение <literal>PGTYPES_NUM_OVERFLOW</literal>.
