Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: Type of the NULL indicator data. It's always SQLSMINT when returning data from the server. When the <literal>SQLDA</literal> is used for a parameterized query, the data is treated according to the set type.
ru: Тип данных индикатора NULL. При получении данных с сервера это всегда SQLSMINT. Когда <literal>SQLDA</literal> используется в параметризованном запросе, данные индикатора обрабатываются в соответствии с указанным здесь типом.

source: Length of the NULL indicator data.
ru: Длина данных индикатора NULL.

source: Extended type of the field, result of <function>PQftype()</function>.
ru: Расширенный тип поля, результат функции <function>PQftype()</function>.

source: Unused.
ru: Не используются.

source: It equals to <literal>sqldata</literal> if <literal>sqllen</literal> is larger than 32kB.
ru: Совпадает с <literal>sqldata</literal>, если <literal>sqllen</literal> превышает 32 Кбайта.

source: EXEC SQL INCLUDE sqlda.h; sqlda_t *sqlda; /* This doesn't need to be under embedded DECLARE SECTION */ EXEC SQL BEGIN DECLARE SECTION; char *prep_stmt = "select * from table1"; int i; EXEC SQL END DECLARE SECTION; ... EXEC SQL PREPARE mystmt FROM :prep_stmt; EXEC SQL DESCRIBE mystmt INTO sqlda; printf("# of fields: %d\n", sqlda-&gt;sqld); for (i = 0; i &lt; sqlda-&gt;sqld; i++) printf("field %d: \"%s\"\n", sqlda-&gt;sqlvar[i]-&gt;sqlname); EXEC SQL DECLARE mycursor CURSOR FOR mystmt; EXEC SQL OPEN mycursor; EXEC SQL WHENEVER NOT FOUND GOTO out; while (1) { EXEC SQL FETCH mycursor USING sqlda; } EXEC SQL CLOSE mycursor; free(sqlda); /* The main structure is all to be free(), * sqlda and sqlda-&gt;sqlvar is in one allocated area */
ru: EXEC SQL INCLUDE sqlda.h; sqlda_t *sqlda; /* Это объявление не обязательно должно быть внутри DECLARE SECTION */ EXEC SQL BEGIN DECLARE SECTION; char *prep_stmt = "select * from table1"; int i; EXEC SQL END DECLARE SECTION; ... EXEC SQL PREPARE mystmt FROM :prep_stmt; EXEC SQL DESCRIBE mystmt INTO sqlda; printf("# of fields: %d\n", sqlda-&gt;sqld); for (i = 0; i &lt; sqlda-&gt;sqld; i++) printf("field %d: \"%s\"\n", sqlda-&gt;sqlvar[i]-&gt;sqlname); EXEC SQL DECLARE mycursor CURSOR FOR mystmt; EXEC SQL OPEN mycursor; EXEC SQL WHENEVER NOT FOUND GOTO out; while (1) { EXEC SQL FETCH mycursor USING sqlda; } EXEC SQL CLOSE mycursor; free(sqlda); /* Освобождать нужно только основную структуру, * sqlda и sqlda-&gt;sqlvar находятся в одной выделенной области. */

source: The global properties are: <placeholder-1/> The per-field properties are below, they are stored in the <literal>sqlvar</literal> array: <placeholder-2/> Example: <placeholder-3/> For more information, see the <literal>sqlda.h</literal> header and the <literal>src/interfaces/ecpg/test/compat_informix/sqlda.pgc</literal> regression test.
ru: Глобальные свойства: <placeholder-1/> Свойства, относящиеся к полям, описаны ниже, они хранятся в массиве <literal>sqlvar</literal>: <placeholder-2/> Например: <placeholder-3/> Дополнительную информацию можно найти в заголовочном файле <literal>sqlda.h</literal> и в регрессионном тесте <literal>src/interfaces/ecpg/test/compat_informix/sqlda.pgc</literal>.

source: Additional Functions
ru: Дополнительные функции

source: Add two decimal type values. <synopsis> int decadd(decimal *arg1, decimal *arg2, decimal *sum); </synopsis> The function receives a pointer to the first operand of type decimal (<literal>arg1</literal>), a pointer to the second operand of type decimal (<literal>arg2</literal>) and a pointer to a value of type decimal that will contain the sum (<literal>sum</literal>). On success, the function returns 0. <symbol>ECPG_INFORMIX_NUM_OVERFLOW</symbol> is returned in case of overflow and <symbol>ECPG_INFORMIX_NUM_UNDERFLOW</symbol> in case of underflow. -1 is returned for other failures and <varname>errno</varname> is set to the respective <varname>errno</varname> number of the pgtypeslib.
ru: Складывает два значения типа decimal. <synopsis> int decadd(decimal *arg1, decimal *arg2, decimal *sum); </synopsis> Эта функция получает указатель на первый операнд типа decimal (<literal>arg1</literal>), указатель на второй операнд типа decimal (<literal>arg2</literal>) и указатель на переменную типа decimal, в которую будет записана сумма (<literal>sum</literal>). В случае успеха эта функция возвращает 0. <symbol>ECPG_INFORMIX_NUM_OVERFLOW</symbol> возвращается в случае переполнения, а <symbol>ECPG_INFORMIX_NUM_UNDERFLOW</symbol> в случае антипереполнения. При любых других ошибках возвращается -1, а в <varname>errno</varname> устанавливается код <varname>errno</varname> из pgtypeslib.

source: 1, if the value that <literal>arg1</literal> points to is bigger than the value that <literal>var2</literal> points to
ru: 1, если значение, на которое указывает <literal>arg1</literal>, больше значения, на которое указывает <literal>var2</literal>

source: -1, if the value that <literal>arg1</literal> points to is smaller than the value that <literal>arg2</literal> points to
ru: -1, если значение, на которое указывает <literal>arg1</literal>, меньше значения, на которое указывает <literal>arg2</literal>

source: 0, if the value that <literal>arg1</literal> points to and the value that <literal>arg2</literal> points to are equal
ru: 0, если значение, на которое указывает <literal>arg1</literal>, равно значению, на которое указывает <literal>arg2</literal>

source: Compare two variables of type decimal. <synopsis> int deccmp(decimal *arg1, decimal *arg2); </synopsis> The function receives a pointer to the first decimal value (<literal>arg1</literal>), a pointer to the second decimal value (<literal>arg2</literal>) and returns an integer value that indicates which is the bigger value. <placeholder-1/>
ru: Сравнивает два значения типа decimal. <synopsis> int deccmp(decimal *arg1, decimal *arg2); </synopsis> Эта функция получает указатель на первое значение типа decimal (<literal>arg1</literal>), указатель на второе значение типа decimal (<literal>arg2</literal>) и возвращает целое, отражающее результат сравнения этих чисел. <placeholder-1/>

source: Copy a decimal value. <synopsis> void deccopy(decimal *src, decimal *target); </synopsis> The function receives a pointer to the decimal value that should be copied as the first argument (<literal>src</literal>) and a pointer to the target structure of type decimal (<literal>target</literal>) as the second argument.
ru: Копирует значение типа decimal. <synopsis> void deccopy(decimal *src, decimal *target); </synopsis> Функция принимает в первом аргументе (<literal>src</literal>) указатель на значение decimal, которое должно быть скопировано, а во втором аргументе (<literal>target</literal>) принимает указатель на структуру типа decimal для скопированного значения.

source: Convert a value from its ASCII representation into a decimal type. <synopsis> int deccvasc(char *cp, int len, decimal *np); </synopsis> The function receives a pointer to string that contains the string representation of the number to be converted (<literal>cp</literal>) as well as its length <literal>len</literal>. <literal>np</literal> is a pointer to the decimal value that saves the result of the operation.
ru: Преобразует значение из представления ASCII в тип decimal. <synopsis> int deccvasc(char *cp, int len, decimal *np); </synopsis> Эта функция получает указатель на строку, содержащую строковое представление числа, которое нужно преобразовать, (<literal>cp</literal>), а также его длину <literal>len</literal>. В <literal>np</literal> передаётся указатель на переменную типа decimal, в которую будет помещён результат преобразования.

source: Valid formats are for example: <literal>-2</literal>, <literal>.794</literal>, <literal>+3.44</literal>, <literal>592.49E07</literal> or <literal>-32.84e-4</literal>.
ru: Допустимыми являются, например следующие форматы: <literal>-2</literal>, <literal>.794</literal>, <literal>+3.44</literal>, <literal>592.49E07</literal> или <literal>-32.84e-4</literal>.

source: The function returns 0 on success. If overflow or underflow occurred, <literal>ECPG_INFORMIX_NUM_OVERFLOW</literal> or <literal>ECPG_INFORMIX_NUM_UNDERFLOW</literal> is returned. If the ASCII representation could not be parsed, <literal>ECPG_INFORMIX_BAD_NUMERIC</literal> is returned or <literal>ECPG_INFORMIX_BAD_EXPONENT</literal> if this problem occurred while parsing the exponent.
ru: В случае успеха эта функция возвращает 0. При переполнении или антипереполнении возвращается <literal>ECPG_INFORMIX_NUM_OVERFLOW</literal> или <literal>ECPG_INFORMIX_NUM_UNDERFLOW</literal>, соответственно. Если разобрать ASCII-представление не удаётся, возвращается <literal>ECPG_INFORMIX_BAD_NUMERIC</literal> или <literal>ECPG_INFORMIX_BAD_EXPONENT</literal>, если не удаётся разобрать компонент экспоненты.

source: Convert a value of type double to a value of type decimal. <synopsis> int deccvdbl(double dbl, decimal *np); </synopsis> The function receives the variable of type double that should be converted as its first argument (<literal>dbl</literal>). As the second argument (<literal>np</literal>), the function receives a pointer to the decimal variable that should hold the result of the operation.
ru: Преобразует значение double в значение типа decimal. <synopsis> int deccvdbl(double dbl, decimal *np); </synopsis> Данная функция принимает в первом аргументе (<literal>dbl</literal>) переменную типа double, которая должна быть преобразована. Во втором аргументе (<literal>np</literal>) она принимает указатель на переменную decimal, в которую будет помещён результат операции.

source: The function returns 0 on success and a negative value if the conversion failed.
ru: Эта функция возвращает 0 в случае успеха, либо отрицательное значение, если выполнить преобразование не удалось.

source: Convert a value of type int to a value of type decimal. <synopsis> int deccvint(int in, decimal *np); </synopsis> The function receives the variable of type int that should be converted as its first argument (<literal>in</literal>). As the second argument (<literal>np</literal>), the function receives a pointer to the decimal variable that should hold the result of the operation.
ru: Преобразует значение int в значение типа decimal. <synopsis> int deccvint(int in, decimal *np); </synopsis> Данная функция принимает в первом аргументе (<literal>in</literal>) переменную типа int, которая должна быть преобразована. Во втором аргументе (<literal>np</literal>) она принимает указатель на переменную decimal, в которую будет помещён результат операции.

source: Convert a value of type long to a value of type decimal. <synopsis> int deccvlong(long lng, decimal *np); </synopsis> The function receives the variable of type long that should be converted as its first argument (<literal>lng</literal>). As the second argument (<literal>np</literal>), the function receives a pointer to the decimal variable that should hold the result of the operation.
ru: Преобразует значение long в значение типа decimal. <synopsis> int deccvlong(long lng, decimal *np); </synopsis> Данная функция принимает в первом аргументе (<literal>lng</literal>) переменную типа long, которая должна быть преобразована. Во втором аргументе (<literal>np</literal>) она принимает указатель на переменную decimal, в которую будет помещён результат операции.

source: Divide two variables of type decimal. <synopsis> int decdiv(decimal *n1, decimal *n2, decimal *result); </synopsis> The function receives pointers to the variables that are the first (<literal>n1</literal>) and the second (<literal>n2</literal>) operands and calculates <literal>n1</literal>/<literal>n2</literal>. <literal>result</literal> is a pointer to the variable that should hold the result of the operation.
ru: Делит одну переменную типа decimal на другую. <synopsis> int decdiv(decimal *n1, decimal *n2, decimal *result); </synopsis> Эта функция получает указатели на переменные (<literal>n1</literal> и <literal>n2</literal>) и вычисляет частное <literal>n1</literal>/<literal>n2</literal>. В <literal>result</literal> передаётся указатель на переменную, в которую будет помещён результат операции.

source: On success, 0 is returned and a negative value if the division fails. If overflow or underflow occurred, the function returns <literal>ECPG_INFORMIX_NUM_OVERFLOW</literal> or <literal>ECPG_INFORMIX_NUM_UNDERFLOW</literal> respectively. If an attempt to divide by zero is observed, the function returns <literal>ECPG_INFORMIX_DIVIDE_ZERO</literal>.
ru: В случае успеха возвращается 0, а при ошибке — отрицательное значение. В случае переполнения или антипереполнения данная функция возвращает <literal>ECPG_INFORMIX_NUM_OVERFLOW</literal> или <literal>ECPG_INFORMIX_NUM_UNDERFLOW</literal>, соответственно. При попытке деления на ноль возвращается <literal>ECPG_INFORMIX_DIVIDE_ZERO</literal>.

source: Multiply two decimal values. <synopsis> int decmul(decimal *n1, decimal *n2, decimal *result); </synopsis> The function receives pointers to the variables that are the first (<literal>n1</literal>) and the second (<literal>n2</literal>) operands and calculates <literal>n1</literal>*<literal>n2</literal>. <literal>result</literal> is a pointer to the variable that should hold the result of the operation.
ru: Перемножает два значения типа decimal. <synopsis> int decmul(decimal *n1, decimal *n2, decimal *result); </synopsis> Эта функция получает указатели на переменные (<literal>n1</literal> и <literal>n2</literal>) и вычисляет произведение <literal>n1</literal>*<literal>n2</literal>. В <literal>result</literal> передаётся указатель на переменную, в которую будет помещён результат операции.

source: On success, 0 is returned and a negative value if the multiplication fails. If overflow or underflow occurred, the function returns <literal>ECPG_INFORMIX_NUM_OVERFLOW</literal> or <literal>ECPG_INFORMIX_NUM_UNDERFLOW</literal> respectively.
ru: В случае успеха возвращается 0, а при ошибке — отрицательное значение. В случае переполнения или антипереполнения данная функция возвращает <literal>ECPG_INFORMIX_NUM_OVERFLOW</literal> или <literal>ECPG_INFORMIX_NUM_UNDERFLOW</literal>, соответственно.

source: Subtract one decimal value from another. <synopsis> int decsub(decimal *n1, decimal *n2, decimal *result); </synopsis> The function receives pointers to the variables that are the first (<literal>n1</literal>) and the second (<literal>n2</literal>) operands and calculates <literal>n1</literal>-<literal>n2</literal>. <literal>result</literal> is a pointer to the variable that should hold the result of the operation.
ru: Вычитает одно значение типа decimal из другого. <synopsis> int decsub(decimal *n1, decimal *n2, decimal *result); </synopsis> Эта функция получает указатели на переменные (<literal>n1</literal> и <literal>n2</literal>) и вычисляет разность <literal>n1</literal>-<literal>n2</literal>. В <literal>result</literal> передаётся указатель на переменную, в которую будет помещён результат операции.

source: On success, 0 is returned and a negative value if the subtraction fails. If overflow or underflow occurred, the function returns <literal>ECPG_INFORMIX_NUM_OVERFLOW</literal> or <literal>ECPG_INFORMIX_NUM_UNDERFLOW</literal> respectively.
ru: В случае успеха возвращается 0, а при ошибке — отрицательное значение. В случае переполнения или антипереполнения данная функция возвращает <literal>ECPG_INFORMIX_NUM_OVERFLOW</literal> или <literal>ECPG_INFORMIX_NUM_UNDERFLOW</literal>, соответственно.

source: Convert a variable of type decimal to its ASCII representation in a C char* string. <synopsis> int dectoasc(decimal *np, char *cp, int len, int right) </synopsis> The function receives a pointer to a variable of type decimal (<literal>np</literal>) that it converts to its textual representation. <literal>cp</literal> is the buffer that should hold the result of the operation. The parameter <literal>right</literal> specifies, how many digits right of the decimal point should be included in the output. The result will be rounded to this number of decimal digits. Setting <literal>right</literal> to -1 indicates that all available decimal digits should be included in the output. If the length of the output buffer, which is indicated by <literal>len</literal> is not sufficient to hold the textual representation including the trailing zero byte, only a single <literal>*</literal> character is stored in the result and -1 is returned.
ru: Преобразует переменную типа decimal в представление ASCII (в строку C char*). <synopsis> int dectoasc(decimal *np, char *cp, int len, int right) </synopsis> Эта функция получает указатель на переменную типа decimal (<literal>np</literal>), которая будет преобразована в текстовое представление. Аргумент <literal>cp</literal> указывает на буфер, в который будет помещён результат операции. Аргумент <literal>right</literal> определяет, сколько должно выводиться цифр правее десятичной точки. Результат будет округлён до этого числа десятичных цифр. Значение <literal>right</literal>, равное -1, указывает, что выводиться должны все имеющиеся десятичные цифры. Если длина выходного буфера, которую задаёт <literal>len</literal>, недостаточна для помещения в него текстового представления, включая завершающий нулевой байт, в буфере сохраняется один знак <literal>*</literal> и возвращается -1.

source: The function returns either -1 if the buffer <literal>cp</literal> was too small or <literal>ECPG_INFORMIX_OUT_OF_MEMORY</literal> if memory was exhausted.
ru: Эта функция возвращает -1, если буфер <literal>cp</literal> слишком мал, либо <literal>ECPG_INFORMIX_OUT_OF_MEMORY</literal> при нехватке памяти.

source: Convert a variable of type decimal to a double. <synopsis> int dectodbl(decimal *np, double *dblp); </synopsis> The function receives a pointer to the decimal value to convert (<literal>np</literal>) and a pointer to the double variable that should hold the result of the operation (<literal>dblp</literal>).
ru: Преобразует переменную типа decimal в тип double. <synopsis> int dectodbl(decimal *np, double *dblp); </synopsis> Эта функция получает указатель (<literal>np</literal>) на значение decimal, которое нужно преобразовать, и указатель (<literal>dblp</literal>) на переменную double, в которую будет помещён результат операции.

source: On success, 0 is returned and a negative value if the conversion failed.
ru: В случае успеха возвращается 0, или отрицательное значение, если выполнить преобразование не удалось.

source: Convert a variable to type decimal to an integer. <synopsis> int dectoint(decimal *np, int *ip); </synopsis> The function receives a pointer to the decimal value to convert (<literal>np</literal>) and a pointer to the integer variable that should hold the result of the operation (<literal>ip</literal>).
ru: Преобразует переменную типа decimal в тип integer. <synopsis> int dectoint(decimal *np, int *ip); </synopsis> Эта функция получает указатель (<literal>np</literal>) на значение decimal, которое нужно преобразовать, и указатель (<literal>ip</literal>) на целочисленную переменную, в которую будет помещён результат операции.

source: On success, 0 is returned and a negative value if the conversion failed. If an overflow occurred, <literal>ECPG_INFORMIX_NUM_OVERFLOW</literal> is returned.
ru: В случае успеха возвращается 0, или отрицательное значение, если выполнить преобразование не удалось. В случае переполнения возвращается <literal>ECPG_INFORMIX_NUM_OVERFLOW</literal>.

source: Note that the ECPG implementation differs from the <productname>Informix</productname> implementation. <productname>Informix</productname> limits an integer to the range from -32767 to 32767, while the limits in the ECPG implementation depend on the architecture (<literal>-INT_MAX .. INT_MAX</literal>).
ru: Заметьте, что реализация ECPG отличается от реализации <productname>Informix</productname>. В <productname>Informix</productname> целое ограничивается диапазоном -32767 .. 32767, тогда как в ECPG ограничение зависит от архитектуры (<literal>-INT_MAX .. INT_MAX</literal>).

source: Convert a variable to type decimal to a long integer. <synopsis> int dectolong(decimal *np, long *lngp); </synopsis> The function receives a pointer to the decimal value to convert (<literal>np</literal>) and a pointer to the long variable that should hold the result of the operation (<literal>lngp</literal>).
ru: Преобразует переменную типа decimal в тип long. <synopsis> int dectolong(decimal *np, long *lngp); </synopsis> Эта функция получает указатель (<literal>np</literal>) на значение decimal, которое нужно преобразовать, и указатель (<literal>lngp</literal>) на переменную типа long, в которую будет помещён результат операции.

source: Note that the ECPG implementation differs from the <productname>Informix</productname> implementation. <productname>Informix</productname> limits a long integer to the range from -2,147,483,647 to 2,147,483,647, while the limits in the ECPG implementation depend on the architecture (<literal>-LONG_MAX .. LONG_MAX</literal>).
ru: Заметьте, что реализация ECPG отличается от реализации <productname>Informix</productname>. В <productname>Informix</productname> длинное целое ограничено диапазоном -2&nbsp;147&nbsp;483&nbsp;647 .. 2&nbsp;147&nbsp;483&nbsp;647, тогда как в ECPG ограничение зависит от архитектуры (<literal>-LONG_MAX .. LONG_MAX</literal>).

source: Converts a date to a C char* string. <synopsis> int rdatestr(date d, char *str); </synopsis> The function receives two arguments, the first one is the date to convert (<literal>d</literal>) and the second one is a pointer to the target string. The output format is always <literal>yyyy-mm-dd</literal>, so you need to allocate at least 11 bytes (including the zero-byte terminator) for the string.
ru: Преобразует дату в строку C char*. <synopsis> int rdatestr(date d, char *str); </synopsis> Эта функция принимает два аргумента. В первом (<literal>d</literal>) передаётся дата, которую нужно преобразовать, а во втором указатель на целевую строку. Результат всегда выводится в формате <literal>yyyy-mm-dd</literal>, так что для этой строки нужно выделить минимум 11 байт (включая завершающий нулевой байт).

source: The function returns 0 on success and a negative value in case of error.
ru: Эта функция возвращает 0 в случае успеха, а в случае ошибки — отрицательное значение.

source: Note that ECPG's implementation differs from the <productname>Informix</productname> implementation. In <productname>Informix</productname> the format can be influenced by setting environment variables. In ECPG however, you cannot change the output format.
ru: Заметьте, что реализация ECPG отличается от реализации <productname>Informix</productname>. В <productname>Informix</productname> формат вывода можно изменить переменными окружения, а в ECPG он фиксирован.
