Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: If the last SQL statement was successful, then <literal>sqlca.sqlerrd[1]</literal> contains the OID of the processed row, if applicable, and <literal>sqlca.sqlerrd[2]</literal> contains the number of processed or returned rows, if applicable to the command.
ru: Если последний оператор SQL был успешным, в <literal>sqlca.sqlerrd[1]</literal> содержится OID обработанной строки (если это уместно), а в <literal>sqlca.sqlerrd[2]</literal> количество обработанных или возвращённых строк (если это уместно для команды).

source: In case of an error or warning, <literal>sqlca.sqlerrm.sqlerrmc</literal> will contain a string that describes the error. The field <literal>sqlca.sqlerrm.sqlerrml</literal> contains the length of the error message that is stored in <literal>sqlca.sqlerrm.sqlerrmc</literal> (the result of <function>strlen()</function>, not really interesting for a C programmer). Note that some messages are too long to fit in the fixed-size <literal>sqlerrmc</literal> array; they will be truncated.
ru: В случае ошибки или предупреждения <literal>sqlca.sqlerrm.sqlerrmc</literal> будет содержать строку, описывающую ошибку. Поле <literal>sqlca.sqlerrm.sqlerrml</literal> содержит длину сообщения об ошибке, которое хранится в <literal>sqlca.sqlerrm.sqlerrmc</literal> (результат функции <function>strlen()</function>, который не очень интересен для программиста C). Заметьте, что некоторые сообщения могут не умещаться в массив <literal>sqlerrmc</literal> фиксированного размера; они будут обрезаться.

source: In case of a warning, <literal>sqlca.sqlwarn[2]</literal> is set to <literal>W</literal>. (In all other cases, it is set to something different from <literal>W</literal>.) If <literal>sqlca.sqlwarn[1]</literal> is set to <literal>W</literal>, then a value was truncated when it was stored in a host variable. <literal>sqlca.sqlwarn[0]</literal> is set to <literal>W</literal> if any of the other elements are set to indicate a warning.
ru: В случае предупреждения, в <literal>sqlca.sqlwarn[2]</literal> записывается символ <literal>W</literal>. (Во всех других случаях значение будет отличным от <literal>W</literal>.) Символ <literal>W</literal> в <literal>sqlca.sqlwarn[1]</literal> показывает, что значение было обрезано при сохранении в переменной среды. <literal>W</literal> в <literal>sqlca.sqlwarn[0]</literal> устанавливается, если предупреждение отмечается в каком-либо другом элементе массива.

source: The fields <structfield>sqlcaid</structfield>, <structfield>sqlcabc</structfield>, <structfield>sqlerrp</structfield>, and the remaining elements of <structfield>sqlerrd</structfield> and <structfield>sqlwarn</structfield> currently contain no useful information.
ru: Поля <structfield>sqlcaid</structfield>, <structfield>sqlcabc</structfield>, <structfield>sqlerrp</structfield> и остальные элементы <structfield>sqlerrd</structfield> и <structfield>sqlwarn</structfield> в настоящее время не содержат полезной информации.

source: The structure <varname>sqlca</varname> is not defined in the SQL standard, but is implemented in several other SQL database systems. The definitions are similar at the core, but if you want to write portable applications, then you should investigate the different implementations carefully.
ru: Структура <varname>sqlca</varname> не определена в стандарте SQL, но реализована в нескольких других СУБД SQL. Принципиально она определяется одинаково, но если вы хотите, чтобы ваши приложения были переносимыми, тщательно изучите различия реализаций.

source: Here is one example that combines the use of <literal>WHENEVER</literal> and <varname>sqlca</varname>, printing out the contents of <varname>sqlca</varname> when an error occurs. This is perhaps useful for debugging or prototyping applications, before installing a more <quote>user-friendly</quote> error handler. <placeholder-1/> The result could look as follows (here an error due to a misspelled table name): <screen> ==== sqlca ==== sqlcode: -400 sqlerrm.sqlerrml: 49 sqlerrm.sqlerrmc: relation "pg_databasep" does not exist on line 38 sqlerrd: 0 0 0 0 0 0 sqlwarn: 0 0 0 0 0 0 0 0 sqlstate: 42P01 =============== </screen>
ru: В следующем примере, демонстрирующем применение <literal>WHENEVER</literal> в сочетании с <varname>sqlca</varname>, выводится содержимое <varname>sqlca</varname> при возникновении ошибки. Это может быть полезно для отладки или в прототипах, пока не реализован более <quote>дружественный пользователю</quote> обработчик ошибок. <placeholder-1/> Результат может выглядеть следующим образом (при ошибке, вызванной опечаткой в имени таблицы): <screen> ==== sqlca ==== sqlcode: -400 sqlerrm.sqlerrml: 49 sqlerrm.sqlerrmc: relation "pg_databasep" does not exist on line 38 sqlerrd: 0 0 0 0 0 0 sqlwarn: 0 0 0 0 0 0 0 0 sqlstate: 42P01 =============== </screen>

source: <literal>SQLSTATE</literal> vs. <literal>SQLCODE</literal>
ru: <literal>SQLSTATE</literal> и <literal>SQLCODE</literal>

source: The fields <literal>sqlca.sqlstate</literal> and <literal>sqlca.sqlcode</literal> are two different schemes that provide error codes. Both are derived from the SQL standard, but <literal>SQLCODE</literal> has been marked deprecated in the SQL-92 edition of the standard and has been dropped in later editions. Therefore, new applications are strongly encouraged to use <literal>SQLSTATE</literal>.
ru: Поля <literal>sqlca.sqlstate</literal> и <literal>sqlca.sqlcode</literal> отражают две различные схемы, представляющие коды ошибок. Обе схемы пришли из стандарта SQL, но схема <literal>SQLCODE</literal> была признана устаревшей в редакции SQL-92 и исключена в последующих редакциях. Поэтому в новых приложениях настоятельно рекомендуется использовать <literal>SQLSTATE</literal>.

source: <literal>SQLSTATE</literal> is a five-character array. The five characters contain digits or upper-case letters that represent codes of various error and warning conditions. <literal>SQLSTATE</literal> has a hierarchical scheme: the first two characters indicate the general class of the condition, the last three characters indicate a subclass of the general condition. A successful state is indicated by the code <literal>00000</literal>. The <literal>SQLSTATE</literal> codes are for the most part defined in the SQL standard. The <productname>PostgreSQL</productname> server natively supports <literal>SQLSTATE</literal> error codes; therefore a high degree of consistency can be achieved by using this error code scheme throughout all applications. For further information see <xref linkend="errcodes-appendix"/>.
ru: <literal>SQLSTATE</literal> задаётся в массиве из пяти символов. Эти пять символов содержат цифры или буквы в верхнем регистре, представляющие коды различных условий ошибок и предупреждений. <literal>SQLSTATE</literal> определяется по иерархической схеме: первые два символа обозначают общий класс условия, а следующие три — подкласс общего условия. Успешное состояние обозначается кодом <literal>00000</literal>. По большей части коды <literal>SQLSTATE</literal> определены в стандарте SQL. Сервер <productname>PostgreSQL</productname> поддерживает коды ошибок <literal>SQLSTATE</literal> естественным образом; поэтому используя во всех приложениях именно эту схему кодов ошибок, можно добиться высокой степени согласованности. За дальнейшими сведениями обратитесь к <xref remap="3" linkend="errcodes-appendix"/>.

source: <literal>SQLCODE</literal>, the deprecated error code scheme, is a simple integer. A value of 0 indicates success, a positive value indicates success with additional information, a negative value indicates an error. The SQL standard only defines the positive value +100, which indicates that the last command returned or affected zero rows, and no specific negative values. Therefore, this scheme can only achieve poor portability and does not have a hierarchical code assignment. Historically, the embedded SQL processor for <productname>PostgreSQL</productname> has assigned some specific <literal>SQLCODE</literal> values for its use, which are listed below with their numeric value and their symbolic name. Remember that these are not portable to other SQL implementations. To simplify the porting of applications to the <literal>SQLSTATE</literal> scheme, the corresponding <literal>SQLSTATE</literal> is also listed. There is, however, no one-to-one or one-to-many mapping between the two schemes (indeed it is many-to-many), so you should consult the global <literal>SQLSTATE</literal> listing in <xref linkend="errcodes-appendix"/> in each case.
ru: <literal>SQLCODE</literal> — устаревшая схема, в которой коды ошибок представлены просто целыми числами. Значение 0 обозначает успешное завершение, положительное значение — успешное завершение с дополнительной информацией, а отрицательное говорит об ошибке. В стандарте SQL определено только положительное значение +100, показывающее, что последняя команда вернула или затронула ноль строк, но отрицательные значения не определены. Таким образом, с этой схемой нельзя рассчитывать на переносимость и она не имеет иерархической структуры. Исторически сложилось, что процессор встраиваемого SQL для <productname>PostgreSQL</productname> назначает некоторые определённые значения <literal>SQLCODE</literal> для собственного использования; они перечислены ниже с числовыми значениями и символьными именами. Помните, что эти коды несовместимы с другими реализациями SQL. Поэтому для упрощения перевода приложений на схему <literal>SQLSTATE</literal> вместе с этими кодами перечисляются соответствующие значения <literal>SQLSTATE</literal>. Однако однозначного соответствия один-к-одному или один-ко-многим между этими двумя схемами не существует (на самом деле это соответствие многие-ко-многим), поэтому следует свериться со списком <literal>SQLSTATE</literal> в <xref remap="6" linkend="errcodes-appendix"/> в каждом случае.

source: Indicates no error. (SQLSTATE 00000)
ru: Показывает, что ошибки нет. (SQLSTATE 00000)

source: This is a harmless condition indicating that the last command retrieved or processed zero rows, or that you are at the end of the cursor. (SQLSTATE 02000)
ru: Это нейтральное условие, показывающее, что последняя команда вернула или обработала ноль строк, либо курсор достиг конца. (SQLSTATE 02000)

source: When processing a cursor in a loop, you could use this code as a way to detect when to abort the loop, like this: <placeholder-1/> But <literal>WHENEVER NOT FOUND DO BREAK</literal> effectively does this internally, so there is usually no advantage in writing this out explicitly.
ru: Выбирая данные из курсора в цикле, можно проверять этот код, чтобы понять, когда нужно прервать цикл, следующим образом: <placeholder-1/> Но <literal>WHENEVER NOT FOUND DO BREAK</literal> внутри по сути делает это же, поэтому такое явное условие обычно ничем не лучше.

source: Indicates that your virtual memory is exhausted. The numeric value is defined as <literal>-ENOMEM</literal>. (SQLSTATE YE001)
ru: Указывает, что закончилась виртуальная память. Числовое значение определено как <literal>-ENOMEM</literal>. (SQLSTATE YE001)

source: Indicates the preprocessor has generated something that the library does not know about. Perhaps you are running incompatible versions of the preprocessor and the library. (SQLSTATE YE002)
ru: Указывает, что препроцессор сгенерировал код, который не понимает библиотека. Возможно, вы используете несовместимые версии препроцессора и библиотеки. (SQLSTATE YE002)

source: This means that the command specified more host variables than the command expected. (SQLSTATE 07001 or 07002)
ru: Это означает, что в команде было указано больше переменных среды, чем она ожидает. (SQLSTATE 07001 или 07002)

source: This means that the command specified fewer host variables than the command expected. (SQLSTATE 07001 or 07002)
ru: Это означает, что в команде было указано меньше переменных среды, чем она ожидает. (SQLSTATE 07001 или 07002)

source: This means a query has returned multiple rows but the statement was only prepared to store one result row (for example, because the specified variables are not arrays). (SQLSTATE 21000)
ru: Это означает, что запрос вернул несколько строк, но оператор был подготовлен только для одной строки результата (например, потому что переданные переменные — не массивы). (SQLSTATE 21000)

source: The host variable is of type <type>int</type> and the datum in the database is of a different type and contains a value that cannot be interpreted as an <type>int</type>. The library uses <function>strtol()</function> for this conversion. (SQLSTATE 42804)
ru: Переменная среды типа <type>int</type> и данные в базе имеют разные типы, и в этих данных содержится значение, которое нельзя преобразовать в <type>int</type>. Для этого преобразования библиотека использует функцию <function>strtol()</function>. (SQLSTATE 42804)

source: The host variable is of type <type>unsigned int</type> and the datum in the database is of a different type and contains a value that cannot be interpreted as an <type>unsigned int</type>. The library uses <function>strtoul()</function> for this conversion. (SQLSTATE 42804)
ru: Переменная среды типа <type>unsigned int</type> и данные в базе имеют разные типы, и в этих данных содержится значение, которое нельзя преобразовать в <type>unsigned int</type>. Для этого преобразования библиотека использует функцию <function>strtoul()</function>. (SQLSTATE 42804)

source: The host variable is of type <type>float</type> and the datum in the database is of another type and contains a value that cannot be interpreted as a <type>float</type>. The library uses <function>strtod()</function> for this conversion. (SQLSTATE 42804)
ru: Переменная среды типа <type>float</type> и данные в базе имеют разные типы, и в этих данных содержится значение, которое нельзя преобразовать во <type>float</type>. Для этого преобразования библиотека использует функцию <function>strtod()</function>. (SQLSTATE 42804)

source: The host variable is of type <type>numeric</type> and the datum in the database is of another type and contains a value that cannot be interpreted as a <type>numeric</type> value. (SQLSTATE 42804)
ru: Переменная среды типа <type>numeric</type> и данные в базе имеют разные типы, и в этих данных содержится значение, которое нельзя преобразовать в <type>numeric</type>. (SQLSTATE 42804)

source: The host variable is of type <type>interval</type> and the datum in the database is of another type and contains a value that cannot be interpreted as an <type>interval</type> value. (SQLSTATE 42804)
ru: Переменная среды типа <type>interval</type> и данные в базе имеют разные типы, и в этих данных содержится значение, которое нельзя преобразовать в <type>interval</type>. (SQLSTATE 42804)

source: The host variable is of type <type>date</type> and the datum in the database is of another type and contains a value that cannot be interpreted as a <type>date</type> value. (SQLSTATE 42804)
ru: Переменная среды типа <type>date</type> и данные в базе имеют разные типы, и в этих данных содержится значение, которое нельзя преобразовать в <type>date</type>. (SQLSTATE 42804)

source: The host variable is of type <type>timestamp</type> and the datum in the database is of another type and contains a value that cannot be interpreted as a <type>timestamp</type> value. (SQLSTATE 42804)
ru: Переменная среды типа <type>timestamp</type> и данные в базе имеют разные типы, и в этих данных содержится значение, которое нельзя преобразовать в <type>timestamp</type>. (SQLSTATE 42804)

source: This means the host variable is of type <type>bool</type> and the datum in the database is neither <literal>'t'</literal> nor <literal>'f'</literal>. (SQLSTATE 42804)
ru: Это означает, что переменная среды имеет тип <type>bool</type>, а значение в базе данных отличается от <literal>'t'</literal> или <literal>'f'</literal>. (SQLSTATE 42804)

source: The statement sent to the <productname>PostgreSQL</productname> server was empty. (This cannot normally happen in an embedded SQL program, so it might point to an internal error.) (SQLSTATE YE002)
ru: Серверу <productname>PostgreSQL</productname> был передан пустой оператор. (Этого обычно не должно происходить в программе со встраиваемым SQL, так что это может указывать на внутреннюю ошибку.) (SQLSTATE YE002)

source: A null value was returned and no null indicator variable was supplied. (SQLSTATE 22002)
ru: Возвращено значение NULL, но переменная-индикатор NULL не задана. (SQLSTATE 22002)

source: An ordinary variable was used in a place that requires an array. (SQLSTATE 42804)
ru: Там, где требуется массив, была передана обычная переменная. (SQLSTATE 42804)

source: The database returned an ordinary variable in a place that requires array value. (SQLSTATE 42804)
ru: База данных возвратила обычную переменную там, где требуется значение-массив. (SQLSTATE 42804)

source: The value could not be inserted into the array. (SQLSTATE 42804)
ru: Не удалось вставить значение в массив. (SQLSTATE 42804)

source: The program tried to access a connection that does not exist. (SQLSTATE 08003)
ru: Программа попыталась использовать несуществующее подключение. (SQLSTATE 08003)

source: The program tried to access a connection that does exist but is not open. (This is an internal error.) (SQLSTATE YE002)
ru: Программа попыталась использовать подключение, которое существует, но не было открыто. (Это внутренняя ошибка.) (SQLSTATE YE002)

source: The statement you are trying to use has not been prepared. (SQLSTATE 26000)
ru: Оператор, который вы пытаетесь выполнить, не был подготовлен. (SQLSTATE 26000)

source: Duplicate key error, violation of unique constraint (Informix compatibility mode). (SQLSTATE 23505)
ru: Ошибка повторяющегося ключа, нарушение ограничения уникальности (режим совместимости с Informix). (SQLSTATE 23505)

source: The descriptor specified was not found. The statement you are trying to use has not been prepared. (SQLSTATE 33000)
ru: Указанный дескриптор не найден. Оператор, который вы пытаетесь использовать, не был подготовлен. (SQLSTATE 33000)

source: The descriptor index specified was out of range. (SQLSTATE 07009)
ru: Указанный индекс дескриптора вне диапазона. (SQLSTATE 07009)

source: An invalid descriptor item was requested. (This is an internal error.) (SQLSTATE YE002)
ru: Запрошен неверный элемент дескриптора. (Это внутренняя ошибка.) (SQLSTATE YE002)

source: During the execution of a dynamic statement, the database returned a numeric value and the host variable was not numeric. (SQLSTATE 07006)
ru: При выполнении динамического оператора база данных возвратила числовое значение, тогда как переменная среды — не числовая. (SQLSTATE 07006)

source: During the execution of a dynamic statement, the database returned a non-numeric value and the host variable was numeric. (SQLSTATE 07006)
ru: При выполнении динамического оператора база данных возвратила не числовое значение, тогда как переменная среды — числовая. (SQLSTATE 07006)

source: A result of the subquery is not single row (Informix compatibility mode). (SQLSTATE 21000)
ru: Результат подзапроса представлен не одной строкой (режим совместимости с Informix). (SQLSTATE 21000)

source: Some error caused by the <productname>PostgreSQL</productname> server. The message contains the error message from the <productname>PostgreSQL</productname> server.
ru: Ошибка произошла на стороне сервера <productname>PostgreSQL</productname>. В тексте ошибки содержится сообщение об ошибке от сервера <productname>PostgreSQL</productname>.

source: The <productname>PostgreSQL</productname> server signaled that we cannot start, commit, or rollback the transaction. (SQLSTATE 08007)
ru: Сервер <productname>PostgreSQL</productname> сообщает, что клиент не может запускать, фиксировать или отменять транзакцию. (SQLSTATE 08007)

source: The connection attempt to the database did not succeed. (SQLSTATE 08001)
ru: Попытка подключения к базе данных была неудачной. (SQLSTATE 08001)

source: Duplicate key error, violation of unique constraint. (SQLSTATE 23505)
ru: Ошибка повторяющегося ключа, нарушение ограничения уникальности. (SQLSTATE 23505)

source: A result for the subquery is not single row. (SQLSTATE 21000)
ru: Результат подзапроса представлен не одной строкой. (SQLSTATE 21000)

source: An invalid cursor name was specified. (SQLSTATE 34000)
ru: Указано неверное имя курсора. (SQLSTATE 34000)

source: Transaction is in progress. (SQLSTATE 25001)
ru: Транзакция в процессе выполнения. (SQLSTATE 25001)

source: There is no active (in-progress) transaction. (SQLSTATE 25P01)
ru: Нет активной (выполняющейся) транзакции. (SQLSTATE 25P01)

source: An existing cursor name was specified. (SQLSTATE 42P03)
ru: Было указано имя существующего курсора. (SQLSTATE 42P03)

source: These are the assigned <literal>SQLCODE</literal> values: <placeholder-1/>
ru: <literal>SQLCODE</literal> может принимать следующие значения: <placeholder-1/>

source: Preprocessor Directives
ru: Директивы препроцессора

source: Several preprocessor directives are available that modify how the <command>ecpg</command> preprocessor parses and processes a file.
ru: Препроцессор <command>ecpg</command> поддерживает ряд директив, которые позволяют управлять разбором и обработкой исходных файлов.

source: Including Files
ru: Включение файлов

source: EXEC SQL INCLUDE <replaceable>filename</replaceable>; EXEC SQL INCLUDE &lt;<replaceable>filename</replaceable>&gt;; EXEC SQL INCLUDE "<replaceable>filename</replaceable>";
ru: EXEC SQL INCLUDE <replaceable>имя_файла</replaceable>; EXEC SQL INCLUDE &lt;<replaceable>имя_файла</replaceable>&gt;; EXEC SQL INCLUDE "<replaceable>имя_файла</replaceable>";

source: To include an external file into your embedded SQL program, use: <placeholder-1/> The embedded SQL preprocessor will look for a file named <literal><replaceable>filename</replaceable>.h</literal>, preprocess it, and include it in the resulting C output. Thus, embedded SQL statements in the included file are handled correctly.
ru: Для включения внешнего файла в программу со встраиваемым SQL, используется конструкция: <placeholder-1/> Встретив такую директиву, препроцессор встраиваемого SQL будет искать файл <literal><replaceable>имя_файла</replaceable>.h</literal>, обрабатывать его и включать в выходной код C. В результате встраиваемые операторы SQL во включённом таким образом файле будут обработаны корректно.

source: current directory
ru: текущий каталог

source: PostgreSQL include directory, defined at build time (e.g., <filename>/usr/local/pgsql/include</filename>)
ru: каталог включаемых файлов PostgreSQL, определённый во время сборки (например, <filename>/usr/local/pgsql/include</filename>)

source: The <command>ecpg</command> preprocessor will search a file at several directories in following order: <placeholder-1/> But when <literal>EXEC SQL INCLUDE "<replaceable>filename</replaceable>"</literal> is used, only the current directory is searched.
ru: Препроцессор <command>ecpg</command> будет искать указанный файл в нескольких каталогах в следующем порядке: <placeholder-1/> Но когда используется форма <literal>EXEC SQL INCLUDE "<replaceable>имя_файла</replaceable>"</literal>, просматривается только текущий каталог.

source: In each directory, the preprocessor will first look for the file name as given, and if not found will append <literal>.h</literal> to the file name and try again (unless the specified file name already has that suffix).
ru: В каждом каталоге препроцессор будет сначала искать файл с заданным именем, а если не обнаружит его, попытается найти файл с добавленным расширением <literal>.h</literal> (если только заданное имя файла уже не содержит это расширение).

source: #include &lt;<replaceable>filename</replaceable>.h&gt;
ru: #include &lt;<replaceable>имя_файла</replaceable>.h&gt;
