Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ecpg.po
Languages: ru

source: Convert a variable of type numeric to long. <synopsis> int PGTYPESnumeric_to_long(numeric *nv, long *lp); </synopsis> The function converts the numeric value from the variable that <literal>nv</literal> points to into the long integer variable that <literal>lp</literal> points to. It returns 0 on success and -1 if an error occurs, including overflow. On overflow, the global variable <literal>errno</literal> will be set to <literal>PGTYPES_NUM_OVERFLOW</literal> additionally.
ru: Преобразует переменную типа numeric в переменную long. <synopsis> int PGTYPESnumeric_to_long(numeric *nv, long *lp); </synopsis> Эта функция преобразует значение типа numeric переменной, на которую указывает <literal>nv</literal>, в целочисленную переменную типа long, на которую указывает <literal>lp</literal>. Она возвращает 0 в случае успеха и -1 при ошибке, в том числе при переполнении. Если происходит переполнение, в глобальной переменной <literal>errno</literal> дополнительно устанавливается значение <literal>PGTYPES_NUM_OVERFLOW</literal>.

source: Convert a variable of type numeric to decimal. <synopsis> int PGTYPESnumeric_to_decimal(numeric *src, decimal *dst); </synopsis> The function converts the numeric value from the variable that <literal>src</literal> points to into the decimal variable that <literal>dst</literal> points to. It returns 0 on success and -1 if an error occurs, including overflow. On overflow, the global variable <literal>errno</literal> will be set to <literal>PGTYPES_NUM_OVERFLOW</literal> additionally.
ru: Преобразует переменную типа numeric в переменную decimal. <synopsis> int PGTYPESnumeric_to_decimal(numeric *src, decimal *dst); </synopsis> Эта функция преобразует значение типа numeric переменной, на которую указывает <literal>src</literal>, в переменную типа decimal, на которую указывает <literal>dst</literal>. Она возвращает 0 в случае успеха и -1 при ошибке, в том числе при переполнении. Если происходит переполнение, в глобальной переменной <literal>errno</literal> дополнительно устанавливается значение <literal>PGTYPES_NUM_OVERFLOW</literal>.

source: Convert a variable of type decimal to numeric. <synopsis> int PGTYPESnumeric_from_decimal(decimal *src, numeric *dst); </synopsis> The function converts the decimal value from the variable that <literal>src</literal> points to into the numeric variable that <literal>dst</literal> points to. It returns 0 on success and -1 if an error occurs. Since the decimal type is implemented as a limited version of the numeric type, overflow cannot occur with this conversion.
ru: Преобразует переменную типа decimal в переменную numeric. <synopsis> int PGTYPESnumeric_from_decimal(decimal *src, numeric *dst); </synopsis> Эта функция преобразует значение типа decimal переменной, на которую указывает <literal>src</literal>, в переменную типа numeric, на которую указывает <literal>dst</literal>. Она возвращает 0 в случае успеха и -1 при ошибке. Так как тип decimal реализован как ограниченная версия типа numeric, при таком преобразовании переполнение невозможно.

source: The following functions can be used to work with the numeric type: <placeholder-1/>
ru: Для работы с типом numeric можно использовать следующие функции: <placeholder-1/>

source: The date Type
ru: Тип date

source: The date type in C enables your programs to deal with data of the SQL type date. See <xref linkend="datatype-datetime"/> for the equivalent type in the <productname>PostgreSQL</productname> server.
ru: Тип date, реализованный в C, позволяет программам работать с данными типа date в SQL. Соответствующий тип сервера <productname>PostgreSQL</productname> описан в <xref remap="6" linkend="datatype-datetime"/>.

source: Extract the date part from a timestamp. <synopsis> date PGTYPESdate_from_timestamp(timestamp dt); </synopsis> The function receives a timestamp as its only argument and returns the extracted date part from this timestamp.
ru: Извлекает часть даты из значения типа timestamp. <synopsis> date PGTYPESdate_from_timestamp(timestamp dt); </synopsis> Эта функция получает в единственном аргументе значение времени типа timestamp и возвращает извлечённую из него дату.

source: Parse a date from its textual representation. <synopsis> date PGTYPESdate_from_asc(char *str, char **endptr); </synopsis> The function receives a C char* string <literal>str</literal> and a pointer to a C char* string <literal>endptr</literal>. At the moment ECPG always parses the complete string and so it currently does not support to store the address of the first invalid character in <literal>*endptr</literal>. You can safely set <literal>endptr</literal> to NULL.
ru: Разбирает дату из её текстового представления. <synopsis> date PGTYPESdate_from_asc(char *str, char **endptr); </synopsis> Эта функция получает строку C char* <literal>str</literal> и указатель на строку C char* <literal>endptr</literal>. На данный момент ECPG всегда разбирает строку до конца, так что эта функция не может вернуть адрес первого недопустимого символа в <literal>*endptr</literal>. Поэтому в <literal>endptr</literal> свободно можно передать NULL.

source: Note that the function always assumes MDY-formatted dates and there is currently no variable to change that within ECPG.
ru: Заметьте, что эта функция всегда подразумевает формат дат MDY (месяц-день-год) и никакой переменной для изменения этого формата в ECPG нет.

source: <xref linkend="ecpg-pgtypesdate-from-asc-table"/> shows the allowed input formats.
ru: Все допустимые форматы ввода перечислены в <xref remap="6" linkend="ecpg-pgtypesdate-from-asc-table"/>.

source: Valid Input Formats for <function>PGTYPESdate_from_asc</function>
ru: Допустимые форматы ввода для <function>PGTYPESdate_from_asc</function>

source: Input
ru: Ввод

source: Result
ru: Результат

source: year and day of year
ru: год и день года

source: Julian day
ru: День по юлианскому календарю

source: year 99 before the Common Era
ru: 99 год до нашей эры

source: Return the textual representation of a date variable. <synopsis> char *PGTYPESdate_to_asc(date dDate); </synopsis> The function receives the date <literal>dDate</literal> as its only parameter. It will output the date in the form <literal>1999-01-18</literal>, i.e., in the <literal>YYYY-MM-DD</literal> format.
ru: Возвращает текстовое представление переменной типа date. <synopsis> char *PGTYPESdate_to_asc(date dDate); </synopsis> Эта функция получает в качестве единственного параметра дату <literal>dDate</literal> и выводит её в виде <literal>1999-01-18</literal>, то есть в формате <literal>YYYY-MM-DD</literal>.

source: Extract the values for the day, the month and the year from a variable of type date. <synopsis> void PGTYPESdate_julmdy(date d, int *mdy); </synopsis> The function receives the date <literal>d</literal> and a pointer to an array of 3 integer values <literal>mdy</literal>. The variable name indicates the sequential order: <literal>mdy[0]</literal> will be set to contain the number of the month, <literal>mdy[1]</literal> will be set to the value of the day and <literal>mdy[2]</literal> will contain the year.
ru: Извлекает значения дня, месяца и года из переменной типа date. <synopsis> void PGTYPESdate_julmdy(date d, int *mdy); </synopsis> Эта функция получает дату <literal>d</literal> и указатель на 3 целочисленных значения <literal>mdy</literal>. Имя переменной указывает на порядок значений: в <literal>mdy[0]</literal> записывается номер месяца, в <literal>mdy[1]</literal> — номер дня, а в <literal>mdy[2]</literal> — год.

source: Create a date value from an array of 3 integers that specify the day, the month and the year of the date. <synopsis> void PGTYPESdate_mdyjul(int *mdy, date *jdate); </synopsis> The function receives the array of the 3 integers (<literal>mdy</literal>) as its first argument and as its second argument a pointer to a variable of type date that should hold the result of the operation.
ru: Образует значение даты из массива 3 целых чисел, задающих день, месяц и год даты. <synopsis> void PGTYPESdate_mdyjul(int *mdy, date *jdate); </synopsis> Эта функция получает в первом аргументе массив из 3 целых чисел (<literal>mdy</literal>), а во втором указатель на переменную типа date, в которую будет помещён результат операции.

source: 0 - Sunday
ru: 0 — Воскресенье

source: 1 - Monday
ru: 1 — Понедельник

source: 2 - Tuesday
ru: 2 — Вторник

source: 3 - Wednesday
ru: 3 — Среда

source: 4 - Thursday
ru: 4 — Четверг

source: 5 - Friday
ru: 5 — Пятница

source: 6 - Saturday
ru: 6 — Суббота

source: Return a number representing the day of the week for a date value. <synopsis> int PGTYPESdate_dayofweek(date d); </synopsis> The function receives the date variable <literal>d</literal> as its only argument and returns an integer that indicates the day of the week for this date. <placeholder-1/>
ru: Возвращает число, представляющее день недели для заданной даты. <synopsis> int PGTYPESdate_dayofweek(date d); </synopsis> Эта функция принимает в единственном аргументе переменную <literal>d</literal> типа date и возвращает целое число, выражающее день недели для этой даты. <placeholder-1/>

source: Get the current date. <synopsis> void PGTYPESdate_today(date *d); </synopsis> The function receives a pointer to a date variable (<literal>d</literal>) that it sets to the current date.
ru: Выдаёт текущую дату. <synopsis> void PGTYPESdate_today(date *d); </synopsis> Эта функция получает указатель на переменную (<literal>d</literal>) типа date, в которую будет записана текущая дата.

source: Convert a variable of type date to its textual representation using a format mask. <synopsis> int PGTYPESdate_fmt_asc(date dDate, char *fmtstring, char *outbuf); </synopsis> The function receives the date to convert (<literal>dDate</literal>), the format mask (<literal>fmtstring</literal>) and the string that will hold the textual representation of the date (<literal>outbuf</literal>).
ru: Преобразует переменную типа date в текстовое представление по маске формата. <synopsis> int PGTYPESdate_fmt_asc(date dDate, char *fmtstring, char *outbuf); </synopsis> Эта функция принимает дату для преобразования (<literal>dDate</literal>), маску формата (<literal>fmtstring</literal>) и строку, в которую будет помещено текстовое представление даты (<literal>outbuf</literal>).

source: On success, 0 is returned and a negative value if an error occurred.
ru: В случае успеха возвращается 0, а в случае ошибки — отрицательное значение.

source: <literal>dd</literal> - The number of the day of the month.
ru: <literal>dd</literal> — Номер дня в месяце.

source: <literal>mm</literal> - The number of the month of the year.
ru: <literal>mm</literal> — Номер месяца в году.

source: <literal>yy</literal> - The number of the year as a two digit number.
ru: <literal>yy</literal> — Номер года в виде двух цифр.

source: <literal>yyyy</literal> - The number of the year as a four digit number.
ru: <literal>yyyy</literal> — Номер года в виде четырёх цифр.

source: <literal>ddd</literal> - The name of the day (abbreviated).
ru: <literal>ddd</literal> — Название дня недели (сокращённое).

source: <literal>mmm</literal> - The name of the month (abbreviated).
ru: <literal>mmm</literal> — Название месяца (сокращённое).

source: The following literals are the field specifiers you can use: <placeholder-1/> All other characters are copied 1:1 to the output string.
ru: В строке формата можно использовать следующие коды полей: <placeholder-1/> Все другие символы копируются в выводимую строку 1:1.

source: <xref linkend="ecpg-pgtypesdate-fmt-asc-example-table"/> indicates a few possible formats. This will give you an idea of how to use this function. All output lines are based on the same date: November 23, 1959.
ru: В <xref remap="6" linkend="ecpg-pgtypesdate-fmt-asc-example-table"/> перечислены несколько возможных форматов. Это даёт представление, как можно использовать эту функцию. Все строки вывода даны для одной даты: 23 ноября 1959 г.

source: Valid Input Formats for <function>PGTYPESdate_fmt_asc</function>
ru: Допустимые форматы ввода для <function>PGTYPESdate_fmt_asc</function>

source: Format
ru: Формат

source: Use a format mask to convert a C <type>char*</type> string to a value of type date. <synopsis> int PGTYPESdate_defmt_asc(date *d, char *fmt, char *str); </synopsis> The function receives a pointer to the date value that should hold the result of the operation (<literal>d</literal>), the format mask to use for parsing the date (<literal>fmt</literal>) and the C char* string containing the textual representation of the date (<literal>str</literal>). The textual representation is expected to match the format mask. However you do not need to have a 1:1 mapping of the string to the format mask. The function only analyzes the sequential order and looks for the literals <literal>yy</literal> or <literal>yyyy</literal> that indicate the position of the year, <literal>mm</literal> to indicate the position of the month and <literal>dd</literal> to indicate the position of the day.
ru: Преобразует строку C <type>char*</type> в значение типа date по маске формата. <synopsis> int PGTYPESdate_defmt_asc(date *d, char *fmt, char *str); </synopsis> Эта функция принимает указатель на переменную типа date (<literal>d</literal>), в которую будет помещён результат операции, маску формата для разбора даты (<literal>fmt</literal>) и строку C char*, содержащую текстовое представление даты (<literal>str</literal>). Ожидается, что текстовое представление будет соответствовать маске формата. Однако это соответствие не обязательно должно быть точным. Данная функция анализирует только порядок элементов и ищет в нём подстроки <literal>yy</literal> или <literal>yyyy</literal>, обозначающие позицию года, подстроку <literal>mm</literal>, обозначающую позицию месяца, и <literal>dd</literal>, обозначающую позицию дня.

source: <xref linkend="ecpg-rdefmtdate-example-table"/> indicates a few possible formats. This will give you an idea of how to use this function.
ru: В <xref linkend="ecpg-rdefmtdate-example-table"/> перечислены несколько возможных форматов. Это даёт представление, как можно использовать эту функцию.

source: Valid Input Formats for <function>rdefmtdate</function>
ru: Допустимые форматы ввода для <function>rdefmtdate</function>

source: String
ru: Строка

source: The following functions can be used to work with the date type: <placeholder-1/>
ru: Для работы с типом date можно использовать следующие функции: <placeholder-1/>

source: The timestamp Type
ru: Тип timestamp

source: The timestamp type in C enables your programs to deal with data of the SQL type timestamp. See <xref linkend="datatype-datetime"/> for the equivalent type in the <productname>PostgreSQL</productname> server.
ru: Тип timestamp, реализованный в C, позволяет программам работать с данными типа timestamp в SQL. Соответствующий тип сервера <productname>PostgreSQL</productname> описан в <xref remap="6" linkend="datatype-datetime"/>.

source: Parse a timestamp from its textual representation into a timestamp variable. <synopsis> timestamp PGTYPEStimestamp_from_asc(char *str, char **endptr); </synopsis> The function receives the string to parse (<literal>str</literal>) and a pointer to a C char* (<literal>endptr</literal>). At the moment ECPG always parses the complete string and so it currently does not support to store the address of the first invalid character in <literal>*endptr</literal>. You can safely set <literal>endptr</literal> to NULL.
ru: Разбирает значение даты/времени из текстового представления в переменную типа timestamp. <synopsis> timestamp PGTYPEStimestamp_from_asc(char *str, char **endptr); </synopsis> Эта функция получает строку (<literal>str</literal>), которую нужно разобрать, и указатель на строку C char* (<literal>endptr</literal>). На данный момент ECPG всегда разбирает строку до конца, так что эта функция не может вернуть адрес первого недопустимого символа в <literal>*endptr</literal>. Поэтому в <literal>endptr</literal> свободно можно передать NULL.

source: The function returns the parsed timestamp on success. On error, <literal>PGTYPESInvalidTimestamp</literal> is returned and <varname>errno</varname> is set to <literal>PGTYPES_TS_BAD_TIMESTAMP</literal>. See <xref linkend="pgtypesinvalidtimestamp"/> for important notes on this value.
ru: В случае успеха эта функция возвращает разобранное время, а в случае ошибки возвращается <literal>PGTYPESInvalidTimestamp</literal> и в <varname>errno</varname> устанавливается значение <literal>PGTYPES_TS_BAD_TIMESTAMP</literal>. См. замечание относительно <xref linkend="pgtypesinvalidtimestamp"/>.

source: In general, the input string can contain any combination of an allowed date specification, a whitespace character and an allowed time specification. Note that time zones are not supported by ECPG. It can parse them but does not apply any calculation as the <productname>PostgreSQL</productname> server does for example. Timezone specifiers are silently discarded.
ru: Вообще вводимая строка может содержать допустимое указание даты, пробельные символы и допустимое указание времени в любом сочетании. Заметьте, что часовые пояса ECPG не поддерживает. Эта функция может разобрать их, но не задействует их в вычислениях как это делает, например, сервер <productname>PostgreSQL</productname>. Указания часового пояса во вводимой строке просто игнорируются.

source: <xref linkend="ecpg-pgtypestimestamp-from-asc-example-table"/> contains a few examples for input strings.
ru: В <xref linkend="ecpg-pgtypestimestamp-from-asc-example-table"/> приведены несколько примеров вводимых строк.

source: Valid Input Formats for <function>PGTYPEStimestamp_from_asc</function>
ru: Допустимые форматы ввода для <function>PGTYPEStimestamp_from_asc</function>

source: 1999-01-08 04:05:06.789 (time zone specifier ignored)
ru: 1999-01-08 04:05:06.789 (указание часового пояса игнорируется)

source: 1999-01-08 04:05:00 (time zone specifier ignored)
ru: 1999-01-08 04:05:00 (указание часового пояса игнорируется)

source: Converts a date to a C char* string. <synopsis> char *PGTYPEStimestamp_to_asc(timestamp tstamp); </synopsis> The function receives the timestamp <literal>tstamp</literal> as its only argument and returns an allocated string that contains the textual representation of the timestamp.
ru: Преобразует значение даты в строку C char*. <synopsis> char *PGTYPEStimestamp_to_asc(timestamp tstamp); </synopsis> Эта функция принимает в качестве единственного аргумента <literal>tstamp</literal> значение типа timestamp и возвращает размещённую в памяти строку, содержащую текстовое представление даты/времени.

source: Retrieve the current timestamp. <synopsis> void PGTYPEStimestamp_current(timestamp *ts); </synopsis> The function retrieves the current timestamp and saves it into the timestamp variable that <literal>ts</literal> points to.
ru: Получает текущее время. <synopsis> void PGTYPEStimestamp_current(timestamp *ts); </synopsis> Эта функция получает текущее время и сохраняет его в переменной типа timestamp, на которую указывает <literal>ts</literal>.

source: Convert a timestamp variable to a C char* using a format mask. <synopsis> int PGTYPEStimestamp_fmt_asc(timestamp *ts, char *output, int str_len, char *fmtstr); </synopsis> The function receives a pointer to the timestamp to convert as its first argument (<literal>ts</literal>), a pointer to the output buffer (<literal>output</literal>), the maximal length that has been allocated for the output buffer (<literal>str_len</literal>) and the format mask to use for the conversion (<literal>fmtstr</literal>).
ru: Преобразует переменную типа timestamp в строку C char* по маске формата. <synopsis> int PGTYPEStimestamp_fmt_asc(timestamp *ts, char *output, int str_len, char *fmtstr); </synopsis> Эта функция получает в первом аргументе (<literal>ts</literal>) указатель на переменную типа timestamp, а в последующих указатель на буфер вывода (<literal>output</literal>), максимальную длину строки, которую может принять буфер (<literal>str_len</literal>), и маску формата, с которой будет выполняться преобразование (<literal>fmtstr</literal>).

source: Upon success, the function returns 0 and a negative value if an error occurred.
ru: В случае успеха возвращается 0, а в случае ошибки — отрицательное значение.

source: <literal>%A</literal> - is replaced by national representation of the full weekday name.
ru: <literal>%A</literal> — заменяется локализованным представлением полного названия дня недели.

source: <literal>%a</literal> - is replaced by national representation of the abbreviated weekday name.
ru: <literal>%a</literal> — заменяется локализованным представлением сокращённого названия дня недели.

source: <literal>%B</literal> - is replaced by national representation of the full month name.
ru: <literal>%B</literal> — заменяется локализованным представлением полного названия месяца.

source: <literal>%b</literal> - is replaced by national representation of the abbreviated month name.
ru: <literal>%b</literal> — заменяется локализованным представлением сокращённого названия месяца.

source: <literal>%C</literal> - is replaced by (year / 100) as decimal number; single digits are preceded by a zero.
ru: <literal>%C</literal> — заменяется столетием (год / 100) в виде десятичного числа; одиночная цифра предваряется нулём.

source: <literal>%c</literal> - is replaced by national representation of time and date.
ru: <literal>%c</literal> — заменяется локализованным представлением даты и времени.

source: <literal>%D</literal> - is equivalent to <literal>%m/%d/%y</literal>.
ru: <literal>%D</literal> — равнозначно <literal>%m/%d/%y</literal>.

source: <literal>%d</literal> - is replaced by the day of the month as a decimal number (01-31).
ru: <literal>%d</literal> — заменяется днём месяца в виде десятичного числа (01-31).

source: <literal>%E*</literal> <literal>%O*</literal> - POSIX locale extensions. The sequences <literal>%Ec</literal> <literal>%EC</literal> <literal>%Ex</literal> <literal>%EX</literal> <literal>%Ey</literal> <literal>%EY</literal> <literal>%Od</literal> <literal>%Oe</literal> <literal>%OH</literal> <literal>%OI</literal> <literal>%Om</literal> <literal>%OM</literal> <literal>%OS</literal> <literal>%Ou</literal> <literal>%OU</literal> <literal>%OV</literal> <literal>%Ow</literal> <literal>%OW</literal> <literal>%Oy</literal> are supposed to provide alternative representations.
ru: <literal>%E*</literal> <literal>%O*</literal> — расширения локали POSIX. Последовательности <literal>%Ec</literal> <literal>%EC</literal> <literal>%Ex</literal> <literal>%EX</literal> <literal>%Ey</literal> <literal>%EY</literal> <literal>%Od</literal> <literal>%Oe</literal> <literal>%OH</literal> <literal>%OI</literal> <literal>%Om</literal> <literal>%OM</literal> <literal>%OS</literal> <literal>%Ou</literal> <literal>%OU</literal> <literal>%OV</literal> <literal>%Ow</literal> <literal>%OW</literal> <literal>%Oy</literal> должны выводить альтернативные представления.

source: Additionally <literal>%OB</literal> implemented to represent alternative months names (used standalone, without day mentioned).
ru: Кроме того, альтернативные названия месяцев представляет код формата <literal>%OB</literal> (используется отдельно, без упоминания дня).

source: <literal>%e</literal> - is replaced by the day of month as a decimal number (1-31); single digits are preceded by a blank.
ru: <literal>%e</literal> — заменяется днём в виде десятичного числа (1-31); одиночная цифра предваряется пробелом.

source: <literal>%F</literal> - is equivalent to <literal>%Y-%m-%d</literal>.
ru: <literal>%F</literal> — равнозначно <literal>%Y-%m-%d</literal>.
