Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/file-fdw.po
Languages: ru

source: The <filename>file_fdw</filename> module provides the foreign-data wrapper <function>file_fdw</function>, which can be used to access data files in the server's file system, or to execute programs on the server and read their output. The data file or program output must be in a format that can be read by <command>COPY FROM</command>; see <xref linkend="sql-copy"/> for details. Access to data files is currently read-only.
ru: Модуль <filename>file_fdw</filename> реализует обёртку сторонних данных <function>file_fdw</function>, с помощью которой можно обращаться к файлам данных в файловой системе сервера или выполнять программы на сервере и читать их вывод. Файлы и вывод программ должны быть в формате, который понимает команда <command>COPY FROM</command>; он рассматривается в описании <xref linkend="sql-copy"/>. В настоящее время файлы доступны только для чтения.

source: The <filename>file_fdw</filename> module provides the foreign-data wrapper <function>file_fdw</function>, which can be used to access data files in the server's file system. Data files must be in a format that can be read by <command>COPY FROM</command>; see <xref linkend="sql-copy"/> for details. Access to such data files is currently read-only.
ru: Модуль <filename>file_fdw</filename> реализует обёртку сторонних данных <function>file_fdw</function> для доступа к файлам на сервере. Файлы должны быть в формате, который понимает команда <command>COPY FROM</command>; он рассматривается в описании <xref linkend="sql-copy"/>. В настоящий момент файлы доступны только для чтения.

source: A foreign table created using this wrapper can have the following options:
ru: Для сторонней таблицы, создаваемой через эту обёртку, можно задать следующие параметры:

source: Specifies the file to be read. Must be an absolute path name. Either <literal>filename</literal> or <literal>program</literal> must be specified, but not both.
ru: Определяет имя файла, который нужно прочитать. Это имя должно задаваться абсолютным путём. Необходимо определить либо параметр <literal>filename</literal>, либо <literal>program</literal>, но не оба сразу.

source: Specifies the command to be executed. The standard output of this command will be read as though <command>COPY FROM PROGRAM</command> were used. Either <literal>program</literal> or <literal>filename</literal> must be specified, but not both.
ru: Определяет команду, которая будет выполнена. Поток стандартного вывода этой команды будет прочитан так же, как и с <command>COPY FROM PROGRAM</command>. Необходимо определить либо параметр <literal>program</literal>, либо <literal>filename</literal>, но не оба сразу.

source: Specifies the data format, the same as <command>COPY</command>'s <literal>FORMAT</literal> option.
ru: Определяет формат файла (аналогично указанию <literal>FORMAT</literal> в команде <command>COPY</command>).

source: Specifies whether the data has a header line, the same as <command>COPY</command>'s <literal>HEADER</literal> option.
ru: Указывает, что данные содержат строку заголовка с именами столбцов (аналогично указанию <literal>HEADER</literal> в команде <command>COPY</command>).

source: Specifies the data delimiter character, the same as <command>COPY</command>'s <literal>DELIMITER</literal> option.
ru: Задаёт символ, разделяющий столбцы в данных (аналогично указанию <literal>DELIMITER</literal> в команде <command>COPY</command>).

source: Specifies the data quote character, the same as <command>COPY</command>'s <literal>QUOTE</literal> option.
ru: Задаёт символ, используемый для заключения данных в кавычки (аналогично указанию <literal>QUOTE</literal> в команде <command>COPY</command>).

source: Specifies the data escape character, the same as <command>COPY</command>'s <literal>ESCAPE</literal> option.
ru: Задаёт символ, используемый для экранирования данных (аналогично указанию <literal>ESCAPE</literal> в команде <command>COPY</command>).

source: Specifies the data null string, the same as <command>COPY</command>'s <literal>NULL</literal> option.
ru: Определяет строку, задающую значение <literal>NULL</literal> в данных (аналогично указанию <literal>NULL</literal> в команде <command>COPY</command>).

source: Specifies the data encoding, the same as <command>COPY</command>'s <literal>ENCODING</literal> option.
ru: Задаёт кодировку данных (аналогично указанию <literal>ENCODING</literal> в команде <command>COPY</command>).

source: Note that while <command>COPY</command> allows options such as <literal>HEADER</literal> to be specified without a corresponding value, the foreign table option syntax requires a value to be present in all cases. To activate <command>COPY</command> options typically written without a value, you can pass the value TRUE, since all such options are Booleans.
ru: Заметьте, что хотя <command>COPY</command> принимает указания, такие как <literal>HEADER</literal>, без соответствующего значения, синтаксис обёртки сторонних данных требует, чтобы значение присутствовало во всех случаях. Чтобы активировать указания <command>COPY</command>, которым значение обычно не передаётся, им можно просто передать значение TRUE, так как все они являются логическими.

source: A column of a foreign table created using this wrapper can have the following options:
ru: Для столбцов сторонней таблицы, создаваемой через эту обёртку, можно задать следующие параметры:

source: This is a Boolean option. If true, it specifies that values of the column should not be matched against the null string (that is, the table-level <literal>null</literal> option). This has the same effect as listing the column in <command>COPY</command>'s <literal>FORCE_NOT_NULL</literal> option.
ru: Логическое значение. Если true, то значение столбца не должно сверяться со значением NULL (заданным в параметре <literal>null</literal> на уровне таблицы). Аналогично включению столбца в список указания <literal>FORCE_NOT_NULL</literal> команды <command>COPY</command>.

source: This is a Boolean option. If true, it specifies that values of the column which match the null string are returned as <literal>NULL</literal> even if the value is quoted. Without this option, only unquoted values matching the null string are returned as <literal>NULL</literal>. This has the same effect as listing the column in <command>COPY</command>'s <literal>FORCE_NULL</literal> option.
ru: Логическое значение. Если true, значения столбцов нужно сверять со значением NULL (заданным в параметре <literal>NULL</literal>), даже если они заключены в кавычки. Без этого параметра только значения без кавычек, соответствующие значению <literal>null</literal>, будут возвращаться как NULL. Аналогично включению столбца в список указания <literal>FORCE_NULL</literal> команды <command>COPY</command>.

source: <command>COPY</command>'s <literal>OIDS</literal> and <literal>FORCE_QUOTE</literal> options are currently not supported by <literal>file_fdw</literal>.
ru: В настоящий момент <literal>file_fdw</literal> не поддерживает указания <literal>OIDS</literal> и <literal>FORCE_QUOTE</literal> команды <command>COPY</command>.

source: These options can only be specified for a foreign table or its columns, not in the options of the <literal>file_fdw</literal> foreign-data wrapper, nor in the options of a server or user mapping using the wrapper.
ru: Перечисленные параметры применимы только для сторонних таблиц или их столбцов. Их нельзя указать для обёртки сторонних данных <literal>file_fdw</literal>, серверов или сопоставлений пользователей, использующих эту обёртку.

source: Changing table-level options requires superuser privileges, for security reasons: only a superuser should be able to control which file is read or which program is run. In principle non-superusers could be allowed to change the other options, but that's not supported at present.
ru: Для изменения параметров, определяемых для таблицы, требуются права суперпользователя. Это сделано в целях безопасности: только суперпользователь должен выбирать, какой файл читать или какую программу запускать. В принципе право изменения остальных параметров можно предоставить и не суперпользователям, но в настоящий момент это не реализовано.

source: One of the obvious uses for the <literal>file_fdw</literal> is to make the PostgreSQL activity log available as a table for querying. To do this, first you must be logging to a CSV file, which here we will call <literal>pglog.csv</literal>. First, install <literal>file_fdw</literal> as an extension:
ru: Одно из очевидных применений <literal>file_fdw</literal> это предоставление доступа к журналу сервера как к таблице. Предварительно нужно убедиться, что журнал сервера пишется в формате CSV. Далее в примере он называется <literal>pglog.csv</literal>. Для начала установите расширение <literal>file_fdw</literal>:

source: When specifying the <literal>program</literal> option, keep in mind that the option string is executed by the shell. If you need to pass any arguments to the command that come from an untrusted source, you must be careful to strip or escape any characters that might have special meaning to the shell. For security reasons, it is best to use a fixed command string, or at least avoid passing any user input in it.
ru: Задавая параметр <literal>program</literal>, помните, что эта строка выполняется оболочкой ОС. Если вы хотите передавать заданной команде параметры из недоверенного источника, позаботьтесь об исключении или экранировании всех символов, которые могут иметь особое назначение в оболочке. По соображениям безопасности лучше, чтобы эта командная строка была фиксированной или как минимум в ней не передавались данные, поступающие от пользователя.

source: For a foreign table using <literal>file_fdw</literal>, <command>EXPLAIN</command> shows the name of the file to be read or program to be run. For a file, unless <literal>COSTS OFF</literal> is specified, the file size (in bytes) is shown as well.
ru: Для сторонних таблиц, работающих через <literal>file_fdw</literal>, команда <command>EXPLAIN</command> показывает имя используемого файла или запускаемой программы. Если не указывать <literal>COSTS OFF</literal>, то выводится и размер файла (в байтах).

source: Create a Foreign Table for PostgreSQL CSV Logs
ru: Создание сторонней таблицы для журнала сервера PostgreSQL

source: One of the obvious uses for <literal>file_fdw</literal> is to make the PostgreSQL activity log available as a table for querying. To do this, first you must be logging to a CSV file, which here we will call <literal>pglog.csv</literal>. First, install <literal>file_fdw</literal> as an extension:
ru: Одно из очевидных применений <literal>file_fdw</literal> это предоставление доступа к журналу сообщений PostgreSQL как к таблице. Для этого необходимо предварительно настроить вывод сообщений в файл CSV (дальше мы будем считать, что это файл <literal>pglog.csv</literal>). Сначала установите расширение <literal>file_fdw</literal>:

source: Then create a foreign server: <placeholder-1/>
ru: Затем создайте сторонний сервер: <placeholder-1/>

source: Now you are ready to create the foreign data table. Using the <command>CREATE FOREIGN TABLE</command> command, you will need to define the columns for the table, the CSV file name, and its format: <placeholder-1/>
ru: Всё готово для создания сторонней таблицы. В команде <command>CREATE FOREIGN TABLE</command> нужно перечислить столбцы таблицы, указать файл CSV и его формат:<placeholder-1/>

source: That's it &mdash; now you can query your log directly. In production, of course, you would need to define some way to deal with log rotation.
ru: Вот и всё. Теперь для просмотра журнала сервера можно просто выполнять запросы к таблице. В производственной среде, разумеется, ещё потребуется как-то учесть ротацию файлов журнала.

source: Specifies the file to be read. Required. Must be an absolute path name.
ru: Имя файла данных. Указывается обязательно. Значение представляет собой абсолютный путь к файлу.

source: Specifies the file's format, the same as <command>COPY</command>'s <literal>FORMAT</literal> option.
ru: Формат файла. Аналогично указанию <literal>FORMAT</literal> в команде <command>COPY</command>.

source: Specifies whether the file has a header line, the same as <command>COPY</command>'s <literal>HEADER</literal> option.
ru: Показывает, что файл содержит строку заголовка с именами столбцов. Аналогично указанию <literal>HEADER</literal> в команде <command>COPY</command>.

source: Specifies the file's delimiter character, the same as <command>COPY</command>'s <literal>DELIMITER</literal> option.
ru: Задаёт символ, разделяющий столбцы в строках файла. Аналогично указанию <literal>DELIMITER</literal> в команде <command>COPY</command>.

source: Specifies the file's quote character, the same as <command>COPY</command>'s <literal>QUOTE</literal> option.
ru: Задаёт символ, используемый для заключения данных в кавычки. Аналогично указанию <literal>QUOTE</literal> в команде <command>COPY</command>.

source: Specifies the file's escape character, the same as <command>COPY</command>'s <literal>ESCAPE</literal> option.
ru: Задаёт символ, который будет выводиться перед символом данных, совпавшим со значением <literal>QUOTE</literal>. Аналогично указанию <literal>ESCAPE</literal> в команде <command>COPY</command>.

source: Specifies the file's null string, the same as <command>COPY</command>'s <literal>NULL</literal> option.
ru: Определяет строку, задающую значение <literal>NULL</literal>. Аналогично указанию <literal>NULL</literal> в команде <command>COPY</command>.

source: Specifies the file's encoding, the same as <command>COPY</command>'s <literal>ENCODING</literal> option.
ru: Задаёт кодировку файла. Аналогично указанию <literal>ENCODING</literal> в команде <command>COPY</command>.

source: Note that while <command>COPY</command> allows options such as OIDS and HEADER to be specified without a corresponding value, the foreign data wrapper syntax requires a value to be present in all cases. To activate <command>COPY</command> options normally supplied without a value, you can instead pass the value TRUE.
ru: Заметьте, что хотя <command>COPY</command> принимает указания, такие как OIDS и HEADER, без соответствующего значения, синтаксис обёртки сторонних данных требует, чтобы значение присутствовало во всех случаях. Чтобы активировать указания <command>COPY</command>, которым значение обычно не передаётся, им можно просто передать значение TRUE.

source: This is a Boolean option. If true, it specifies that values of the column should not be matched against the null string (that is, the file-level <literal>null</literal> option). This has the same effect as listing the column in <command>COPY</command>'s <literal>FORCE_NOT_NULL</literal> option.
ru: Логическое значение. Если true, то значение столбца не должно сверяться со значением NULL (заданным в параметре <literal>null</literal>). Аналогично включению столбца в список указания <literal>FORCE_NOT_NULL</literal> команды <command>COPY</command>.

source: Changing table-level options requires superuser privileges, for security reasons: only a superuser should be able to determine which file is read. In principle non-superusers could be allowed to change the other options, but that's not supported at present.
ru: Для изменения параметров, определяемых для таблицы, требуются права суперпользователя. Это сделано в целях безопасности: только суперпользователь должен решать, какой файл использовать. В принципе, доступ на изменение остальных параметров можно предоставить и не суперпользователям, но в настоящий момент это не реализовано.

source: For a foreign table using <literal>file_fdw</literal>, <command>EXPLAIN</command> shows the name of the file to be read. Unless <literal>COSTS OFF</literal> is specified, the file size (in bytes) is shown as well.
ru: Для сторонних таблиц, работающих через <literal>file_fdw</literal>, команда <command>EXPLAIN</command> показывает имя используемого файла. Если не указывать <literal>COSTS OFF</literal>, то выводится и размер файла (в байтах).
