Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/generic-wal.po
Languages: ru

source: Generic WAL Records
ru: Унифицированные записи WAL

source: Although all built-in WAL-logged modules have their own types of WAL records, there is also a generic WAL record type, which describes changes to pages in a generic way. This is useful for extensions that provide custom access methods, because they cannot register their own WAL redo routines.
ru: Хотя у всех внутренних модулей, взаимодействующих с WAL, имеются собственные типы записей WAL, существует также унифицированный тип записей WAL, описывающий изменения в страницах унифицированным образом. Это полезно для расширений, реализующих собственные методы доступа, так как они не могут зарегистрировать свои подпрограммы воспроизведения изменений WAL.

source: The API for constructing generic WAL records is defined in <filename>access/generic_xlog.h</filename> and implemented in <filename>access/transam/generic_xlog.c</filename>.
ru: API для конструирования унифицированных записей WAL определён в <filename>access/generic_xlog.h</filename> и реализован в <filename>access/transam/generic_xlog.c</filename>.

source: <function>state = GenericXLogStart(relation)</function> &mdash; start construction of a generic WAL record for the given relation.
ru: <function>state = GenericXLogStart(relation)</function> &mdash; начните формирование унифицированной записи WAL для заданного отношения.

source: <function>page = GenericXLogRegisterBuffer(state, buffer, flags)</function> &mdash; register a buffer to be modified within the current generic WAL record. This function returns a pointer to a temporary copy of the buffer's page, where modifications should be made. (Do not modify the buffer's contents directly.) The third argument is a bitmask of flags applicable to the operation. Currently the only such flag is <literal>GENERIC_XLOG_FULL_IMAGE</literal>, which indicates that a full-page image rather than a delta update should be included in the WAL record. Typically this flag would be set if the page is new or has been rewritten completely. <function>GenericXLogRegisterBuffer</function> can be repeated if the WAL-logged action needs to modify multiple pages.
ru: <function>page = GenericXLogRegisterBuffer(state, buffer, flags)</function> &mdash; зарегистрируйте буфер, который будет изменён текущей унифицированной записью WAL. Эта функция возвращает указатель на временную копию страницы буфера, в которой должны производиться изменения. (Модифицировать непосредственно содержимое буфера нельзя.) В третьем аргументе передаётся битовая маска флагов, применимых к этой операции. В настоящее время флаг только один — <literal>GENERIC_XLOG_FULL_IMAGE</literal>, который показывает, что в запись WAL нужно включить образ всей страницы, а не только изменения. Обычно этот флаг должен устанавливаться, когда страница новая или полностью перезаписана. Вызов <function>GenericXLogRegisterBuffer</function> можно повторять, если фиксируемое в WAL действие изменяет несколько страниц.

source: Apply modifications to the page images obtained in the previous step.
ru: Применить изменения к образам страниц, полученным на предыдущем шаге.

source: <function>GenericXLogFinish(state)</function> &mdash; apply the changes to the buffers and emit the generic WAL record.
ru: <function>GenericXLogFinish(state)</function> &mdash; завершите изменения в буферах и выдайте унифицированную запись WAL.

source: To perform a WAL-logged data update using the generic WAL record facility, follow these steps: <placeholder-1/>
ru: Чтобы сформировать запись изменения данных для WAL, применяя механизм унифицированных записей WAL, выполните следующие действия: <placeholder-1/>

source: WAL record construction can be canceled between any of the above steps by calling <function>GenericXLogAbort(state)</function>. This will discard all changes to the page image copies.
ru: Формирование записи WAL можно прервать на любом шаге, вызвав <function>GenericXLogAbort(state)</function>. При этом будут отменены все изменения, внесённые в копии образов страниц.

source: No direct modifications of buffers are allowed! All modifications must be done in copies acquired from <function>GenericXLogRegisterBuffer()</function>. In other words, code that makes generic WAL records should never call <function>BufferGetPage()</function> for itself. However, it remains the caller's responsibility to pin/unpin and lock/unlock the buffers at appropriate times. Exclusive lock must be held on each target buffer from before <function>GenericXLogRegisterBuffer()</function> until after <function>GenericXLogFinish()</function>.
ru: Модифицировать буферы напрямую нельзя! Все изменения должны производиться в копиях, полученных от функции <function>GenericXLogRegisterBuffer()</function>. Другими словами, код, формирующий унифицированные записи WAL, никогда не должен сам вызывать <function>BufferGetPage()</function>. Однако, вызывающий код отвечает за закрепление/открепление и блокировку/разблокировку буферов в подходящие моменты времени. Исключительная блокировка каждого целевого буфера должна удерживаться от вызова <function>GenericXLogRegisterBuffer()</function> до <function>GenericXLogFinish()</function>.

source: Registrations of buffers (step 2) and modifications of page images (step 3) can be mixed freely, i.e., both steps may be repeated in any sequence. Keep in mind that buffers should be registered in the same order in which locks are to be obtained on them during replay.
ru: Регистрацию буферов (шаг 2) и модификацию образов страниц (шаг 3) можно свободно смешивать, оба этих шага можно повторять в любой последовательности. Но помните, что буферы должны регистрироваться в том же порядке, в каком для них должны получаться блокировки при воспроизведении.

source: The maximum number of buffers that can be registered for a generic WAL record is <literal>MAX_GENERIC_XLOG_PAGES</literal>. An error will be thrown if this limit is exceeded.
ru: Максимальное число буферов, которые можно зарегистрировать для унифицированной записи WAL, составляет <literal>MAX_GENERIC_XLOG_PAGES</literal>. При исчерпании этого лимита будет выдана ошибка.

source: Generic WAL assumes that the pages to be modified have standard layout, and in particular that there is no useful data between <structfield>pd_lower</structfield> and <structfield>pd_upper</structfield>.
ru: Унифицированный тип WAL подразумевает, что страницы, подлежащие изменению, имеют стандартную структуру, в частности между <structfield>pd_lower</structfield> и <structfield>pd_upper</structfield> нет полезных данных.

source: Since you are modifying copies of buffer pages, <function>GenericXLogStart()</function> does not start a critical section. Thus, you can safely do memory allocation, error throwing, etc. between <function>GenericXLogStart()</function> and <function>GenericXLogFinish()</function>. The only actual critical section is present inside <function>GenericXLogFinish()</function>. There is no need to worry about calling <function>GenericXLogAbort()</function> during an error exit, either.
ru: Так как изменяются копии страниц буфера, <function>GenericXLogStart()</function> не начинает критическую секцию. Таким образом вы можете безопасно выделять память, выдать ошибку и т. п. между <function>GenericXLogStart()</function> и <function>GenericXLogFinish()</function>. Единственная фактическая критическая секция присутствует внутри <function>GenericXLogFinish()</function>. При выходе по ошибке так же не нужно заботиться о вызове <function>GenericXLogAbort()</function>.

source: <function>GenericXLogFinish()</function> takes care of marking buffers dirty and setting their LSNs. You do not need to do this explicitly.
ru: <function>GenericXLogFinish()</function> помечает буферы как грязные и устанавливает для них LSN. Вам делать явно это не нужно.

source: For unlogged relations, everything works the same except that no actual WAL record is emitted. Thus, you typically do not need to do any explicit checks for unlogged relations.
ru: Для нежурналируемых отношений всё работает так же, за исключением того, что фактически запись в WAL не выдаётся. Таким образом, явно проверять, является ли отношение нежурналируемым, не требуется.

source: The generic WAL redo function will acquire exclusive locks to buffers in the same order as they were registered. After redoing all changes, the locks will be released in the same order.
ru: Функция воспроизведения унифицированных изменений WAL получит исключительные блокировки буферов в том же порядке, в каком они были зарегистрированы. После воспроизведения всех изменений блокировки в том же порядке и освобождаются.

source: If <literal>GENERIC_XLOG_FULL_IMAGE</literal> is not specified for a registered buffer, the generic WAL record contains a delta between the old and the new page images. This delta is based on byte-by-byte comparison. This is not very compact for the case of moving data within a page, and might be improved in the future.
ru: Если для регистрируемого буфера не задаётся <literal>GENERIC_XLOG_FULL_IMAGE</literal>, унифицированная запись WAL содержит различие между старым и новым образом страницы, которое вычисляется при побайтовом сравнении. Результат оказывается не очень компактным при перемещении данных в странице, но это может быть доработано в будущем.

source: Please note the following points when using the generic WAL record facility: <placeholder-1/>
ru: Используя механизм унифицированных записей WAL, необходимо учитывать следующее: <placeholder-1/>
