Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/geqo.po
Languages: ru

source: Genetic Query Optimizer
ru: Генетический оптимизатор запросов

source: Author
ru: Автор

source: Written by Martin Utesch (<email>utesch@aut.tu-freiberg.de</email>) for the Institute of Automatic Control at the University of Mining and Technology in Freiberg, Germany.
ru: Разработал Мартин Утеш (<email>utesch@aut.tu-freiberg.de</email>) для Института автоматического управления в Техническом университете Фрайбергская горная академия, Германия.

source: Query Handling as a Complex Optimization Problem
ru: Обработка запроса как сложная задача оптимизации

source: Among all relational operators the most difficult one to process and optimize is the <firstterm>join</firstterm>. The number of possible query plans grows exponentially with the number of joins in the query. Further optimization effort is caused by the support of a variety of <firstterm>join methods</firstterm> (e.g., nested loop, hash join, merge join in <productname>PostgreSQL</productname>) to process individual joins and a diversity of <firstterm>indexes</firstterm> (e.g., B-tree, hash, GiST and GIN in <productname>PostgreSQL</productname>) as access paths for relations.
ru: Среди всех реляционных операторов самым сложным для обработки и оптимизации является <firstterm>соединение</firstterm>. В первую очередь потому, что по мере увеличения числа соединений в запросе число возможных планов запроса увеличивается экспоненциально. Дополнительная сложность оптимизации связана с наличием различных <firstterm>методов соединения</firstterm> (например, в <productname>PostgreSQL</productname> это вложенный цикл, соединение по хешу и соединение слиянием) для каждого отдельного соединения и разнообразием <firstterm>индексов</firstterm> (например, в <productname>PostgreSQL</productname> это B-дерево, хеш, GiST и GIN), определяющих путь доступа к отношениям.

source: The normal <productname>PostgreSQL</productname> query optimizer performs a <firstterm>near-exhaustive search</firstterm> over the space of alternative strategies. This algorithm, first introduced in IBM's System R database, produces a near-optimal join order, but can take an enormous amount of time and memory space when the number of joins in the query grows large. This makes the ordinary <productname>PostgreSQL</productname> query optimizer inappropriate for queries that join a large number of tables.
ru: Традиционный оптимизатор запросов <productname>PostgreSQL</productname> выполняет <firstterm>почти исчерпывающий поиск</firstterm> во всём множестве возможных стратегий. Этот алгоритм, появившийся в СУБД IBM System R, находит порядок соединений, близкий к оптимальному, но может требовать огромного количества времени и памяти, когда число соединений оказывается большим. В результате обычный оптимизатор <productname>PostgreSQL</productname> оказывается неподходящим для запросов, в которых соединяется большое количество таблиц.

source: The Institute of Automatic Control at the University of Mining and Technology, in Freiberg, Germany, encountered some problems when it wanted to use <productname>PostgreSQL</productname> as the backend for a decision support knowledge based system for the maintenance of an electrical power grid. The DBMS needed to handle large join queries for the inference machine of the knowledge based system. The number of joins in these queries made using the normal query optimizer infeasible.
ru: Институт автоматического управления в Техническом университете Фрайбергская горная академия, Германия, столкнулся с этими проблемами, разрабатывая систему принятия решений на основе базы знаний для обслуживания электростанций, в которой в качестве СУБД планировалось применять <productname>PostgreSQL</productname>. Для машины, делающей выводы на основе базы знаний, СУБД должна была выполнять запросы с таким количеством соединений, что использование обычного оптимизатора запросов оказалось неприемлемым.

source: In the following we describe the implementation of a <firstterm>genetic algorithm</firstterm> to solve the join ordering problem in a manner that is efficient for queries involving large numbers of joins.
ru: Далее мы опишем реализацию <firstterm>генетического алгоритма</firstterm>, который решает проблему выбора порядка соединений эффективным способом для запросов с большим числом соединений.

source: Genetic Algorithms
ru: Генетические алгоритмы

source: The genetic algorithm (<acronym>GA</acronym>) is a heuristic optimization method which operates through randomized search. The set of possible solutions for the optimization problem is considered as a <firstterm>population</firstterm> of <firstterm>individuals</firstterm>. The degree of adaptation of an individual to its environment is specified by its <firstterm>fitness</firstterm>.
ru: Генетический алгоритм (<acronym>ГА</acronym>) реализует метод эвристической оптимизации, построенный на случайном поиске. В данном контексте множество возможных решений проблемы оптимизации называется <firstterm>популяцией</firstterm> <firstterm>особей</firstterm>. Степень адаптации особи к среде определяет функция <firstterm>приспособленности</firstterm>.

source: The coordinates of an individual in the search space are represented by <firstterm>chromosomes</firstterm>, in essence a set of character strings. A <firstterm>gene</firstterm> is a subsection of a chromosome which encodes the value of a single parameter being optimized. Typical encodings for a gene could be <firstterm>binary</firstterm> or <firstterm>integer</firstterm>.
ru: Координаты особи в пространстве поиска представляются <firstterm>хромосомами</firstterm>, которые по сути являются символьными строками. Фрагмент хромосомы, кодирующий значение одного оптимизируемого параметра, называется <firstterm>геном</firstterm>. Обычно ген кодируется в виде <firstterm>двоичного</firstterm> или <firstterm>целочисленного</firstterm> значения.

source: Through simulation of the evolutionary operations <firstterm>recombination</firstterm>, <firstterm>mutation</firstterm>, and <firstterm>selection</firstterm> new generations of search points are found that show a higher average fitness than their ancestors.
ru: В результате симуляции эволюционных операций (<firstterm>скрещивания</firstterm>, <firstterm>мутации</firstterm> и <firstterm>селекции</firstterm>) данный алгоритм формирует новые поколения особей, у которых приспособленность в среднем будет выше, чем у их предшественников.

source: According to the <systemitem class="resource">comp.ai.genetic</systemitem> <acronym>FAQ</acronym> it cannot be stressed too strongly that a <acronym>GA</acronym> is not a pure random search for a solution to a problem. A <acronym>GA</acronym> uses stochastic processes, but the result is distinctly non-random (better than random).
ru: Как сказано в ответах на вопросы в группе <systemitem class="resource">comp.ai.genetic</systemitem>, нельзя не отметить, что <acronym>ГА</acronym> реализует не чисто случайный поиск решения проблемы. В <acronym>ГА</acronym> происходят вероятностные процессы, но результат явно оказывается не случайным (лучше случайного).

source: Structured Diagram of a Genetic Algorithm
ru: Диаграмма структуры генетического алгоритма

source: generation of ancestors at a time t
ru: поколение предков на момент t

source: generation of descendants at a time t
ru: поколение потомков на момент t

source: +=========================================+ |&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; Algorithm GA &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;| +=========================================+ | INITIALIZE t := 0 | +=========================================+ | INITIALIZE P(t) | +=========================================+ | evaluate FITNESS of P(t) | +=========================================+ | while not STOPPING CRITERION do | | +-------------------------------------+ | | P'(t) := RECOMBINATION{P(t)} | | +-------------------------------------+ | | P''(t) := MUTATION{P'(t)} | | +-------------------------------------+ | | P(t+1) := SELECTION{P''(t) + P(t)} | | +-------------------------------------+ | | evaluate FITNESS of P''(t) | | +-------------------------------------+ | | t := t + 1 | +===+=====================================+
ru: +=========================================+ |&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt;&gt; Алгоритм ГА &lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;&lt;| +=========================================+ | ИНИЦИАЛИЗАЦИЯ t := 0 | +=========================================+ | ИНИЦИАЛИЗАЦИЯ P(t) | +=========================================+ | вычислить ПРИСПОСОБЛЕННОСТЬ P(t) | +=========================================+ | пока не выполняется УСЛОВИЕ ОСТАНОВКИ | | +-------------------------------------+ | | P'(t) := СКРЕЩИВАНИЕ{P(t)} | | +-------------------------------------+ | | P''(t) := МУТАЦИЯ{P'(t)} | | +-------------------------------------+ | | P(t+1) := СЕЛЕКЦИЯ{P''(t) + P(t)} | | +-------------------------------------+ | | вычислить ПРИСПОСОБЛЕННОСТЬ P''(t) | | +-------------------------------------+ | | t := t + 1 | +===+=====================================+

source: Genetic Query Optimization (<acronym>GEQO</acronym>) in PostgreSQL
ru: Генетическая оптимизация запросов (<acronym>GEQO</acronym>) в PostgreSQL

source: The <acronym>GEQO</acronym> module approaches the query optimization problem as though it were the well-known traveling salesman problem (<acronym>TSP</acronym>). Possible query plans are encoded as integer strings. Each string represents the join order from one relation of the query to the next. For example, the join tree <literallayout class="monospaced"> /\ /\ 2 /\ 3 4 1 </literallayout> is encoded by the integer string '4-1-3-2', which means, first join relation '4' and '1', then '3', and then '2', where 1, 2, 3, 4 are relation IDs within the <productname>PostgreSQL</productname> optimizer.
ru: Модуль <acronym>GEQO</acronym> (Genetic Query Optimization, Генетическая оптимизация запросов) подходит к проблеме оптимизации запроса как к хорошо известной задаче коммивояжёра (<acronym>TSP</acronym>, Traveling Salesman Problem). Возможные планы запроса кодируются числами в строковом виде. Каждая строка представляет порядок соединения одного отношения из запроса со следующим. Например, дерево соединения <literallayout class="monospaced"> /\ /\ 2 /\ 3 4 1 </literallayout> кодируется строкой целых чисел '4-1-3-2', которая означает: сначала соединить отношения '4' и '1', потом добавить '3', а затем '2', где 1, 2, 3, 4 — идентификаторы отношений внутри оптимизатора <productname>PostgreSQL</productname>.

source: Usage of a <firstterm>steady state</firstterm> <acronym>GA</acronym> (replacement of the least fit individuals in a population, not whole-generational replacement) allows fast convergence towards improved query plans. This is essential for query handling with reasonable time;
ru: Использование ГА с <firstterm>зафиксированным состоянием</firstterm> (когда заменяются наименее приспособленные особи популяции, а не всё поколение) способствует быстрой сходимости к улучшенным планам запроса. Это важно для обработки запроса за приемлемое время;

source: Usage of <firstterm>edge recombination crossover</firstterm> which is especially suited to keep edge losses low for the solution of the <acronym>TSP</acronym> by means of a <acronym>GA</acronym>;
ru: Использование <firstterm>скрещивания с обменом рёбер</firstterm>, которое очень удачно минимизирует число потерянных рёбер при решении задачи коммивояжёра с применением <acronym>ГА</acronym>;

source: Mutation as genetic operator is deprecated so that no repair mechanisms are needed to generate legal <acronym>TSP</acronym> tours.
ru: Мутация как генетический оператор считается устаревшей, так что для получения допустимых путей <acronym>TSP</acronym> не требуются механизмы исправления.

source: Specific characteristics of the <acronym>GEQO</acronym> implementation in <productname>PostgreSQL</productname> are: <placeholder-1/>
ru: Реализация <acronym>GEQO</acronym> в <productname>PostgreSQL</productname> имеет следующие особые характеристики: <placeholder-1/>

source: Parts of the <acronym>GEQO</acronym> module are adapted from D. Whitley's Genitor algorithm.
ru: Части модуля <acronym>GEQO</acronym> взяты из алгоритма Genitor, разработанного Д. Уитли.

source: The <acronym>GEQO</acronym> module allows the <productname>PostgreSQL</productname> query optimizer to support large join queries effectively through non-exhaustive search.
ru: В результате, модуль <acronym>GEQO</acronym> позволяет оптимизатору запросов <productname>PostgreSQL</productname> эффективно выполнять запросы со множеством соединений, обходясь без полного перебора вариантов.

source: Generating Possible Plans with <acronym>GEQO</acronym>
ru: Построение возможных планов с <acronym>GEQO</acronym>

source: The <acronym>GEQO</acronym> planning process uses the standard planner code to generate plans for scans of individual relations. Then join plans are developed using the genetic approach. As shown above, each candidate join plan is represented by a sequence in which to join the base relations. In the initial stage, the <acronym>GEQO</acronym> code simply generates some possible join sequences at random. For each join sequence considered, the standard planner code is invoked to estimate the cost of performing the query using that join sequence. (For each step of the join sequence, all three possible join strategies are considered; and all the initially-determined relation scan plans are available. The estimated cost is the cheapest of these possibilities.) Join sequences with lower estimated cost are considered <quote>more fit</quote> than those with higher cost. The genetic algorithm discards the least fit candidates. Then new candidates are generated by combining genes of more-fit candidates &mdash; that is, by using randomly-chosen portions of known low-cost join sequences to create new sequences for consideration. This process is repeated until a preset number of join sequences have been considered; then the best one found at any time during the search is used to generate the finished plan.
ru: В процедуре планирования в <acronym>GEQO</acronym> используется код стандартного планировщика, который строит планы сканирования отдельных отношений. Затем вырабатываются планы соединений с применением генетического подхода. Как было сказано выше, каждый план соединения представляется последовательностью чисел, определяющей порядок соединений базовых отношений. На начальной стадии код <acronym>GEQO</acronym> просто случайным образом генерирует несколько возможных последовательностей. Затем для каждой рассматриваемой последовательности вызывается функция стандартного планировщика, оценивающая стоимость запроса в случае выбора этого порядка соединений. (Для каждого шага последовательности рассматриваются все три возможные стратегии соединения и все изначально выбранные планы сканирования отношений. Результирующей оценкой стоимости будет минимальная из всех возможных.) Последовательности соединений с наименьшей оценкой стоимости считаются <quote>более приспособленными</quote>, чем последовательности с большей оценкой. Проанализировав возможные последовательности, генетический алгоритм отбрасывает наименее приспособленные из них. Затем генерируются новые кандидаты путём объединения генов более приспособленных последовательностей &mdash; для этого выбираются случайные фрагменты известных последовательностей с низкой стоимостью, из которых складываются новые последовательности для рассмотрения. Этот процесс повторяется, пока не будет рассмотрено некоторое предопределённое количество последовательностей соединений; после этого для построения окончательного плана выбирается лучшая последовательность, найденная за всё время поиска.

source: This process is inherently nondeterministic, because of the randomized choices made during both the initial population selection and subsequent <quote>mutation</quote> of the best candidates. To avoid surprising changes of the selected plan, each run of the GEQO algorithm restarts its random number generator with the current <xref linkend="guc-geqo-seed"/> parameter setting. As long as <varname>geqo_seed</varname> and the other GEQO parameters are kept fixed, the same plan will be generated for a given query (and other planner inputs such as statistics). To experiment with different search paths, try changing <varname>geqo_seed</varname>.
ru: Этот процесс по природе своей недетерминирован, вследствие случайного выбора при формировании начальной популяции и последующей <quote>мутации</quote> лучших кандидатов. Но во избежание неожиданных изменений выбранного плана, на каждом проходе алгоритм GEQO перезапускает свой генератор случайных чисел с текущим значением параметра <xref linkend="guc-geqo-seed"/>. Поэтому пока значение <varname>geqo_seed</varname> и другие параметры GEQO остаются неизменными, для определённого запроса (и других входных данных планировщика, в частности, статистики) будет строиться один и тот же план. Если вы хотите поэкспериментировать с разными путями соединений, попробуйте изменить <varname>geqo_seed</varname>.

source: Future Implementation Tasks for <productname>PostgreSQL</productname> <acronym>GEQO</acronym>
ru: Будущее развитие модуля <productname>PostgreSQL</productname> <acronym>GEQO</acronym>

source: Optimality of the query plan
ru: Оптимальность плана запроса

source: Computing time
ru: Время вычисления

source: Work is still needed to improve the genetic algorithm parameter settings. In file <filename>src/backend/optimizer/geqo/geqo_main.c</filename>, routines <function>gimme_pool_size</function> and <function>gimme_number_generations</function>, we have to find a compromise for the parameter settings to satisfy two competing demands: <placeholder-1/>
ru: Требуется провести дополнительную работу для выбора оптимальных параметров генетического алгоритма. В файле <filename>src/backend/optimizer/geqo/geqo_main.c</filename>, подпрограммах <function>gimme_pool_size</function> и <function>gimme_number_generations</function>, мы должны найти компромиссные значения параметров, удовлетворяющие двум несовместимым требованиям: <placeholder-1/>

source: In the current implementation, the fitness of each candidate join sequence is estimated by running the standard planner's join selection and cost estimation code from scratch. To the extent that different candidates use similar sub-sequences of joins, a great deal of work will be repeated. This could be made significantly faster by retaining cost estimates for sub-joins. The problem is to avoid expending unreasonable amounts of memory on retaining that state.
ru: В текущей реализации приспособленность каждой рассматриваемой последовательности соединений рассчитывается стандартным планировщиком, который каждый раз вычисляет избирательность соединения и стоимость заново. С учётом того, что различные кандидаты могут содержать общие подпоследовательности соединений, при этом будет повторяться большой объём работы. Таким образом, расчёт можно значительно ускорить, сохраняя оценки стоимости для внутренних соединений, но сложность состоит в том, чтобы уместить это состояние в разумные объёмы памяти.

source: At a more basic level, it is not clear that solving query optimization with a GA algorithm designed for TSP is appropriate. In the TSP case, the cost associated with any substring (partial tour) is independent of the rest of the tour, but this is certainly not true for query optimization. Thus it is questionable whether edge recombination crossover is the most effective mutation procedure.
ru: На более общем уровне не вполне понятно, насколько уместно для оптимизации запросов использовать ГА, предназначенный для решения задачи коммивояжёра. В этой задаче стоимость, связанная с любой подстрокой (частью тура) не зависит от остального маршрута, но это определённо не так для оптимизации запросов. Таким образом, возникает вопрос, насколько эффективно скрещивание путём обмена рёбрами.

source: Further Reading
ru: Дополнительные источники информации

source: <ulink url="http://www.aip.de/~ast/EvolCompFAQ/"> The Hitch-Hiker's Guide to Evolutionary Computation</ulink>, (FAQ for <ulink url="news://comp.ai.genetic"/>)
ru: <ulink url="http://www.aip.de/~ast/EvolCompFAQ/"> The Hitch-Hiker's Guide to Evolutionary Computation</ulink>, (Руководство для путешествующих автостопом по эволюционным вычислениям, Ответы на часто задаваемые вопросы в группе <ulink url="news://comp.ai.genetic"/>)

source: <ulink url="http://www.red3d.com/cwr/evolve.html"> Evolutionary Computation and its application to art and design</ulink>, by Craig Reynolds
ru: <ulink url="http://www.red3d.com/cwr/evolve.html">Evolutionary Computation and its application to art and design</ulink> (Эволюционные вычисления и их применение в искусстве и дизайне), Крейг Рейнольдс

source: The following resources contain additional information about genetic algorithms: <placeholder-1/>
ru: Дополнительную информацию о генетических алгоритмах можно получить в следующих источниках: <placeholder-1/>
