Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/information_schema.po
Languages: ru

source: Columns of system tables are not included. This should be fixed sometime.
ru: Столбцы системных таблиц в этом представлении не отображаются. Это может быть исправлено позже.

source: <literal>view_column_usage</literal> Columns
ru: Столбцы <literal>view_column_usage</literal>

source: Name of the database that contains the view (always the current database)
ru: Имя базы данных, содержащей представление (всегда текущая база)

source: Name of the schema that contains the view
ru: Имя схемы, содержащей представление

source: Name of the view
ru: Имя представления

source: Name of the database that contains the table that contains the column that is used by the view (always the current database)
ru: Имя базы данных, содержащей таблицу со столбцом, задействованным в представлении (всегда текущая база)

source: Name of the schema that contains the table that contains the column that is used by the view
ru: Имя схемы, содержащей таблицу со столбцом, задействованным в представлении

source: Name of the table that contains the column that is used by the view
ru: Имя таблицы со столбцом, задействованным в представлении

source: Name of the column that is used by the view
ru: Имя столбца, задействованного в представлении

source: The view <literal>view_routine_usage</literal> identifies all routines (functions and procedures) that are used in the query expression of a view (the <command>SELECT</command> statement that defines the view). A routine is only included if that routine is owned by a currently enabled role.
ru: Представление <literal>view_routine_usage</literal> описывает все подпрограммы (функции и процедуры), используемые в выражении запроса представления (операторе <command>SELECT</command>, определяющем представление). Подпрограмма выводится в этом списке, только если она принадлежит текущей активной роли.

source: <literal>view_routine_usage</literal> Columns
ru: Столбцы <literal>view_routine_usage</literal>

source: Name of the database containing the view (always the current database)
ru: Имя базы данных, содержащей представление (всегда текущая база)

source: Name of the schema containing the view
ru: Имя схемы, содержащей представление

source: The view <literal>view_table_usage</literal> identifies all tables that are used in the query expression of a view (the <command>SELECT</command> statement that defines the view). A table is only included if that table is owned by a currently enabled role.
ru: Представление <literal>view_table_usage</literal> описывает все таблицы, задействованные в выражении запроса представления (операторе <command>SELECT</command>, определяющем представление). Таблица выводится в этом списке, только если она принадлежит текущей активной роли.

source: System tables are not included. This should be fixed sometime.
ru: Системные таблицы в этом представлении не отображаются. Это может быть исправлено позже.

source: <literal>view_table_usage</literal> Columns
ru: Столбцы <literal>view_table_usage</literal>

source: Name of the database that contains the table that is used by the view (always the current database)
ru: Имя базы данных, содержащей таблицу, задействованную в представлении (всегда текущая база)

source: Name of the schema that contains the table that is used by the view
ru: Имя схемы, содержащей таблицу, задействованную в представлении

source: Name of the table that is used by the view
ru: Имя таблицы, задействованной в представлении

source: The view <literal>views</literal> contains all views defined in the current database. Only those views are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>views</literal> показывает все представления, определённые в текущей базе данных. В нём показываются только представления, к которым имеет доступ текущий пользователь (являясь владельцем или имея некоторые права).

source: <literal>views</literal> Columns
ru: Столбцы <literal>views</literal>

source: Query expression defining the view (null if the view is not owned by a currently enabled role)
ru: Выражение запроса, определяющее представление (NULL, если представление не принадлежит текущей активной роли)

source: <literal>YES</literal> if the view is updatable (allows <command>UPDATE</command> and <command>DELETE</command>), <literal>NO</literal> if not
ru: <literal>YES</literal>, если представление допускает изменение (команды <command>UPDATE</command> и <command>DELETE</command>), или <literal>NO</literal> в противном случае

source: <literal>YES</literal> if the view is insertable into (allows <command>INSERT</command>), <literal>NO</literal> if not
ru: <literal>YES</literal>, если представление допускает добавление данных (команду <command>INSERT</command>), или <literal>NO</literal> в противном случае

source: <literal>YES</literal> if the view has an <literal>INSTEAD OF</literal> <command>UPDATE</command> trigger defined on it, <literal>NO</literal> if not
ru: <literal>YES</literal>, если для представления определён триггер <literal>INSTEAD OF</literal> <command>UPDATE</command>, или <literal>NO</literal> в противном случае

source: <literal>YES</literal> if the view has an <literal>INSTEAD OF</literal> <command>DELETE</command> trigger defined on it, <literal>NO</literal> if not
ru: <literal>YES</literal>, если для представления определён триггер <literal>INSTEAD OF</literal> <command>DELETE</command>, или <literal>NO</literal> в противном случае

source: <literal>YES</literal> if the view has an <literal>INSTEAD OF</literal> <command>INSERT</command> trigger defined on it, <literal>NO</literal> if not
ru: <literal>YES</literal>, если для представления определён триггер <literal>INSTEAD OF</literal> <command>INSERT</command>, или <literal>NO</literal> в противном случае

source: The data type of the sequence. In <productname>PostgreSQL</productname>, this is currently always <literal>bigint</literal>.
ru: Тип данных последовательности. В <productname>PostgreSQL</productname> на данный момент это всегда <literal>bigint</literal>.
