Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/information_schema.po
Languages: ru

source: Name of the character set, currently implemented as showing the name of the database encoding
ru: Имя набора символов, в настоящее время в качестве этого имени показывается имя кодировки базы данных

source: Character repertoire, showing <literal>UCS</literal> if the encoding is <literal>UTF8</literal>, else just the encoding name
ru: Совокупность символов — <literal>UCS</literal> для кодировки <literal>UTF8</literal>, либо просто имя кодировки

source: Character encoding form, same as the database encoding
ru: Форма кодировки символов, то же, что и кодировка базы данных

source: Name of the database containing the default collation (always the current database, if any collation is identified)
ru: Имя базы данных, содержащей правило сортировки по умолчанию (всегда текущая база, если это правило установлено)

source: Name of the schema containing the default collation
ru: Имя схемы, содержащей правило сортировки по умолчанию

source: Name of the default collation. The default collation is identified as the collation that matches the <literal>COLLATE</literal> and <literal>CTYPE</literal> settings of the current database. If there is no such collation, then this column and the associated schema and catalog columns are null.
ru: Имя правила сортировки по умолчанию. Правилом сортировки по умолчанию считается правило, соответствующее параметрам <literal>COLLATE</literal> и <literal>CTYPE</literal> текущей базы данных. Если такого правила нет, данный столбец и связанные столбцы схемы и каталога содержат NULL.

source: The view <literal>check_constraint_routine_usage</literal> identifies routines (functions and procedures) that are used by a check constraint. Only those routines are shown that are owned by a currently enabled role.
ru: Представление <literal>check_constraint_routine_usage</literal> описывает подпрограммы (функции и процедуры), участвующие в проверках ограничений. В нём показываются только те подпрограммы, которые принадлежат текущей активной роли.

source: <literal>check_constraint_routine_usage</literal> Columns
ru: Столбцы <literal>check_constraint_routine_usage</literal>

source: Name of the database containing the constraint (always the current database)
ru: Имя базы данных, содержащей ограничение (всегда текущая база)

source: Name of the schema containing the constraint
ru: Имя схемы, содержащей ограничение

source: Name of the constraint
ru: Имя ограничения

source: Name of the database containing the function (always the current database)
ru: Имя базы данных, содержащей функцию (всегда текущая база)

source: Name of the schema containing the function
ru: Имя схемы, содержащей функцию

source: The <quote>specific name</quote> of the function. See <xref linkend="infoschema-routines"/> for more information.
ru: <quote>Однозначное имя</quote> функции. Подробнее оно описано в <xref remap="6" linkend="infoschema-routines"/>.

source: The view <literal>check_constraints</literal> contains all check constraints, either defined on a table or on a domain, that are owned by a currently enabled role. (The owner of the table or domain is the owner of the constraint.)
ru: Представление <literal>check_constraints</literal> показывает все ограничения-проверки, либо определённые для таблицы или домена, либо принадлежащие текущей активной роли. (Владелец таблицы или домена является владельцем ограничения.)

source: <literal>check_constraints</literal> Columns
ru: Столбцы <literal>check_constraints</literal>

source: The check expression of the check constraint
ru: Выражение проверки для ограничения

source: The view <literal>collations</literal> contains the collations available in the current database.
ru: Представление <literal>collations</literal> показывает правила сортировки, доступные в текущей базе данных.

source: <literal>collations</literal> Columns
ru: Столбцы <literal>collations</literal>

source: Name of the database containing the collation (always the current database)
ru: Имя базы данных, содержащей правило сортировки (всегда текущая база)

source: Name of the schema containing the collation
ru: Имя схемы, содержащей правило сортировки

source: Name of the default collation
ru: Имя правила сортировки

source: Always <literal>NO PAD</literal> (The alternative <literal>PAD SPACE</literal> is not supported by PostgreSQL.)
ru: Всегда <literal>NO PAD</literal> (Альтернативный вариант <literal>PAD SPACE</literal> в PostgreSQL не поддерживается.)

source: The view <literal>collation_character_set_applicability</literal> identifies which character set the available collations are applicable to. In PostgreSQL, there is only one character set per database (see explanation in <xref linkend="infoschema-character-sets"/>), so this view does not provide much useful information.
ru: Представление <literal>collation_character_set_applicability</literal> показывает, к каким наборам символов применимы доступные правила сортировки. В PostgreSQL в базе данных может быть только один набор символов (см. описание в <xref remap="6" linkend="infoschema-character-sets"/>), так что это представление даёт не так много полезной информации.

source: <literal>collation_character_set_applicability</literal> Columns
ru: Столбцы <literal>collation_character_set_applicability</literal>

source: Character sets are currently not implemented as schema objects, so this column is null
ru: Наборы символов в настоящее время не представлены в виде объектов схемы, так что этот столбец содержит NULL

source: Name of the character set
ru: Имя набора символов

source: The view <literal>column_domain_usage</literal> identifies all columns (of a table or a view) that make use of some domain defined in the current database and owned by a currently enabled role.
ru: Представление <literal>column_domain_usage</literal> описывает все столбцы (таблиц или представлений), которые используют какие-либо домены, определённые в базе данных и принадлежащие текущей активной роли.

source: <literal>column_domain_usage</literal> Columns
ru: Столбцы <literal>column_domain_usage</literal>

source: Name of the database containing the domain (always the current database)
ru: Имя базы данных, содержащей домен (всегда текущая база)

source: Name of the schema containing the domain
ru: Имя схемы, содержащей домен

source: Name of the domain
ru: Имя домена

source: Name of the database containing the table (always the current database)
ru: Имя базы данных, содержащей таблицу (всегда текущая база)

source: Name of the schema containing the table
ru: Имя схемы, содержащей таблицу

source: Name of the table
ru: Имя таблицы

source: Name of the column
ru: Имя столбца

source: The view <literal>column_options</literal> contains all the options defined for foreign table columns in the current database. Only those foreign table columns are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>column_options</literal> показывает все параметры, определённые для столбцов сторонней таблицы в текущей базе данных. В нём отражаются только те столбцы сторонних таблиц, к которым имеет доступ текущий пользователь (являясь их владельцем или имея некоторые права).

source: <literal>column_options</literal> Columns
ru: Столбцы <literal>column_options</literal>

source: Name of the database that contains the foreign table (always the current database)
ru: Имя базы данных, содержащей стороннюю таблицу (всегда текущая база)

source: Name of the schema that contains the foreign table
ru: Имя схемы, содержащей стороннюю таблицу

source: Name of the foreign table
ru: Имя сторонней таблицы

source: Name of an option
ru: Имя параметра

source: Value of the option
ru: Значение параметра

source: The view <literal>column_privileges</literal> identifies all privileges granted on columns to a currently enabled role or by a currently enabled role. There is one row for each combination of column, grantor, and grantee.
ru: Представление <literal>column_privileges</literal> описывает все права, назначенные текущей активной роли или текущей активной ролью для столбцов. Оно содержит отдельную строку для каждой комбинации столбца, праводателя и правообладателя.

source: If a privilege has been granted on an entire table, it will show up in this view as a grant for each column, but only for the privilege types where column granularity is possible: <literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>REFERENCES</literal>.
ru: Если право даётся для всей таблицы, оно будет показываться как право для каждого столбца, но только для типов прав, применимых к столбцам: <literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>REFERENCES</literal>.

source: <literal>column_privileges</literal> Columns
ru: Столбцы <literal>column_privileges</literal>

source: Name of the role that granted the privilege
ru: Имя роли, давшей право (праводатель)

source: Name of the role that the privilege was granted to
ru: Имя роли, которой было дано право (правообладатель)

source: Name of the database that contains the table that contains the column (always the current database)
ru: Имя базы данных, содержащей таблицу с этим столбцом (всегда текущая база)

source: Name of the schema that contains the table that contains the column
ru: Имя схемы, содержащей таблицу с этим столбцом

source: Name of the table that contains the column
ru: Имя таблицы с этим столбцом

source: Type of the privilege: <literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal>, or <literal>REFERENCES</literal>
ru: Тип права: <literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal> или <literal>REFERENCES</literal>

source: <literal>YES</literal> if the privilege is grantable, <literal>NO</literal> if not
ru: <literal>YES</literal>, если право может передаваться, или <literal>NO</literal> в противном случае

source: The view <literal>column_udt_usage</literal> identifies all columns that use data types owned by a currently enabled role. Note that in <productname>PostgreSQL</productname>, built-in data types behave like user-defined types, so they are included here as well. See also <xref linkend="infoschema-columns"/> for details.
ru: Представление <literal>column_udt_usage</literal> описывает все столбцы, которые используют типы данных, принадлежащие текущей активной роли. Заметьте, что в <productname>PostgreSQL</productname> встроенные типы данных не отличаются от определённых пользователем, так что в этом представлении выводятся и они. За подробностями обратитесь к <xref remap="3" linkend="infoschema-columns"/>.

source: <literal>column_udt_usage</literal> Columns
ru: Столбцы <literal>column_udt_usage</literal>

source: Name of the database that the column data type (the underlying type of the domain, if applicable) is defined in (always the current database)
ru: Имя базы данных, в которой определён тип (если применимо, нижележащий тип домена) столбца (всегда текущая база)

source: Name of the schema that the column data type (the underlying type of the domain, if applicable) is defined in
ru: Имя схемы, в которой определён тип (если применимо, нижележащий тип домена) столбца (всегда текущая база)

source: Name of the column data type (the underlying type of the domain, if applicable)
ru: Имя типа данных столбца (если применимо, нижележащий тип домена)

source: The view <literal>columns</literal> contains information about all table columns (or view columns) in the database. System columns (<literal>oid</literal>, etc.) are not included. Only those columns are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>columns</literal> содержит информацию обо всех столбцах таблиц (или столбцах представлений) в базе данных. Системные столбцы (<literal>oid</literal> и т. д.) в нём не отображаются. В нём показываются только те столбцы, к которым имеет доступ текущий пользователь (являясь владельцем или имея некоторые права).

source: <literal>columns</literal> Columns
ru: Столбцы <literal>columns</literal>

source: Ordinal position of the column within the table (count starts at 1)
ru: Порядковый номер столбца в таблице (нумерация начинается с 1)

source: Default expression of the column
ru: Выражение по умолчанию для столбца

source: <literal>YES</literal> if the column is possibly nullable, <literal>NO</literal> if it is known not nullable. A not-null constraint is one way a column can be known not nullable, but there can be others.
ru: <literal>YES</literal>, если столбец может содержать NULL, или <literal>NO</literal>, если он не принимает NULL. Не будет принимать NULL столбец с ограничением не-NULL, но возможны и другие варианты.

source: Data type of the column, if it is a built-in type, or <literal>ARRAY</literal> if it is some array (in that case, see the view <literal>element_types</literal>), else <literal>USER-DEFINED</literal> (in that case, the type is identified in <literal>udt_name</literal> and associated columns). If the column is based on a domain, this column refers to the type underlying the domain (and the domain is identified in <literal>domain_name</literal> and associated columns).
ru: Тип данных столбца, если это встроенный тип, либо <literal>ARRAY</literal>, если это массив (в этом случае обратитесь к представлению <literal>element_types</literal>), иначе — <literal>USER-DEFINED</literal> (в этом случае тип определяется в <literal>udt_name</literal> и связанных столбцах). Если столбец основан на домене, данный столбец показывает нижележащий тип домена (а сам домен показывается в <literal>domain_name</literal> и связанных столбцах).

source: If <literal>data_type</literal> identifies a numeric type, this column contains the (declared or implicit) precision of the type for this column. The precision indicates the number of significant digits. It can be expressed in decimal (base 10) or binary (base 2) terms, as specified in the column <literal>numeric_precision_radix</literal>. For all other data types, this column is null.
ru: Если в <literal>data_type</literal> указан числовой тип, этот столбец содержит точность (объявленную или неявную) типа для целевого столбца. Точность определяет число значащих цифр. Она может выражаться в десятичных (по основанию 10) или двоичных (по основанию 2) цифрах, согласно столбцу <literal>numeric_precision_radix</literal>. Для всех других типов данных этот столбец содержит NULL.

source: If <literal>data_type</literal> identifies an exact numeric type, this column contains the (declared or implicit) scale of the type for this column. The scale indicates the number of significant digits to the right of the decimal point. It can be expressed in decimal (base 10) or binary (base 2) terms, as specified in the column <literal>numeric_precision_radix</literal>. For all other data types, this column is null.
ru: Если в <literal>data_type</literal> указан точный числовой тип, этот столбец содержит масштаб (объявленный или неявный) типа для целевого столбца. Масштаб определяет число значащих цифр справа от десятичной точки. Он может выражаться в десятичных (по основанию 10) или двоичных (по основанию 2) цифрах, согласно столбцу <literal>numeric_precision_radix</literal>. Для всех других типов данных этот столбец содержит NULL.

source: If <literal>data_type</literal> identifies a date, time, timestamp, or interval type, this column contains the (declared or implicit) fractional seconds precision of the type for this column, that is, the number of decimal digits maintained following the decimal point in the seconds value. For all other data types, this column is null.
ru: Если в <literal>data_type</literal> указан тип даты, времени, отметки времени или интервала, этот столбец содержит точность (объявленную или неявную) в долях секунды типа для целевого столбца, то есть число десятичных цифр, сохраняемых после десятичной точки в значении секунд. Для всех других типов данных этот столбец содержит NULL.

source: If <literal>data_type</literal> identifies an interval type, this column contains the specification which fields the intervals include for this column, e.g., <literal>YEAR TO MONTH</literal>, <literal>DAY TO SECOND</literal>, etc. If no field restrictions were specified (that is, the interval accepts all fields), and for all other data types, this field is null.
ru: Если в <literal>data_type</literal> указан тип интервала, этот столбец определяет, какие поля принимает интервал в целевом столбце, например: <literal>YEAR TO MONTH</literal>, <literal>DAY TO SECOND</literal> и т. д. Если ограничения для полей не заданы (то есть, интервал принимает все поля), и для любых других типов данных это поле содержит NULL.

source: Applies to a feature not available in <productname>PostgreSQL</productname> (see <literal>datetime_precision</literal> for the fractional seconds precision of interval type columns)
ru: Относится к функциональности, отсутствующей в <productname>PostgreSQL</productname> (см. поле <literal>datetime_precision</literal>, определяющее точность в долях секунды для типов интервалов)

source: Name of the database containing the collation of the column (always the current database), null if default or the data type of the column is not collatable
ru: Имя базы данных, содержащей правило сортировки столбца (это всегда текущая база), либо NULL, если это правило по умолчанию или тип данных столбца несортируемый

source: Name of the schema containing the collation of the column, null if default or the data type of the column is not collatable
ru: Имя схемы, содержащей правило сортировки столбца, либо NULL, если это правило по умолчанию или тип данных столбца несортируемый

source: Name of the collation of the column, null if default or the data type of the column is not collatable
ru: Имя правила сортировки столбца, либо NULL, если это правило по умолчанию или тип данных столбца несортируемый

source: If the column has a domain type, the name of the database that the domain is defined in (always the current database), else null.
ru: Если целевой столбец имеет тип домена, этот столбец содержит имя базы данных, в которой определён домен (всегда текущая база), иначе NULL.

source: If the column has a domain type, the name of the schema that the domain is defined in, else null.
ru: Если целевой столбец имеет тип домена, этот столбец содержит имя схемы, в которой определён домен, иначе NULL.

source: If the column has a domain type, the name of the domain, else null.
ru: Если целевой столбец имеет тип домена, этот столбец содержит имя домена, иначе NULL.

source: If the column is an identity column, then <literal>YES</literal>, else <literal>NO</literal>.
ru: Если целевой столбец является столбцом идентификации, значение <literal>YES</literal>, иначе — <literal>NO</literal>.

source: If the column is an identity column, then <literal>ALWAYS</literal> or <literal>BY DEFAULT</literal>, reflecting the definition of the column.
ru: Если целевой столбец является столбцом идентификации, значение <literal>ALWAYS</literal> или <literal>BY DEFAULT</literal>, отражающее определение столбца.

source: If the column is an identity column, then the start value of the internal sequence, else null.
ru: Если целевой столбец является столбцом идентификации, начальное значение внутренней последовательности, иначе — NULL.

source: If the column is an identity column, then the increment of the internal sequence, else null.
ru: Если целевой столбец является столбцом идентификации, шаг внутренней последовательности, иначе — NULL.

source: If the column is an identity column, then the maximum value of the internal sequence, else null.
ru: Если целевой столбец является столбцом идентификации, максимальное значение внутренней последовательности, иначе — NULL.

source: If the column is an identity column, then the minimum value of the internal sequence, else null.
ru: Если целевой столбец является столбцом идентификации, минимальное значение внутренней последовательности, иначе — NULL.

source: If the column is an identity column, then <literal>YES</literal> if the internal sequence cycles or <literal>NO</literal> if it does not; otherwise null.
ru: Если целевой столбец является столбцом идентификации, <literal>YES</literal> показывает, что внутренняя последовательность зацикливается, <literal>NO</literal> — не зацикливается, иначе — NULL.

source: <literal>YES</literal> if the column is updatable, <literal>NO</literal> if not (Columns in base tables are always updatable, columns in views not necessarily)
ru: <literal>YES</literal>, если столбец допускает изменение, или <literal>NO</literal> в противном случае (столбцы в базовых таблицах всегда изменяемые, но в представлениях — не обязательно)
