Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/information_schema.po
Languages: ru

source: Value of the sizing item, or 0 if the size is unlimited or cannot be determined, or null if the features for which the sizing item is applicable are not supported
ru: Значение элемента размеров, или 0, если размер неограниченный или не может быть определён, либо NULL, если функциональность, к которой относится размер, не поддерживается

source: Possibly a comment pertaining to the sizing item
ru: Необязательный комментарий, относящийся к элементу размеров

source: The table <literal>sql_sizing_profiles</literal> contains information about the <literal>sql_sizing</literal> values that are required by various profiles of the SQL standard. <productname>PostgreSQL</productname> does not track any SQL profiles, so this table is empty.
ru: Таблица <literal>sql_sizing_profiles</literal> содержит информацию о значениях <literal>sql_sizing</literal>, которые требуются для различных профилей стандарта SQL. <productname>PostgreSQL</productname> не ориентируется на профили SQL, поэтому данная таблица пуста.

source: <literal>sql_sizing_profiles</literal> Columns
ru: Столбцы <literal>sql_sizing_profiles</literal>

source: Identifier string of a profile
ru: Строка идентификатора профиля

source: The value required by the SQL profile for the sizing item, or 0 if the profile places no limit on the sizing item, or null if the profile does not require any of the features for which the sizing item is applicable
ru: Значение, которое требует профиль SQL для этого элемента размеров, или 0, если профиль не ограничивает данный элемент, либо NULL, если профиль не требует наличия функциональности, для которой применим этот элемент

source: Possibly a comment pertaining to the sizing item within the profile
ru: Необязательный комментарий, относящийся к элементу размеров в профиле

source: The view <literal>table_constraints</literal> contains all constraints belonging to tables that the current user owns or has some privilege other than <literal>SELECT</literal> on.
ru: Представление <literal>table_constraints</literal> показывает все ограничения, принадлежащие таблицам, к которым имеет доступ текущий пользователь (являясь владельцем или имея некоторые права, кроме <literal>SELECT</literal>).

source: <literal>table_constraints</literal> Columns
ru: Столбцы <literal>table_constraints</literal>

source: Type of the constraint: <literal>CHECK</literal>, <literal>FOREIGN KEY</literal>, <literal>PRIMARY KEY</literal>, or <literal>UNIQUE</literal>
ru: Тип ограничения: <literal>CHECK</literal>, <literal>FOREIGN KEY</literal>, <literal>PRIMARY KEY</literal> или <literal>UNIQUE</literal>

source: The view <literal>table_privileges</literal> identifies all privileges granted on tables or views to a currently enabled role or by a currently enabled role. There is one row for each combination of table, grantor, and grantee.
ru: Представление <literal>table_privileges</literal> описывает все права, назначенные текущей активной роли или текущей активной ролью для таблиц и представлений. Оно содержит отдельную строку для каждой комбинации таблицы, праводателя и правообладателя.

source: <literal>table_privileges</literal> Columns
ru: Столбцы <literal>table_privileges</literal>

source: The view <literal>tables</literal> contains all tables and views defined in the current database. Only those tables and views are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>tables</literal> показывает все таблицы и представления, определённые в текущей базе данных. В нём показываются только те таблицы и представления, к которым имеет доступ текущий пользователь (являясь их владельцем или имея некоторые права).

source: <literal>tables</literal> Columns
ru: Столбцы <literal>tables</literal>

source: Type of the table: <literal>BASE TABLE</literal> for a persistent base table (the normal table type), <literal>VIEW</literal> for a view, <literal>FOREIGN TABLE</literal> for a foreign table, or <literal>LOCAL TEMPORARY</literal> for a temporary table
ru: Тип таблицы: <literal>BASE TABLE</literal> для постоянных базовых таблиц (таблиц обычного типа), <literal>VIEW</literal> для представлений, <literal>FOREIGN TABLE</literal> для сторонних таблиц, либо <literal>LOCAL TEMPORARY</literal> для временных таблиц

source: If the table is a typed table, the name of the database that contains the underlying data type (always the current database), else null.
ru: Если таблица является типизированной, это имя базы данных, содержащей нижележащий тип данных (всегда текущая база), иначе NULL.

source: If the table is a typed table, the name of the schema that contains the underlying data type, else null.
ru: Если таблица является типизированной, это имя схемы, содержащей нижележащий тип данных, иначе NULL.

source: If the table is a typed table, the name of the underlying data type, else null.
ru: Если таблица является типизированной, это имя типа данных, иначе NULL.

source: <literal>YES</literal> if the table is insertable into, <literal>NO</literal> if not (Base tables are always insertable into, views not necessarily.)
ru: <literal>YES</literal>, если в эту таблицу можно добавлять данные, или <literal>NO</literal> в противном случае (Базовые таблицы всегда допускают добавление данных, но представления — не обязательно.)

source: <literal>YES</literal> if the table is a typed table, <literal>NO</literal> if not
ru: <literal>YES</literal>, если эта таблица является типизированной, иначе <literal>NO</literal>

source: The view <literal>transforms</literal> contains information about the transforms defined in the current database. More precisely, it contains a row for each function contained in a transform (the <quote>from SQL</quote> or <quote>to SQL</quote> function).
ru: Представление <literal>transforms</literal> содержит информацию о трансформациях, определённых в текущей базе данных. Более точно, оно содержит строку для каждой функции, задействованной в трансформации (функцию <quote>из SQL</quote> или <quote>в SQL</quote>).

source: <literal>transforms</literal> Columns
ru: Столбцы <literal>transforms</literal>

source: Name of the database that contains the type the transform is for (always the current database)
ru: Имя базы данных, содержащей тип, для которого предназначена трансформация (всегда текущая база)

source: Name of the schema that contains the type the transform is for
ru: Имя схемы, содержащей тип, для которого предназначена трансформация

source: Name of the type the transform is for
ru: Имя типа, для которого предназначена трансформация

source: The SQL standard allows defining transforms in <quote>groups</quote>, and selecting a group at run time. PostgreSQL does not support this. Instead, transforms are specific to a language. As a compromise, this field contains the language the transform is for.
ru: Стандарт SQL позволяет определять <quote>группы</quote> трансформаций и выбирать группу во время выполнения. PostgreSQL это не поддерживает. Вместо этого трансформации привязываются к языкам. В качестве компромисса со стандартом, это поле содержит язык, для которого предназначена трансформация.

source: <literal>FROM SQL</literal> or <literal>TO SQL</literal>
ru: <literal>FROM SQL</literal> или <literal>TO SQL</literal>

source: For triggers in the current database that specify a column list (like <literal>UPDATE OF column1, column2</literal>), the view <literal>triggered_update_columns</literal> identifies these columns. Triggers that do not specify a column list are not included in this view. Only those columns are shown that the current user owns or has some privilege other than <literal>SELECT</literal> on.
ru: Для триггеров в текущей базе данных, установленных для списка столбцов (например, <literal>UPDATE OF column1, column2</literal>), представление <literal>triggered_update_columns</literal> показывает эти столбцы. Триггеры, для которых не задаётся список столбцов, в этом представлении не отражаются. В нём показываются только столбцы, доступные текущему пользователю (как владельцу или имеющему некоторые права, кроме <literal>SELECT</literal>).

source: <literal>triggered_update_columns</literal> Columns
ru: Столбцы <literal>triggered_update_columns</literal>

source: Name of the database that contains the trigger (always the current database)
ru: Имя базы данных, содержащей триггер (всегда текущая база)

source: Name of the schema that contains the trigger
ru: Имя схемы, содержащей триггер

source: Name of the trigger
ru: Имя триггера

source: Name of the database that contains the table that the trigger is defined on (always the current database)
ru: Имя базы данных, содержащей таблицу, для которой определён триггер (всегда текущая база)

source: Name of the schema that contains the table that the trigger is defined on
ru: Имя схемы, содержащей таблицу, для которой определён триггер

source: Name of the table that the trigger is defined on
ru: Имя таблицы, для которой определён триггер

source: Name of the column that the trigger is defined on
ru: Имя столбца, для которого определён триггер

source: The view <literal>triggers</literal> contains all triggers defined in the current database on tables and views that the current user owns or has some privilege other than <literal>SELECT</literal> on.
ru: Представление <literal>triggers</literal> показывает все триггеры, определённые в текущей базе данных для таблиц и представлений, к которым имеет доступ текущий пользователь (являясь владельцем или имея некоторые права, кроме <literal>SELECT</literal>).

source: <literal>triggers</literal> Columns
ru: Столбцы <literal>triggers</literal>

source: Event that fires the trigger (<literal>INSERT</literal>, <literal>UPDATE</literal>, or <literal>DELETE</literal>)
ru: Событие, вызывающие срабатывание триггера (<literal>INSERT</literal>, <literal>UPDATE</literal> или <literal>DELETE</literal>)

source: <literal>WHEN</literal> condition of the trigger, null if none (also null if the table is not owned by a currently enabled role)
ru: Условие <literal>WHEN</literal> триггера, либо NULL, если его нет (так же NULL, если таблица не принадлежит текущей активной роли)

source: Statement that is executed by the trigger (currently always <literal>EXECUTE PROCEDURE <replaceable>function</replaceable>(...)</literal>)
ru: Оператор, выполняемый триггером (в настоящее время всегда <literal>EXECUTE PROCEDURE <replaceable>функция</replaceable>(...)</literal>)

source: Identifies whether the trigger fires once for each processed row or once for each statement (<literal>ROW</literal> or <literal>STATEMENT</literal>)
ru: Определяет, срабатывает ли триггер для каждой обрабатываемой строки или только для каждого оператора (<literal>ROW</literal> или <literal>STATEMENT</literal>)

source: Time at which the trigger fires (<literal>BEFORE</literal>, <literal>AFTER</literal>, or <literal>INSTEAD OF</literal>)
ru: Момент срабатывания триггера (<literal>BEFORE</literal> (до), <literal>AFTER</literal> (после) или <literal>INSTEAD OF</literal> (вместо))

source: Triggers in <productname>PostgreSQL</productname> have two incompatibilities with the SQL standard that affect the representation in the information schema. First, trigger names are local to each table in <productname>PostgreSQL</productname>, rather than being independent schema objects. Therefore there can be duplicate trigger names defined in one schema, so long as they belong to different tables. (<literal>trigger_catalog</literal> and <literal>trigger_schema</literal> are really the values pertaining to the table that the trigger is defined on.) Second, triggers can be defined to fire on multiple events in <productname>PostgreSQL</productname> (e.g., <literal>ON INSERT OR UPDATE</literal>), whereas the SQL standard only allows one. If a trigger is defined to fire on multiple events, it is represented as multiple rows in the information schema, one for each type of event. As a consequence of these two issues, the primary key of the view <literal>triggers</literal> is really <literal>(trigger_catalog, trigger_schema, event_object_table, trigger_name, event_manipulation)</literal> instead of <literal>(trigger_catalog, trigger_schema, trigger_name)</literal>, which is what the SQL standard specifies. Nonetheless, if you define your triggers in a manner that conforms with the SQL standard (trigger names unique in the schema and only one event type per trigger), this will not affect you.
ru: Триггеры в <productname>PostgreSQL</productname> несовместимы со стандартом в двух аспектах, которые влияют на их представление в информационной схеме. Во-первых, имена триггеров являются локальными для каждой таблицы в <productname>PostgreSQL</productname>, а не независимыми объектами схемы. Таким образом, в одной схеме могут быть дублирующиеся имена триггеров, если они принадлежат разным таблицам. (Значения <literal>trigger_catalog</literal> и <literal>trigger_schema</literal> на самом деле относятся к таблице, для которой определён триггер.) Во-вторых, триггеры в <productname>PostgreSQL</productname> могут срабатывать при нескольких событиях (например, <literal>ON INSERT OR UPDATE</literal>), тогда как стандарт SQL допускает только одно событие. Если триггер настроен на несколько событий, он представляется в информационной схеме в виде нескольких строк, по одной для каждого типа события. Вследствие этих двух особенностей, первичный ключ в представлении <literal>triggers</literal> на самом деле <literal>(trigger_catalog, trigger_schema, event_object_table, trigger_name, event_manipulation)</literal>, а не <literal>(trigger_catalog, trigger_schema, trigger_name)</literal>, как должно быть согласно стандарту SQL. Однако, если определять триггеры в строгом соответствии со стандартом SQL (чтобы имена триггеров были уникальны в схеме и каждый триггер связывался только с одним событием), это расхождение никак не проявится.

source: Prior to <productname>PostgreSQL</productname> 9.1, this view's columns <structfield>action_timing</structfield>, <structfield>action_reference_old_table</structfield>, <structfield>action_reference_new_table</structfield>, <structfield>action_reference_old_row</structfield>, and <structfield>action_reference_new_row</structfield> were named <structfield>condition_timing</structfield>, <structfield>condition_reference_old_table</structfield>, <structfield>condition_reference_new_table</structfield>, <structfield>condition_reference_old_row</structfield>, and <structfield>condition_reference_new_row</structfield> respectively. That was how they were named in the SQL:1999 standard. The new naming conforms to SQL:2003 and later.
ru: До <productname>PostgreSQL</productname> 9.1 в этом представлении столбцы <structfield>action_timing</structfield>, <structfield>action_reference_old_table</structfield>, <structfield>action_reference_new_table</structfield>, <structfield>action_reference_old_row</structfield> и <structfield>action_reference_new_row</structfield> назывались <structfield>condition_timing</structfield>, <structfield>condition_reference_old_table</structfield>, <structfield>condition_reference_new_table</structfield>, <structfield>condition_reference_old_row</structfield> и <structfield>condition_reference_new_row</structfield>, соответственно. Старые имена были продиктованы стандартом SQL:1999. Новые имена соответствуют стандарту SQL:2003 и более поздним.

source: The view <literal>udt_privileges</literal> identifies <literal>USAGE</literal> privileges granted on user-defined types to a currently enabled role or by a currently enabled role. There is one row for each combination of type, grantor, and grantee. This view shows only composite types (see under <xref linkend="infoschema-user-defined-types"/> for why); see <xref linkend="infoschema-usage-privileges"/> for domain privileges.
ru: Представление <literal>udt_privileges</literal> описывает права <literal>USAGE</literal>, назначенные текущей активной роли или текущей активной ролью для пользовательских типов. Оно содержит отдельную строку для каждой комбинации типа, праводателя и правообладателя. Это представление показывает только составные типы (почему, говорится в <xref remap="6" linkend="infoschema-user-defined-types"/>); права, затрагивающие домены, описаны в <xref remap="6" linkend="infoschema-usage-privileges"/>.

source: <literal>udt_privileges</literal> Columns
ru: Столбцы <literal>udt_privileges</literal>

source: The view <literal>usage_privileges</literal> identifies <literal>USAGE</literal> privileges granted on various kinds of objects to a currently enabled role or by a currently enabled role. In <productname>PostgreSQL</productname>, this currently applies to collations, domains, foreign-data wrappers, foreign servers, and sequences. There is one row for each combination of object, grantor, and grantee.
ru: Представление <literal>usage_privileges</literal> описывает права <literal>USAGE</literal>, назначенные текущей активной роли или текущей активной ролью для различных типов объектов. В <productname>PostgreSQL</productname> на данный момент это правила сортировки, домены, обёртки сторонних данных, сторонние серверы и последовательности. Оно содержит отдельную строку для каждой комбинации объекта, праводателя и правообладателя.

source: Since collations do not have real privileges in <productname>PostgreSQL</productname>, this view shows implicit non-grantable <literal>USAGE</literal> privileges granted by the owner to <literal>PUBLIC</literal> for all collations. The other object types, however, show real privileges.
ru: Так как с правилами сортировки в <productname>PostgreSQL</productname> не связаны никакие действующие права, в этом представлении показываются фиктивные права <literal>USAGE</literal>, якобы назначенные владельцем базы роли <literal>PUBLIC</literal> для всех правил сортировки. Для других типов объектов, однако, в нём показываются фактические права.

source: In PostgreSQL, sequences also support <literal>SELECT</literal> and <literal>UPDATE</literal> privileges in addition to the <literal>USAGE</literal> privilege. These are nonstandard and therefore not visible in the information schema.
ru: В PostgreSQL для последовательностей могут назначаться права <literal>SELECT</literal> и <literal>UPDATE</literal>, в дополнение к <literal>USAGE</literal>. Но это нестандартные права и поэтому в информационной схеме они не видны.

source: <literal>usage_privileges</literal> Columns
ru: Столбцы <literal>usage_privileges</literal>

source: The view <literal>user_defined_types</literal> currently contains all composite types defined in the current database. Only those types are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>user_defined_types</literal> в данное время показывает все составные типы, определённые в текущей базе данных. В нём показываются только те типы, к которым имеет доступ текущий пользователь (являясь владельцем или имея некоторые права).

source: SQL knows about two kinds of user-defined types: structured types (also known as composite types in <productname>PostgreSQL</productname>) and distinct types (not implemented in <productname>PostgreSQL</productname>). To be future-proof, use the column <literal>user_defined_type_category</literal> to differentiate between these. Other user-defined types such as base types and enums, which are <productname>PostgreSQL</productname> extensions, are not shown here. For domains, see <xref linkend="infoschema-domains"/> instead.
ru: SQL знает два вида пользовательских типов: структурные типы (также называются составными типами в <productname>PostgreSQL</productname>) и отдельные типы (не реализованы в <productname>PostgreSQL</productname>). Для уверенности в будущем, нужно обратиться к столбцу <literal>user_defined_type_category</literal>, чтобы различить их. Другие пользовательские типы, как например, базовые типы и перечисления, относящиеся к расширениям <productname>PostgreSQL</productname>, в этом представлении не показываются. О доменах можно узнать в <xref remap="6" linkend="infoschema-domains"/>.

source: <literal>user_defined_types</literal> Columns
ru: Столбцы <literal>user_defined_types</literal>

source: Name of the database that contains the type (always the current database)
ru: Имя базы данных, содержащей тип (всегда текущая база)

source: Name of the schema that contains the type
ru: Имя схемы, содержащей тип

source: Currently always <literal>STRUCTURED</literal>
ru: На данный момент всегда <literal>STRUCTURED</literal>

source: The view <literal>user_mapping_options</literal> contains all the options defined for user mappings in the current database. Only those user mappings are shown where the current user has access to the corresponding foreign server (by way of being the owner or having some privilege).
ru: Представление <literal>user_mapping_options</literal> показывает все параметры, заданные для сопоставлений пользователей в текущей базе данных. В нём отражаются только сопоставления пользователей, установленные для сторонних серверов, к которым имеет доступ текущий пользователь (являясь владельцем или имея некоторые права).

source: <literal>user_mapping_options</literal> Columns
ru: Столбцы <literal>user_mapping_options</literal>

source: Name of the user being mapped, or <literal>PUBLIC</literal> if the mapping is public
ru: Имя сопоставляемого пользователя, либо <literal>PUBLIC</literal>, если это сопоставление для всех

source: Name of the database that the foreign server used by this mapping is defined in (always the current database)
ru: Имя базы данных, в которой определён сторонний сервер, задействованный в сопоставлении (всегда текущая база)

source: Name of the foreign server used by this mapping
ru: Имя стороннего сервера, задействованного в сопоставлении

source: Value of the option. This column will show as null unless the current user is the user being mapped, or the mapping is for <literal>PUBLIC</literal> and the current user is the server owner, or the current user is a superuser. The intent is to protect password information stored as user mapping option.
ru: Значение параметра. Этот столбец будет содержать не NULL, только если описывается сопоставление текущего пользователя, либо это сопоставление для <literal>PUBLIC</literal>, а текущий пользователь — владелец стороннего сервера или суперпользователь. Данное ограничение введено для защиты информации о пароле, сохранённой в параметрах сопоставления.

source: The view <literal>user_mappings</literal> contains all user mappings defined in the current database. Only those user mappings are shown where the current user has access to the corresponding foreign server (by way of being the owner or having some privilege).
ru: Представление <literal>user_mappings</literal> показывает все сопоставления пользователей, определённые в текущей базе данных. В нём показываются только сопоставления, установленные для сторонних серверов, к которым имеет доступ текущий пользователь (являясь владельцем или имея некоторые права).

source: <literal>user_mappings</literal> Columns
ru: Столбцы <literal>user_mappings</literal>

source: The view <literal>view_column_usage</literal> identifies all columns that are used in the query expression of a view (the <command>SELECT</command> statement that defines the view). A column is only included if the table that contains the column is owned by a currently enabled role.
ru: Представление <literal>view_column_usage</literal> описывает все столбцы, задействованные в выражении запроса представления (операторе <command>SELECT</command>, определяющем представление). Столбец выводится в этом списке, только если содержащая его таблица принадлежит текущей активной роли.
