Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/information_schema.po
Languages: ru

source: Since data types can be defined in a variety of ways in SQL, and <productname>PostgreSQL</productname> contains additional ways to define data types, their representation in the information schema can be somewhat difficult. The column <literal>data_type</literal> is supposed to identify the underlying built-in type of the column. In <productname>PostgreSQL</productname>, this means that the type is defined in the system catalog schema <literal>pg_catalog</literal>. This column might be useful if the application can handle the well-known built-in types specially (for example, format the numeric types differently or use the data in the precision columns). The columns <literal>udt_name</literal>, <literal>udt_schema</literal>, and <literal>udt_catalog</literal> always identify the underlying data type of the column, even if the column is based on a domain. (Since <productname>PostgreSQL</productname> treats built-in types like user-defined types, built-in types appear here as well. This is an extension of the SQL standard.) These columns should be used if an application wants to process data differently according to the type, because in that case it wouldn't matter if the column is really based on a domain. If the column is based on a domain, the identity of the domain is stored in the columns <literal>domain_name</literal>, <literal>domain_schema</literal>, and <literal>domain_catalog</literal>. If you want to pair up columns with their associated data types and treat domains as separate types, you could write <literal>coalesce(domain_name, udt_name)</literal>, etc.
ru: Так как типы данных могут определяться в SQL множеством способов и <productname>PostgreSQL</productname> добавляет дополнительные варианты, представление типов в информационной схеме может быть довольно сложным. Столбец <literal>data_type</literal> предназначен для идентификации нижележащего встроенного типа столбца. В <productname>PostgreSQL</productname> это означает, что данный тип определён в схеме системного каталога <literal>pg_catalog</literal>. Этот столбец может быть полезным, если приложение способно особым образом воспринимать встроенные типы (например, форматировать числовые типы по-другому или задействовать данные в столбцах точности). Столбцы <literal>udt_name</literal>, <literal>udt_schema</literal> и <literal>udt_catalog</literal> всегда указывают на нижележащий тип данных столбца, даже если столбец основан на домене. (Так как в <productname>PostgreSQL</productname> встроенные типы не отличаются от определённых пользователем, в этом представлении выводятся и они. Это расширение стандарта SQL.) Эти столбцы должны учитываться, когда приложению нужно обрабатывать данные в зависимости от типа, так как в этом случае не важно, основан ли столбец на домене. Если столбец основан на домене, на него указывают столбцы <literal>domain_name</literal>, <literal>domain_schema</literal> и <literal>domain_catalog</literal>. Если вы хотите связать столбцы с их типами данных и обработать домены как отдельные типы, вы можете записать <literal>coalesce(domain_name, udt_name)</literal> и т. п.

source: The view <literal>constraint_column_usage</literal> identifies all columns in the current database that are used by some constraint. Only those columns are shown that are contained in a table owned by a currently enabled role. For a check constraint, this view identifies the columns that are used in the check expression. For a foreign key constraint, this view identifies the columns that the foreign key references. For a unique or primary key constraint, this view identifies the constrained columns.
ru: Представление <literal>constraint_column_usage</literal> описывает все столбцы в текущей базе данных, связанные с некоторым ограничением. В нём показываются только столбцы таблиц, принадлежащих текущей активной роли. Для ограничений-проверок это представление содержит столбцы, задействованные в выражении проверки. Для ограничений внешнего ключа оно содержит столбцы, на которые ссылается внешний ключ, а для ограничений уникальности или первичного ключа — ограничиваемые столбцы.

source: <literal>constraint_column_usage</literal> Columns
ru: Столбцы <literal>constraint_column_usage</literal>

source: Name of the database that contains the table that contains the column that is used by some constraint (always the current database)
ru: Имя базы данных, содержащей таблицу со столбцом, задействованным в некотором ограничении (всегда текущая база)

source: Name of the schema that contains the table that contains the column that is used by some constraint
ru: Имя схемы, содержащей таблицу со столбцом, задействованным в некотором ограничении

source: Name of the table that contains the column that is used by some constraint
ru: Имя таблицы со столбцом, задействованным в некотором ограничении

source: Name of the column that is used by some constraint
ru: Имя столбца, задействованного в некотором ограничении

source: Name of the database that contains the constraint (always the current database)
ru: Имя базы данных, содержащей ограничение (всегда текущая база)

source: Name of the schema that contains the constraint
ru: Имя схемы, содержащей ограничение

source: The view <literal>constraint_table_usage</literal> identifies all tables in the current database that are used by some constraint and are owned by a currently enabled role. (This is different from the view <literal>table_constraints</literal>, which identifies all table constraints along with the table they are defined on.) For a foreign key constraint, this view identifies the table that the foreign key references. For a unique or primary key constraint, this view simply identifies the table the constraint belongs to. Check constraints and not-null constraints are not included in this view.
ru: Представление <literal>constraint_table_usage</literal> описывает все таблицы в текущей базе данных, связанные с некоторым ограничением и принадлежащие текущей активной роли. (Это отличается от представления <literal>table_constraints</literal>, в котором показываются все ограничения таблиц с таблицами, для которых они определены.) Для ограничений внешнего ключа это представление показывает таблицу, на которую ссылается ограничение. Для ограничений уникальности или первичного ключа в этом представлении показывается таблица, которой принадлежит ограничение. Ограничения-проверки и ограничения не-NULL в нём не отражаются.

source: <literal>constraint_table_usage</literal> Columns
ru: Столбцы <literal>constraint_table_usage</literal>

source: Name of the database that contains the table that is used by some constraint (always the current database)
ru: Имя базы данных, которая содержит таблицу, задействованную некоторым ограничением (всегда текущая база)

source: Name of the schema that contains the table that is used by some constraint
ru: Имя схемы, которая содержит таблицу, задействованную некоторым ограничением

source: Name of the table that is used by some constraint
ru: Имя таблицы, задействованной некоторым ограничением

source: The view <literal>data_type_privileges</literal> identifies all data type descriptors that the current user has access to, by way of being the owner of the described object or having some privilege for it. A data type descriptor is generated whenever a data type is used in the definition of a table column, a domain, or a function (as parameter or return type) and stores some information about how the data type is used in that instance (for example, the declared maximum length, if applicable). Each data type descriptor is assigned an arbitrary identifier that is unique among the data type descriptor identifiers assigned for one object (table, domain, function). This view is probably not useful for applications, but it is used to define some other views in the information schema.
ru: Представление <literal>data_type_privileges</literal> описывает все дескрипторы типов данных, к которым имеет доступ текущий пользователь, являясь их владельцем или имея некоторые права для них. Дескриптор типа данных формируется, когда тип данных задействуется в определении столбца таблицы, домена или функции (в качестве типа параметра или результата), и хранит некоторую информацию о том, как этот тип используется в данном случае (например, объявленную максимальную длину, если это применимо). Каждому дескриптору типа данных назначается уникальный идентификатор, уникальный среди всех дескрипторов типов, назначаемых одному объекту (таблица, домен, функция). Это представление, вероятно, не полезно для приложений, но на его базе определены некоторые другие представления в информационной схеме.

source: <literal>data_type_privileges</literal> Columns
ru: Столбцы <literal>data_type_privileges</literal>

source: Name of the database that contains the described object (always the current database)
ru: Имя базы данных, содержащей описываемый объект (всегда текущая база)

source: Name of the schema that contains the described object
ru: Имя схемы, содержащей описываемый объект

source: Name of the described object
ru: Имя описываемого объекта

source: The type of the described object: one of <literal>TABLE</literal> (the data type descriptor pertains to a column of that table), <literal>DOMAIN</literal> (the data type descriptors pertains to that domain), <literal>ROUTINE</literal> (the data type descriptor pertains to a parameter or the return data type of that function).
ru: Тип описываемого объекта: <literal>TABLE</literal> (дескриптор типа данных относится к столбцу этой таблицы), <literal>DOMAIN</literal> (дескриптор типа данных относится к домену) или <literal>ROUTINE</literal> (дескриптор типа данных относится к типу данных параметра или результата функции).

source: The identifier of the data type descriptor, which is unique among the data type descriptors for that same object.
ru: Идентификатор дескриптора типа данных, уникальный среди дескрипторов типов для этого же объекта.

source: The view <literal>domain_constraints</literal> contains all constraints belonging to domains defined in the current database. Only those domains are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>domain_constraints</literal> показывает все ограничения, принадлежащие доменам, определённым в текущей базе данных. В нём отражаются только те домены, к которым имеет доступ текущий пользователь (являясь владельцем или имея некоторые права).

source: <literal>domain_constraints</literal> Columns
ru: Столбцы <literal>domain_constraints</literal>

source: Name of the database that contains the domain (always the current database)
ru: Имя базы данных, содержащей домен (всегда текущая база)

source: Name of the schema that contains the domain
ru: Имя схемы, содержащей домен

source: <literal>YES</literal> if the constraint is deferrable, <literal>NO</literal> if not
ru: <literal>YES</literal>, если ограничение откладываемое, или <literal>NO</literal> в противном случае

source: <literal>YES</literal> if the constraint is deferrable and initially deferred, <literal>NO</literal> if not
ru: <literal>YES</literal>, если ограничение откладываемое и отложенное изначально, или <literal>NO</literal> в противном случае

source: The view <literal>domain_udt_usage</literal> identifies all domains that are based on data types owned by a currently enabled role. Note that in <productname>PostgreSQL</productname>, built-in data types behave like user-defined types, so they are included here as well.
ru: Представление <literal>domain_udt_usage</literal> описывает все домены, которые используют типы данных, принадлежащие текущей активной роли. Заметьте, что в <productname>PostgreSQL</productname> встроенные типы данных не отличаются от определённых пользователем, так что в этом представлении выводятся и они.

source: <literal>domain_udt_usage</literal> Columns
ru: Столбцы <literal>domain_udt_usage</literal>

source: Name of the database that the domain data type is defined in (always the current database)
ru: Имя базы данных, в которой определён тип данных домена (всегда текущая база)

source: Name of the schema that the domain data type is defined in
ru: Имя схемы, в которой определён тип данных домена

source: Name of the domain data type
ru: Имя типа данных домена

source: The view <literal>domains</literal> contains all domains defined in the current database. Only those domains are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>domains</literal> показывает все домены, определённые в текущей базе данных. В нём показываются только те домены, к которым имеет доступ текущий пользователь (являясь владельцем или имея некоторые права).

source: <literal>domains</literal> Columns
ru: Столбцы <literal>domains</literal>

source: Data type of the domain, if it is a built-in type, or <literal>ARRAY</literal> if it is some array (in that case, see the view <literal>element_types</literal>), else <literal>USER-DEFINED</literal> (in that case, the type is identified in <literal>udt_name</literal> and associated columns).
ru: Тип данных домена, если это встроенный тип, либо <literal>ARRAY</literal>, если это массив (в этом случае обратитесь к представлению <literal>element_types</literal>), иначе — <literal>USER-DEFINED</literal> (в этом случае тип определяется в <literal>udt_name</literal> и связанных столбцах).

source: If the domain has a character or bit string type, the declared maximum length; null for all other data types or if no maximum length was declared.
ru: Если домен имеет тип текстовой или битовой строки, это поле задаёт её объявленную максимальную длину; NULL для всех других типов данных, или если максимальная длина не объявлена.

source: If the domain has a character type, the maximum possible length in octets (bytes) of a datum; null for all other data types. The maximum octet length depends on the declared character maximum length (see above) and the server encoding.
ru: Если домен имеет тип символьной строки, это поле задаёт её максимально возможный размер в октетах (байтах); NULL для всех других типов данных. Максимальный размер в октетах зависит от объявленной максимальной длины в символах (см. выше) и от кодировки сервера.

source: Name of the database containing the collation of the domain (always the current database), null if default or the data type of the domain is not collatable
ru: Имя базы данных, содержащей правило сортировки домена (это всегда текущая база), либо NULL, если это правило по умолчанию или тип домена несортируемый

source: Name of the schema containing the collation of the domain, null if default or the data type of the domain is not collatable
ru: Имя схемы, содержащей правило сортировки домена, либо NULL, если это правило по умолчанию или тип домена несортируемый

source: Name of the collation of the domain, null if default or the data type of the domain is not collatable
ru: Имя правила сортировки домена, либо NULL, если это правило по умолчанию или тип домена несортируемый

source: If the domain has a numeric type, this column contains the (declared or implicit) precision of the type for this domain. The precision indicates the number of significant digits. It can be expressed in decimal (base 10) or binary (base 2) terms, as specified in the column <literal>numeric_precision_radix</literal>. For all other data types, this column is null.
ru: Если домен имеет числовой тип, этот столбец содержит точность (объявленную или неявную) типа для этого домена. Точность определяет число значащих цифр. Она может выражаться в десятичных (по основанию 10) или двоичных (по основанию 2) цифрах, согласно столбцу <literal>numeric_precision_radix</literal>. Для всех других типов данных этот столбец содержит NULL.

source: If the domain has a numeric type, this column indicates in which base the values in the columns <literal>numeric_precision</literal> and <literal>numeric_scale</literal> are expressed. The value is either 2 or 10. For all other data types, this column is null.
ru: Если домен имеет числовой тип, в этом столбце определяется, по какому основанию задаются значения в столбцах <literal>numeric_precision</literal> и <literal>numeric_scale</literal>. Возможные варианты: 2 и 10. Для всех других типов данных этот столбец содержит NULL.

source: If the domain has an exact numeric type, this column contains the (declared or implicit) scale of the type for this domain. The scale indicates the number of significant digits to the right of the decimal point. It can be expressed in decimal (base 10) or binary (base 2) terms, as specified in the column <literal>numeric_precision_radix</literal>. For all other data types, this column is null.
ru: Если домен имеет точный числовой тип, этот столбец содержит масштаб (объявленный или неявный) типа для этого домена. Масштаб определяет число значащих цифр справа от десятичной точки. Он может выражаться в десятичных (по основанию 10) или двоичных (по основанию 2) цифрах, согласно столбцу <literal>numeric_precision_radix</literal>. Для всех других типов данных этот столбец содержит NULL.

source: If <literal>data_type</literal> identifies a date, time, timestamp, or interval type, this column contains the (declared or implicit) fractional seconds precision of the type for this domain, that is, the number of decimal digits maintained following the decimal point in the seconds value. For all other data types, this column is null.
ru: Если в <literal>data_type</literal> указан тип даты, времени, отметки времени или интервала, этот столбец содержит точность (объявленную или неявную) в долях секунды типа для этого домена, то есть число десятичных цифр, сохраняемых после десятичной точки в значении секунд. Для всех других типов данных этот столбец содержит NULL.

source: If <literal>data_type</literal> identifies an interval type, this column contains the specification which fields the intervals include for this domain, e.g., <literal>YEAR TO MONTH</literal>, <literal>DAY TO SECOND</literal>, etc. If no field restrictions were specified (that is, the interval accepts all fields), and for all other data types, this field is null.
ru: Если в <literal>data_type</literal> указан тип интервала, этот столбец определяет, какие поля принимает интервал в домене, например: <literal>YEAR TO MONTH</literal>, <literal>DAY TO SECOND</literal> и т. д. Если ограничения для полей не заданы (то есть, интервал принимает все поля), и для любых других типов данных это поле содержит NULL.

source: Applies to a feature not available in <productname>PostgreSQL</productname> (see <literal>datetime_precision</literal> for the fractional seconds precision of interval type domains)
ru: Относится к функциональности, отсутствующей в <productname>PostgreSQL</productname> (см. поле <literal>datetime_precision</literal>, определяющее точность в долях секунды для типов интервалов)

source: Default expression of the domain
ru: Выражение по умолчанию для домена

source: An identifier of the data type descriptor of the domain, unique among the data type descriptors pertaining to the domain (which is trivial, because a domain only contains one data type descriptor). This is mainly useful for joining with other instances of such identifiers. (The specific format of the identifier is not defined and not guaranteed to remain the same in future versions.)
ru: Идентификатор дескриптора типа данных целевого домена, уникальный среди всех дескрипторов типов, относящихся к домену (что тривиально, так как домен содержит только один дескриптор типа). Он в основном полезен для соединения с другими экземплярами таких идентификаторов. (Конкретный формат идентификатора не определён и не гарантируется, что он останется неизменным в будущих версиях.)

source: The view <literal>element_types</literal> contains the data type descriptors of the elements of arrays. When a table column, composite-type attribute, domain, function parameter, or function return value is defined to be of an array type, the respective information schema view only contains <literal>ARRAY</literal> in the column <literal>data_type</literal>. To obtain information on the element type of the array, you can join the respective view with this view. For example, to show the columns of a table with data types and array element types, if applicable, you could do: <placeholder-1/> This view only includes objects that the current user has access to, by way of being the owner or having some privilege.
ru: Представление <literal>element_types</literal> показывает дескрипторы типов элементов массива. Когда столбец таблицы, атрибут составного типа, параметр или результат функции объявлены с типом массива, соответствующее представление информационной схемы будет содержать только <literal>ARRAY</literal> в столбце <literal>data_type</literal>. Чтобы получить информацию о типе элемента массива, можно связать соответствующее представление с данным. Например, просмотреть столбцы таблицы с типами данных и типами элементов массива (если это применимо) можно так: <placeholder-1/> Это представление показывает только те объекты, к которым имеет доступ текущий пользователь, являясь владельцем или имея некоторые права.

source: <literal>element_types</literal> Columns
ru: Столбцы <literal>element_types</literal>

source: Name of the database that contains the object that uses the array being described (always the current database)
ru: Имя базы данных, содержащей объект, связанный с описываемым массивом (всегда текущая база)

source: Name of the schema that contains the object that uses the array being described
ru: Имя схемы, содержащей объект, связанный с описываемым массивом

source: Name of the object that uses the array being described
ru: Имя объекта, связанного с описываемым массивом

source: The type of the object that uses the array being described: one of <literal>TABLE</literal> (the array is used by a column of that table), <literal>USER-DEFINED TYPE</literal> (the array is used by an attribute of that composite type), <literal>DOMAIN</literal> (the array is used by that domain), <literal>ROUTINE</literal> (the array is used by a parameter or the return data type of that function).
ru: Тип объекта, связанного с описываемым массивом: <literal>TABLE</literal> (массив задействован в столбце этой таблицы), <literal>USER-DEFINED TYPE</literal> (массив задействован в атрибуте составного типа), <literal>DOMAIN</literal> (массив задействован в домене), <literal>ROUTINE</literal> (массив задействован в типе данных параметра или результата функции).

source: The identifier of the data type descriptor of the array being described. Use this to join with the <literal>dtd_identifier</literal> columns of other information schema views.
ru: Идентификатор дескриптора типа данных для описываемого массива. Его можно использовать для соединения со столбцами <literal>dtd_identifier</literal> других представлений информационной схемы.

source: Data type of the array elements, if it is a built-in type, else <literal>USER-DEFINED</literal> (in that case, the type is identified in <literal>udt_name</literal> and associated columns).
ru: Тип данных элементов массива, если это встроенный тип, либо <literal>USER-DEFINED</literal> (в этом случае тип определяется в <literal>udt_name</literal> и связанных столбцах).

source: Always null, since this information is not applied to array element data types in <productname>PostgreSQL</productname>
ru: Всегда NULL, так как эта информация неприменима к типам элементов массива в <productname>PostgreSQL</productname>
