Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/information_schema.po
Languages: ru

source: Name of the database containing the collation of the element type (always the current database), null if default or the data type of the element is not collatable
ru: Имя базы данных, содержащей правило сортировки типа элемента (это всегда текущая база), либо NULL, если это правило по умолчанию или тип элемента несортируемый

source: Name of the schema containing the collation of the element type, null if default or the data type of the element is not collatable
ru: Имя схемы, содержащей правило сортировки типа элемента, либо NULL, если это правило по умолчанию или тип элемента несортируемый

source: Name of the collation of the element type, null if default or the data type of the element is not collatable
ru: Имя правила сортировки типа элемента, либо NULL, если это правило по умолчанию или тип элемента несортируемый

source: Not yet implemented
ru: Ещё не реализовано

source: Name of the database that the data type of the elements is defined in (always the current database)
ru: Имя базы данных, в которой определён тип данных элемента (всегда текущая база)

source: Name of the schema that the data type of the elements is defined in
ru: Имя схемы, в которой определён тип данных элемента

source: Name of the data type of the elements
ru: Имя типа данных элемента

source: An identifier of the data type descriptor of the element. This is currently not useful.
ru: Идентификатор дескриптора типа данных элемента. В настоящее время бесполезен.

source: <primary>enabled role</primary>
ru: <primary>доступная роль</primary>

source: <primary>role</primary><secondary>enabled</secondary>
ru: <primary>роль</primary> <secondary>доступная</secondary>

source: The view <literal>enabled_roles</literal> identifies the currently <quote>enabled roles</quote>. The enabled roles are recursively defined as the current user together with all roles that have been granted to the enabled roles with automatic inheritance. In other words, these are all roles that the current user has direct or indirect, automatically inheriting membership in. <placeholder-1/> <placeholder-2/>
ru: Представление <literal>enabled_roles</literal> описывает <quote>доступные роли</quote>. Список доступных ролей рекурсивно определяется как роль текущего пользователя плюс роли, данные доступным ролям, с автоматическим наследованием. Другими словами, это роли, которые даны текущему пользователю непосредственно или косвенно, посредством автоматического наследования. <placeholder-1/> <placeholder-2/>

source: For permission checking, the set of <quote>applicable roles</quote> is applied, which can be broader than the set of enabled roles. So generally, it is better to use the view <literal>applicable_roles</literal> instead of this one; see also there.
ru: Для проверки разрешений применяется набор <quote>применимых ролей</quote>, который может быть шире набора доступных ролей. Поэтому в общем случае вместо этого представления лучше использовать <literal>applicable_roles</literal> (см. его описание).

source: <literal>enabled_roles</literal> Columns
ru: Столбцы <literal>enabled_roles</literal>

source: The view <literal>foreign_data_wrapper_options</literal> contains all the options defined for foreign-data wrappers in the current database. Only those foreign-data wrappers are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>foreign_data_wrapper_options</literal> показывает все параметры, определённые для обёрток сторонних данных в текущей базе. В нём отражаются только те обёртки сторонних данных, к которым имеет доступ текущий пользователь (являясь их владельцем или имея некоторые права).

source: <literal>foreign_data_wrapper_options</literal> Columns
ru: Столбцы <literal>foreign_data_wrapper_options</literal>

source: Name of the database that the foreign-data wrapper is defined in (always the current database)
ru: Имя базы данных, в которой определена обёртка сторонних данных (всегда текущая база)

source: Name of the foreign-data wrapper
ru: Имя обёртки сторонних данных

source: The view <literal>foreign_data_wrappers</literal> contains all foreign-data wrappers defined in the current database. Only those foreign-data wrappers are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>foreign_data_wrappers</literal> показывает все обёртки сторонних данных, определённые в текущей базе. В нём показываются только те обёртки сторонних данных, к которым имеет доступ текущий пользователь (являясь их владельцем или имея некоторые права).

source: <literal>foreign_data_wrappers</literal> Columns
ru: Столбцы <literal>foreign_data_wrappers</literal>

source: Name of the database that contains the foreign-data wrapper (always the current database)
ru: Имя базы данных, в которой определена обёртка сторонних данных (всегда текущая база)

source: Name of the owner of the foreign server
ru: Имя владельца стороннего сервера

source: File name of the library that implementing this foreign-data wrapper
ru: Имя файла библиотеки, реализующей эту обёртку сторонних данных

source: Language used to implement this foreign-data wrapper
ru: Язык, на котором реализована эта обёртка сторонних данных

source: The view <literal>foreign_server_options</literal> contains all the options defined for foreign servers in the current database. Only those foreign servers are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>foreign_server_options</literal> показывает все параметры, определённые для сторонних серверов в текущей базе данных. В нём отражаются только те сторонние серверы, к которым имеет доступ текущий пользователь (являясь их владельцем или имея некоторые права).

source: <literal>foreign_server_options</literal> Columns
ru: Столбцы <literal>foreign_server_options</literal>

source: Name of the database that the foreign server is defined in (always the current database)
ru: Имя базы данных, в которой определён сторонний сервер (всегда текущая база)

source: Name of the foreign server
ru: Имя стороннего сервера

source: The view <literal>foreign_servers</literal> contains all foreign servers defined in the current database. Only those foreign servers are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>foreign_servers</literal> показывает все сторонние серверы, определённые в текущей базе данных. В нём показываются только те сторонние серверы, к которым имеет доступ текущий пользователь (являясь их владельцем или имея некоторые права).

source: <literal>foreign_servers</literal> Columns
ru: Столбцы <literal>foreign_servers</literal>

source: Name of the database that contains the foreign-data wrapper used by the foreign server (always the current database)
ru: Имя базы данных, в которой определена обёртка сторонних данных, используемая сторонним сервером (всегда текущая база)

source: Name of the foreign-data wrapper used by the foreign server
ru: Имя обёртки сторонних данных, используемой сторонним сервером

source: Foreign server type information, if specified upon creation
ru: Информация о типе стороннего сервера, если она была указана при его создании

source: Foreign server version information, if specified upon creation
ru: Информация о версии стороннего сервера, если она была указана при его создании

source: The view <literal>foreign_table_options</literal> contains all the options defined for foreign tables in the current database. Only those foreign tables are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>foreign_table_options</literal> показывает все параметры, определённые для сторонних таблиц в текущей базе данных. В нём отражаются только те сторонние таблицы, к которым имеет доступ текущий пользователь (являясь их владельцем или имея некоторые права).

source: <literal>foreign_table_options</literal> Columns
ru: Столбцы <literal>foreign_table_options</literal>

source: The view <literal>foreign_tables</literal> contains all foreign tables defined in the current database. Only those foreign tables are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>foreign_tables</literal> показывает все сторонние таблицы, определённые в текущей базе данных. В нём показываются только те сторонние таблицы, к которым имеет доступ текущий пользователь (являясь их владельцем или имея некоторые права).

source: <literal>foreign_tables</literal> Columns
ru: Столбцы <literal>foreign_tables</literal>

source: Name of the database that the foreign table is defined in (always the current database)
ru: Имя базы данных, в которой определена сторонняя таблица (всегда текущая база)

source: The view <literal>key_column_usage</literal> identifies all columns in the current database that are restricted by some unique, primary key, or foreign key constraint. Check constraints are not included in this view. Only those columns are shown that the current user has access to, by way of being the owner or having some privilege.
ru: Представление <literal>key_column_usage</literal> описывает все столбцы в текущей базе, с которыми связано какое-либо ограничение уникальности, либо ограничение первичного или внешнего ключа. Ограничения-проверки в этом представлении не показываются. В нём показываются только те столбцы, к которым имеет доступ текущий пользователь (являясь владельцем или имея некоторые права).

source: <literal>key_column_usage</literal> Columns
ru: Столбцы <literal>key_column_usage</literal>

source: Name of the database that contains the table that contains the column that is restricted by this constraint (always the current database)
ru: Имя базы данных, содержащей таблицу со столбцом, подчиняющимся этому ограничению (всегда текущая база)

source: Name of the schema that contains the table that contains the column that is restricted by this constraint
ru: Имя схемы, содержащей таблицу со столбцом, подчиняющимся этому ограничению

source: Name of the table that contains the column that is restricted by this constraint
ru: Имя таблицы со столбцом, подчиняющимся этому ограничению

source: Name of the column that is restricted by this constraint
ru: Имя столбца, подчиняющегося этому ограничению

source: Ordinal position of the column within the constraint key (count starts at 1)
ru: Порядковый номер столбца в ключе ограничения (нумерация начинается с 1)

source: For a foreign-key constraint, ordinal position of the referenced column within its unique constraint (count starts at 1); otherwise null
ru: Для ограничения внешнего ключа это порядковый номер целевого столбца в его ограничении уникальности (нумерация начинается с 1); в противном случае NULL

source: The view <literal>parameters</literal> contains information about the parameters (arguments) of all functions in the current database. Only those functions are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>parameters</literal> содержит информацию о параметрах (аргументах) всех функций в текущей базе данных. В нём отражаются только функции, к которым имеет доступ текущий пользователь (являясь владельцем или имея некоторые права).

source: <literal>parameters</literal> Columns
ru: Столбцы <literal>parameters</literal>

source: Ordinal position of the parameter in the argument list of the function (count starts at 1)
ru: Порядковый номер параметра в списке аргументов функции (нумерация начинается с 1)

source: <literal>IN</literal> for input parameter, <literal>OUT</literal> for output parameter, and <literal>INOUT</literal> for input/output parameter.
ru: <literal>IN</literal> для входного параметра, <literal>OUT</literal> для выходного, <literal>INOUT</literal> — для входного и выходного параметра.

source: Name of the parameter, or null if the parameter has no name
ru: Имя параметра, либо NULL, если параметр безымянный

source: Data type of the parameter, if it is a built-in type, or <literal>ARRAY</literal> if it is some array (in that case, see the view <literal>element_types</literal>), else <literal>USER-DEFINED</literal> (in that case, the type is identified in <literal>udt_name</literal> and associated columns).
ru: Тип данных параметра, если это встроенный тип, либо <literal>ARRAY</literal>, если это массив (в этом случае обратитесь к представлению <literal>element_types</literal>), иначе — <literal>USER-DEFINED</literal> (в этом случае тип определяется в <literal>udt_name</literal> и связанных столбцах).

source: Always null, since this information is not applied to parameter data types in <productname>PostgreSQL</productname>
ru: Всегда NULL, так как эта информация не применима к типам параметров в <productname>PostgreSQL</productname>

source: Name of the database that the data type of the parameter is defined in (always the current database)
ru: Имя базы данных, в которой определён тип данных параметра (всегда текущая база)

source: Name of the schema that the data type of the parameter is defined in
ru: Имя схемы, в которой определён тип данных параметра

source: Name of the data type of the parameter
ru: Имя типа данных параметра

source: An identifier of the data type descriptor of the parameter, unique among the data type descriptors pertaining to the function. This is mainly useful for joining with other instances of such identifiers. (The specific format of the identifier is not defined and not guaranteed to remain the same in future versions.)
ru: Идентификатор дескриптора типа данных параметра, уникальный среди всех дескрипторов типов, относящихся к функции. Он в основном полезен для соединения с другими экземплярами таких идентификаторов. (Конкретный формат идентификатора не определён и не гарантируется, что он останется неизменным в будущих версиях.)

source: The default expression of the parameter, or null if none or if the function is not owned by a currently enabled role.
ru: Выражение параметра по умолчанию, либо NULL, если такого выражения нет или функция не принадлежит текущей активной роли.

source: The view <literal>referential_constraints</literal> contains all referential (foreign key) constraints in the current database. Only those constraints are shown for which the current user has write access to the referencing table (by way of being the owner or having some privilege other than <literal>SELECT</literal>).
ru: Представление <literal>referential_constraints</literal> содержит все ссылочные ограничения (внешнего ключа) в текущей базе данных. В нём показываются только ограничения, в которых ссылающаяся таблица доступна текущему пользователю на запись (он является её владельцем или имеет не только право <literal>SELECT</literal>).

source: <literal>referential_constraints</literal> Columns
ru: Столбцы <literal>referential_constraints</literal>

source: Name of the database that contains the unique or primary key constraint that the foreign key constraint references (always the current database)
ru: Имя базы данных, содержащей ограничение уникальности или первичный ключ, на которые ссылается ограничение внешнего ключа (всегда текущая база)

source: Name of the schema that contains the unique or primary key constraint that the foreign key constraint references
ru: Имя схемы, содержащей ограничение уникальности или первичный ключ, на которые ссылается ограничение внешнего ключа

source: Name of the unique or primary key constraint that the foreign key constraint references
ru: Имя ограничения уникальности или первичного ключа, на которые ссылается ограничение внешнего ключа

source: Match option of the foreign key constraint: <literal>FULL</literal>, <literal>PARTIAL</literal>, or <literal>NONE</literal>.
ru: Тип совпадения для ограничения внешнего ключа: <literal>FULL</literal>, <literal>PARTIAL</literal> или <literal>NONE</literal>.

source: Update rule of the foreign key constraint: <literal>CASCADE</literal>, <literal>SET NULL</literal>, <literal>SET DEFAULT</literal>, <literal>RESTRICT</literal>, or <literal>NO ACTION</literal>.
ru: Правило изменения для ограничения внешнего ключа: <literal>CASCADE</literal>, <literal>SET NULL</literal>, <literal>SET DEFAULT</literal>, <literal>RESTRICT</literal> или <literal>NO ACTION</literal>.

source: Delete rule of the foreign key constraint: <literal>CASCADE</literal>, <literal>SET NULL</literal>, <literal>SET DEFAULT</literal>, <literal>RESTRICT</literal>, or <literal>NO ACTION</literal>.
ru: Правило удаления для ограничения внешнего ключа: <literal>CASCADE</literal>, <literal>SET NULL</literal>, <literal>SET DEFAULT</literal>, <literal>RESTRICT</literal> или <literal>NO ACTION</literal>.

source: The view <literal>role_column_grants</literal> identifies all privileges granted on columns where the grantor or grantee is a currently enabled role. Further information can be found under <literal>column_privileges</literal>. The only effective difference between this view and <literal>column_privileges</literal> is that this view omits columns that have been made accessible to the current user by way of a grant to <literal>PUBLIC</literal>.
ru: Представление <literal>role_column_grants</literal> описывает все назначенные для столбцов права, в которых праводателем или правообладателем является текущая активная роль. Дополнительную информацию можно найти в <literal>column_privileges</literal>. Единственное существенное отличие этого представления от <literal>column_privileges</literal> состоит в том, что в данном представлении опускаются столбцы, которые доступны текущему пользователю косвенно через роль <literal>PUBLIC</literal>.

source: <literal>role_column_grants</literal> Columns
ru: Столбцы <literal>role_column_grants</literal>

source: The view <literal>role_routine_grants</literal> identifies all privileges granted on functions where the grantor or grantee is a currently enabled role. Further information can be found under <literal>routine_privileges</literal>. The only effective difference between this view and <literal>routine_privileges</literal> is that this view omits functions that have been made accessible to the current user by way of a grant to <literal>PUBLIC</literal>.
ru: Представление <literal>role_routine_grants</literal> описывает все назначенные для функций права, в которых праводателем или правообладателем является текущая активная роль. Дополнительную информацию можно найти в <literal>routine_privileges</literal>. Единственное существенное отличие этого представления от <literal>routine_privileges</literal> состоит в том, что в данном представлении опускаются функции, которые доступны текущему пользователю косвенно через роль <literal>PUBLIC</literal>.

source: <literal>role_routine_grants</literal> Columns
ru: Столбцы <literal>role_routine_grants</literal>

source: Name of the function (might be duplicated in case of overloading)
ru: Имя функции (может дублироваться в случае перегрузки)

source: Always <literal>EXECUTE</literal> (the only privilege type for functions)
ru: Всегда <literal>EXECUTE</literal> (единственный тип прав для функций)

source: The view <literal>role_table_grants</literal> identifies all privileges granted on tables or views where the grantor or grantee is a currently enabled role. Further information can be found under <literal>table_privileges</literal>. The only effective difference between this view and <literal>table_privileges</literal> is that this view omits tables that have been made accessible to the current user by way of a grant to <literal>PUBLIC</literal>.
ru: Представление <literal>role_table_grants</literal> описывает все назначенные для таблиц и представлений права, в которых праводателем или правообладателем является текущая активная роль. Дополнительную информацию можно найти в <literal>table_privileges</literal>. Единственное существенное отличие этого представления от <literal>table_privileges</literal> состоит в том, что в данном представлении опускаются таблицы, которые доступны текущему пользователю косвенно через роль <literal>PUBLIC</literal>.

source: <literal>role_table_grants</literal> Columns
ru: Столбцы <literal>role_table_grants</literal>

source: Name of the database that contains the table (always the current database)
ru: Имя базы данных, содержащей таблицу (всегда текущая база)

source: Name of the schema that contains the table
ru: Имя схемы, содержащей таблицу

source: Type of the privilege: <literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, <literal>TRUNCATE</literal>, <literal>REFERENCES</literal>, or <literal>TRIGGER</literal>
ru: Тип права: <literal>SELECT</literal>, <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, <literal>TRUNCATE</literal>, <literal>REFERENCES</literal> или <literal>TRIGGER</literal>

source: In the SQL standard, <literal>WITH HIERARCHY OPTION</literal> is a separate (sub-)privilege allowing certain operations on table inheritance hierarchies. In PostgreSQL, this is included in the <literal>SELECT</literal> privilege, so this column shows <literal>YES</literal> if the privilege is <literal>SELECT</literal>, else <literal>NO</literal>.
ru: В стандарте SQL имеется отдельное подчинённое разрешение <literal>WITH HIERARCHY OPTION</literal>, позволяющее выполнять определённые операции в иерархии наследования таблиц. В PostgreSQL так действует право <literal>SELECT</literal>, так что в этом столбце выводится <literal>YES</literal> для права <literal>SELECT</literal>, а для других — <literal>NO</literal>.

source: The view <literal>role_udt_grants</literal> is intended to identify <literal>USAGE</literal> privileges granted on user-defined types where the grantor or grantee is a currently enabled role. Further information can be found under <literal>udt_privileges</literal>. The only effective difference between this view and <literal>udt_privileges</literal> is that this view omits objects that have been made accessible to the current user by way of a grant to <literal>PUBLIC</literal>. Since data types do not have real privileges in PostgreSQL, but only an implicit grant to <literal>PUBLIC</literal>, this view is empty.
ru: Представление <literal>role_udt_grants</literal> предназначено для отображения прав <literal>USAGE</literal>, назначенных для пользовательских типов, в которых праводателем или правообладателем является текущая активная роль. Дополнительную информацию можно найти в <literal>udt_privileges</literal>. Единственное существенное отличие этого представления от <literal>udt_privileges</literal> состоит в том, что в данном представлении опускаются объекты, которые доступны текущему пользователю косвенно через роль <literal>PUBLIC</literal>. Так как с типами данных не связываются действующие права в PostgreSQL (только <literal>PUBLIC</literal> неявно даётся право их использования), это представление пустое.

source: <literal>role_udt_grants</literal> Columns
ru: Столбцы <literal>role_udt_grants</literal>

source: The name of the role that granted the privilege
ru: Имя роли, которая дала это право

source: The name of the role that the privilege was granted to
ru: Имя роли, которой было дано это право

source: Name of the database containing the type (always the current database)
ru: Имя базы данных, содержащей тип (всегда текущая база)

source: Name of the schema containing the type
ru: Имя схемы, содержащей тип

source: Name of the type
ru: Имя типа

source: Always <literal>TYPE USAGE</literal>
ru: Всегда <literal>TYPE USAGE</literal>
