Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/information_schema.po
Languages: ru

source: The view <literal>role_usage_grants</literal> identifies <literal>USAGE</literal> privileges granted on various kinds of objects where the grantor or grantee is a currently enabled role. Further information can be found under <literal>usage_privileges</literal>. The only effective difference between this view and <literal>usage_privileges</literal> is that this view omits objects that have been made accessible to the current user by way of a grant to <literal>PUBLIC</literal>.
ru: Представление <literal>role_usage_grants</literal> описывает права <literal>USAGE</literal>, назначенные для объектов различных типов, в которых праводателем или правообладателем является текущая активная роль. Дополнительную информацию можно найти в <literal>usage_privileges</literal>. Единственное существенное отличие этого представления от <literal>usage_privileges</literal> состоит в том, что в данном представлении опускаются объекты, которые доступны текущему пользователю косвенно через роль <literal>PUBLIC</literal>.

source: <literal>role_usage_grants</literal> Columns
ru: Столбцы <literal>role_usage_grants</literal>

source: Name of the database containing the object (always the current database)
ru: Имя базы данных, содержащей объект (всегда текущая база)

source: Name of the schema containing the object, if applicable, else an empty string
ru: Имя схемы, содержащей объект, если это применимо, иначе пустая строка

source: Name of the object
ru: Имя объекта

source: <literal>COLLATION</literal> or <literal>DOMAIN</literal> or <literal>FOREIGN DATA WRAPPER</literal> or <literal>FOREIGN SERVER</literal> or <literal>SEQUENCE</literal>
ru: <literal>COLLATION</literal> или <literal>DOMAIN</literal> или <literal>FOREIGN DATA WRAPPER</literal> или <literal>FOREIGN SERVER</literal> или <literal>SEQUENCE</literal>

source: Always <literal>USAGE</literal>
ru: Всегда <literal>USAGE</literal>

source: The view <literal>routine_privileges</literal> identifies all privileges granted on functions to a currently enabled role or by a currently enabled role. There is one row for each combination of function, grantor, and grantee.
ru: Представление <literal>routine_privileges</literal> описывает все права, назначенные текущей активной роли или текущей активной ролью для функций. Оно содержит отдельный столбец для каждой комбинации функции, праводателя и правообладателя.

source: <literal>routine_privileges</literal> Columns
ru: Столбцы <literal>routine_privileges</literal>

source: The view <literal>routines</literal> contains all functions in the current database. Only those functions are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>routines</literal> показывает все функции в текущей базе данных. В нём показываются только функции, к которым имеет доступ текущий пользователь (являясь владельцем или имея некоторые права).

source: <literal>routines</literal> Columns
ru: Столбцы <literal>routines</literal>

source: The <quote>specific name</quote> of the function. This is a name that uniquely identifies the function in the schema, even if the real name of the function is overloaded. The format of the specific name is not defined, it should only be used to compare it to other instances of specific routine names.
ru: <quote>Однозначное имя</quote> функции. Это имя однозначным образом идентифицирует функцию в схеме, даже если реальное имя функции перегружено. Формат однозначных имён не определён, так что его следует использовать только для сравнения с другими экземплярами однозначных имён подпрограмм.

source: Always <literal>FUNCTION</literal> (In the future there might be other types of routines.)
ru: Всегда <literal>FUNCTION</literal> (в будущем могут появиться и другие типы подпрограмм.)

source: Return data type of the function, if it is a built-in type, or <literal>ARRAY</literal> if it is some array (in that case, see the view <literal>element_types</literal>), else <literal>USER-DEFINED</literal> (in that case, the type is identified in <literal>type_udt_name</literal> and associated columns).
ru: Тип данных результата функции, если это встроенный тип, либо <literal>ARRAY</literal>, если это массив (в этом случае обратитесь к представлению <literal>element_types</literal>), иначе — <literal>USER-DEFINED</literal> (в этом случае тип определяется в <literal>type_udt_name</literal> и связанных столбцах).

source: Always null, since this information is not applied to return data types in <productname>PostgreSQL</productname>
ru: Всегда NULL, так как эта информация неприменима к типам результатов в <productname>PostgreSQL</productname>

source: Name of the database that the return data type of the function is defined in (always the current database)
ru: Имя базы данных, в которой определён тип данных результата функции (всегда текущая база)

source: Name of the schema that the return data type of the function is defined in
ru: Имя схемы, в которой определён тип данных результата функции

source: Name of the return data type of the function
ru: Имя типа данных результата функции

source: An identifier of the data type descriptor of the return data type of this function, unique among the data type descriptors pertaining to the function. This is mainly useful for joining with other instances of such identifiers. (The specific format of the identifier is not defined and not guaranteed to remain the same in future versions.)
ru: Идентификатор дескриптора типа данных результата функции, уникальный среди всех дескрипторов типов, относящихся к функции. Он в основном полезен для соединения с другими экземплярами таких идентификаторов. (Конкретный формат идентификатора не определён и не гарантируется, что он останется неизменным в будущих версиях.)

source: If the function is an SQL function, then <literal>SQL</literal>, else <literal>EXTERNAL</literal>.
ru: Если функция написана на SQL, это поле содержит <literal>SQL</literal>, иначе <literal>EXTERNAL</literal>.

source: The source text of the function (null if the function is not owned by a currently enabled role). (According to the SQL standard, this column is only applicable if <literal>routine_body</literal> is <literal>SQL</literal>, but in <productname>PostgreSQL</productname> it will contain whatever source text was specified when the function was created.)
ru: Исходный текст функции (NULL, если функция не принадлежит текущей активной роли). (Согласно стандарту SQL, этот столбец актуален, только если в <literal>routine_body</literal> указано <literal>SQL</literal>, но в <productname>PostgreSQL</productname> он будет содержать любой исходный текст, заданный при создании функции.)

source: If this function is a C function, then the external name (link symbol) of the function; else null. (This works out to be the same value that is shown in <literal>routine_definition</literal>.)
ru: Если это функция на C, этот столбец содержит внешнее имя (объектный символ) функции, иначе NULL. (Это будет то же значение, что содержит столбец <literal>routine_definition</literal>.)

source: The language the function is written in
ru: Язык, на котором написана функция

source: Always <literal>GENERAL</literal> (The SQL standard defines other parameter styles, which are not available in <productname>PostgreSQL</productname>.)
ru: Всегда <literal>GENERAL</literal> (В стандарте SQL определены и другие стили параметров, но в <productname>PostgreSQL</productname> они отсутствуют.)

source: If the function is declared immutable (called deterministic in the SQL standard), then <literal>YES</literal>, else <literal>NO</literal>. (You cannot query the other volatility levels available in <productname>PostgreSQL</productname> through the information schema.)
ru: Если функция объявлена как постоянная (IMMUTABLE) (в стандарте SQL она называется детерминированной), этот столбец содержит <literal>YES</literal>, иначе — <literal>NO</literal>. (Получить другие уровни переменности функций, имеющиеся в <productname>PostgreSQL</productname>, через информационную схему нельзя.)

source: Always <literal>MODIFIES</literal>, meaning that the function possibly modifies SQL data. This information is not useful for <productname>PostgreSQL</productname>.
ru: Всегда <literal>MODIFIES</literal>, что означает, что функция может модифицировать данные SQL. Для <productname>PostgreSQL</productname> эта информация бесполезна.

source: If the function automatically returns null if any of its arguments are null, then <literal>YES</literal>, else <literal>NO</literal>.
ru: Если функция автоматически возвращает NULL, когда один из аргументов NULL, этот столбец содержит <literal>YES</literal>, иначе — <literal>NO</literal>.

source: Always <literal>YES</literal> (The opposite would be a method of a user-defined type, which is a feature not available in <productname>PostgreSQL</productname>.)
ru: Всегда <literal>YES</literal> (Другое значение было бы у методов пользовательских типов, но в <productname>PostgreSQL</productname> их нет.)

source: If the function runs with the privileges of the current user, then <literal>INVOKER</literal>, if the function runs with the privileges of the user who defined it, then <literal>DEFINER</literal>.
ru: Если функция выполняется с правами вызывающего пользователя, этот столбец содержит <literal>INVOKER</literal>, а если с правами пользователя, создавшего её, то — <literal>DEFINER</literal>.

source: Currently always <literal>NO</literal>. The alternative <literal>YES</literal> applies to a feature not available in <productname>PostgreSQL</productname>.
ru: В настоящее время всегда <literal>NO</literal>. Альтернативное значение <literal>YES</literal> связано с возможностями, отсутствующими в <productname>PostgreSQL</productname>.

source: The view <literal>schemata</literal> contains all schemas in the current database that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>schemata</literal> показывает все схемы в текущей базе данных, к которым имеет доступ текущий пользователь (являясь их владельцем или имея некоторые права).

source: <literal>schemata</literal> Columns
ru: Столбцы <literal>schemata</literal>

source: Name of the database that the schema is contained in (always the current database)
ru: Имя базы данных, содержащей схему (всегда текущая база)

source: Name of the schema
ru: Имя схемы

source: Name of the owner of the schema
ru: Имя владельца схемы

source: The view <literal>sequences</literal> contains all sequences defined in the current database. Only those sequences are shown that the current user has access to (by way of being the owner or having some privilege).
ru: Представление <literal>sequences</literal> показывает все последовательности, определённые в текущей базе данных. В нём показываются только те последовательности, к которым имеет доступ текущий пользователь (являясь владельцем или имея некоторые права).

source: <literal>sequences</literal> Columns
ru: Столбцы <literal>sequences</literal>

source: Name of the database that contains the sequence (always the current database)
ru: Имя базы данных, содержащей последовательность (всегда текущая база)

source: Name of the schema that contains the sequence
ru: Имя схемы, содержащей последовательность

source: Name of the sequence
ru: Имя последовательности

source: The data type of the sequence.
ru: Тип данных последовательности.

source: This column contains the (declared or implicit) precision of the sequence data type (see above). The precision indicates the number of significant digits. It can be expressed in decimal (base 10) or binary (base 2) terms, as specified in the column <literal>numeric_precision_radix</literal>.
ru: Этот столбец содержит точность (объявленную или неявную) типа данных последовательности (см. выше). Точность определяет число значащих цифр. Она может выражаться в десятичных (по основанию 10) или двоичных (по основанию 2) цифрах, согласно столбцу <literal>numeric_precision_radix</literal>.

source: This column indicates in which base the values in the columns <literal>numeric_precision</literal> and <literal>numeric_scale</literal> are expressed. The value is either 2 or 10.
ru: Этот столбец определяет, по какому основанию задаются значения в столбцах <literal>numeric_precision</literal> и <literal>numeric_scale</literal>. Возможные варианты: 2 и 10.

source: This column contains the (declared or implicit) scale of the sequence data type (see above). The scale indicates the number of significant digits to the right of the decimal point. It can be expressed in decimal (base 10) or binary (base 2) terms, as specified in the column <literal>numeric_precision_radix</literal>.
ru: Этот столбец содержит масштаб (объявленный или неявный) типа данных последовательности (см. выше). Масштаб определяет число значащих цифр справа от десятичной точки. Он может выражаться в десятичных (по основанию 10) или двоичных (по основанию 2) цифрах, согласно столбцу <literal>numeric_precision_radix</literal>.

source: The start value of the sequence
ru: Начальное значение последовательности

source: The minimum value of the sequence
ru: Минимальное значение последовательности

source: The maximum value of the sequence
ru: Максимальное значение последовательности

source: The increment of the sequence
ru: Шаг увеличения последовательности

source: <literal>YES</literal> if the sequence cycles, else <literal>NO</literal>
ru: <literal>YES</literal>, если последовательность зацикливается, или <literal>NO</literal> в противном случае

source: Note that in accordance with the SQL standard, the start, minimum, maximum, and increment values are returned as character strings.
ru: Заметьте, что, согласно стандарту SQL, начальное, минимальное, максимальное значение и шаг выдаются в виде символьных строк.

source: The table <literal>sql_features</literal> contains information about which formal features defined in the SQL standard are supported by <productname>PostgreSQL</productname>. This is the same information that is presented in <xref linkend="features"/>. There you can also find some additional background information.
ru: Таблица <literal>sql_features</literal> содержит информацию о формальной функциональности, описанной в стандарте и поддерживаемой <productname>PostgreSQL</productname>. Эта же информация представлена в <xref remap="6" linkend="features"/>. Там вы можете найти и дополнительные сведения.

source: <literal>sql_features</literal> Columns
ru: Столбцы <literal>sql_features</literal>

source: Identifier string of the feature
ru: Строка идентификатора функциональности

source: Descriptive name of the feature
ru: Описательное название функциональности

source: Identifier string of the subfeature, or a zero-length string if not a subfeature
ru: Строка идентификатора подчинённой возможности, либо строка нулевой длины, если это не подчинённая возможность

source: Descriptive name of the subfeature, or a zero-length string if not a subfeature
ru: Описательное название подчинённой возможности, либо строка нулевой длины, если это не подчинённая возможность

source: <literal>YES</literal> if the feature is fully supported by the current version of <productname>PostgreSQL</productname>, <literal>NO</literal> if not
ru: <literal>YES</literal>, если функциональность полностью поддерживается текущей версией <productname>PostgreSQL</productname>, либо <literal>NO</literal> в противном случае

source: Always null, since the <productname>PostgreSQL</productname> development group does not perform formal testing of feature conformance
ru: Всегда NULL, так как группа разработки <productname>PostgreSQL</productname> не проводит формальное тестирование функционального соответствия

source: Possibly a comment about the supported status of the feature
ru: Необязательный комментарий о поддерживаемом состоянии функциональности

source: The table <literal>sql_implementation_info</literal> contains information about various aspects that are left implementation-defined by the SQL standard. This information is primarily intended for use in the context of the ODBC interface; users of other interfaces will probably find this information to be of little use. For this reason, the individual implementation information items are not described here; you will find them in the description of the ODBC interface.
ru: Таблица <literal>sql_implementation_info</literal> содержит информацию о различных аспектах, которые в стандарте SQL оставлены на усмотрение реализации. Эта информация в основном предназначена для применения в контексте интерфейса ODBC; пользователям других интерфейсов она вряд ли будет нужна. Поэтому отдельные элементы особенностей реализации здесь не описываются; о них можно прочитать в описании интерфейса ODBC.

source: <literal>sql_implementation_info</literal> Columns
ru: Столбцы <literal>sql_implementation_info</literal>

source: Identifier string of the implementation information item
ru: Строка идентификатора элемента особенности реализации

source: Descriptive name of the implementation information item
ru: Описательное название элемента особенности реализации

source: Value of the implementation information item, or null if the value is contained in the column <literal>character_value</literal>
ru: Значение элемента особенности реализации, либо NULL, если его значение содержится в столбце <literal>character_value</literal>

source: Value of the implementation information item, or null if the value is contained in the column <literal>integer_value</literal>
ru: Значение элемента особенности реализации, либо NULL, если его значение содержится в столбце <literal>integer_value</literal>

source: Possibly a comment pertaining to the implementation information item
ru: Необязательный комментарий, относящийся к элементу особенности реализации

source: The table <literal>sql_languages</literal> contains one row for each SQL language binding that is supported by <productname>PostgreSQL</productname>. <productname>PostgreSQL</productname> supports direct SQL and embedded SQL in C; that is all you will learn from this table.
ru: Таблица <literal>sql_languages</literal> содержит одну строку для каждой привязки языка SQL, поддерживаемой <productname>PostgreSQL</productname>. <productname>PostgreSQL</productname> поддерживает непосредственный SQL и SQL, встроенный в C; это всё, что можно получить из этой таблицы.

source: This table was removed from the SQL standard in SQL:2008, so there are no entries referring to standards later than SQL:2003.
ru: Эта таблица была исключена из стандарта SQL в версии SQL:2008, так что она не содержит записей, относящихся к стандартам новее SQL:2003.

source: <literal>sql_languages</literal> Columns
ru: Столбцы <literal>sql_languages</literal>

source: The name of the source of the language definition; always <literal>ISO 9075</literal>, that is, the SQL standard
ru: Имя источника определения языка; всегда <literal>ISO 9075</literal>, то есть стандарт SQL

source: The year the standard referenced in <literal>sql_language_source</literal> was approved.
ru: Год, в котором был одобрен стандарт, отмеченный в <literal>sql_language_source</literal>.

source: The standard conformance level for the language binding. For ISO 9075:2003 this is always <literal>CORE</literal>.
ru: Уровень совместимости со стандартом для привязки языка. Для ISO 9075:2003 это всегда <literal>CORE</literal>.

source: Always null (This value is relevant to an earlier version of the SQL standard.)
ru: Всегда NULL (Это значение было актуально для более ранней версии стандарта SQL.)

source: Always null
ru: Всегда NULL

source: The language binding style, either <literal>DIRECT</literal> or <literal>EMBEDDED</literal>
ru: Стиль привязки языка: <literal>DIRECT</literal> или <literal>EMBEDDED</literal>

source: The programming language, if the binding style is <literal>EMBEDDED</literal>, else null. <productname>PostgreSQL</productname> only supports the language C.
ru: Язык программирования, если стиль привязки — <literal>EMBEDDED</literal>, иначе NULL. <productname>PostgreSQL</productname> поддерживает только язык C.

source: The table <literal>sql_packages</literal> contains information about which feature packages defined in the SQL standard are supported by <productname>PostgreSQL</productname>. Refer to <xref linkend="features"/> for background information on feature packages.
ru: Таблица <literal>sql_packages</literal> содержит информацию о функциональных пакетах, определённых в стандарте SQL и поддерживаемых <productname>PostgreSQL</productname>. За дополнительными сведениями о функциональных пакетах обратитесь к <xref remap="3" linkend="features"/>.

source: <literal>sql_packages</literal> Columns
ru: Столбцы <literal>sql_packages</literal>

source: Identifier string of the package
ru: Строка идентификатора пакета

source: Descriptive name of the package
ru: Описательное название пакета

source: <literal>YES</literal> if the package is fully supported by the current version of <productname>PostgreSQL</productname>, <literal>NO</literal> if not
ru: <literal>YES</literal>, если пакет полностью поддерживается текущей версией <productname>PostgreSQL</productname>, либо <literal>NO</literal> в противном случае

source: Possibly a comment about the supported status of the package
ru: Необязательный комментарий о поддерживаемом состоянии пакета

source: The table <literal>sql_parts</literal> contains information about which of the several parts of the SQL standard are supported by <productname>PostgreSQL</productname>.
ru: Таблица <literal>sql_parts</literal> содержит информацию о различных частях стандарта SQL, поддерживаемых <productname>PostgreSQL</productname>.

source: <literal>sql_parts</literal> Columns
ru: Столбцы <literal>sql_parts</literal>

source: An identifier string containing the number of the part
ru: Строка идентификатора, содержащая номер части

source: Descriptive name of the part
ru: Описательное название части

source: <literal>YES</literal> if the part is fully supported by the current version of <productname>PostgreSQL</productname>, <literal>NO</literal> if not
ru: <literal>YES</literal>, если часть полностью поддерживается текущей версией <productname>PostgreSQL</productname>, либо <literal>NO</literal> в противном случае

source: Possibly a comment about the supported status of the part
ru: Необязательный комментарий о поддерживаемом состоянии части

source: The table <literal>sql_sizing</literal> contains information about various size limits and maximum values in <productname>PostgreSQL</productname>. This information is primarily intended for use in the context of the ODBC interface; users of other interfaces will probably find this information to be of little use. For this reason, the individual sizing items are not described here; you will find them in the description of the ODBC interface.
ru: Таблица <literal>sql_sizing</literal> содержит информацию о различных ограничениях размера и максимальных значениях в <productname>PostgreSQL</productname>. Эта информация в основном предназначена для применения в контексте интерфейса ODBC; пользователям других интерфейсов она вряд ли будет нужна. Поэтому отдельные элементы размеров здесь не описываются; о них можно прочитать в описании интерфейса ODBC.

source: <literal>sql_sizing</literal> Columns
ru: Столбцы <literal>sql_sizing</literal>

source: Identifier of the sizing item
ru: Идентификатор элемента размеров

source: Descriptive name of the sizing item
ru: Описательное название элемента размеров
