Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/information_schema.po
Languages: ru

source: The Information Schema
ru: Информационная схема

source: <primary>information schema</primary>
ru: <primary>информационная схема</primary>

source: The information schema consists of a set of views that contain information about the objects defined in the current database. The information schema is defined in the SQL standard and can therefore be expected to be portable and remain stable &mdash; unlike the system catalogs, which are specific to <productname>PostgreSQL</productname> and are modeled after implementation concerns. The information schema views do not, however, contain information about <productname>PostgreSQL</productname>-specific features; to inquire about those you need to query the system catalogs or other <productname>PostgreSQL</productname>-specific views.
ru: Информационная схема состоит из набора представлений, содержащих информацию об объектах, определённых в текущей базе данных. Информационная схема описана в стандарте SQL и поэтому можно рассчитывать на её переносимость и стабильность &mdash; в отличие от системных каталогов, которые привязаны к <productname>PostgreSQL</productname>, и моделируются, отталкиваясь от реализации. Представления информационной схемы, однако, не содержат информацию о функциях, присущих исключительно <productname>PostgreSQL</productname>; чтобы получить информацию о них, необходимо обратиться к системным каталогам или другим специфическим представлениям <productname>PostgreSQL</productname>.

source: When querying the database for constraint information, it is possible for a standard-compliant query that expects to return one row to return several. This is because the SQL standard requires constraint names to be unique within a schema, but <productname>PostgreSQL</productname> does not enforce this restriction. <productname>PostgreSQL</productname> automatically-generated constraint names avoid duplicates in the same schema, but users can specify such duplicate names.
ru: Когда из базы данных запрашивается информация об ограничениях, возможна ситуация, когда соответствующий стандарту запрос, который должен возвращать одну строку, возвращает несколько. Это связано с тем, что стандарт SQL требует, чтобы имена ограничений были уникальными в схеме, но в <productname>PostgreSQL</productname> такого требования нет. Имена ограничений, которые <productname>PostgreSQL</productname> генерирует автоматически, не должны дублироваться в одной схеме, но сами пользователи могут назначить подобные дублирующиеся имена.

source: This problem can appear when querying information schema views such as <literal>check_constraint_routine_usage</literal>, <literal>check_constraints</literal>, <literal>domain_constraints</literal>, and <literal>referential_constraints</literal>. Some other views have similar issues but contain the table name to help distinguish duplicate rows, e.g., <literal>constraint_column_usage</literal>, <literal>constraint_table_usage</literal>, <literal>table_constraints</literal>.
ru: Эта проблема может проявиться при обращении к таким представлениям информационной схемы, как <literal>check_constraint_routine_usage</literal>, <literal>check_constraints</literal>, <literal>domain_constraints</literal> и <literal>referential_constraints</literal>. В некоторых других представлениях она могла бы тоже иметь место, но они содержат имя таблицы, помогающее различить дублирующиеся строки, например: <literal>constraint_column_usage</literal>, <literal>constraint_table_usage</literal>, <literal>table_constraints</literal>.

source: The Schema
ru: Схема

source: The information schema itself is a schema named <literal>information_schema</literal>. This schema automatically exists in all databases. The owner of this schema is the initial database user in the cluster, and that user naturally has all the privileges on this schema, including the ability to drop it (but the space savings achieved by that are minuscule).
ru: Информационная схема сама по себе — это схема с именем <literal>information_schema</literal>. Данная схема автоматически доступна во всех базах данных. Владельцем этой схемы является начальный пользователь баз данных в кластере, и этот пользователь, естественно, имеет все права в ней, включая возможность её удалить (хотя достигаемая при этом экономия пространства минимальна).

source: By default, the information schema is not in the schema search path, so you need to access all objects in it through qualified names. Since the names of some of the objects in the information schema are generic names that might occur in user applications, you should be careful if you want to put the information schema in the path.
ru: По умолчанию информационная схема отсутствует в пути поиска схем, так что ко всем объектам в ней нужно обращаться по полным именам. Так как имена некоторых объектов в информационной схеме довольно распространённые и могут встречаться и в пользовательских приложениях, будьте осторожны, добавляя информационную схему в путь поиска.

source: Data Types
ru: Типы данных

source: The columns of the information schema views use special data types that are defined in the information schema. These are defined as simple domains over ordinary built-in types. You should not use these types for work outside the information schema, but your applications must be prepared for them if they select from the information schema.
ru: Столбцы в представлениях информационной схемы имеют специальные типы данных, определённые в информационной схеме. Они определены как простые домены поверх обычных встроенных типов. Задействовать эти типы вне информационной схемы не следует, но тем не менее, приложения, выбирающие данные из информационной схеме должны быть готовы работать с ними.

source: A nonnegative integer.
ru: Неотрицательное целое.

source: A character string (without specific maximum length).
ru: Строка символов (без определённого ограничения по длине).

source: A character string. This type is used for SQL identifiers, the type <type>character_data</type> is used for any other kind of text data.
ru: Строка символов. Этот тип применяется для идентификаторов SQL, тогда как тип <type>character_data</type> для всех остальных видов текстовых данных.

source: A domain over the type <type>timestamp with time zone</type>
ru: Домен на базе типа <type>timestamp with time zone</type>

source: A character string domain that contains either <literal>YES</literal> or <literal>NO</literal>. This is used to represent Boolean (true/false) data in the information schema. (The information schema was invented before the type <type>boolean</type> was added to the SQL standard, so this convention is necessary to keep the information schema backward compatible.)
ru: Домен символьной строки, который принимает либо <literal>YES</literal>, либо <literal>NO</literal>. Этот домен применяется для представления булевых данных (истина/ложь, true/false) в информационной схеме. (Информационная схема была введена до появления в стандарте SQL типа <type>boolean</type>, поэтому данный домен необходим для сохранения обратной совместимости информационной схемы.)

source: These types are: <placeholder-1/> Every column in the information schema has one of these five types.
ru: Это следующие типы: <placeholder-1/> Все столбцы в информационной схеме имеют один из этих пяти типов.

source: <literal>information_schema_catalog_name</literal> is a table that always contains one row and one column containing the name of the current database (current catalog, in SQL terminology).
ru: Таблица <literal>information_schema_catalog_name</literal> всегда содержит одну строку и один столбец с именем текущей базы данных (текущий каталог, в терминологии SQL).

source: <literal>information_schema_catalog_name</literal> Columns
ru: Столбцы <literal>information_schema_catalog_name</literal>

source: Name
ru: Имя

source: Data Type
ru: Тип данных

source: Description
ru: Описание

source: Name of the database that contains this information schema
ru: Имя базы данных, содержащей эту информационную схему

source: The view <literal>administrable_role_authorizations</literal> identifies all roles that the current user has the admin option for.
ru: Представление <literal>administrable_role_authorizations</literal> описывает все роли, для которых текущий пользователь является администратором.

source: <literal>administrable_role_authorizations</literal> Columns
ru: Столбцы <literal>administrable_role_authorizations</literal>

source: Name of the role to which this role membership was granted (can be the current user, or a different role in case of nested role memberships)
ru: Имя роли, которой было разрешено участие в целевой роли (может быть текущий пользователь, либо другая роль, в случае вложенного членства)

source: Name of a role
ru: Имя целевой роли

source: Always <literal>YES</literal>
ru: Всегда <literal>YES</literal>

source: <primary>applicable role</primary>
ru: <primary>применимая роль</primary>

source: <primary>role</primary><secondary>applicable</secondary>
ru: <primary>роль</primary> <secondary>применимая</secondary>

source: The view <literal>applicable_roles</literal> identifies all roles whose privileges the current user can use. This means there is some chain of role grants from the current user to the role in question. The current user itself is also an applicable role. The set of applicable roles is generally used for permission checking. <placeholder-1/> <placeholder-2/>
ru: Представление <literal>applicable_roles</literal> описывает все роли, права которых может использовать текущий пользователь. Это означает, что существует некоторая цепочка ролей от текущего пользователя к целевой роли. Роль самого пользователя также считается применимой. Набор применимых ролей обычно используется для проверки разрешений. <placeholder-1/> <placeholder-2/>

source: <literal>applicable_roles</literal> Columns
ru: Столбцы <literal>applicable_roles</literal>

source: <literal>YES</literal> if the grantee has the admin option on the role, <literal>NO</literal> if not
ru: <literal>YES</literal>, если субъект является администратором для этой роли, или <literal>NO</literal> в противном случае

source: The view <literal>attributes</literal> contains information about the attributes of composite data types defined in the database. (Note that the view does not give information about table columns, which are sometimes called attributes in PostgreSQL contexts.) Only those attributes are shown that the current user has access to (by way of being the owner of or having some privilege on the type).
ru: Представление <literal>attributes</literal> содержит информацию об атрибутах составных типов данных, определённых в базе. (Заметьте, что представление не даёт информацию о столбцах таблицы, которые иногда называются атрибутами в контекстах PostgreSQL.) В нём показываются только те атрибуты, к которым имеет доступ текущий пользователь (являясь владельцем или имея некоторое право для использования типа).

source: <literal>attributes</literal> Columns
ru: Столбцы <literal>attributes</literal>

source: Name of the database containing the data type (always the current database)
ru: Имя базы данных, содержащей тип данных (всегда текущая база)

source: Name of the schema containing the data type
ru: Имя схемы, содержащей тип данных

source: Name of the data type
ru: Имя типа данных

source: Name of the attribute
ru: Имя атрибута

source: Ordinal position of the attribute within the data type (count starts at 1)
ru: Порядковый номер атрибута внутри типа данных (нумерация начинается с 1)

source: Default expression of the attribute
ru: Выражение по умолчанию для атрибута

source: <literal>YES</literal> if the attribute is possibly nullable, <literal>NO</literal> if it is known not nullable.
ru: <literal>YES</literal>, если атрибут может содержать NULL, или <literal>NO</literal>, если он не принимает NULL

source: Data type of the attribute, if it is a built-in type, or <literal>ARRAY</literal> if it is some array (in that case, see the view <literal>element_types</literal>), else <literal>USER-DEFINED</literal> (in that case, the type is identified in <literal>attribute_udt_name</literal> and associated columns).
ru: Тип данных атрибута, если это встроенный тип, либо <literal>ARRAY</literal>, если это массив (в этом случае обратитесь к представлению <literal>element_types</literal>), иначе — <literal>USER-DEFINED</literal> (в этом случае тип определяется в <literal>attribute_udt_name</literal> и связанных столбцах).

source: If <literal>data_type</literal> identifies a character or bit string type, the declared maximum length; null for all other data types or if no maximum length was declared.
ru: Если в <literal>data_type</literal> указан тип текстовой или битовой строки, это поле задаёт её объявленную максимальную длину; NULL для всех других типов данных, либо если максимальная длина не объявлена.

source: If <literal>data_type</literal> identifies a character type, the maximum possible length in octets (bytes) of a datum; null for all other data types. The maximum octet length depends on the declared character maximum length (see above) and the server encoding.
ru: Если в <literal>data_type</literal> указан тип символьной строки, это поле задаёт её максимально возможный размер в октетах (байтах); NULL для всех других типов данных. Максимальный размер в октетах зависит от объявленной максимальной длины в символах (см. выше) и от кодировки сервера.

source: Applies to a feature not available in <productname>PostgreSQL</productname>
ru: Относится к функциональности, отсутствующей в <productname>PostgreSQL</productname>

source: Name of the database containing the collation of the attribute (always the current database), null if default or the data type of the attribute is not collatable
ru: Имя базы данных, содержащей правило сортировки атрибута (это всегда текущая база), либо NULL, если это правило по умолчанию или тип данных атрибута несортируемый

source: Name of the schema containing the collation of the attribute, null if default or the data type of the attribute is not collatable
ru: Имя схемы, содержащей правило сортировки атрибута, либо NULL, если это правило по умолчанию или тип данных атрибута несортируемый

source: Name of the collation of the attribute, null if default or the data type of the attribute is not collatable
ru: Имя правила сортировки атрибута, либо NULL, если это правило по умолчанию или атрибут несортируемый

source: If <literal>data_type</literal> identifies a numeric type, this column contains the (declared or implicit) precision of the type for this attribute. The precision indicates the number of significant digits. It can be expressed in decimal (base 10) or binary (base 2) terms, as specified in the column <literal>numeric_precision_radix</literal>. For all other data types, this column is null.
ru: Если в <literal>data_type</literal> указан числовой тип, этот столбец содержит точность (объявленную или неявную) типа для этого атрибута. Точность определяет число значащих цифр. Она может выражаться в десятичных (по основанию 10) или двоичных (по основанию 2) цифрах, согласно столбцу <literal>numeric_precision_radix</literal>. Для всех других типов данных этот столбец содержит NULL.

source: If <literal>data_type</literal> identifies a numeric type, this column indicates in which base the values in the columns <literal>numeric_precision</literal> and <literal>numeric_scale</literal> are expressed. The value is either 2 or 10. For all other data types, this column is null.
ru: Если в <literal>data_type</literal> указан числовой тип, в этом столбце определяется, по какому основанию задаются значения в столбцах <literal>numeric_precision</literal> и <literal>numeric_scale</literal>. Возможные варианты: 2 или 10. Для всех других типов данных этот столбец содержит NULL.

source: If <literal>data_type</literal> identifies an exact numeric type, this column contains the (declared or implicit) scale of the type for this attribute. The scale indicates the number of significant digits to the right of the decimal point. It can be expressed in decimal (base 10) or binary (base 2) terms, as specified in the column <literal>numeric_precision_radix</literal>. For all other data types, this column is null.
ru: Если в <literal>data_type</literal> указан точный числовой тип, этот столбец содержит масштаб (объявленный или неявный) типа для этого атрибута. Масштаб определяет число значащих цифр справа от десятичной точки. Он может выражаться в десятичных (по основанию 10) или двоичных (по основанию 2) цифрах, согласно столбцу <literal>numeric_precision_radix</literal>. Для всех других типов данных этот столбец содержит NULL.

source: If <literal>data_type</literal> identifies a date, time, timestamp, or interval type, this column contains the (declared or implicit) fractional seconds precision of the type for this attribute, that is, the number of decimal digits maintained following the decimal point in the seconds value. For all other data types, this column is null.
ru: Если в <literal>data_type</literal> указан тип даты, времени, отметки времени или интервала, этот столбец содержит точность (объявленную или неявную) в долях секунды типа этого атрибута, то есть число десятичных цифр, сохраняемых после десятичной точки в значении секунд. Для всех других типов данных этот столбец содержит NULL.

source: If <literal>data_type</literal> identifies an interval type, this column contains the specification which fields the intervals include for this attribute, e.g., <literal>YEAR TO MONTH</literal>, <literal>DAY TO SECOND</literal>, etc. If no field restrictions were specified (that is, the interval accepts all fields), and for all other data types, this field is null.
ru: Если в <literal>data_type</literal> указан тип интервала, этот столбец определяет, какие поля принимает интервал в этом атрибуте, например: <literal>YEAR TO MONTH</literal>, <literal>DAY TO SECOND</literal> и т. д. Если ограничения для полей не заданы (то есть, интервал принимает все поля), и для любых других типов данных это поле содержит NULL.

source: Applies to a feature not available in <productname>PostgreSQL</productname> (see <literal>datetime_precision</literal> for the fractional seconds precision of interval type attributes)
ru: Относится к функциональности, отсутствующей в <productname>PostgreSQL</productname> (см. поле <literal>datetime_precision</literal>, определяющее точность в долях секунды для типов интервалов)

source: Name of the database that the attribute data type is defined in (always the current database)
ru: Имя базы данных, в которой определён тип данных атрибута (всегда текущая база)

source: Name of the schema that the attribute data type is defined in
ru: Имя схемы, в которой определён тип данных атрибута

source: Name of the attribute data type
ru: Имя типа данных атрибута

source: Always null, because arrays always have unlimited maximum cardinality in <productname>PostgreSQL</productname>
ru: Всегда NULL, так как массивы имеют неограниченную максимальную ёмкость в <productname>PostgreSQL</productname>

source: An identifier of the data type descriptor of the column, unique among the data type descriptors pertaining to the table. This is mainly useful for joining with other instances of such identifiers. (The specific format of the identifier is not defined and not guaranteed to remain the same in future versions.)
ru: Идентификатор дескриптора типа данных столбца, уникальный среди всех дескрипторов типов, относящихся к таблице. Он в основном полезен для соединения с другими экземплярами таких идентификаторов. (Конкретный формат идентификатора не определён и не гарантируется, что он останется неизменным в будущих версиях.)

source: See also under <xref linkend="infoschema-columns"/>, a similarly structured view, for further information on some of the columns.
ru: Обратитесь также к описанию <xref linkend="infoschema-columns"/>, представлению с похожей структурой, за дополнительной информацией о некоторых столбцах.

source: The view <literal>character_sets</literal> identifies the character sets available in the current database. Since PostgreSQL does not support multiple character sets within one database, this view only shows one, which is the database encoding.
ru: Представление <literal>character_sets</literal> описывает наборы символов, доступные в текущей базе данных. Так как PostgreSQL не поддерживает несколько наборов символов в одной базе данных, этот набор показывает только один набор, соответствующий кодировке базы.

source: character repertoire
ru: совокупность символов

source: An abstract collection of characters, for example <literal>UNICODE</literal>, <literal>UCS</literal>, or <literal>LATIN1</literal>. Not exposed as an SQL object, but visible in this view.
ru: Абстрактная коллекция символов, например <literal>UNICODE</literal>, <literal>UCS</literal> или <literal>LATIN1</literal>. Не существует в виде SQL-объекта, но показывается в этом представлении.

source: character encoding form
ru: форма кодировки символов

source: An encoding of some character repertoire. Most older character repertoires only use one encoding form, and so there are no separate names for them (e.g., <literal>LATIN1</literal> is an encoding form applicable to the <literal>LATIN1</literal> repertoire). But for example Unicode has the encoding forms <literal>UTF8</literal>, <literal>UTF16</literal>, etc. (not all supported by PostgreSQL). Encoding forms are not exposed as an SQL object, but are visible in this view.
ru: Кодировка некоторой совокупности символов. Для большинства устаревших совокупностей используется только одна кодировка, так что эта кодировка не имеет отдельного имени (например, <literal>LATIN1</literal> — форма кодировки, применимая к совокупности <literal>LATIN1</literal>). Но например, Unicode имеет формы кодировки <literal>UTF8</literal>, <literal>UTF16</literal> и т. д. (не все они поддерживаются в PostgreSQL). Формы кодировки не существуют в виде SQL-объектов, но показываются в этом представлении.

source: character set
ru: набор символов

source: A named SQL object that identifies a character repertoire, a character encoding, and a default collation. A predefined character set would typically have the same name as an encoding form, but users could define other names. For example, the character set <literal>UTF8</literal> would typically identify the character repertoire <literal>UCS</literal>, encoding form <literal>UTF8</literal>, and some default collation.
ru: Именованный SQL-объект, определяющий совокупность и кодировку символов, а также правило сортировки по умолчанию. Предопределённый набор символов обычно называется так же, как форма кодировки, но пользователи могут определить другие имена. Например, набору символов <literal>UTF8</literal> обычно соответствует совокупность символов <literal>UCS</literal>, форма кодировки <literal>UTF8</literal> и некоторое правило сортировки по умолчанию.

source: Take note of how the following terms are used in the SQL standard: <placeholder-1/> You can think of an <quote>encoding</quote> in PostgreSQL either as a character set or a character encoding form. They will have the same name, and there can only be one in one database.
ru: Примите к сведению следующие термины, принятые в стандарте SQL: <placeholder-1/> Вы можете считать, что <quote>кодировка</quote> в PostgreSQL определяет набор или форму кодировки символов. Она имеет такое же имя и может быть только одной в определённой базе.

source: <literal>character_sets</literal> Columns
ru: Столбцы <literal>character_sets</literal>

source: Character sets are currently not implemented as schema objects, so this column is null.
ru: Наборы символов в настоящее время не представлены в виде объектов схемы, так что этот столбец содержит NULL.
