Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/logical-replication.po
Languages: ru

source: The database schema and DDL commands are not replicated. The initial schema can be copied by hand using <literal>pg_dump --schema-only</literal>. Subsequent schema changes would need to be kept in sync manually. (Note, however, that there is no need for the schemas to be absolutely the same on both sides.) Logical replication is robust when schema definitions change in a live database: When the schema is changed on the publisher and replicated data starts arriving at the subscriber but does not fit into the table schema, replication will error until the schema is updated. In many cases, intermittent errors can be avoided by applying additive schema changes to the subscriber first.
ru: Схема базы данных и команды DDL не реплицируются. Изначальную схему можно скопировать, воспользовавшись командой <literal>pg_dump --schema-only</literal>. Последующие изменения схемы необходимо будет синхронизировать вручную. (Заметьте, однако, что схемы не обязательно должны быть абсолютно идентичными на обеих сторонах репликации.) Если определения схемы в исходной базе данных меняются, логическая репликация работает надёжно — когда данные после изменения схемы прибывают на сторону подписчика, но не вписываются в схему его таблиц, выдаётся ошибка, требующая обновления схемы. Во многих случаях возникновение таких ошибок можно предупредить, сначала применяя дополняющие изменения на подписчике.

source: Sequence data is not replicated. The data in serial or identity columns backed by sequences will of course be replicated as part of the table, but the sequence itself would still show the start value on the subscriber. If the subscriber is used as a read-only database, then this should typically not be a problem. If, however, some kind of switchover or failover to the subscriber database is intended, then the sequences would need to be updated to the latest values, either by copying the current data from the publisher (perhaps using <command>pg_dump</command>) or by determining a sufficiently high value from the tables themselves.
ru: Данные последовательностей не реплицируются. Данные в столбцах serial или столбцах идентификации, выдаваемые последовательностями, конечно, будут реплицированы в составе таблицы, но сама последовательность на подписчике будет сохранять стартовое значение. Если подписчик используется в качестве базы только для чтения, обычно это не является проблемой. Если же, однако, предусматривается возможность переключения на базу подписчика некоторым образом, текущие значения в этих последовательностях нужно будет обновить, либо скопировав текущие данные из базы публикации (вероятно, с применением <command>pg_dump</command>), либо выбрав достаточно большие значения из самих таблиц.

source: <command>TRUNCATE</command> commands are not replicated. This can, of course, be worked around by using <command>DELETE</command> instead. To avoid accidental <command>TRUNCATE</command> invocations, you can revoke the <literal>TRUNCATE</literal> privilege from tables.
ru: Команды <command>TRUNCATE</command> не реплицируются. Разумеется, это можно обойти, выполняя вместо них команды <command>DELETE</command>. Чтобы предотвратить случайное выполнение <command>TRUNCATE</command>, вы можете отозвать право <literal>TRUNCATE</literal> для реплицируемых таблиц.

source: Large objects (see <xref linkend="largeobjects"/>) are not replicated. There is no workaround for that, other than storing data in normal tables.
ru: Большие объекты (см. <xref remap="4" linkend="largeobjects"/>) не реплицируются. Это ограничение нельзя обойти никак, кроме как хранить данные в обычных таблицах.

source: Replication is only possible from base tables to base tables. That is, the tables on the publication and on the subscription side must be normal tables, not views, materialized views, partition root tables, or foreign tables. In the case of partitions, you can therefore replicate a partition hierarchy one-to-one, but you cannot currently replicate to a differently partitioned setup. Attempts to replicate tables other than base tables will result in an error.
ru: Реплицировать данные возможно только из базовых таблиц в базовые таблицы. То есть таблицы на стороне публикации и на стороне подписки должны быть обычными, а не представлениями, мат. представлениями, секционированными или сторонними таблицами. Это означает, что вы можете реплицировать секции одну в одну, но реплицировать данные в таблицы, секционированные по-другому, нельзя. При попытке реплицировать таблицы, отличные от базовых, будет выдана ошибка.

source: Architecture
ru: Архитектура

source: Logical replication starts by copying a snapshot of the data on the publisher database. Once that is done, changes on the publisher are sent to the subscriber as they occur in real time. The subscriber applies data in the order in which commits were made on the publisher so that transactional consistency is guaranteed for the publications within any single subscription.
ru: Логическая репликация начинается с копирования снимка данных в базе данных публикации. По завершении этой операции изменения на стороне публикации передаются подписчику в реальном времени, когда они происходят. Подписчик применяет изменения в том же порядке, в каком они вносятся на узле публикации, так что для публикаций в рамках одной подписки гарантируется транзакционная целостность.

source: Logical replication is built with an architecture similar to physical streaming replication (see <xref linkend="streaming-replication"/>). It is implemented by <quote>walsender</quote> and <quote>apply</quote> processes. The walsender process starts logical decoding (described in <xref linkend="logicaldecoding"/>) of the WAL and loads the standard logical decoding plugin (pgoutput). The plugin transforms the changes read from WAL to the logical replication protocol (see <xref linkend="protocol-logical-replication"/>) and filters the data according to the publication specification. The data is then continuously transferred using the streaming replication protocol to the apply worker, which maps the data to local tables and applies the individual changes as they are received, in correct transactional order.
ru: Логическая репликация построена по схеме, подобной физической потоковой репликации (см. <xref remap="4" linkend="streaming-replication"/>). Она реализуется процессами <quote>walsender</quote> (передачи WAL) и <quote>apply</quote> (применения). Процесс walsender запускает логическое декодирование (описанное в <xref remap="6" linkend="logicaldecoding"/>) WAL и загружает стандартный модуль логического декодирования (pgoutput). Этот модуль преобразует изменения, считываемые из WAL, в протокол логической репликации (см. <xref remap="4" linkend="protocol-logical-replication"/>) и отфильтровывает данные согласно спецификации публикации. Затем данные последовательно передаются по протоколу логической репликации рабочему процессу применения изменений, который сопоставляет данные с логическими таблицами и применяет отдельные изменения по мере их поступления, сохраняя транзакционный порядок.

source: The apply process on the subscriber database always runs with <varname>session_replication_role</varname> set to <literal>replica</literal>, which produces the usual effects on triggers and constraints.
ru: Процесс применения изменений в базе данных подписчика всегда выполняется со значением <varname>session_replication_role</varname>, равным <literal>replica</literal>, что влечёт соответствующие эффекты для триггеров и ограничений.

source: The logical replication apply process currently only fires row triggers, not statement triggers. The initial table synchronization, however, is implemented like a <command>COPY</command> command and thus fires both row and statement triggers for <command>INSERT</command>.
ru: Процесс применения логической репликации в настоящее время вызывает только триггеры уровня строк, но не триггеры операторов. Однако начальная синхронизация таблицы реализована как команда <command>COPY</command> и поэтому вызывает триггеры для <command>INSERT</command> и уровня строк, и уровня оператора.

source: Initial Snapshot
ru: Начальный снимок

source: The initial data in existing subscribed tables are snapshotted and copied in a parallel instance of a special kind of apply process. This process will create its own temporary replication slot and copy the existing data. Once existing data is copied, the worker enters synchronization mode, which ensures that the table is brought up to a synchronized state with the main apply process by streaming any changes that happened during the initial data copy using standard logical replication. Once the synchronization is done, the control of the replication of the table is given back to the main apply process where the replication continues as normal.
ru: Начальные данные существующих таблиц в подписке помещаются в снимок и копируются в параллельном экземпляре процесса применения особого вида. Этот процесс создаёт собственный слот репликации и производит копирование существующих данных. Когда существующие данные будут скопированы, этот рабочий процесс переходит в режим синхронизации, в котором таблица приводится в синхронизированное состояние для основного процесса применения, то есть передаёт все изменения, произошедшие во время начального копирования данных, используя стандартную логическую репликацию. По завершении синхронизации управление репликацией этой таблицы возвращается главному процессу, который продолжает репликацию в обычном режиме.

source: Monitoring
ru: Мониторинг

source: Because logical replication is based on a similar architecture as <link linkend="streaming-replication">physical streaming replication</link>, the monitoring on a publication node is similar to monitoring of a physical replication master (see <xref linkend="streaming-replication-monitoring"/>).
ru: Так как логическая репликация построена по схеме, подобной <link linkend="streaming-replication">физической потоковой репликации</link>, мониторинг публикующего узла подобен мониторингу ведущего сервера при физической репликации (см. <xref remap="4" linkend="streaming-replication-monitoring"/>).

source: The monitoring information about subscription is visible in <link linkend="pg-stat-subscription"><literal>pg_stat_subscription</literal></link>. This view contains one row for every subscription worker. A subscription can have zero or more active subscription workers depending on its state.
ru: Информацию о подписке для мониторинга можно получить в представлении <link linkend="pg-stat-subscription"><literal>pg_stat_subscription</literal></link>. Это представление содержит по одной строке для каждого рабочего процесса подписчика. В зависимости от состояния подписки, с ней может быть связано ноль или более активных рабочих процессов.

source: Normally, there is a single apply process running for an enabled subscription. A disabled subscription or a crashed subscription will have zero rows in this view. If the initial data synchronization of any table is in progress, there will be additional workers for the tables being synchronized.
ru: Обычно для включённой подписки работает только один процесс применения. Для отключённой или нарушенной подписки это представление будет содержать ноль строк. Если выполняется начальная синхронизация данных для каких-либо таблиц, для этих таблиц будут показаны дополнительные рабочие процессы, производящие синхронизацию.

source: Security
ru: Безопасность

source: The role used for the replication connection must have the <literal>REPLICATION</literal> attribute (or be a superuser). Access for the role must be configured in <filename>pg_hba.conf</filename>.
ru: Роль, используемая для подключения репликации, должна иметь атрибут <literal>REPLICATION</literal> (или быть суперпользователем). Доступ для этой роли должен быть настроен в <filename>pg_hba.conf</filename>.

source: To create a publication, the user must have the <literal>CREATE</literal> privilege in the database.
ru: Чтобы создать публикацию, пользователь должен иметь право <literal>CREATE</literal> в базе данных.

source: To add tables to a publication, the user must have ownership rights on the table. To create a publication that publishes all tables automatically, the user must be a superuser.
ru: Чтобы добавлять таблицы в публикацию, пользователь должен иметь права владельца для этих таблиц. Создавать публикации, публикующие все таблицы автоматически, разрешено только суперпользователям.

source: To create a subscription, the user must be a superuser.
ru: Создавать подписки разрешено только суперпользователям.

source: The subscription apply process will run in the local database with the privileges of a superuser.
ru: Процесс применения изменений подписки будет выполняться в локальной базе с правами суперпользователя.

source: Privileges are only checked once at the start of a replication connection. They are not re-checked as each change record is read from the publisher, nor are they re-checked for each change when applied.
ru: Права проверяются только один раз при установлении подключения для репликации. Они не перепроверяются при чтении каждой записи изменения с публикующего сервера и не перепроверяются при применении каждого изменения.

source: Configuration Settings
ru: Параметры конфигурации

source: Logical replication requires several configuration options to be set.
ru: Для осуществления логической репликации необходимо установить несколько параметров конфигурации.

source: On the publisher side, <varname>wal_level</varname> must be set to <literal>logical</literal>, and <varname>max_replication_slots</varname> must be set to at least the number of subscriptions expected to connect, plus some reserve for table synchronization. And <varname>max_wal_senders</varname> should be set to at least the same as <varname>max_replication_slots</varname> plus the number of physical replicas that are connected at the same time.
ru: На публикующем сервере параметр <varname>wal_level</varname> должен иметь значение <literal>logical</literal>, а в <varname>max_replication_slots</varname> должно быть задано число не меньше ожидаемого числа подписчиков плюс некоторый резерв для синхронизации таблиц. А в <varname>max_wal_senders</varname> должно быть значение как минимум равное <varname>max_replication_slots</varname> плюс число возможных физических реплик, работающих одновременно.

source: The subscriber also requires the <varname>max_replication_slots</varname> to be set. In this case it should be set to at least the number of subscriptions that will be added to the subscriber. <varname>max_logical_replication_workers</varname> must be set to at least the number of subscriptions, again plus some reserve for the table synchronization. Additionally the <varname>max_worker_processes</varname> may need to be adjusted to accommodate for replication workers, at least (<varname>max_logical_replication_workers</varname> + <literal>1</literal>). Note that some extensions and parallel queries also take worker slots from <varname>max_worker_processes</varname>.
ru: Также на стороне подписчика необходимо установить параметр <varname>max_replication_slots</varname>. В данном случае он должен быть не меньше числа подписок, на которые будет подписываться данный подписчик. В <varname>max_logical_replication_workers</varname> необходимо установить минимум число подписок плюс некоторый резерв для синхронизации таблиц. Кроме того, может потребоваться изменить <varname>max_worker_processes</varname>, чтобы это число включало дополнительные рабочие процессы для репликации (как минимум <varname>max_logical_replication_workers</varname> + <literal>1</literal>). Заметьте, что некоторые расширения и параллельные запросы также занимают слоты из числа <varname>max_worker_processes</varname>.

source: Quick Setup
ru: Быстрая настройка

source: First set the configuration options in <filename>postgresql.conf</filename>: <placeholder-1/> The other required settings have default values that are sufficient for a basic setup.
ru: Сначала установите параметры конфигурации в <filename>postgresql.conf</filename>: <placeholder-1/> Другие необходимые параметры по умолчанию имеют значения, подходящие для базовой настройки.

source: <filename>pg_hba.conf</filename> needs to be adjusted to allow replication (the values here depend on your actual network configuration and user you want to use for connecting): <placeholder-1/>
ru: В файл <filename>pg_hba.conf</filename> необходимо внести изменения, чтобы разрешить репликацию (конкретные значения будут зависеть от фактической конфигурации сети и имени пользователя, с которым вы будете подключаться): <placeholder-1/>

source: Then on the publisher database: <placeholder-1/>
ru: Затем в базе данных публикации выполните: <placeholder-1/>

source: And on the subscriber database: <placeholder-1/>
ru: И в базе данных подписчика: <placeholder-1/>

source: The above will start the replication process, which synchronizes the initial table contents of the tables <literal>users</literal> and <literal>departments</literal> and then starts replicating incremental changes to those tables.
ru: Показанная выше команда запустит процесс репликации, который вначале синхронизирует исходное содержимого таблиц <literal>users</literal> и <literal>departments</literal>, а затем начнёт перенос инкрементальных изменений в этих таблицах.
