Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/logical-replication.po
Languages: ru

source: Logical Replication
ru: Логическая репликация

source: Logical replication is a method of replicating data objects and their changes, based upon their replication identity (usually a primary key). We use the term logical in contrast to physical replication, which uses exact block addresses and byte-by-byte replication. PostgreSQL supports both mechanisms concurrently, see <xref linkend="high-availability"/>. Logical replication allows fine-grained control over both data replication and security.
ru: Логическая репликация — это метод репликации объектов данных и изменений в них, использующий репликационные идентификаторы (обычно это первичный ключ). Мы называем такую репликацию «логической», в отличие от физической, которая построена на точных адресах блоков и побайтовом копировании. PostgreSQL поддерживает оба механизма одновременно; см. <xref remap="4" linkend="high-availability"/>. Логическая репликация позволяет более детально управлять репликацией данных и аспектами безопасности.

source: Logical replication uses a <firstterm>publish</firstterm> and <firstterm>subscribe</firstterm> model with one or more <firstterm>subscribers</firstterm> subscribing to one or more <firstterm>publications</firstterm> on a <firstterm>publisher</firstterm> node. Subscribers pull data from the publications they subscribe to and may subsequently re-publish data to allow cascading replication or more complex configurations.
ru: В логической репликации используется модель <firstterm>публикаций</firstterm>/<firstterm>подписок</firstterm> с одним или несколькими <firstterm>подписчиками</firstterm>, которые подписываются на одну или несколько <firstterm>публикаций</firstterm> на <firstterm>публикующем</firstterm> узле. Подписчики получают данные из публикаций, на которые они подписаны, и могут затем повторно опубликовать данные для организации каскадной репликации или более сложных конфигураций.

source: Logical replication of a table typically starts with taking a snapshot of the data on the publisher database and copying that to the subscriber. Once that is done, the changes on the publisher are sent to the subscriber as they occur in real-time. The subscriber applies the data in the same order as the publisher so that transactional consistency is guaranteed for publications within a single subscription. This method of data replication is sometimes referred to as transactional replication.
ru: Логическая репликация таблицы обычно начинается с создания снимка данных в публикуемой базе данных и копирования её подписчику. После этого изменения на стороне публикации передаются подписчику в реальном времени, когда они происходят. Подписчик применяет изменения в том же порядке, что и узел публикации, так что для публикаций в рамках одной подписки гарантируется транзакционная целостность. Этот метод репликации данных иногда называется транзакционной репликацией.

source: Sending incremental changes in a single database or a subset of a database to subscribers as they occur.
ru: Передача подписчикам инкрементальных изменений в одной базе данных или подмножестве базы данных, когда они происходят.

source: Firing triggers for individual changes as they arrive on the subscriber.
ru: Срабатывание триггеров для отдельных изменений, когда их получает подписчик.

source: Consolidating multiple databases into a single one (for example for analytical purposes).
ru: Объединение нескольких баз данных в одну (например, для целей анализа).

source: Replicating between different major versions of PostgreSQL.
ru: Репликация между разными основными версиями PostgreSQL.

source: Giving access to replicated data to different groups of users.
ru: Предоставление доступа к реплицированным данным другим группам пользователей.

source: Sharing a subset of the database between multiple databases.
ru: Разделение подмножества базы данных между несколькими базами данных.

source: The typical use-cases for logical replication are: <placeholder-1/>
ru: Типичные сценарии использования логической репликации: <placeholder-1/>

source: The subscriber database behaves in the same way as any other PostgreSQL instance and can be used as a publisher for other databases by defining its own publications. When the subscriber is treated as read-only by application, there will be no conflicts from a single subscription. On the other hand, if there are other writes done either by an application or by other subscribers to the same set of tables, conflicts can arise.
ru: База данных подписчика функционирует так же, как и любой другой экземпляр базы PostgreSQL, и может стать публикующей, если создать публикации в ней. Когда подписчик действует как исключительно читающее приложение, никаких конфликтов с одной подпиской не будет. Но они могут возникнуть, если в тот же набор таблиц производят запись какие-либо приложения или другие подписчики.

source: Publication
ru: Публикация

source: A <firstterm>publication</firstterm> can be defined on any physical replication master. The node where a publication is defined is referred to as <firstterm>publisher</firstterm>. A publication is a set of changes generated from a table or a group of tables, and might also be described as a change set or replication set. Each publication exists in only one database.
ru: <firstterm>Публикация</firstterm> может быть определена на любом ведущем сервере физической репликации. Сервер, на котором определяется публикация, называется <firstterm>публикующим</firstterm>. Публикация — это набор изменений, выделяемых в таблице или в группе таблиц (он также может называться набором репликации). Публикация существует только в одной базе данных.

source: Publications are different from schemas and do not affect how the table is accessed. Each table can be added to multiple publications if needed. Publications may currently only contain tables. Objects must be added explicitly, except when a publication is created for <literal>ALL TABLES</literal>.
ru: Публикации отличаются от схем и они никак не влияют на доступ к таблице. Если требуется, каждую таблицу можно включить в несколько публикаций. В настоящее время публикации могут содержать только таблицы. Объекты в них нужно добавлять явным образом, если только публикация не создана для всех таблиц (с указанием <literal>ALL TABLES</literal>).

source: Publications can choose to limit the changes they produce to any combination of <command>INSERT</command>, <command>UPDATE</command>, and <command>DELETE</command>, similar to how triggers are fired by particular event types. By default, all operation types are replicated.
ru: Публикации могут ограничивать набор публикуемых изменений, выбирая любое сочетание операций из <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command>, подобно тому как триггеры могут срабатывать для разных типов событий. По умолчанию реплицируются все типы операций.

source: A published table must have a <quote>replica identity</quote> configured in order to be able to replicate <command>UPDATE</command> and <command>DELETE</command> operations, so that appropriate rows to update or delete can be identified on the subscriber side. By default, this is the primary key, if there is one. Another unique index (with certain additional requirements) can also be set to be the replica identity. If the table does not have any suitable key, then it can be set to replica identity <quote>full</quote>, which means the entire row becomes the key. This, however, is very inefficient and should only be used as a fallback if no other solution is possible. If a replica identity other than <quote>full</quote> is set on the publisher side, a replica identity comprising the same or fewer columns must also be set on the subscriber side. See <xref linkend="sql-createtable-replica-identity"/> for details on how to set the replica identity. If a table without a replica identity is added to a publication that replicates <command>UPDATE</command> or <command>DELETE</command> operations then subsequent <command>UPDATE</command> or <command>DELETE</command> operations will cause an error on the publisher. <command>INSERT</command> operations can proceed regardless of any replica identity.
ru: Чтобы можно было реплицировать операции <command>UPDATE</command> и <command>DELETE</command>, в публикуемой таблице должен быть настроен <quote>репликационный идентификатор</quote> для нахождения соответствующих строк для изменения или удаления на стороне подписчика. По умолчанию это первичный ключ, если он создан. Также репликационным идентификатором можно назначить другой уникальный индекс (с некоторыми дополнительными условиями). Если в таблице нет подходящего ключа, в качестве репликационного идентификатора можно задать <quote>full</quote>, что будет означать, что ключом будет вся строка. Это, однако, очень неэффективно и должно применяться как крайняя мера, если другого решения нет. Если на стороне публикации выбран репликационный идентификатор, отличный от <quote>full</quote>, то идентификатор, состоящий из того же или меньшего количества столбцов, также должен быть определён на стороне подписчика. Подробнее о назначении репликационного идентификатора рассказывается в <xref remap="6" linkend="sql-createtable-replica-identity"/>. Если в публикацию, в которой реплицируются операции <command>UPDATE</command> и <command>DELETE</command>, добавляется таблица без репликационного идентификатора, то последующие команды <command>UPDATE</command> и <command>DELETE</command> на стороне публикации вызовут ошибку. Команды <command>INSERT</command> могут выполняться вне зависимости от такого идентификатора.

source: Every publication can have multiple subscribers.
ru: У каждой публикации может быть множество подписчиков.

source: A publication is created using the <xref linkend="sql-createpublication"/> command and may later be altered or dropped using corresponding commands.
ru: Публикация создаётся командой <xref linkend="sql-createpublication"/> и может быть впоследствии изменена или удалена с помощью соответствующих команд.

source: The individual tables can be added and removed dynamically using <xref linkend="sql-alterpublication"/>. Both the <literal>ADD TABLE</literal> and <literal>DROP TABLE</literal> operations are transactional; so the table will start or stop replicating at the correct snapshot once the transaction has committed.
ru: В публикации можно динамически добавлять или удалять отдельные таблицы, используя команду <xref linkend="sql-alterpublication"/>. Операции <literal>ADD TABLE</literal> и <literal>DROP TABLE</literal> являются транзакционными, так что репликация таблицы будет начата или закончена с определённым снимком только после фиксации транзакции.

source: Subscription
ru: Подписка

source: A <firstterm>subscription</firstterm> is the downstream side of logical replication. The node where a subscription is defined is referred to as the <firstterm>subscriber</firstterm>. A subscription defines the connection to another database and set of publications (one or more) to which it wants to subscribe.
ru: <firstterm>Подписка</firstterm> — это принимающая сторона логической репликации. Узел, на котором определяется подписка, называется <firstterm>подписчиком</firstterm>. В свойствах подписки определяется подключение к другой базе данных и набор публикаций (из одной или нескольких), на которые подписчик хочет подписаться.

source: The subscriber database behaves in the same way as any other PostgreSQL instance and can be used as a publisher for other databases by defining its own publications.
ru: База данных подписчика работает так же, как и экземпляр любой другой базы PostgreSQL, и может быть публикующей для других баз, если в ней определены собственные подписки.

source: A subscriber node may have multiple subscriptions if desired. It is possible to define multiple subscriptions between a single publisher-subscriber pair, in which case care must be taken to ensure that the subscribed publication objects don't overlap.
ru: Узел подписчика может подписываться на несколько подписок, если требуется. В одной паре публикующий сервер/подписчик могут быть определены несколько подписок, но при этом нужно позаботиться о том, чтобы публикуемые объекты в разных подписках не перекрывались.

source: Each subscription will receive changes via one replication slot (see <xref linkend="streaming-replication-slots"/>). Additional temporary replication slots may be required for the initial data synchronization of pre-existing table data.
ru: Изменения в каждой подписке будут приходить через один слот репликации (см. <xref remap="4" linkend="streaming-replication-slots"/>). Дополнительные слоты репликации могут потребоваться для начальной синхронизации уже существующих данных таблиц.

source: A logical replication subscription can be a standby for synchronous replication (see <xref linkend="synchronous-replication"/>). The standby name is by default the subscription name. An alternative name can be specified as <literal>application_name</literal> in the connection information of the subscription.
ru: Подписка логической репликации может представлять собой ведомый узел для синхронной репликации (см. <xref remap="4" linkend="synchronous-replication"/>). В этом случае именем ведомого узла по умолчанию будет имя подписки. Другое имя можно задать в свойстве <literal>application_name</literal> в строке подключения для данной подписки.

source: Subscriptions are dumped by <command>pg_dump</command> if the current user is a superuser. Otherwise a warning is written and subscriptions are skipped, because non-superusers cannot read all subscription information from the <structname>pg_subscription</structname> catalog.
ru: Подписки могут быть выгружены командой <command>pg_dump</command>, если её выполняет суперпользователь. В противном случае выдаётся предупреждение и подписки пропускаются, так как обычным пользователям не разрешено читать всю информацию о подписках из каталога <structname>pg_subscription</structname>.

source: The subscription is added using <xref linkend="sql-createsubscription"/> and can be stopped/resumed at any time using the <xref linkend="sql-altersubscription"/> command and removed using <xref linkend="sql-dropsubscription"/>.
ru: Подписки добавляются командой <xref linkend="sql-createsubscription"/> и могут быть остановлены/возобновлены в любой момент командой <xref linkend="sql-altersubscription"/>, а также удалены командой <xref linkend="sql-dropsubscription"/>.

source: When a subscription is dropped and recreated, the synchronization information is lost. This means that the data has to be resynchronized afterwards.
ru: Когда подписка удаляется и пересоздаётся, информация о синхронизации теряется. Это означает, что после этого данные необходимо синхронизировать заново.

source: The schema definitions are not replicated, and the published tables must exist on the subscriber. Only regular tables may be the target of replication. For example, you can't replicate to a view.
ru: Определения схемы не реплицируются, а публикуемые таблицы должны существовать в базе подписчика. Объектами репликации могут быть только обычные таблицы. Так, например, нельзя произвести репликацию в представление.

source: The tables are matched between the publisher and the subscriber using the fully qualified table name. Replication to differently-named tables on the subscriber is not supported.
ru: Таблицы публикации сопоставляются с таблицами подписчика по полностью заданным именам таблиц. Репликация в таблицы с другими именами на стороне подписчика не поддерживается.

source: Columns of a table are also matched by name. A different order of columns in the target table is allowed, but the column types have to match. The target table can have additional columns not provided by the published table. Those will be filled with their default values.
ru: Столбцы таблиц также сопоставляются по именам. Другой порядок столбцов в целевой таблице допускается, но типы столбцов должны совпадать. Целевая таблица может содержать дополнительные столбцы, отсутствующие в публикуемой таблице. Они будут заполнены установленными для них значениями по умолчанию.

source: Replication Slot Management
ru: Управление слотами репликации

source: When creating a subscription, the replication slot already exists. In that case, the subscription can be created using the <literal>create_slot = false</literal> option to associate with the existing slot.
ru: При создании подписки слот репликации может уже существовать. В этом случае подписку можно создать с параметром <literal>create_slot = false</literal>, чтобы она была связана с существующим слотом.

source: When creating a subscription, the remote host is not reachable or in an unclear state. In that case, the subscription can be created using the <literal>connect = false</literal> option. The remote host will then not be contacted at all. This is what <application>pg_dump</application> uses. The remote replication slot will then have to be created manually before the subscription can be activated.
ru: Про создании подписки удалённый узел может быть недоступен или находиться в нерабочем состоянии. В этом случае подписку можно создать с указанием <literal>connect = false</literal>. При этом подключение к удалённому узлу не будет устанавливаться. Этот вариант использует <application>pg_dump</application>. Чтобы активировать такую подписку впоследствии, удалённый слот репликации нужно будет создать вручную.

source: When dropping a subscription, the replication slot should be kept. This could be useful when the subscriber database is being moved to a different host and will be activated from there. In that case, disassociate the slot from the subscription using <command>ALTER SUBSCRIPTION</command> before attempting to drop the subscription.
ru: При ликвидации репликации может потребоваться сохранить слот репликации. Например, это полезно, когда нужно перенести базу данных подписчика на другой узел и активировать её там. В этом случае разорвите связь подписки со слотом, используя команду <command>ALTER SUBSCRIPTION</command>, прежде чем удалять подписку.

source: When dropping a subscription, the remote host is not reachable. In that case, disassociate the slot from the subscription using <command>ALTER SUBSCRIPTION</command> before attempting to drop the subscription. If the remote database instance no longer exists, no further action is then necessary. If, however, the remote database instance is just unreachable, the replication slot should then be dropped manually; otherwise it would continue to reserve WAL and might eventually cause the disk to fill up. Such cases should be carefully investigated.
ru: При ликвидации подписки удалённый узел может быть недоступен. В этом случае разорвите связь подписки со слотом, используя команду <command>ALTER SUBSCRIPTION</command>, прежде чем пытаться удалять подписку. Если удалённый экземпляр базы данных прекратил существование, больше никакие действия не требуются. Если же экземпляр удалённой базы данных просто оказался недоступным, слот репликации нужно будет удалить вручную; в противном случае публикующий сервер продолжит сохранять WAL и может в конце концов заполнить всё место на диске. Такие случаи заслуживают самого серьёзного разбирательства.

source: As mentioned earlier, each (active) subscription receives changes from a replication slot on the remote (publishing) side. Normally, the remote replication slot is created automatically when the subscription is created using <command>CREATE SUBSCRIPTION</command> and it is dropped automatically when the subscription is dropped using <command>DROP SUBSCRIPTION</command>. In some situations, however, it can be useful or necessary to manipulate the subscription and the underlying replication slot separately. Here are some scenarios: <placeholder-1/>
ru: Как было сказано ранее, каждая (активная) подписка получает изменения из слота репликации на удалённой стороне (стороне публикации). Обычно удалённый слот репликации создаётся автоматически, когда подписка создаётся командой <command>CREATE SUBSCRIPTION</command>, и удаляется автоматически, когда она удаляется командой <command>DROP SUBSCRIPTION</command>. Однако в некоторых ситуациях может быть полезно или необходимо манипулировать подпиской и нижележащим слотом по отдельности. Например, возможны такие сценарии: <placeholder-1/>

source: Conflicts
ru: Конфликты

source: Logical replication behaves similarly to normal DML operations in that the data will be updated even if it was changed locally on the subscriber node. If incoming data violates any constraints the replication will stop. This is referred to as a <firstterm>conflict</firstterm>. When replicating <command>UPDATE</command> or <command>DELETE</command> operations, missing data will not produce a conflict and such operations will simply be skipped.
ru: Логическая репликация работает подобно обычным операциям DML в том смысле, что данные будут изменены, даже если они независимо изменялись на стороне подписчика. Если входящие данные нарушат какие-либо ограничения, репликация остановится. Эта ситуация называется <firstterm>конфликтом</firstterm>. При репликации операций <command>UPDATE</command> или <command>DELETE</command> отсутствие данных не вызывает конфликта, так что такие операции просто пропускаются.

source: A conflict will produce an error and will stop the replication; it must be resolved manually by the user. Details about the conflict can be found in the subscriber's server log.
ru: В случае конфликта выдаётся ошибка и репликация останавливается; разрешить возникшую проблему пользователь должен вручную. Подробности конфликта можно найти в журнале сервера-подписчика.

source: The resolution can be done either by changing data on the subscriber so that it does not conflict with the incoming change or by skipping the transaction that conflicts with the existing data. The transaction can be skipped by calling the <link linkend="pg-replication-origin-advance"><function>pg_replication_origin_advance()</function></link> function with a <parameter>node_name</parameter> corresponding to the subscription name, and a position. The current position of origins can be seen in the <link linkend="view-pg-replication-origin-status"><structname>pg_replication_origin_status</structname></link> system view.
ru: Разрешение может заключаться либо в изменении данных на стороне подписчика, чтобы они не конфликтовали с приходящим изменением, либо в пропуске транзакции, конфликтующей с существующими данными. Пропустить транзакцию можно, вызвав функцию <link linkend="pg-replication-origin-advance"><function>pg_replication_origin_advance()</function></link>, которой передаётся в <parameter>node_name</parameter> соответствующее имя подписки, а также позиция. Текущие позиции источников можно увидеть в системном представлении <link linkend="view-pg-replication-origin-status"><structname>pg_replication_origin_status</structname></link>.

source: Restrictions
ru: Ограничения

source: Logical replication currently has the following restrictions or missing functionality. These might be addressed in future releases.
ru: Логическая репликация в настоящее время имеет ограничения и недостатки, описанные ниже. Они могут быть устранены в будущих выпусках.
