Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/oid2name.po
Languages: ru

source: Application
ru: Приложение

source: resolve OIDs and file nodes in a <placeholder-1/> data directory
ru: преобразовать в имена OID и номера файловых узлов в каталоге данных <placeholder-1/>

source: option
ru: параметр

source: Description
ru: Описание

source: <application>oid2name</application> is a utility program that helps administrators to examine the file structure used by PostgreSQL. To make use of it, you need to be familiar with the database file structure, which is described in <xref linkend="storage"/>.
ru: <application>oid2name</application> — вспомогательная программа, помогающая администраторам исследовать структуру файлов PostgreSQL. Чтобы использовать её, необходимо понимать структуру базы данных на уровне файлов, описанную в <xref remap="6" linkend="storage"/>.

source: The name <quote>oid2name</quote> is historical, and is actually rather misleading, since most of the time when you use it, you will really be concerned with tables' filenode numbers (which are the file names visible in the database directories). Be sure you understand the difference between table OIDs and table filenodes!
ru: Имя <quote>oid2name</quote> сложилось исторически и на самом деле вводит в заблуждение, так как чаще всего, используя её, вы будете иметь дело с номерами файловых узлов таблиц (эти номера образуют имена файлов в каталоге баз данных). Необходимо понимать, что OID таблиц отличаются от номеров файловых узлов!

source: <application>oid2name</application> connects to a target database and extracts OID, filenode, and/or table name information. You can also have it show database OIDs or tablespace OIDs.
ru: Программа <application>oid2name</application> подключается к целевой базе данных и извлекает информацию об OID, файловых узлах и/или именах таблиц. С её помощью можно также просмотреть OID базы данных или табличного пространства.

source: Options
ru: Параметры

source: filenode
ru: файловый_узел

source: show info for table with filenode <replaceable>filenode</replaceable>
ru: показать информацию о таблице, к которой относится <replaceable>файловый_узел</replaceable>

source: include indexes and sequences in the listing
ru: включить в вывод индексы и последовательности

source: show info for table with OID <replaceable>oid</replaceable>
ru: показать информацию о таблице с OID, равным <replaceable>oid</replaceable>

source: omit headers (useful for scripting)
ru: не выводить заголовки (полезно для скриптов)

source: show tablespace OIDs
ru: показать OID табличных пространств

source: include system objects (those in <option>information_schema</option>, <option>pg_toast</option> and <option>pg_catalog</option> schemas)
ru: включить в вывод системные объекты (те, что находятся в схемах <option>information_schema</option>, <option>pg_toast</option> и <option>pg_catalog</option>)

source: tablename_pattern
ru: шаблон_имён_таблиц

source: show info for table(s) matching <replaceable>tablename_pattern</replaceable>
ru: показать информацию о таблицах, подпадающих под <replaceable>шаблон_имён_таблиц</replaceable>

source: Print the <application>oid2name</application> version and exit.
ru: вывести версию <application>oid2name</application> и завершиться.

source: display more information about each object shown: tablespace name, schema name, and OID
ru: вывести дополнительные сведения о каждом показываемом объекте: имя табличного пространства, имя схемы и OID

source: Show help about <application>oid2name</application> command line arguments, and exit.
ru: вывести справку об аргументах командной строки <application>oid2name</application> и завершиться.

source: <application>oid2name</application> accepts the following command-line arguments: <placeholder-1/>
ru: <application>oid2name</application> принимает следующие аргументы командной строки: <placeholder-1/>

source: database
ru: база_данных

source: database to connect to
ru: целевая база данных

source: host
ru: сервер

source: database server's host
ru: адрес сервера баз данных

source: port
ru: порт

source: database server's port
ru: порт сервера баз данных

source: username
ru: имя_пользователя

source: user name to connect as
ru: имя пользователя для подключения

source: password
ru: пароль

source: password (deprecated &mdash; putting this on the command line is a security hazard)
ru: пароль (устаревшая возможность &mdash; указание пароля в командной строке угрожает безопасности)

source: <application>oid2name</application> also accepts the following command-line arguments for connection parameters: <placeholder-1/>
ru: <application>oid2name</application> также принимает в командной строке следующие аргументы, задающие параметры подключения: <placeholder-1/>

source: To display specific tables, select which tables to show by using <option>-o</option>, <option>-f</option> and/or <option>-t</option>. <option>-o</option> takes an OID, <option>-f</option> takes a filenode, and <option>-t</option> takes a table name (actually, it's a <literal>LIKE</literal> pattern, so you can use things like <literal>foo%</literal>). You can use as many of these options as you like, and the listing will include all objects matched by any of the options. But note that these options can only show objects in the database given by <option>-d</option>.
ru: Чтобы получить информацию об определённых таблицах, выберите их с аргументом <option>-o</option>, <option>-f</option> и/или <option>-t</option>. Параметр <option>-o</option> принимает OID, <option>-f</option> — файловый узел, а <option>-t</option> — имя таблицы (на самом деле он принимает шаблон <literal>LIKE</literal>, так что в нём можно задать что-то вроде <literal>foo%</literal>). Вы можете использовать эти аргументы в любом количестве; в вывод будут включены все объекты, соответствующие любым из этих указаний. Но заметьте, что эти аргументы будут выбирать только объекты в базе данных, заданной ключом <option>-d</option>.

source: If you don't give any of <option>-o</option>, <option>-f</option> or <option>-t</option>, but do give <option>-d</option>, it will list all tables in the database named by <option>-d</option>. In this mode, the <option>-S</option> and <option>-i</option> options control what gets listed.
ru: Если аргументы <option>-o</option>, <option>-f</option> и <option>-t</option> отсутствуют, но передаётся <option>-d</option>, будут выведены все таблицы в базе данных с именем, заданным в <option>-d</option>. В этом режиме набором выводимых данных управляют параметры <option>-S</option> и <option>-i</option>.

source: If you don't give <option>-d</option> either, it will show a listing of database OIDs. Alternatively you can give <option>-s</option> to get a tablespace listing.
ru: Если отсутствует и аргумент <option>-d</option>, выводится список OID баз данных. Также можно получить список табличных пространств, передав аргумент <option>-s</option>.

source: Notes
ru: Замечания

source: <application>oid2name</application> requires a running database server with non-corrupt system catalogs. It is therefore of only limited use for recovering from catastrophic database corruption situations.
ru: Программе <application>oid2name</application> требуется работающий сервер баз данных с исправными системными каталогами. Таким образом, в ситуациях с катастрофическими повреждениями базы данных её использование ограничено.

source: Examples
ru: Примеры

source: $ # what's in this database server, anyway? $ oid2name All databases: Oid Database Name Tablespace ---------------------------------- 17228 alvherre pg_default 17255 regression pg_default 17227 template0 pg_default 1 template1 pg_default $ oid2name -s All tablespaces: Oid Tablespace Name ------------------------- 1663 pg_default 1664 pg_global 155151 fastdisk 155152 bigdisk $ # OK, let's look into database alvherre $ cd $PGDATA/base/17228 $ # get top 10 db objects in the default tablespace, ordered by size $ ls -lS * | head -10 -rw------- 1 alvherre alvherre 136536064 sep 14 09:51 155173 -rw------- 1 alvherre alvherre 17965056 sep 14 09:51 1155291 -rw------- 1 alvherre alvherre 1204224 sep 14 09:51 16717 -rw------- 1 alvherre alvherre 581632 sep 6 17:51 1255 -rw------- 1 alvherre alvherre 237568 sep 14 09:50 16674 -rw------- 1 alvherre alvherre 212992 sep 14 09:51 1249 -rw------- 1 alvherre alvherre 204800 sep 14 09:51 16684 -rw------- 1 alvherre alvherre 196608 sep 14 09:50 16700 -rw------- 1 alvherre alvherre 163840 sep 14 09:50 16699 -rw------- 1 alvherre alvherre 122880 sep 6 17:51 16751 $ # I wonder what file 155173 is ... $ oid2name -d alvherre -f 155173 From database "alvherre": Filenode Table Name ---------------------- 155173 accounts $ # you can ask for more than one object $ oid2name -d alvherre -f 155173 -f 1155291 From database "alvherre": Filenode Table Name ------------------------- 155173 accounts 1155291 accounts_pkey $ # you can mix the options, and get more details with -x $ oid2name -d alvherre -t accounts -f 1155291 -x From database "alvherre": Filenode Table Name Oid Schema Tablespace ------------------------------------------------------ 155173 accounts 155173 public pg_default 1155291 accounts_pkey 1155291 public pg_default $ # show disk space for every db object $ du [0-9]* | &gt; while read SIZE FILENODE &gt; do &gt; echo "$SIZE `oid2name -q -d alvherre -i -f $FILENODE`" &gt; done 16 1155287 branches_pkey 16 1155289 tellers_pkey 17561 1155291 accounts_pkey ... $ # same, but sort by size $ du [0-9]* | sort -rn | while read SIZE FN &gt; do &gt; echo "$SIZE `oid2name -q -d alvherre -f $FN`" &gt; done 133466 155173 accounts 17561 1155291 accounts_pkey 1177 16717 pg_proc_proname_args_nsp_index ... $ # If you want to see what's in tablespaces, use the pg_tblspc directory $ cd $PGDATA/pg_tblspc $ oid2name -s All tablespaces: Oid Tablespace Name ------------------------- 1663 pg_default 1664 pg_global 155151 fastdisk 155152 bigdisk $ # what databases have objects in tablespace "fastdisk"? $ ls -d 155151/* 155151/17228/ 155151/PG_VERSION $ # Oh, what was database 17228 again? $ oid2name All databases: Oid Database Name Tablespace ---------------------------------- 17228 alvherre pg_default 17255 regression pg_default 17227 template0 pg_default 1 template1 pg_default $ # Let's see what objects does this database have in the tablespace. $ cd 155151/17228 $ ls -l total 0 -rw------- 1 postgres postgres 0 sep 13 23:20 155156 $ # OK, this is a pretty small table ... but which one is it? $ oid2name -d alvherre -f 155156 From database "alvherre": Filenode Table Name ---------------------- 155156 foo
ru: $ # Что вообще есть на этом сервере базы данных? $ oid2name All databases: Oid Database Name Tablespace ---------------------------------- 17228 alvherre pg_default 17255 regression pg_default 17227 template0 pg_default 1 template1 pg_default $ oid2name -s All tablespaces: Oid Tablespace Name ------------------------- 1663 pg_default 1664 pg_global 155151 fastdisk 155152 bigdisk $ # Хорошо, давайте взглянем на базу alvherre $ cd $PGDATA/base/17228 $ # Получим первые 10 объектов базы (отсортированных по размеру) в табличном пространстве по умолчанию $ ls -lS * | head -10 -rw------- 1 alvherre alvherre 136536064 sep 14 09:51 155173 -rw------- 1 alvherre alvherre 17965056 sep 14 09:51 1155291 -rw------- 1 alvherre alvherre 1204224 sep 14 09:51 16717 -rw------- 1 alvherre alvherre 581632 sep 6 17:51 1255 -rw------- 1 alvherre alvherre 237568 sep 14 09:50 16674 -rw------- 1 alvherre alvherre 212992 sep 14 09:51 1249 -rw------- 1 alvherre alvherre 204800 sep 14 09:51 16684 -rw------- 1 alvherre alvherre 196608 sep 14 09:50 16700 -rw------- 1 alvherre alvherre 163840 sep 14 09:50 16699 -rw------- 1 alvherre alvherre 122880 sep 6 17:51 16751 $ # Поинтересуемся, что за файл 155173... $ oid2name -d alvherre -f 155173 From database "alvherre": Filenode Table Name ---------------------- 155173 accounts $ # Можно узнать сразу о нескольких объектах $ oid2name -d alvherre -f 155173 -f 1155291 From database "alvherre": Filenode Table Name ------------------------- 155173 accounts 1155291 accounts_pkey $ # Можно добавить другие параметры и получить дополнительные подробности с -x $ oid2name -d alvherre -t accounts -f 1155291 -x From database "alvherre": Filenode Table Name Oid Schema Tablespace ------------------------------------------------------ 155173 accounts 155173 public pg_default 1155291 accounts_pkey 1155291 public pg_default $ # Вычислить объём, который занимает на диске каждый объект БД $ du [0-9]* | &gt; while read SIZE FILENODE &gt; do &gt; echo "$SIZE `oid2name -q -d alvherre -i -f $FILENODE`" &gt; done 16 1155287 branches_pkey 16 1155289 tellers_pkey 17561 1155291 accounts_pkey ... $ # То же самое, но с сортировкой по размеру $ du [0-9]* | sort -rn | while read SIZE FN &gt; do &gt; echo "$SIZE `oid2name -q -d alvherre -f $FN`" &gt; done 133466 155173 accounts 17561 1155291 accounts_pkey 1177 16717 pg_proc_proname_args_nsp_index ... $ # Просмотреть содержимое табличных пространств можно в каталоге pg_tblspc $ cd $PGDATA/pg_tblspc $ oid2name -s All tablespaces: Oid Tablespace Name ------------------------- 1663 pg_default 1664 pg_global 155151 fastdisk 155152 bigdisk $ # Объекты каких баз данных находятся в табличном пространстве "fastdisk"? $ ls -d 155151/* 155151/17228/ 155151/PG_VERSION $ # И что это за база данных 17228? $ oid2name All databases: Oid Database Name Tablespace ---------------------------------- 17228 alvherre pg_default 17255 regression pg_default 17227 template0 pg_default 1 template1 pg_default $ # Давайте посмотрим, какие объекты этой базы содержатся в данном табличном пространстве. $ cd 155151/17228 $ ls -l total 0 -rw------- 1 postgres postgres 0 sep 13 23:20 155156 $ # Мда, таблица невелика... и что это за таблица? $ oid2name -d alvherre -f 155156 From database "alvherre": Filenode Table Name ---------------------- 155156 foo

source: Author
ru: Автор

source: B. Palmer <email>bpalmer@crimelabs.net</email>
ru: Б. Палмер <email>bpalmer@crimelabs.net</email>
