Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/parallel.po
Languages: ru

source: Note that the query planner does not consider deferring the evaluation of parallel-restricted functions or aggregates involved in the query in order to obtain a superior plan. So, for example, if a <literal>WHERE</literal> clause applied to a particular table is parallel restricted, the query planner will not consider performing a scan of that table in the parallel portion of a plan. In some cases, it would be possible (and perhaps even efficient) to include the scan of that table in the parallel portion of the query and defer the evaluation of the <literal>WHERE</literal> clause so that it happens above the <literal>Gather</literal> node. However, the planner does not do this.
ru: Заметьте, что планировщик запросов не рассматривает возможность отложенного выполнения ограниченно распараллеливаемых обычных или агрегатных функций, задействованных в запросе, для получения лучшего плана. Поэтому, например, если предложение <literal>WHERE</literal>, применяемое к конкретной таблице, является ограниченно параллельным, планировщик запросов исключит возможность сканирования этой таблицы в параллельной части плана. В некоторых случаях возможно (и, вероятно, более эффективно) включить сканирование этой таблицы в параллельную часть запроса и отложить вычисление предложения <literal>WHERE</literal>, чтобы оно происходило над узлом <literal>Gather</literal>, но планировщик этого не делает.

source: In all cases, the <literal>Gather</literal> node will have exactly one child plan, which is the portion of the plan that will be executed in parallel. If the <literal>Gather</literal> node is at the very top of the plan tree, then the entire query will execute in parallel. If it is somewhere else in the plan tree, then only that portion of the query will run in parallel. In the example above, the query accesses only one table, so there is only one plan node other than the <literal>Gather</literal> node itself; since that plan node is a child of the <literal>Gather</literal> node, it will run in parallel.
ru: Во всех случаях узел <literal>Gather</literal> будет иметь ровно один дочерний план, представляющий часть общего плана, выполняемую в параллельном режиме. Если узел <literal>Gather</literal> располагается на самом верху дерева плана, в параллельном режиме будет выполняться весь запрос. Если он находится где-то в другом месте плана, параллельно будет выполняться только соответствующая часть плана. В приведённом выше примере запрос обращается только к одной таблице, так что помимо узла <literal>Gather</literal> есть только ещё один узел плана; и так как этот узел является потомком узла <literal>Gather</literal>, он будет выполняться в параллельном режиме.

source: <link linkend="using-explain">Using EXPLAIN</link>, you can see the number of workers chosen by the planner. When the <literal>Gather</literal> node is reached during query execution, the process which is implementing the user's session will request a number of <link linkend="bgworker">background worker processes</link> equal to the number of workers chosen by the planner. The total number of background workers that can exist at any one time is limited by <xref linkend="guc-max-worker-processes"/>, so it is possible for a parallel query to run with fewer workers than planned, or even with no workers at all. The optimal plan may depend on the number of workers that are available, so this can result in poor query performance. If this occurrence is frequent, considering increasing <varname>max_worker_processes</varname> so that more workers can be run simultaneously or alternatively reducing <xref linkend="guc-max-parallel-workers-per-gather"/> so that the planner requests fewer workers.
ru: <link linkend="using-explain">Используя EXPLAIN</link>, вы можете узнать количество исполнителей, выбранное планировщиком для данного запроса. Когда при выполнении запроса достигается узел <literal>Gather</literal>, процесс, обслуживающий сеанс пользователя, запрашивает <link linkend="bgworker">фоновые рабочие процессы</link> в этом количестве. Общее число фоновых рабочих процессов, которые могут существовать одновременно, ограничивается параметром <xref linkend="guc-max-worker-processes"/>, так что вполне возможно, что параллельный запрос будет выполняться меньшим числом рабочих процессов, чем планировалось, либо вообще без дополнительных рабочих процессов. Оптимальность плана может зависеть от числа доступных рабочих процессов, так что их нехватка может повлечь значительное снижение производительности. Если это наблюдается часто, имеет смысл увеличить <varname>max_worker_processes</varname>, чтобы одновременно могло работать больше процессов, либо уменьшить <xref linkend="guc-max-parallel-workers-per-gather"/>, чтобы планировщик ожидал их наличия в меньшем количестве.

source: Every background worker process which is successfully started for a given parallel query will execute the portion of the plan which is a descendent of the <literal>Gather</literal> node. The leader will also execute that portion of the plan, but it has an additional responsibility: it must also read all of the tuples generated by the workers. When the parallel portion of the plan generates only a small number of tuples, the leader will often behave very much like an additional worker, speeding up query execution. Conversely, when the parallel portion of the plan generates a large number of tuples, the leader may be almost entirely occupied with reading the tuples generated by the workers and performing any further processing steps which are required by plan nodes above the level of the <literal>Gather</literal> node. In such cases, the leader will do very little of the work of executing the parallel portion of the plan.
ru: Каждый фоновый рабочий процесс, успешно запущенный для данного параллельного запроса, будет выполнять часть плана, подчинённую узлу <literal>Gather</literal>. Ведущий процесс также будет выполнять эту часть плана, но он несёт дополнительную ответственность: он должен также прочитать все кортежи, выданные рабочими процессами. Когда параллельная часть плана выдаёт лишь небольшое количество кортежей, ведущий часто ведёт себя просто как один из рабочих процессов, ускоряя выполнение запроса. И напротив, когда параллельная часть плана выдаёт множество кортежей, ведущий может быть почти всё время занят чтением кортежей, выдаваемых другими рабочими процессами, и выполнять другие шаги обработки, связанные с узлами плана выше узла <literal>Gather</literal>. В таких случаях ведущий процесс может вносить лишь минимальный вклад в выполнение параллельной части плана.

source: The query might be suspended during execution. In any situation in which the system thinks that partial or incremental execution might occur, no parallel plan is generated. For example, a cursor created using <link linkend="sql-declare">DECLARE CURSOR</link> will never use a parallel plan. Similarly, a PL/pgsql loop of the form <literal>FOR x IN query LOOP .. END LOOP</literal> will never use a parallel plan, because the parallel query system is unable to verify that the code in the loop is safe to execute while parallel query is active.
ru: Запрос может быть приостановлен в процессе выполнения. В ситуациях, когда система решает, что может иметь место частичное или дополнительное выполнение, план параллельного выполнения не строится. Например, курсор, созданный предложением <link linkend="sql-declare">DECLARE CURSOR</link>, никогда не будет использовать параллельный план. Подобным образом, цикл PL/pgSQL вида <literal>FOR x IN query LOOP .. END LOOP</literal> никогда не будет использовать параллельный план, так как система параллельных запросов не сможет определить, может ли безопасно выполняться код внутри цикла во время параллельного выполнения запроса.

source: The client sends an Execute message with a non-zero fetch count. See the discussion of the <link linkend="protocol-flow-ext-query">extended query protocol</link>. Since <link linkend="libpq">libpq</link> currently provides no way to send such a message, this can only occur when using a client that does not rely on libpq. If this is a frequent occurrence, it may be a good idea to set <xref linkend="guc-max-parallel-workers-per-gather"/> in sessions where it is likely, so as to avoid generating query plans that may be suboptimal when run serially.
ru: Клиент передаёт сообщение Execute с ненулевым количеством выбираемых кортежей. За подробностями обратитесь к описанию <link linkend="protocol-flow-ext-query">протокола расширенных запросов</link>. Так как <link linkend="libpq">libpq</link> в настоящее время не позволяет передавать такие сообщения, это возможно только с клиентом, задействующим не libpq. Если это происходит часто, имеет смысл установить <xref linkend="guc-max-parallel-workers-per-gather"/> в сеансах, для которых это актуально, чтобы система не пыталась строить планы, которые могут быть неэффективны при последовательном выполнении.

source: Currently, the only type of scan which has been modified to work with parallel query is a sequential scan. Therefore, the driving table in a parallel plan will always be scanned using a <literal>Parallel Seq Scan</literal>. The relation's blocks will be divided among the cooperating processes. Blocks are handed out one at a time, so that access to the relation remains sequential. Each process will visit every tuple on the page assigned to it before requesting a new page.
ru: В настоящее время единственным вариантом сканирования, адаптированным для работы в параллельном режиме, является последовательное сканирование. Таким образом, целевая таблица в параллельном плане всегда будет сканироваться узлом <literal>Parallel Seq Scan</literal>. Блоки отношения разделяются между сотрудничающими процессами и выдаются им по одному, так что доступ к отношению остаётся последовательным. Каждый отдельный процесс сначала посещает все кортежи на назначенной ему странице, и только затем переходит к новой.

source: The driving table may be joined to one or more other tables using nested loops or hash joins. The inner side of the join may be any kind of non-parallel plan that is otherwise supported by the planner provided that it is safe to run within a parallel worker. For example, it may be an index scan which looks up a value taken from the outer side of the join. Each worker will execute the inner side of the join in full, which for hash join means that an identical hash table is built in each worker process.
ru: Целевая таблица может соединяться с одной или несколькими другими таблицами с использованием вложенных циклов или соединений по хешу. Внутренней стороной соединения может быть любой вид не параллельного плана, который в остальном поддерживается планировщиком, при условии, что он безопасен для выполнения в параллельном исполнителе. Например, это может быть сканирование индекса, при котором находится значение, взятое из внешней стороны соединения. Каждый рабочий процесс будет выполнять внутреннюю сторону соединения в полном объёме, что для соединения по хешу означает, что в каждом рабочем процессе будет строиться одна и та же хеш-таблица.

source: <productname>PostgreSQL</productname> supports parallel aggregation by aggregating in two stages. First, each process participating in the parallel portion of the query performs an aggregation step, producing a partial result for each group of which that process is aware. This is reflected in the plan as a <literal>Partial Aggregate</literal> node. Second, the partial results are transferred to the leader via the <literal>Gather</literal> node. Finally, the leader re-aggregates the results across all workers in order to produce the final result. This is reflected in the plan as a <literal>Finalize Aggregate</literal> node.
ru: <productname>PostgreSQL</productname> поддерживает параллельное агрегирование, выполняя агрегирование в два этапа. Сначала каждый процесс, задействованный в параллельной части запроса, выполняет шаг агрегирования, выдавая частичный результат для каждой известной ему группы. В плане это отражает узел <literal>Partial Aggregate</literal>. Затем эти промежуточные результаты передаются ведущему через узел <literal>Gather</literal>. И наконец, ведущий заново агрегирует результаты всех рабочих процессов, чтобы получить окончательный результат. Это отражает в плане узел <literal>Finalize Aggregate</literal>.

source: The planner classifies operations involved in a query as either <firstterm>parallel safe</firstterm>, <firstterm>parallel restricted</firstterm>, or <firstterm>parallel unsafe</firstterm>. A parallel safe operation is one which does not conflict with the use of parallel query. A parallel restricted operation is one which cannot be performed in a parallel worker, but which can be performed in the leader while parallel query is in use. Therefore, parallel restricted operations can never occur below a <literal>Gather</literal> node, but can occur elsewhere in a plan which contains a <literal>Gather</literal> node. A parallel unsafe operation is one which cannot be performed while parallel query is in use, not even in the leader. When a query contains anything which is parallel unsafe, parallel query is completely disabled for that query.
ru: Планировщик классифицирует операции, вовлечённые в выполнение запроса, как либо <firstterm>безопасные для распараллеливания</firstterm>, либо <firstterm>ограниченно распараллеливаемые</firstterm>, либо <firstterm>небезопасные для распараллеливания</firstterm>. Безопасной для распараллеливания операцией считается такая, которая не мешает параллельному выполнению запроса. Ограниченно распараллеливаемой операцией считается такая, которая не может выполняться в параллельном рабочем процессе, но может выполняться в ведущем процессе, когда запрос выполняется параллельно. Таким образом, ограниченно параллельные операции никогда не могут оказаться ниже узла <literal>Gather</literal>, но могут встречаться в других местах плана с узлом <literal>Gather</literal>. Небезопасные для распараллеливания операции не могут выполняться в параллельных запросах, даже в ведущем процессе. Когда запрос содержит что-либо небезопасное для распараллеливания, параллельное выполнение для такого запроса полностью исключается.

source: Access to an <literal>InitPlan</literal> or <literal>SubPlan</literal>.
ru: Доступ к <literal>InitPlan</literal> или <literal>SubPlan</literal>.

source: Functions and aggregates must be marked <literal>PARALLEL UNSAFE</literal> if they write to the database, access sequences, change the transaction state even temporarily (e.g. a PL/pgsql function which establishes an <literal>EXCEPTION</literal> block to catch errors), or make persistent changes to settings. Similarly, functions must be marked <literal>PARALLEL RESTRICTED</literal> if they access temporary tables, client connection state, cursors, prepared statements, or miscellaneous backend-local state which the system cannot synchronize across workers. For example, <literal>setseed</literal> and <literal>random</literal> are parallel restricted for this last reason.
ru: Обычные и агрегатные функции должны помечаться небезопасными для распараллеливания (<literal>PARALLEL UNSAFE</literal>), если они пишут в базу данных, обращаются к последовательностям, изменяют состояние транзакции, даже временно (как, например, функция PL/pgSQL, устанавливающая блок <literal>EXCEPTION</literal> для перехвата ошибок), либо производят постоянные изменения параметров. Подобным образом, функции должны помечаться как ограниченно распараллеливаемые (<literal>PARALLEL RESTRICTED</literal>), если они обращаются к временным таблицам, состоянию клиентского подключения, курсорам, подготовленным операторам или разнообразному локальному состоянию обслуживающего процесса, которое система не может синхронизировать между рабочими процессами. Например, по этой причине ограниченно параллельными являются функции <literal>setseed</literal> и <literal>random</literal>.

source: Note that the query planner does not consider deferring the evaluation of parallel-restricted functions or aggregates involved in the query in order to obtain a superior plan. So, for example, if a <literal>WHERE</literal> clause applied to a particular table is parallel restricted, the query planner will not consider placing the scan of that table below a <literal>Gather</literal> node. In some cases, it would be possible (and perhaps even efficient) to include the scan of that table in the parallel portion of the query and defer the evaluation of the <literal>WHERE</literal> clause so that it happens above the <literal>Gather</literal> node. However, the planner does not do this.
ru: Заметьте, что планировщик запросов не рассматривает возможность отложенного выполнения ограниченно распараллеливаемых обычных или агрегатных функций, задействованных в запросе, для получения лучшего плана. Поэтому, например, если предложение <literal>WHERE</literal>, применяемое к конкретной таблице, является ограниченно параллельным, планировщик запросов не будет помещать сканирование этой таблицы под узел <literal>Gather</literal>. В некоторых случаях возможно (и, вероятно, более эффективно) включить сканирование этой таблицы в параллельную часть запроса и отложить вычисление предложения <literal>WHERE</literal>, чтобы оно происходило над узлом <literal>Gather</literal>, но планировщик этого не делает.
