Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/parallel.po
Languages: ru

source: Parallel Query
ru: Параллельный запрос

source: <primary>parallel query</primary>
ru: <primary>параллельный запрос</primary>

source: <productname>PostgreSQL</productname> can devise query plans which can leverage multiple CPUs in order to answer queries faster. This feature is known as parallel query. Many queries cannot benefit from parallel query, either due to limitations of the current implementation or because there is no imaginable query plan which is any faster than the serial query plan. However, for queries that can benefit, the speedup from parallel query is often very significant. Many queries can run more than twice as fast when using parallel query, and some queries can run four times faster or even more. Queries that touch a large amount of data but return only a few rows to the user will typically benefit most. This chapter explains some details of how parallel query works and in which situations it can be used so that users who wish to make use of it can understand what to expect.
ru: <productname>PostgreSQL</productname> может вырабатывать такие планы запросов, которые будут задействовать несколько CPU, чтобы получить ответ на запросы быстрее. Эта возможность называется распараллеливанием запросов. Для многих запросов параллельное выполнение не даёт никакого выигрыша, либо из-за ограничений текущей реализации, либо из-за принципиальной невозможности построить параллельный план, который был бы быстрее последовательного. Однако для запросов, в которых это может быть полезно, распараллеливание часто даёт очень значительное ускорение. Многие такие запросы могут выполняться в параллельном режиме как минимум двое быстрее, а некоторые — быстрее в четыре и даже более раз. Обычно наибольший выигрыш можно получить с запросами, обрабатывающими большой объём данных, но возвращающими пользователю всего несколько строк. В этой главе достаточно подробно рассказывается, как работают параллельные запросы и в каких ситуациях их можно использовать, чтобы пользователи, желающие применять их, понимали, чего ожидать.

source: How Parallel Query Works
ru: Как работают параллельно выполняемые запросы

source: When the optimizer determines that parallel query is the fastest execution strategy for a particular query, it will create a query plan which includes a <firstterm>Gather</firstterm> or <firstterm>Gather Merge</firstterm> node. Here is a simple example: <screen> EXPLAIN SELECT * FROM pgbench_accounts WHERE filler LIKE '%x%'; QUERY PLAN ------------------------------------------------------------------------------------- Gather (cost=1000.00..217018.43 rows=1 width=97) Workers Planned: 2 -&gt; Parallel Seq Scan on pgbench_accounts (cost=0.00..216018.33 rows=1 width=97) Filter: (filler ~~ '%x%'::text) (4 rows) </screen>
ru: Когда оптимизатор определяет, что параллельное выполнение будет наилучшей стратегией для конкретного запроса, он создаёт план запроса, включающий <firstterm>узел Gather</firstterm> (Сбор) или <firstterm>Gather Merge</firstterm> (Сбор со слиянием). Взгляните на простой пример: <screen> EXPLAIN SELECT * FROM pgbench_accounts WHERE filler LIKE '%x%'; QUERY PLAN ------------------------------------------------------------------------------------- Gather (cost=1000.00..217018.43 rows=1 width=97) Workers Planned: 2 -&gt; Parallel Seq Scan on pgbench_accounts (cost=0.00..216018.33 rows=1 width=97) Filter: (filler ~~ '%x%'::text) (4 rows) </screen>

source: When the optimizer determines that parallel query is the fastest execution strategy for a particular query, it will create a query plan which includes a <firstterm>Gather node</firstterm>. Here is a simple example: <screen> EXPLAIN SELECT * FROM pgbench_accounts WHERE filler LIKE '%x%'; QUERY PLAN ------------------------------------------------------------------------------------- Gather (cost=1000.00..217018.43 rows=1 width=97) Workers Planned: 2 -&gt; Parallel Seq Scan on pgbench_accounts (cost=0.00..216018.33 rows=1 width=97) Filter: (filler ~~ '%x%'::text) (4 rows) </screen>
ru: Когда оптимизатор определяет, что параллельное выполнение будет наилучшей стратегией для конкретного запроса, он создаёт план запроса, включающий <firstterm>узел Gather</firstterm> (Сбор). Взгляните на простой пример: <screen> EXPLAIN SELECT * FROM pgbench_accounts WHERE filler LIKE '%x%'; QUERY PLAN ------------------------------------------------------------------------------------- Gather (cost=1000.00..217018.43 rows=1 width=97) Workers Planned: 2 -&gt; Parallel Seq Scan on pgbench_accounts (cost=0.00..216018.33 rows=1 width=97) Filter: (filler ~~ '%x%'::text) (4 rows) </screen>

source: In all cases, the <literal>Gather</literal> or <literal>Gather Merge</literal> node will have exactly one child plan, which is the portion of the plan that will be executed in parallel. If the <literal>Gather</literal> or <literal>Gather Merge</literal> node is at the very top of the plan tree, then the entire query will execute in parallel. If it is somewhere else in the plan tree, then only the portion of the plan below it will run in parallel. In the example above, the query accesses only one table, so there is only one plan node other than the <literal>Gather</literal> node itself; since that plan node is a child of the <literal>Gather</literal> node, it will run in parallel.
ru: Во всех случаях узел <literal>Gather</literal> или <literal>Gather Merge</literal> будет иметь ровно один дочерний план, представляющий часть общего плана, выполняемую в параллельном режиме. Если узел <literal>Gather</literal> или <literal>Gather Merge</literal> располагается на самом верху дерева плана, в параллельном режиме будет выполняться весь запрос. Если он находится где-то в другом месте плана, параллельно будет выполняться только часть плана ниже него. В приведённом выше примере запрос обращается только к одной таблице, так что помимо узла <literal>Gather</literal> есть только ещё один узел плана; и так как этот узел является потомком узла <literal>Gather</literal>, он будет выполняться в параллельном режиме.

source: <link linkend="using-explain">Using EXPLAIN</link>, you can see the number of workers chosen by the planner. When the <literal>Gather</literal> node is reached during query execution, the process which is implementing the user's session will request a number of <link linkend="bgworker">background worker processes</link> equal to the number of workers chosen by the planner. The number of background workers that the planner will consider using is limited to at most <xref linkend="guc-max-parallel-workers-per-gather"/>. The total number of background workers that can exist at any one time is limited by both <xref linkend="guc-max-worker-processes"/> and <xref linkend="guc-max-parallel-workers"/>. Therefore, it is possible for a parallel query to run with fewer workers than planned, or even with no workers at all. The optimal plan may depend on the number of workers that are available, so this can result in poor query performance. If this occurrence is frequent, consider increasing <varname>max_worker_processes</varname> and <varname>max_parallel_workers</varname> so that more workers can be run simultaneously or alternatively reducing <varname>max_parallel_workers_per_gather</varname> so that the planner requests fewer workers.
ru: <link linkend="using-explain">Используя EXPLAIN</link>, вы можете узнать количество исполнителей, выбранное планировщиком для данного запроса. Когда при выполнении запроса достигается узел <literal>Gather</literal>, процесс, обслуживающий сеанс пользователя, запрашивает <link linkend="bgworker">фоновые рабочие процессы</link> в этом количестве. Количество исполнителей, которое может попытаться задействовать планировщик, ограничивается значением <xref linkend="guc-max-parallel-workers-per-gather"/>. Общее число фоновых рабочих процессов, которые могут существовать одновременно, ограничивается параметрами <xref linkend="guc-max-worker-processes"/> и <xref linkend="guc-max-parallel-workers"/>. Таким образом, вполне возможно, что параллельный запрос будет выполняться меньшим числом рабочих процессов, чем планировалось, либо вообще без дополнительных рабочих процессов. Оптимальность плана может зависеть от числа доступных рабочих процессов, так что их нехватка может повлечь значительное снижение производительности. Если это наблюдается часто, имеет смысл увеличить <varname>max_worker_processes</varname> и <varname>max_parallel_workers</varname>, чтобы одновременно могло работать больше процессов, либо наоборот уменьшить <varname>max_parallel_workers_per_gather</varname>, чтобы планировщик запрашивал их в меньшем количестве.

source: Every background worker process which is successfully started for a given parallel query will execute the parallel portion of the plan. The leader will also execute that portion of the plan, but it has an additional responsibility: it must also read all of the tuples generated by the workers. When the parallel portion of the plan generates only a small number of tuples, the leader will often behave very much like an additional worker, speeding up query execution. Conversely, when the parallel portion of the plan generates a large number of tuples, the leader may be almost entirely occupied with reading the tuples generated by the workers and performing any further processing steps which are required by plan nodes above the level of the <literal>Gather</literal> node or <literal>Gather Merge</literal> node. In such cases, the leader will do very little of the work of executing the parallel portion of the plan.
ru: Каждый фоновый рабочий процесс, успешно запущенный для данного параллельного запроса, будет выполнять параллельную часть плана. Ведущий процесс также будет выполнять эту часть плана, но он несёт дополнительную ответственность: он должен также прочитать все кортежи, выданные рабочими процессами. Когда параллельная часть плана выдаёт лишь небольшое количество кортежей, ведущий часто ведёт себя просто как один из рабочих процессов, ускоряя выполнение запроса. И напротив, когда параллельная часть плана выдаёт множество кортежей, ведущий может быть почти всё время занят чтением кортежей, выдаваемых другими рабочими процессами, и выполнять другие шаги обработки, связанные с узлами плана выше узла <literal>Gather</literal> или <literal>Gather Merge</literal>. В таких случаях ведущий процесс может вносить лишь минимальный вклад в выполнение параллельной части плана.

source: When the node at the top of the parallel portion of the plan is <literal>Gather Merge</literal> rather than <literal>Gather</literal>, it indicates that each process executing the parallel portion of the plan is producing tuples in sorted order, and that the leader is performing an order-preserving merge. In contrast, <literal>Gather</literal> reads tuples from the workers in whatever order is convenient, destroying any sort order that may have existed.
ru: Когда над параллельной частью плана оказывается узел <literal>Gather Merge</literal>, а не <literal>Gather</literal>, это означает, что все процессы, выполняющие части параллельного плана, выдают кортежи в отсортированном порядке, и что ведущий процесс выполняет слияние с сохранением порядка. Узел же <literal>Gather</literal>, напротив, получает кортежи от подчинённых процессов в произвольном удобном ему порядке, нарушая порядок сортировки, который мог существовать.

source: When Can Parallel Query Be Used?
ru: Когда может применяться распараллеливание запросов?

source: There are several settings which can cause the query planner not to generate a parallel query plan under any circumstances. In order for any parallel query plans whatsoever to be generated, the following settings must be configured as indicated.
ru: Планировщик запросов может отказаться от построения параллельных планов запросов в любом случае под влиянием нескольких параметров. Чтобы он строил параллельные планы запросов при каких-бы то ни было условиях, описанные далее параметры необходимо настроить указанным образом.

source: <xref linkend="guc-max-parallel-workers-per-gather"/> must be set to a value which is greater than zero. This is a special case of the more general principle that no more workers should be used than the number configured via <varname>max_parallel_workers_per_gather</varname>.
ru: <xref linkend="guc-max-parallel-workers-per-gather"/> должен иметь значение, большее нуля. Это особый вариант более общего ограничения на суммарное число используемых рабочих процессов, задаваемого параметром <varname>max_parallel_workers_per_gather</varname>.

source: <xref linkend="guc-dynamic-shared-memory-type"/> must be set to a value other than <literal>none</literal>. Parallel query requires dynamic shared memory in order to pass data between cooperating processes.
ru: <xref linkend="guc-dynamic-shared-memory-type"/> должен иметь значение, отличное от <literal>none</literal>. Для параллельного выполнения запросов нужна динамическая общая память, через которую будут передаваться данные между взаимодействующими процессами.

source: In addition, the system must not be running in single-user mode. Since the entire database system is running in single process in this situation, no background workers will be available.
ru: В дополнение к этому, система должна работать не в однопользовательском режиме. Так как в этом режиме вся СУБД работает в одном процессе, фоновые рабочие процессы в нём недоступны.

source: Even when it is in general possible for parallel query plans to be generated, the planner will not generate them for a given query if any of the following are true:
ru: Даже если принципиально возможно построить параллельные планы выполнения, планировщик не будет строить такой план для определённого запроса, если имеет место одно из следующих обстоятельств:

source: The query writes any data or locks any database rows. If a query contains a data-modifying operation either at the top level or within a CTE, no parallel plans for that query will be generated. This is a limitation of the current implementation which could be lifted in a future release.
ru: Запрос выполняет запись данных или блокирует строки в базе данных. Если запрос содержит операцию, изменяющую данные либо на верхнем уровне, либо внутри CTE, для такого запроса не будут строиться параллельные планы. Это ограничение текущей реализации, которое может быть смягчено в будущих версиях.

source: The query might be suspended during execution. In any situation in which the system thinks that partial or incremental execution might occur, no parallel plan is generated. For example, a cursor created using <link linkend="sql-declare">DECLARE CURSOR</link> will never use a parallel plan. Similarly, a PL/pgSQL loop of the form <literal>FOR x IN query LOOP .. END LOOP</literal> will never use a parallel plan, because the parallel query system is unable to verify that the code in the loop is safe to execute while parallel query is active.
ru: Запрос может быть приостановлен в процессе выполнения. В ситуациях, когда система решает, что может иметь место частичное или дополнительное выполнение, план параллельного выполнения не строится. Например, курсор, созданный предложением <link linkend="sql-declare">DECLARE CURSOR</link>, никогда не будет использовать параллельный план. Подобным образом, цикл PL/pgSQL вида <literal>FOR x IN query LOOP .. END LOOP</literal> никогда не будет использовать параллельный план, так как система параллельных запросов не сможет определить, может ли безопасно выполняться код внутри цикла во время параллельного выполнения запроса.

source: The query uses any function marked <literal>PARALLEL UNSAFE</literal>. Most system-defined functions are <literal>PARALLEL SAFE</literal>, but user-defined functions are marked <literal>PARALLEL UNSAFE</literal> by default. See the discussion of <xref linkend="parallel-safety"/>.
ru: В запросе используются функции, помеченные как <literal>PARALLEL UNSAFE</literal>. Большинство системных функций безопасны для параллельного выполнения (<literal>PARALLEL SAFE</literal>), но пользовательские функции по умолчанию помечаются как небезопасные (<literal>PARALLEL UNSAFE</literal>). Эта характеристика функции рассматривается в <xref remap="6" linkend="parallel-safety"/>.

source: The query is running inside of another query that is already parallel. For example, if a function called by a parallel query issues an SQL query itself, that query will never use a parallel plan. This is a limitation of the current implementation, but it may not be desirable to remove this limitation, since it could result in a single query using a very large number of processes.
ru: Запрос работает внутри другого запроса, уже параллельного. Например, если функция, вызываемая в параллельном запросе, сама выполняет SQL-запрос, последний запрос никогда не будет выполняться параллельно. Это ограничение текущей реализации, но убирать его вряд ли следует, так как это может привести к использованию одним запросом чрезмерного количества процессов.

source: The transaction isolation level is serializable. This is a limitation of the current implementation.
ru: Для транзакции установлен сериализуемый уровень изоляции. Это ограничение текущей реализации.

source: Even when parallel query plan is generated for a particular query, there are several circumstances under which it will be impossible to execute that plan in parallel at execution time. If this occurs, the leader will execute the portion of the plan below the <literal>Gather</literal> node entirely by itself, almost as if the <literal>Gather</literal> node were not present. This will happen if any of the following conditions are met:
ru: Даже когда для определённого запроса построен параллельный план, возможны различные обстоятельства, при которых этот план нельзя будет выполнить в параллельном режиме. В этих случаях ведущий процесс выполнит часть плана ниже узла <literal>Gather</literal> полностью самостоятельно, как если бы узла <literal>Gather</literal> вовсе не было. Это произойдёт только при выполнении одного из следующих условий:

source: No background workers can be obtained because of the limitation that the total number of background workers cannot exceed <xref linkend="guc-max-worker-processes"/>.
ru: Невозможно получить ни одного фонового рабочего процесса из-за ограничения общего числа этих процессов значением <xref linkend="guc-max-worker-processes"/>.

source: No background workers can be obtained because of the limitation that the total number of background workers launched for purposes of parallel query cannot exceed <xref linkend="guc-max-parallel-workers"/>.
ru: Невозможно получить ни одного фонового рабочего процесса из-за ограничения общего числа таких процессов для параллельного выполнения значением <xref linkend="guc-max-parallel-workers"/>.

source: The client sends an Execute message with a non-zero fetch count. See the discussion of the <link linkend="protocol-flow-ext-query">extended query protocol</link>. Since <link linkend="libpq">libpq</link> currently provides no way to send such a message, this can only occur when using a client that does not rely on libpq. If this is a frequent occurrence, it may be a good idea to set <xref linkend="guc-max-parallel-workers-per-gather"/> to zero in sessions where it is likely, so as to avoid generating query plans that may be suboptimal when run serially.
ru: Клиент передаёт сообщение Execute с ненулевым количеством выбираемых кортежей. За подробностями обратитесь к описанию <link linkend="protocol-flow-ext-query">протокола расширенных запросов</link>. Так как <link linkend="libpq">libpq</link> в настоящее время не позволяет передавать такие сообщения, это возможно только с клиентом, задействующим не libpq. Если это происходит часто, имеет смысл установить в <xref linkend="guc-max-parallel-workers-per-gather"/> 0 в сеансах, для которых это актуально, чтобы система не пыталась строить планы, которые могут быть неэффективны при последовательном выполнении.

source: A prepared statement is executed using a <literal>CREATE TABLE .. AS EXECUTE ..</literal> statement. This construct converts what otherwise would have been a read-only operation into a read-write operation, making it ineligible for parallel query.
ru: Подготовленный оператор выполняется в конструкции <literal>CREATE TABLE .. AS EXECUTE ..</literal>. Эта конструкция меняет характер операции с «только чтение» на «чтение+запись», что исключает параллельное выполнение этой операции.

source: Because each worker executes the parallel portion of the plan to completion, it is not possible to simply take an ordinary query plan and run it using multiple workers. Each worker would produce a full copy of the output result set, so the query would not run any faster than normal but would produce incorrect results. Instead, the parallel portion of the plan must be what is known internally to the query optimizer as a <firstterm>partial plan</firstterm>; that is, it must be constructed so that each process which executes the plan will generate only a subset of the output rows in such a way that each required output row is guaranteed to be generated by exactly one of the cooperating processes.
ru: Так как каждый рабочий процесс выполняет параллельную часть плана до конца, нельзя просто взять обычный план запроса и запустить его в нескольких исполнителях. В этом случае все исполнители выдавали бы полные копии выходного набора результатов, так что запрос выполнится не быстрее, чем обычно, а его результаты могут быть некорректными. Вместо этого параллельной частью плана должно быть то, что для оптимизатора представляется как <firstterm>частичный план</firstterm>; то есть такой план, при выполнении которого в отдельном процессе будет получено только подмножество выходных строк, а каждая требующаяся строка результата будет гарантированно выдана ровно одним из сотрудничающих процессов.

source: The transaction isolation level is serializable. This situation does not normally arise, because parallel query plans are not generated when the transaction isolation level is serializable. However, it can happen if the transaction isolation level is changed to serializable after the plan is generated and before it is executed.
ru: Для транзакции установлен сериализуемый уровень изоляции. Обычно эта ситуация не возникает, так как при таком уровне изоляции не строятся параллельные планы выполнения. Однако она возможна, если уровень изоляции транзакции меняется на сериализуемый после построения плана и до его выполнения.

source: Parallel Plans
ru: Параллельные планы
