Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/parallel.po
Languages: ru

source: Because each worker executes the parallel portion of the plan to completion, it is not possible to simply take an ordinary query plan and run it using multiple workers. Each worker would produce a full copy of the output result set, so the query would not run any faster than normal but would produce incorrect results. Instead, the parallel portion of the plan must be what is known internally to the query optimizer as a <firstterm>partial plan</firstterm>; that is, it must be constructed so that each process which executes the plan will generate only a subset of the output rows in such a way that each required output row is guaranteed to be generated by exactly one of the cooperating processes. Generally, this means that the scan on the driving table of the query must be a parallel-aware scan.
ru: Так как каждый рабочий процесс выполняет параллельную часть плана до конца, нельзя просто взять обычный план запроса и запустить его в нескольких исполнителях. В этом случае все исполнители выдавали бы полные копии выходного набора результатов, так что запрос выполнится не быстрее, чем обычно, а его результаты могут быть некорректными. Вместо этого параллельной частью плана должно быть то, что для оптимизатора представляется как <firstterm>частичный план</firstterm>; то есть такой план, при выполнении которого в отдельном процессе будет получено только подмножество выходных строк, а каждая требующаяся строка результата будет гарантированно выдана ровно одним из сотрудничающих процессов. Вообще говоря, это означает, что сканирование нижележащей таблицы запроса должно проводиться с учётом распараллеливания.

source: Parallel Scans
ru: Параллельные сканирования

source: In a <emphasis>parallel sequential scan</emphasis>, the table's blocks will be divided among the cooperating processes. Blocks are handed out one at a time, so that access to the table remains sequential.
ru: При <emphasis>параллельном последовательном сканировании</emphasis> блоки таблицы будут разделены между взаимодействующими процессами. Блоки выдаются по очереди, так что доступ к таблице остаётся последовательным.

source: In a <emphasis>parallel bitmap heap scan</emphasis>, one process is chosen as the leader. That process performs a scan of one or more indexes and builds a bitmap indicating which table blocks need to be visited. These blocks are then divided among the cooperating processes as in a parallel sequential scan. In other words, the heap scan is performed in parallel, but the underlying index scan is not.
ru: При <emphasis>параллельном сканировании кучи по битовой карте</emphasis> один процесс выбирается на роль ведущего. Этот процесс производит сканирование одного или нескольких индексов и строит битовую карту, показывающую, какие блоки таблицы нужно посетить. Затем эти блоки разделяются между взаимодействующими процессами как при параллельном последовательном сканировании. Другими словами, сканирование кучи выполняется в параллельном режиме, а сканирование нижележащего индекса — нет.

source: In a <emphasis>parallel index scan</emphasis> or <emphasis>parallel index-only scan</emphasis>, the cooperating processes take turns reading data from the index. Currently, parallel index scans are supported only for btree indexes. Each process will claim a single index block and will scan and return all tuples referenced by that block; other process can at the same time be returning tuples from a different index block. The results of a parallel btree scan are returned in sorted order within each worker process.
ru: При <emphasis>параллельном сканировании по индексу</emphasis> или <emphasis>параллельном сканировании только индекса</emphasis>, взаимодействующие процессы читают данные из индекса по очереди. В настоящее время параллельное сканирование индекса поддерживается только для индексов-B-деревьев. Каждый процесс будет выбирать один блок индекса с тем, чтобы просканировать и вернуть все кортежи, на которые он ссылается; другой процесс может в то же время возвращать кортежи для другого блока индекса. Результаты параллельного сканирования B-дерева каждый рабочий процесс возвращает в отсортированном порядке.

source: The following types of parallel-aware table scans are currently supported. <placeholder-1/> Other scan types, such as scans of non-btree indexes, may support parallel scans in the future.
ru: В настоящее время поддерживаются следующие виды сканирований таблицы, рассчитанные на параллельное выполнение. <placeholder-1/> В будущем может появиться поддержка параллельного выполнения и для других вариантов сканирования, например, сканирования индексов, отличных от B-дерева.

source: Parallel Joins
ru: Параллельные соединения

source: Just as in a non-parallel plan, the driving table may be joined to one or more other tables using a nested loop, hash join, or merge join. The inner side of the join may be any kind of non-parallel plan that is otherwise supported by the planner provided that it is safe to run within a parallel worker. For example, if a nested loop join is chosen, the inner plan may be an index scan which looks up a value taken from the outer side of the join.
ru: Как и в непараллельном плане, целевая таблица может соединяться с одной или несколькими другими таблицами с использованием вложенных циклов, соединений по хешу или соединений слиянием. Внутренней стороной соединения может быть любой вид непараллельного плана, который в остальном поддерживается планировщиком, при условии, что он безопасен для выполнения в параллельном исполнителе. Например, если выбрано соединение с вложенным циклом, во внутреннем плане может быть сканирование индекса, при котором находится значение, взятое из внешней стороны соединения.

source: Each worker will execute the inner side of the join in full. This is typically not a problem for nested loops, but may be inefficient for cases involving hash or merge joins. For example, for a hash join, this restriction means that an identical hash table is built in each worker process, which works fine for joins against small tables but may not be efficient when the inner table is large. For a merge join, it might mean that each worker performs a separate sort of the inner relation, which could be slow. Of course, in cases where a parallel plan of this type would be inefficient, the query planner will normally choose some other plan (possibly one which does not use parallelism) instead.
ru: Каждый рабочий процесс будет выполнять внутреннюю сторону соединения в полном объёме. Обычно это не проблема для вложенных циклов, но это может быть неэффективно с соединением по хешу или соединением слиянием. Например, для соединения по хешу это ограничение означает, что в каждом рабочем процессе будет строиться одна и та же хеш-таблица, что приемлемо для маленьких таблиц, но может быть неэффективно, когда внутренняя таблица велика. Для соединения слиянием это может означать, что каждый рабочий процесс независимо выполняет сортировку внутреннего отношения, потенциально медленную операцию. Конечно, в тех случаях, когда параллельный план такого вида может быть неэффективным, планировщик запросов обычно выбирает другой план (возможно, уже без распараллеливания).

source: Parallel Aggregation
ru: Параллельное агрегирование

source: <productname>PostgreSQL</productname> supports parallel aggregation by aggregating in two stages. First, each process participating in the parallel portion of the query performs an aggregation step, producing a partial result for each group of which that process is aware. This is reflected in the plan as a <literal>Partial Aggregate</literal> node. Second, the partial results are transferred to the leader via <literal>Gather</literal> or <literal>Gather Merge</literal>. Finally, the leader re-aggregates the results across all workers in order to produce the final result. This is reflected in the plan as a <literal>Finalize Aggregate</literal> node.
ru: <productname>PostgreSQL</productname> поддерживает параллельное агрегирование, выполняя агрегирование в два этапа. Сначала каждый процесс, задействованный в параллельной части запроса, выполняет шаг агрегирования, выдавая частичный результат для каждой известной ему группы. В плане это отражает узел <literal>Partial Aggregate</literal>. Затем эти промежуточные результаты передаются ведущему через узел <literal>Gather</literal> или <literal>Gather Merge</literal>. И наконец, ведущий заново агрегирует результаты всех рабочих процессов, чтобы получить окончательный результат. Это отражает в плане узел <literal>Finalize Aggregate</literal>.

source: Because the <literal>Finalize Aggregate</literal> node runs on the leader process, queries which produce a relatively large number of groups in comparison to the number of input rows will appear less favorable to the query planner. For example, in the worst-case scenario the number of groups seen by the <literal>Finalize Aggregate</literal> node could be as many as the number of input rows which were seen by all worker processes in the <literal>Partial Aggregate</literal> stage. For such cases, there is clearly going to be no performance benefit to using parallel aggregation. The query planner takes this into account during the planning process and is unlikely to choose parallel aggregate in this scenario.
ru: Так как узел <literal>Finalize Aggregate</literal> выполняется в ведущем процессе, запросы, выдающие достаточно большое количество групп по отношению к числу входных строк, будут расцениваться планировщиком как менее предпочтительные. Например, в худшем случае количество групп, выявленных узлом <literal>Finalize Aggregate</literal>, может равняться числу входных строк, обработанных всеми рабочими процессами на этапе <literal>Partial Aggregate</literal>. Очевидно, что в такой ситуации использование параллельного агрегирования не даст никакого выигрыша производительности. Планировщик запросов учитывает это в процессе планирования, так что выбор параллельного агрегирования в подобных случаях очень маловероятен.

source: Parallel aggregation is not supported in all situations. Each aggregate must be <link linkend="parallel-safety">safe</link> for parallelism and must have a combine function. If the aggregate has a transition state of type <literal>internal</literal>, it must have serialization and deserialization functions. See <xref linkend="sql-createaggregate"/> for more details. Parallel aggregation is not supported if any aggregate function call contains <literal>DISTINCT</literal> or <literal>ORDER BY</literal> clause and is also not supported for ordered set aggregates or when the query involves <literal>GROUPING SETS</literal>. It can only be used when all joins involved in the query are also part of the parallel portion of the plan.
ru: Параллельное агрегирование поддерживается не во всех случаях. Чтобы оно поддерживалось, агрегатная функция должна быть <link linkend="parallel-safety">безопасной</link> для распараллеливания и должна иметь комбинирующую функцию. Если переходное состояние агрегатной функции имеет тип <literal>internal</literal>, она должна также иметь функции сериализации и десериализации. За подробностями обратитесь к <xref remap="3" linkend="sql-createaggregate"/>. Параллельное агрегирование не поддерживается, если вызов агрегатной функции содержит предложение <literal>DISTINCT</literal> или <literal>ORDER BY</literal>. Также оно не поддерживается для сортирующих агрегатов или когда запрос включает предложение <literal>GROUPING SETS</literal>. Оно может использоваться только когда все соединения, задействованные в запросе, также входят в параллельную часть плана.

source: Parallel Plan Tips
ru: Советы по параллельным планам

source: If a query that is expected to do so does not produce a parallel plan, you can try reducing <xref linkend="guc-parallel-setup-cost"/> or <xref linkend="guc-parallel-tuple-cost"/>. Of course, this plan may turn out to be slower than the serial plan which the planner preferred, but this will not always be the case. If you don't get a parallel plan even with very small values of these settings (e.g. after setting them both to zero), there may be some reason why the query planner is unable to generate a parallel plan for your query. See <xref linkend="when-can-parallel-query-be-used"/> and <xref linkend="parallel-safety"/> for information on why this may be the case.
ru: Если для запроса ожидается параллельный план, но такой план не строится, можно попытаться уменьшить <xref linkend="guc-parallel-setup-cost"/> или <xref linkend="guc-parallel-tuple-cost"/>. Разумеется, этот план может оказаться медленнее последовательного плана, предпочитаемого планировщиком, но не всегда. Если вы не получаете параллельный план даже с очень маленькими значениями этих параметров (например, сбросив оба их в ноль), может быть какая-то веская причина тому, что планировщик запросов не может построить параллельный план для вашего запроса. За информацией о возможных причинах обратитесь к <xref remap="3" linkend="when-can-parallel-query-be-used"/> и <xref remap="3" linkend="parallel-safety"/>.

source: When executing a parallel plan, you can use <literal>EXPLAIN (ANALYZE, VERBOSE)</literal> to display per-worker statistics for each plan node. This may be useful in determining whether the work is being evenly distributed between all plan nodes and more generally in understanding the performance characteristics of the plan.
ru: Когда выполняется параллельный план, вы можете применить <literal>EXPLAIN (ANALYZE, VERBOSE)</literal>, чтобы просмотреть статистику по каждому узлу плана в разрезе рабочих процессов. Это может помочь определить, равномерно ли распределяется работа между всеми узлами плана, и на более общем уровне понимать характеристики производительности плана.

source: Parallel Safety
ru: Безопасность распараллеливания

source: The planner classifies operations involved in a query as either <firstterm>parallel safe</firstterm>, <firstterm>parallel restricted</firstterm>, or <firstterm>parallel unsafe</firstterm>. A parallel safe operation is one which does not conflict with the use of parallel query. A parallel restricted operation is one which cannot be performed in a parallel worker, but which can be performed in the leader while parallel query is in use. Therefore, parallel restricted operations can never occur below a <literal>Gather</literal> or <literal>Gather Merge</literal> node, but can occur elsewhere in a plan which contains such a node. A parallel unsafe operation is one which cannot be performed while parallel query is in use, not even in the leader. When a query contains anything which is parallel unsafe, parallel query is completely disabled for that query.
ru: Планировщик классифицирует операции, вовлечённые в выполнение запроса, как либо <firstterm>безопасные для распараллеливания</firstterm>, либо <firstterm>ограниченно распараллеливаемые</firstterm>, либо <firstterm>небезопасные для распараллеливания</firstterm>. Безопасной для распараллеливания операцией считается такая, которая не мешает параллельному выполнению запроса. Ограниченно распараллеливаемой операцией считается такая, которая не может выполняться в параллельном рабочем процессе, но может выполняться в ведущем процессе, когда запрос выполняется параллельно. Таким образом, ограниченно параллельные операции никогда не могут оказаться ниже узла <literal>Gather</literal> или <literal>Gather Merge</literal>, но могут встречаться в других местах плана, содержащего такой узел. Небезопасные для распараллеливания операции не могут выполняться в параллельных запросах, даже в ведущем процессе. Когда запрос содержит что-либо небезопасное для распараллеливания, параллельное выполнение для такого запроса полностью исключается.

source: The following operations are always parallel restricted.
ru: Параллельное выполнение всегда запрещается для следующих операций.

source: Scans of common table expressions (CTEs).
ru: Сканирование общих табличных выражений (CTE).

source: Scans of temporary tables.
ru: Сканирование временных таблиц.

source: Scans of foreign tables, unless the foreign data wrapper has an <literal>IsForeignScanParallelSafe</literal> API which indicates otherwise.
ru: Сканирование сторонних таблиц, если только обёртка сторонних данных не предоставляет функцию <literal>IsForeignScanParallelSafe</literal>, которая допускает распараллеливание.

source: Access to an <literal>InitPlan</literal> or correlated <literal>SubPlan</literal>.
ru: Доступ к <literal>InitPlan</literal> или связанному <literal>SubPlan</literal>.

source: Parallel Labeling for Functions and Aggregates
ru: Пометки параллельности для функций и агрегатов

source: The planner cannot automatically determine whether a user-defined function or aggregate is parallel safe, parallel restricted, or parallel unsafe, because this would require predicting every operation which the function could possibly perform. In general, this is equivalent to the Halting Problem and therefore impossible. Even for simple functions where it conceivably be done, we do not try, since this would be expensive and error-prone. Instead, all user-defined functions are assumed to be parallel unsafe unless otherwise marked. When using <xref linkend="sql-createfunction"/> or <xref linkend="sql-alterfunction"/>, markings can be set by specifying <literal>PARALLEL SAFE</literal>, <literal>PARALLEL RESTRICTED</literal>, or <literal>PARALLEL UNSAFE</literal> as appropriate. When using <xref linkend="sql-createaggregate"/>, the <literal>PARALLEL</literal> option can be specified with <literal>SAFE</literal>, <literal>RESTRICTED</literal>, or <literal>UNSAFE</literal> as the corresponding value.
ru: Планировщик не может автоматически определить, является ли пользовательская обычная или агрегатная функция безопасной для распараллеливания, так как это потребовало бы предсказания действия каждой операции, которую могла бы выполнять функция. В общем случае это равнозначно решению проблемы остановки, а значит, невозможно. Даже для простых функций, где это в принципе возможно, мы не пытаемся это делать, так как это будет слишком дорогой и потенциально неточной процедурой. Вместо этого, все определяемые пользователем функции полагаются небезопасными для распараллеливания, если явно не отмечено обратное. Когда используется <xref linkend="sql-createfunction"/> или <xref linkend="sql-alterfunction"/>, функции можно назначить отметку <literal>PARALLEL SAFE</literal>, <literal>PARALLEL RESTRICTED</literal> или <literal>PARALLEL UNSAFE</literal>, отражающую её характер. В команде <xref linkend="sql-createaggregate"/> для параметра <literal>PARALLEL</literal> можно задать <literal>SAFE</literal>, <literal>RESTRICTED</literal> или <literal>UNSAFE</literal> в виде соответствующего значения.

source: Functions and aggregates must be marked <literal>PARALLEL UNSAFE</literal> if they write to the database, access sequences, change the transaction state even temporarily (e.g. a PL/pgSQL function which establishes an <literal>EXCEPTION</literal> block to catch errors), or make persistent changes to settings. Similarly, functions must be marked <literal>PARALLEL RESTRICTED</literal> if they access temporary tables, client connection state, cursors, prepared statements, or miscellaneous backend-local state which the system cannot synchronize across workers. For example, <literal>setseed</literal> and <literal>random</literal> are parallel restricted for this last reason.
ru: Обычные и агрегатные функции должны помечаться небезопасными для распараллеливания (<literal>PARALLEL UNSAFE</literal>), если они пишут в базу данных, обращаются к последовательностям, изменяют состояние транзакции, даже временно (как, например, функция PL/pgSQL, устанавливающая блок <literal>EXCEPTION</literal> для перехвата ошибок), либо производят постоянные изменения параметров. Подобным образом, функции должны помечаться как ограниченно распараллеливаемые (<literal>PARALLEL RESTRICTED</literal>), если они обращаются к временным таблицам, состоянию клиентского подключения, курсорам, подготовленным операторам или разнообразному локальному состоянию обслуживающего процесса, которое система не может синхронизировать между рабочими процессами. Например, по этой причине ограниченно параллельными являются функции <literal>setseed</literal> и <literal>random</literal>.

source: In general, if a function is labeled as being safe when it is restricted or unsafe, or if it is labeled as being restricted when it is in fact unsafe, it may throw errors or produce wrong answers when used in a parallel query. C-language functions could in theory exhibit totally undefined behavior if mislabeled, since there is no way for the system to protect itself against arbitrary C code, but in most likely cases the result will be no worse than for any other function. If in doubt, it is probably best to label functions as <literal>UNSAFE</literal>.
ru: В целом, если функция помечена как безопасная, когда на самом деле она небезопасна или ограниченно безопасна, или если она помечена как ограниченно безопасная, когда на самом деле она небезопасная, такая функция может выдавать ошибки или возвращать неправильные ответы при использовании в параллельном запросе. Функции на языке C могут теоретически проявлять полностью неопределённое появление при некорректной пометке, так как система никаким образом не может защитить себя от произвольного кода C, но чаще всего результат будет не хуже, чем с любой другой функцией. В случае сомнений, вероятно, лучше всего будет помечать функции как небезопасные (<literal>UNSAFE</literal>).

source: If a function executed within a parallel worker acquires locks which are not held by the leader, for example by querying a table not referenced in the query, those locks will be released at worker exit, not end of transaction. If you write a function which does this, and this behavior difference is important to you, mark such functions as <literal>PARALLEL RESTRICTED</literal> to ensure that they execute only in the leader.
ru: Если функция, выполняемая в параллельном рабочем процессе, затребует блокировки, которыми не владеет ведущий, например, обращаясь к таблице, не упомянутой в запросе, эти блокировки будут освобождены по завершении процесса, а не в конце транзакции. Если вы разрабатываете функцию с таким поведением, и эта особенность выполнения оказывается критичной, пометьте такую функцию как <literal>PARALLEL RESTRICTED</literal>, чтобы она выполнялась только в ведущем процессе.
