Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/pltcl.po
Languages: ru

source: Tcl provides an <varname>errorCode</varname> variable that can represent additional information about an error in a form that is easy for Tcl programs to interpret. The contents are in Tcl list format, and the first word identifies the subsystem or library reporting the error; beyond that the contents are left to the individual subsystem or library. For database errors reported by PL/Tcl commands, the first word is <literal>POSTGRES</literal>, the second word is the Postgres version number, and additional words are field name/value pairs providing detailed information about the error. Fields <varname>SQLSTATE</varname>, <varname>condition</varname>, and <varname>message</varname> are always supplied (the first two represent the error code and condition name as shown in <xref linkend="errcodes-appendix"/>). Fields that may be present include <varname>detail</varname>, <varname>hint</varname>, <varname>context</varname>, <varname>schema</varname>, <varname>table</varname>, <varname>column</varname>, <varname>datatype</varname>, <varname>constraint</varname>, <varname>statement</varname>, <varname>cursor_position</varname>, <varname>filename</varname>, <varname>lineno</varname>, and <varname>funcname</varname>.
ru: В Tcl имеется переменная <varname>errorCode</varname>, представляющая дополнительную информацию об ошибке в виде, удобном для обработки в программах на Tcl. Эта информация передаётся в формате списка Tcl, первое слово в котором указывает на подсистему или библиотеку, выдающую ошибку; последующее содержимое определяется в зависимости от подсистемы или библиотеки. Для ошибок СУБД, возникающих в командах PL/Tcl, первым словом будет <literal>POSTGRES</literal>, вторым — номер версии Postgres, а дополнительные слова представляют пары имя/значения, передающие подробную информацию об ошибке. В этих парах всегда передаются поля <varname>SQLSTATE</varname>, <varname>condition</varname> и <varname>message</varname> (первые два представляют код ошибки и имя условия, как описано в <xref remap="6" linkend="errcodes-appendix"/>). Также могут передаваться поля <varname>detail</varname>, <varname>hint</varname>, <varname>context</varname>, <varname>schema</varname>, <varname>table</varname>, <varname>column</varname>, <varname>datatype</varname>, <varname>constraint</varname>, <varname>statement</varname>, <varname>cursor_position</varname>, <varname>filename</varname>, <varname>lineno</varname> и <varname>funcname</varname>.

source: Modules and the <function>unknown</function> Command
ru: Модули и команда <function>unknown</function>

source: PL/Tcl has support for autoloading Tcl code when used. It recognizes a special table, <literal>pltcl_modules</literal>, which is presumed to contain modules of Tcl code. If this table exists, the module <literal>unknown</literal> is fetched from the table and loaded into the Tcl interpreter immediately before the first execution of a PL/Tcl function in a database session. (This happens separately for each Tcl interpreter, if more than one is used in a session; see <xref linkend="pltcl-global"/>.)
ru: PL/Tcl поддерживает автозагрузку кода Tcl. Для этого он задействует специальную таблицу, <literal>pltcl_modules</literal>, предназначенную для размещения модулей кода Tcl. Если эта таблица существует, из таблицы выбирается модуль <literal>unknown</literal> и загружается в интерпретатор Tcl непосредственно перед первым выполнением функции PL/Tcl в сеансе базы данных. (Это происходит независимо для каждого интерпретатора Tcl, если их несколько в одном сеансе; см. <xref remap="4" linkend="pltcl-global"/>.)

source: The <productname>PostgreSQL</productname> distribution includes support scripts to maintain these tables: <command>pltcl_loadmod</command>, <command>pltcl_listmod</command>, <command>pltcl_delmod</command>, as well as source for the standard <literal>unknown</literal> module in <filename>share/unknown.pltcl</filename>. This module must be loaded into each database initially to support the autoloading mechanism.
ru: В составе <productname>PostgreSQL</productname> поставляются вспомогательные скрипты для обслуживания этих таблиц: <command>pltcl_loadmod</command>, <command>pltcl_listmod</command>, <command>pltcl_delmod</command>, а также исходный код стандартного модуля <literal>unknown</literal> в <filename>share/unknown.pltcl</filename>. Для поддержки механизма автозагрузки этот модуль должен изначально загружаться в каждую базу данных.

source: The tables <literal>pltcl_modules</literal> and <literal>pltcl_modfuncs</literal> must be readable by all, but it is wise to make them owned and writable only by the database administrator. As a security precaution, PL/Tcl will ignore <literal>pltcl_modules</literal> (and thus, not attempt to load the <literal>unknown</literal> module) unless it is owned by a superuser. But update privileges on this table can be granted to other users, if you trust them sufficiently.
ru: Таблицы <literal>pltcl_modules</literal> и <literal>pltcl_modfuncs</literal> должны быть доступны на чтение всем, но разрешать запись в них разумно только администратору базы данных (и только он должен быть их владельцем). В качестве меры предосторожности PL/Tcl будет игнорировать таблицу <literal>pltcl_modules</literal> (и таким образом, не будет пытаться загрузить модуль <literal>unknown</literal>), если она принадлежит не суперпользователю. Но право на изменение данных в ней можно дать и другим пользователям, если они заслуживают такого доверия.
