Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/pltcl.po
Languages: ru

source: PL/Tcl - Tcl Procedural Language
ru: PL/Tcl — процедурный язык Tcl

source: PL/Tcl is a loadable procedural language for the <productname>PostgreSQL</productname> database system that enables the <ulink url="http://www.tcl.tk/"> Tcl language</ulink> to be used to write functions and trigger procedures.
ru: PL/Tcl — это загружаемый процедурный язык для СУБД <productname>PostgreSQL</productname>, позволяющий использовать <ulink url="http://www.tcl.tk/">язык Tcl</ulink> для написания функций и триггерных процедур.

source: Overview
ru: Обзор

source: PL/Tcl offers most of the capabilities a function writer has in the C language, with a few restrictions, and with the addition of the powerful string processing libraries that are available for Tcl.
ru: PL/Tcl предоставляет большинство возможностей, которые имеет разработчик функций на C, с небольшими ограничениями, и позволяет применять мощные библиотеки обработки строк, существующие для Tcl.

source: One compelling <emphasis>good</emphasis> restriction is that everything is executed from within the safety of the context of a Tcl interpreter. In addition to the limited command set of safe Tcl, only a few commands are available to access the database via SPI and to raise messages via <function>elog()</function>. PL/Tcl provides no way to access internals of the database server or to gain OS-level access under the permissions of the <productname>PostgreSQL</productname> server process, as a C function can do. Thus, unprivileged database users can be trusted to use this language; it does not give them unlimited authority.
ru: Одним убедительным <emphasis>хорошим</emphasis> ограничением является то, что весь код выполняется в контексте безопасности интерпретатора Tcl. Помимо ограниченного набора команд безопасного Tcl, разрешены только несколько команд для обращения к базе данных через SPI и вызовы <function>elog()</function> для выдачи сообщений. PL/Tcl не даёт возможности взаимодействовать с внутренним механизмом сервера баз данных или обращаться к ОС с правами серверного процесса <productname>PostgreSQL</productname>, что возможно в функциях на C. Таким образом, использование этого языка можно доверить непривилегированным пользователям; это не даст им неограниченные полномочия.

source: The other notable implementation restriction is that Tcl functions cannot be used to create input/output functions for new data types.
ru: Ещё одно существенное ограничение заключается в том, что функции на Tcl нельзя использовать для создания функций ввода/вывода для новых типов данных.

source: Sometimes it is desirable to write Tcl functions that are not restricted to safe Tcl. For example, one might want a Tcl function that sends email. To handle these cases, there is a variant of <application>PL/Tcl</application> called <literal>PL/TclU</literal> (for untrusted Tcl). This is exactly the same language except that a full Tcl interpreter is used. <emphasis>If <application>PL/TclU</application> is used, it must be installed as an untrusted procedural language</emphasis> so that only database superusers can create functions in it. The writer of a <application>PL/TclU</application> function must take care that the function cannot be used to do anything unwanted, since it will be able to do anything that could be done by a user logged in as the database administrator.
ru: Иногда возникает желание написать функцию на Tcl, которая не будут ограничена безопасным Tcl. Например, может потребоваться функция, которая будет посылать сообщения по почте. Для этих случаев есть вариация <application>PL/Tcl</application>, названная <literal>PL/TclU</literal> (название подразумевает &laquo;untrusted Tcl&raquo;, недоверенный Tcl). Это тот же язык, за исключением того, что для него используется полноценный интерпретатор Tcl. <emphasis>Если применяется <application>PL/TclU</application>, он должен быть установлен как недоверенный процедурный язык</emphasis>, чтобы только суперпользователи могли создавать функции на нём. Автор функции на <application>PL/TclU</application> должен позаботиться о том, чтобы эту функцию нельзя было использовать не по назначению, так как она может делать всё, что может пользователь с правами администратора баз данных.

source: The shared object code for the <application>PL/Tcl</application> and <application>PL/TclU</application> call handlers is automatically built and installed in the <productname>PostgreSQL</productname> library directory if Tcl support is specified in the configuration step of the installation procedure. To install <application>PL/Tcl</application> and/or <application>PL/TclU</application> in a particular database, use the <command>CREATE EXTENSION</command> command, for example <literal>CREATE EXTENSION pltcl</literal> or <literal>CREATE EXTENSION pltclu</literal>.
ru: Разделяемый объектный код для обработчиков вызова <application>PL/Tcl</application> и <application>PL/TclU</application> собирается автоматически и устанавливается в каталог библиотек <productname>PostgreSQL</productname>, если поддержка Tcl включена на этапе конфигурирования процедуры установки. Чтобы установить <application>PL/Tcl</application> и/или <application>PL/TclU</application> в конкретную базу данных, воспользуйтесь командой <command>CREATE EXTENSION</command>, например, так: <literal>CREATE EXTENSION pltcl</literal> или <literal>CREATE EXTENSION pltclu</literal>.

source: The shared object code for the <application>PL/Tcl</application> and <application>PL/TclU</application> call handlers is automatically built and installed in the <productname>PostgreSQL</productname> library directory if Tcl support is specified in the configuration step of the installation procedure. To install <application>PL/Tcl</application> and/or <application>PL/TclU</application> in a particular database, use the <command>CREATE EXTENSION</command> command or the <command>createlang</command> program, for example <literal>createlang pltcl <replaceable>dbname</replaceable></literal> or <literal>createlang pltclu <replaceable>dbname</replaceable></literal>.
ru: Разделяемый объектный код для обработчиков вызова <application>PL/Tcl</application> и <application>PL/TclU</application> собирается автоматически и устанавливается в каталог библиотек <productname>PostgreSQL</productname>, если поддержка Tcl включена на этапе конфигурирования процедуры установки. Чтобы установить <application>PL/Tcl</application> и/или <application>PL/TclU</application> в конкретную базу данных, воспользуйтесь командой <command>CREATE EXTENSION</command> или программой <command>createlang</command>, например, так: <literal>createlang pltcl <replaceable>имя_базы</replaceable></literal> или <literal>createlang pltclu <replaceable>имя_базы</replaceable></literal>.

source: PL/Tcl Functions and Arguments
ru: Функции на PL/Tcl и их аргументы

source: CREATE FUNCTION <replaceable>funcname</replaceable> (<replaceable>argument-types</replaceable>) RETURNS <replaceable>return-type</replaceable> AS $$ # PL/Tcl function body $$ LANGUAGE pltcl;
ru: CREATE FUNCTION <replaceable>имя_функции</replaceable> (<replaceable>типы_аргументов</replaceable>) RETURNS <replaceable>тип_результата</replaceable> AS $$ # Тело функции на PL/Tcl $$ LANGUAGE pltcl;

source: To create a function in the <application>PL/Tcl</application> language, use the standard <xref linkend="sql-createfunction"/> syntax: <placeholder-1/> <application>PL/TclU</application> is the same, except that the language has to be specified as <literal>pltclu</literal>.
ru: Чтобы создать функцию на языке <application>PL/Tcl</application>, используйте стандартный синтаксис <xref linkend="sql-createfunction"/>: <placeholder-1/> С <application>PL/TclU</application> команда та же, но в качестве языка должно быть указано <literal>pltclu</literal>.

source: The body of the function is simply a piece of Tcl script. When the function is called, the argument values are passed to the Tcl script as variables named <literal>1</literal> ... <literal><replaceable>n</replaceable></literal>. The result is returned from the Tcl code in the usual way, with a <literal>return</literal> statement.
ru: Тело функции содержит просто скрипт на Tcl. Когда вызывается функция, значения аргументов передаются скрипту Tcl в виде переменных с именами <literal>1</literal> ... <literal><replaceable>n</replaceable></literal>. Результат из кода Tcl возвращается как обычно, оператором <literal>return</literal>.

source: For example, a function returning the greater of two integer values could be defined as: <placeholder-1/> Note the clause <literal>STRICT</literal>, which saves us from having to think about null input values: if a null value is passed, the function will not be called at all, but will just return a null result automatically.
ru: Например, функцию, возвращающую большее из двух целых чисел, можно определить так: <placeholder-1/> Обратите внимание на предложение <literal>STRICT</literal>, которое избавляет нас от необходимости думать о входящих значениях NULL: если при вызове передаётся значение NULL, функция не будет выполняться вовсе, будет сразу возвращён результат NULL.

source: In a nonstrict function, if the actual value of an argument is null, the corresponding <literal>$<replaceable>n</replaceable></literal> variable will be set to an empty string. To detect whether a particular argument is null, use the function <literal>argisnull</literal>. For example, suppose that we wanted <function>tcl_max</function> with one null and one nonnull argument to return the nonnull argument, rather than null: <placeholder-1/>
ru: В нестрогой функции, если фактическое значение аргумента — NULL, соответствующей переменной <literal>$<replaceable>n</replaceable></literal> будет присвоена пустая строка. Чтобы определить, был ли передан NULL в определённом аргументе, используйте функцию <literal>argisnull</literal>. Например, предположим, что нам нужна функция <function>tcl_max</function>, которая с одним аргументом NULL и вторым аргументом не NULL должна возвращать не NULL, а второй аргумент: <placeholder-1/>

source: As shown above, to return a null value from a PL/Tcl function, execute <literal>return_null</literal>. This can be done whether the function is strict or not.
ru: Как показано выше, чтобы вернуть значение NULL из функции PL/Tcl, нужно выполнить <literal>return_null</literal>. Это можно сделать и в строгой, и в нестрогой функции.

source: Composite-type arguments are passed to the function as Tcl arrays. The element names of the array are the attribute names of the composite type. If an attribute in the passed row has the null value, it will not appear in the array. Here is an example: <placeholder-1/>
ru: Аргументы составного типа передаются функции в виде массивов Tcl. Именами элементов массива являются имена атрибутов составного типа. Если атрибут в переданной строке имеет значение NULL, он будет отсутствовать в данном массиве. Например: <placeholder-1/>

source: PL/Tcl functions can return composite-type results, too. To do this, the Tcl code must return a list of column name/value pairs matching the expected result type. Any column names omitted from the list are returned as nulls, and an error is raised if there are unexpected column names. Here is an example: <placeholder-1/>
ru: Функции PL/Tcl могут возвращать и результаты составного типа. Для этого код на Tcl должен вернуть список пар имя/значение столбца, соответствующий ожидаемому типу результата. Столбцы, имена которых в этом списке отсутствуют, получат значения NULL, а если в списке указано имя несуществующего столбца, возникнет ошибка. Например: <placeholder-1/>

source: The result list can be made from an array representation of the desired tuple with the <literal>array get</literal> Tcl command. For example: <placeholder-1/>
ru: Список результатов можно создать из желаемого кортежа, представленного в виде массива, с помощью команды <literal>array get</literal> языка Tcl. Например: <placeholder-1/>

source: PL/Tcl functions can return sets. To do this, the Tcl code should call <function>return_next</function> once per row to be returned, passing either the appropriate value when returning a scalar type, or a list of column name/value pairs when returning a composite type. Here is an example returning a scalar type: <placeholder-1/> and here is one returning a composite type: <placeholder-2/>
ru: Функции PL/Tcl могут возвращать наборы результатов. Для этого код на Tcl должен вызывать <function>return_next</function> для каждой возвращаемой строки, передавая ей соответствующее значение, когда возвращается скалярный тип, или список пар имя/значение столбца, когда возвращается составной тип. Пример с результатом скалярного типа: <placeholder-1/> и с результатом составного: <placeholder-2/>

source: Data Values in PL/Tcl
ru: Значения данных в PL/Tcl

source: The argument values supplied to a PL/Tcl function's code are simply the input arguments converted to text form (just as if they had been displayed by a <command>SELECT</command> statement). Conversely, the <literal>return</literal> and <literal>return_next</literal> commands will accept any string that is acceptable input format for the function's declared result type, or for the specified column of a composite result type.
ru: Значения аргументов, передаваемые в код функции PL/Tcl, представляют собой просто входные аргументы, преобразованные в текстовый вид (так же, как при выводе оператором <command>SELECT</command>). И наоборот, команды <literal>return</literal> и <literal>return_next</literal> примут любую строку, соответствующую формату ввода для объявленного типа результата функции или заданного столбца в результате составного типа.

source: Global Data in PL/Tcl
ru: Глобальные данные в PL/Tcl

source: <primary>global data</primary> <secondary>in PL/Tcl</secondary>
ru: <primary>глобальные данные</primary> <secondary>в PL/Tcl</secondary>

source: Sometimes it is useful to have some global data that is held between two calls to a function or is shared between different functions. This is easily done in PL/Tcl, but there are some restrictions that must be understood.
ru: Иногда полезно иметь некоторые глобальные данные, сохраняемые между двумя вызовами функции или совместно используемые разными функциями. Это легко сделать в PL/Tcl, но есть некоторые ограничения, которые необходимо понимать.

source: For security reasons, PL/Tcl executes functions called by any one SQL role in a separate Tcl interpreter for that role. This prevents accidental or malicious interference by one user with the behavior of another user's PL/Tcl functions. Each such interpreter will have its own values for any <quote>global</quote> Tcl variables. Thus, two PL/Tcl functions will share the same global variables if and only if they are executed by the same SQL role. In an application wherein a single session executes code under multiple SQL roles (via <literal>SECURITY DEFINER</literal> functions, use of <command>SET ROLE</command>, etc) you may need to take explicit steps to ensure that PL/Tcl functions can share data. To do that, make sure that functions that should communicate are owned by the same user, and mark them <literal>SECURITY DEFINER</literal>. You must of course take care that such functions can't be used to do anything unintended.
ru: По соображениям безопасности, PL/Tcl выполняет функции, вызываемые некоторой ролью SQL в отдельном интерпретаторе Tcl, выделенном для этой роли. Это предотвращает случайное или злонамеренное влияние одного пользователя на поведение функций PL/Tcl другого пользователя. В каждом интерпретаторе будут свои значения всех <quote>глобальных</quote> переменных Tcl. Таким образом, в двух функциях PL/Tcl будут общие глобальные переменные, только если они выполняются одной ролью SQL. В приложении, выполняющем код в одном сеансе с разными ролями SQL (вызывающем функции <literal>SECURITY DEFINER</literal>, использующем команду <command>SET ROLE</command> и т. д.) может понадобиться явно предпринять дополнительные меры, чтобы функции могли разделять свои данные. Для этого сначала установите для функций, которые должны взаимодействовать, одного владельца, а затем задайте для них свойство <literal>SECURITY DEFINER</literal>. Разумеется, при этом нужно позаботиться о том, чтобы эти функции не могли сделать ничего непредусмотренного.

source: All PL/TclU functions used in a session execute in the same Tcl interpreter, which of course is distinct from the interpreter(s) used for PL/Tcl functions. So global data is automatically shared between PL/TclU functions. This is not considered a security risk because all PL/TclU functions execute at the same trust level, namely that of a database superuser.
ru: Все функции PL/TclU, вызываемые в одном сеансе, выполняются одним интерпретатором Tcl, который, конечно, отличается от интерпретатора(ов), используемого для функций PL/Tcl. Поэтому глобальные данные функций PL/TclU автоматически становятся общими. Это не считается угрозой безопасности, так как все функции PL/TclU выполняются на одном уровне доверия, а именно уровне суперпользователя базы данных.

source: To help protect PL/Tcl functions from unintentionally interfering with each other, a global array is made available to each function via the <function>upvar</function> command. The global name of this variable is the function's internal name, and the local name is <literal>GD</literal>. It is recommended that <literal>GD</literal> be used for persistent private data of a function. Use regular Tcl global variables only for values that you specifically intend to be shared among multiple functions. (Note that the <literal>GD</literal> arrays are only global within a particular interpreter, so they do not bypass the security restrictions mentioned above.)
ru: Чтобы защитить функции PL/Tcl от непреднамеренного влияния друг на друга, каждой из них предоставляется глобальная переменная-массив через команду <function>upvar</function>. Глобальным именем этой переменной является внутреннее имя функции, а в качестве локального выбрано <literal>GD</literal>. Переменную <literal>GD</literal> рекомендуется использовать для постоянных внутренних данных функции. Обычные глобальные переменные Tcl следует использовать только для значений, которые предназначены именно для совместного использования несколькими функциями. (Заметьте, что массивы <literal>GD</literal> являются глобальными только для конкретного интерпретатора, так что они не нарушают ограничения безопасности, описанные выше.)

source: An example of using <literal>GD</literal> appears in the <function>spi_execp</function> example below.
ru: Использование <literal>GD</literal> демонстрируется в примере <function>spi_execp</function>, приведённом ниже.

source: Database Access from PL/Tcl
ru: Обращение к базе данных из PL/Tcl

source: name
ru: имя

source: command
ru: команда

source: loop-body
ru: тело-цикла

source: Executes an SQL command given as a string. An error in the command causes an error to be raised. Otherwise, the return value of <function>spi_exec</function> is the number of rows processed (selected, inserted, updated, or deleted) by the command, or zero if the command is a utility statement. In addition, if the command is a <command>SELECT</command> statement, the values of the selected columns are placed in Tcl variables as described below.
ru: Выполняет команду SQL, заданную в виде строки. В случае ошибки в этой команде выдаётся ошибка в Tcl. В противном случае <function>spi_exec</function> возвращает число обработанных командой строк (выбранных, добавленных, изменённых или удалённых), либо ноль, если эта команда — служебный оператор. Кроме того, если команда — оператор <command>SELECT</command>, значения выбранных столбцов помещаются в переменные Tcl, как описано ниже.

source: The optional <literal>-count</literal> value tells <function>spi_exec</function> the maximum number of rows to process in the command. The effect of this is comparable to setting up a query as a cursor and then saying <literal>FETCH <replaceable>n</replaceable></literal>.
ru: Необязательное значение <literal>-count</literal> задаёт для <function>spi_exec</function> максимальное число строк, которое должно быть обработано в команде. Его действие можно представить как выполнение <literal>FETCH <replaceable>n</replaceable></literal> для курсора, предварительно подготовленного для команды.

source: If the command is a <command>SELECT</command> statement, the values of the result columns are placed into Tcl variables named after the columns. If the <literal>-array</literal> option is given, the column values are instead stored into elements of the named associative array, with the column names used as array indexes. In addition, the current row number within the result (counting from zero) is stored into the array element named <quote><literal>.tupno</literal></quote>, unless that name is in use as a column name in the result.
ru: Если в качестве команды выполняется оператор <command>SELECT</command>, значения результирующих столбцов помещаются в переменные Tcl, названные по именам столбцов. Если передаётся <literal>-array</literal>, значения столбцов вместо этого становятся элементами названного ассоциативного массива, индексами в котором становятся имена столбцов. Кроме того, в элементе с именем <quote><literal>.tupno</literal></quote> сохраняется номер текущей строки в результирующем наборе (отсчитывая от нуля), если только это имя не занято одним из столбцов результата.

source: If the command is a <command>SELECT</command> statement and no <replaceable>loop-body</replaceable> script is given, then only the first row of results are stored into Tcl variables or array elements; remaining rows, if any, are ignored. No storing occurs if the query returns no rows. (This case can be detected by checking the result of <function>spi_exec</function>.) For example: <placeholder-1/> will set the Tcl variable <literal>$cnt</literal> to the number of rows in the <structname>pg_proc</structname> system catalog.
ru: Если в качестве команды выполняется <command>SELECT</command> без указания скрипта <replaceable>тело-цикла</replaceable>, в переменных Tcl или элементах массива сохраняется только первая строка результатов; оставшиеся строки (если они есть), игнорируются. Если запрос не возвращает строки, не сохраняется ничего. (Этот случай можно отследить, проверив результат <function>spi_exec</function>.) Например, команда: <placeholder-1/> присвоит переменной <literal>$cnt</literal> в Tcl число строк, содержащихся в системном каталоге <structname>pg_proc</structname>.
