Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/pltcl.po
Languages: ru

source: If the optional <replaceable>loop-body</replaceable> argument is given, it is a piece of Tcl script that is executed once for each row in the query result. (<replaceable>loop-body</replaceable> is ignored if the given command is not a <command>SELECT</command>.) The values of the current row's columns are stored into Tcl variables or array elements before each iteration. For example: <placeholder-1/> will print a log message for every row of <literal>pg_class</literal>. This feature works similarly to other Tcl looping constructs; in particular <literal>continue</literal> and <literal>break</literal> work in the usual way inside the loop body.
ru: Если передаётся необязательный аргумент <replaceable>тело-цикла</replaceable>, заданный в нём блок скрипта Tcl будет выполняться для каждой строки результата запроса. (Аргумент <replaceable>тело-цикла</replaceable> игнорируется, если целевая команда — не <command>SELECT</command>.) При этом значения столбцов текущей строки сохраняются в переменных Tcl или элементах массива перед каждой итерацией этого цикла. Например, код: <placeholder-1/> будет выводить в журнал сообщение для каждой строки <literal>pg_class</literal>. Это работает подобно другим конструкциям циклов в Tcl; в частности, команды <literal>continue</literal> и <literal>break</literal> в теле цикла будут действовать обычным образом.

source: If a column of a query result is null, the target variable for it is <quote>unset</quote> rather than being set.
ru: Если в столбце результата запроса выдаётся NULL, целевая переменная для неё не устанавливается, и оказывается <quote>неустановленной</quote>.

source: query
ru: запрос

source: typelist
ru: список-типов

source: <primary>preparing a query</primary> <secondary>in PL/Tcl</secondary>
ru: <primary>подготовка запроса</primary> <secondary>в PL/Tcl</secondary>

source: Prepares and saves a query plan for later execution. The saved plan will be retained for the life of the current session.<placeholder-1/>
ru: Подготавливает и сохраняет план запроса для последующего выполнения. Сохранённый план будет продолжать существование до завершения текущего сеанса.<placeholder-1/>

source: The query can use parameters, that is, placeholders for values to be supplied whenever the plan is actually executed. In the query string, refer to parameters by the symbols <literal>$1</literal> ... <literal>$<replaceable>n</replaceable></literal>. If the query uses parameters, the names of the parameter types must be given as a Tcl list. (Write an empty list for <replaceable>typelist</replaceable> if no parameters are used.)
ru: Запрос может принимать параметры, то есть местозаполнители для значений, которые будут передаваться, когда план будет собственно выполняться. В строке запроса эти параметры обозначаются как <literal>$1</literal> ... <literal>$<replaceable>n</replaceable></literal>. Если в запросе используются параметры, нужно задать имена типов этих параметров в виде списка Tcl. (Если параметры отсутствуют, задайте пустой <replaceable>список_типов</replaceable>.)

source: The return value from <function>spi_prepare</function> is a query ID to be used in subsequent calls to <function>spi_execp</function>. See <function>spi_execp</function> for an example.
ru: Функция <function>spi_prepare</function> возвращает идентификатор запроса, который может использоваться в последующих вызовах <function>spi_execp</function>. Пример приведён в описании <function>spi_execp</function>.

source: string
ru: строка

source: queryid
ru: ид-запроса

source: value-list
ru: список-значений

source: Executes a query previously prepared with <function>spi_prepare</function>. <replaceable>queryid</replaceable> is the ID returned by <function>spi_prepare</function>. If the query references parameters, a <replaceable>value-list</replaceable> must be supplied. This is a Tcl list of actual values for the parameters. The list must be the same length as the parameter type list previously given to <function>spi_prepare</function>. Omit <replaceable>value-list</replaceable> if the query has no parameters.
ru: Выполняет запрос, ранее подготовленный функцией <function>spi_prepare</function>. В качестве <replaceable>ид_запроса</replaceable> передаётся идентификатор, возвращённый функцией <function>spi_prepare</function>. Если в запросе задействуются параметры, необходимо указать <replaceable>список-значений</replaceable>. Это должен быть принятый в Tcl список параметров. Он должен иметь ту же длину, что и список типов параметров, ранее переданный <function>spi_prepare</function>. Опустите <replaceable>список-значений</replaceable>, если у запроса нет параметров.

source: The optional value for <literal>-nulls</literal> is a string of spaces and <literal>'n'</literal> characters telling <function>spi_execp</function> which of the parameters are null values. If given, it must have exactly the same length as the <replaceable>value-list</replaceable>. If it is not given, all the parameter values are nonnull.
ru: Необязательный аргумент <literal>-nulls</literal> принимает строку из пробелов и символов <literal>'n'</literal>, которые отмечают, в каких параметрах <function>spi_execp</function> передаются значения NULL. Если присутствует, эта строка должна иметь ту же длину, что и <replaceable>список-значений</replaceable>. В случае её отсутствия значения всех параметров считаются отличными от NULL.

source: Except for the way in which the query and its parameters are specified, <function>spi_execp</function> works just like <function>spi_exec</function>. The <literal>-count</literal>, <literal>-array</literal>, and <replaceable>loop-body</replaceable> options are the same, and so is the result value.
ru: Не считая отличий в способе передачи запроса и параметров, <function>spi_execp</function> работает так же, как <function>spi_exec</function>. Параметры <literal>-count</literal>, <literal>-array</literal> и <replaceable>тело-цикла</replaceable> задаются так же, и так же передаётся возвращаемое значение.

source: CREATE FUNCTION t1_count(integer, integer) RETURNS integer AS $$ if {![ info exists GD(plan) ]} { # prepare the saved plan on the first call set GD(plan) [ spi_prepare \ "SELECT count(*) AS cnt FROM t1 WHERE num &gt;= \$1 AND num &lt;= \$2" \ [ list int4 int4 ] ] } spi_execp -count 1 $GD(plan) [ list $1 $2 ] return $cnt $$ LANGUAGE pltcl;
ru: CREATE FUNCTION t1_count(integer, integer) RETURNS integer AS $$ if {![ info exists GD(plan) ]} { # подготовить сохранённый план при первом вызове set GD(plan) [ spi_prepare \ "SELECT count(*) AS cnt FROM t1 WHERE num &gt;= \$1 AND num &lt;= \$2" \ [ list int4 int4 ] ] } spi_execp -count 1 $GD(plan) [ list $1 $2 ] return $cnt $$ LANGUAGE pltcl;

source: Here's an example of a PL/Tcl function using a prepared plan: <placeholder-1/> We need backslashes inside the query string given to <function>spi_prepare</function> to ensure that the <literal>$<replaceable>n</replaceable></literal> markers will be passed through to <function>spi_prepare</function> as-is, and not replaced by Tcl variable substitution.
ru: Взгляните на пример функции на PL/Tcl, использующей подготовленный план: <placeholder-1/> Обратные косые черты внутри строки запроса, передаваемой функции <function>spi_prepare</function>, нужны для того, чтобы маркеры <literal>$<replaceable>n</replaceable></literal> передавались функции <function>spi_prepare</function> как есть, а не заменялись при подстановке переменных Tcl.

source: <primary>spi_lastoid</primary> <secondary>in PL/Tcl</secondary>
ru: <primary>spi_lastoid</primary> <secondary>в PL/Tcl</secondary>

source: Returns the OID of the row inserted by the last <function>spi_exec</function> or <function>spi_execp</function>, if the command was a single-row <command>INSERT</command> and the modified table contained OIDs. (If not, you get zero.)
ru: Возвращает OID строки, вставленной последней командой <function>spi_exec</function> или <function>spi_execp</function>, если этой командой был оператор <command>INSERT</command> с одной строкой и изменяемая таблица содержит OID. (В противном случае вы получите ноль.)

source: The Tcl script contained in <replaceable>command</replaceable> is executed within a SQL subtransaction. If the script returns an error, that entire subtransaction is rolled back before returning the error out to the surrounding Tcl code. See <xref linkend="pltcl-subtransactions"/> for more details and an example.
ru: Скрипт Tcl, который содержит <replaceable>команда</replaceable>, выполняется в подтранзакции SQL. Если этот скрипт возвращает ошибку, вся подтранзакция откатывается назад, а затем в окружающий код Tcl возвращается ошибка. За дополнительными подробностями и примером обратитесь к <xref remap="3" linkend="pltcl-subtransactions"/>.

source: Doubles all occurrences of single quote and backslash characters in the given string. This can be used to safely quote strings that are to be inserted into SQL commands given to <function>spi_exec</function> or <function>spi_prepare</function>. For example, think about an SQL command string like: <placeholder-1/> where the Tcl variable <literal>val</literal> actually contains <literal>doesn't</literal>. This would result in the final command string: <placeholder-2/> which would cause a parse error during <function>spi_exec</function> or <function>spi_prepare</function>. To work properly, the submitted command should contain: <placeholder-3/> which can be formed in PL/Tcl using: <placeholder-4/> One advantage of <function>spi_execp</function> is that you don't have to quote parameter values like this, since the parameters are never parsed as part of an SQL command string.
ru: Дублирует все вхождения апострофа и обратной косой черты в заданной строке. Это можно использовать для защиты строк, которые будут вставляться в команды SQL, передаваемые в <function>spi_exec</function> или <function>spi_prepare</function>. Например, представьте, что при выполнении такой команды SQL: <placeholder-1/> переменная языка Tcl <literal>val</literal> содержит <literal>doesn't</literal>. Это приведёт к формированию такой окончательной строки команды: <placeholder-2/> при разборе которой в процессе <function>spi_exec</function> или <function>spi_prepare</function> возникнет ошибка. Чтобы этот запрос работал правильно, итоговая команда должна выглядеть так: <placeholder-3/> Получить её в PL/Tcl можно так: <placeholder-4/> Преимуществом <function>spi_execp</function> является то, что для неё заключать значения параметров в кавычки подобным образом не нужно, так как параметры никогда не разбираются в составе строки команды SQL.

source: level
ru: уровень

source: msg
ru: сообщение

source: <primary>elog</primary> <secondary>in PL/Tcl</secondary>
ru: <primary>elog</primary> <secondary>в PL/Tcl</secondary>

source: Emits a log or error message. Possible levels are <literal>DEBUG</literal>, <literal>LOG</literal>, <literal>INFO</literal>, <literal>NOTICE</literal>, <literal>WARNING</literal>, <literal>ERROR</literal>, and <literal>FATAL</literal>. <literal>ERROR</literal> raises an error condition; if this is not trapped by the surrounding Tcl code, the error propagates out to the calling query, causing the current transaction or subtransaction to be aborted. This is effectively the same as the Tcl <literal>error</literal> command. <literal>FATAL</literal> aborts the transaction and causes the current session to shut down. (There is probably no good reason to use this error level in PL/Tcl functions, but it's provided for completeness.) The other levels only generate messages of different priority levels. Whether messages of a particular priority are reported to the client, written to the server log, or both is controlled by the <xref linkend="guc-log-min-messages"/> and <xref linkend="guc-client-min-messages"/> configuration variables. See <xref linkend="runtime-config"/> and <xref linkend="pltcl-error-handling"/> for more information.
ru: Выдаёт служебное сообщение или сообщение об ошибке. Возможные уровни сообщений: <literal>DEBUG</literal> (ОТЛАДКА), <literal>LOG</literal> (СООБЩЕНИЕ), <literal>INFO</literal> (ИНФОРМАЦИЯ), <literal>NOTICE</literal> (ЗАМЕЧАНИЕ), <literal>WARNING</literal> (ПРЕДУПРЕЖДЕНИЕ), <literal>ERROR</literal> (ОШИБКА) и <literal>FATAL</literal> (ВАЖНО). С уровнем <literal>ERROR</literal> выдаётся ошибка; если она не перехватывается окружающим кодом Tcl, она распространяется в вызывающий запрос, что приводит к прерыванию текущей транзакции или подтранзакции. По сути то же самое делает команда <literal>error</literal> языка Tcl. Сообщение уровня <literal>FATAL</literal> прерывает транзакцию и приводит к завершению текущего сеанса. (Вероятно, нет обоснованной причины использовать этот уровень ошибок в функциях PL/Tcl, но он поддерживается для полноты.) При использовании других уровней происходит просто вывод сообщения с заданным уровнем важности. Будут ли сообщения определённого уровня передаваться клиенту и/или записываться в журнал, определяется конфигурационными переменными <xref linkend="guc-log-min-messages"/> и <xref linkend="guc-client-min-messages"/>. За дополнительными сведениями обратитесь к <xref remap="3" linkend="runtime-config"/> и <xref remap="3" linkend="pltcl-error-handling"/>.

source: The following commands are available to access the database from the body of a PL/Tcl function: <placeholder-1/>
ru: Для обращения к базе данных из тела функции на PL/Tcl предназначены следующие команды: <placeholder-1/>

source: Trigger Procedures in PL/Tcl
ru: Процедуры триггеров на PL/Tcl

source: <primary>trigger</primary> <secondary>in PL/Tcl</secondary>
ru: <primary>триггер</primary> <secondary>на языке PL/Tcl</secondary>

source: Trigger procedures can be written in PL/Tcl. <productname>PostgreSQL</productname> requires that a procedure that is to be called as a trigger must be declared as a function with no arguments and a return type of <literal>trigger</literal>.
ru: На PL/Tcl можно написать триггерные процедуры. <productname>PostgreSQL</productname> требует, чтобы процедура, которая будет вызываться как триггерная, была объявлена как функция без аргументов и возвращала тип <literal>trigger</literal>.

source: The name of the trigger from the <command>CREATE TRIGGER</command> statement.
ru: Имя триггера из оператора <command>CREATE TRIGGER</command>.

source: The object ID of the table that caused the trigger procedure to be invoked.
ru: Идентификатор объекта таблицы, для которой будет вызываться триггерная процедура.

source: The name of the table that caused the trigger procedure to be invoked.
ru: Имя таблицы, для которой будет вызываться триггерная процедура.

source: The schema of the table that caused the trigger procedure to be invoked.
ru: Схема таблицы, для которой будет вызываться триггерная процедура.

source: A Tcl list of the table column names, prefixed with an empty list element. So looking up a column name in the list with <application>Tcl</application>'s <function>lsearch</function> command returns the element's number starting with 1 for the first column, the same way the columns are customarily numbered in <productname>PostgreSQL</productname>. (Empty list elements also appear in the positions of columns that have been dropped, so that the attribute numbering is correct for columns to their right.)
ru: Список языка Tcl, содержащий имена столбцов таблицы. В начало списка добавлен пустой элемент, поэтому при поиске в этом списке имени столбца с помощью стандартной в <application>Tcl</application> команды <function>lsearch</function> будет возвращён номер элемента, начиная с 1, так же, как нумеруются столбцы в <productname>PostgreSQL</productname>. (В позициях удалённых столбцов также содержатся пустые элементы, так что нумерация следующих за ними атрибутов не нарушается.)

source: The string <literal>BEFORE</literal>, <literal>AFTER</literal>, or <literal>INSTEAD OF</literal>, depending on the type of trigger event.
ru: Строка <literal>BEFORE</literal>, <literal>AFTER</literal> или <literal>INSTEAD OF</literal>, в зависимости от типа события триггера.

source: The string <literal>ROW</literal> or <literal>STATEMENT</literal> depending on the type of trigger event.
ru: Строка <literal>ROW</literal> или <literal>STATEMENT</literal>, в зависимости от уровня события триггера.

source: The string <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, or <literal>TRUNCATE</literal> depending on the type of trigger event.
ru: Строка <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal> или <literal>TRUNCATE</literal>, в зависимости от действия события триггера.

source: An associative array containing the values of the new table row for <command>INSERT</command> or <command>UPDATE</command> actions, or empty for <command>DELETE</command>. The array is indexed by column name. Columns that are null will not appear in the array. This is not set for statement-level triggers.
ru: Ассоциативный массив, содержащий значения новой строки таблицы для действий <command>INSERT</command> или <command>UPDATE</command>, либо пустой массив для <command>DELETE</command>. Индексами в массиве являются имена столбцов. Столбцы со значениями NULL в нём отсутствуют. Для триггеров уровня оператора этот массив не определяется.

source: An associative array containing the values of the old table row for <command>UPDATE</command> or <command>DELETE</command> actions, or empty for <command>INSERT</command>. The array is indexed by column name. Columns that are null will not appear in the array. This is not set for statement-level triggers.
ru: Ассоциативный массив, содержащий значения старой строки таблицы для действий <command>UPDATE</command> или <command>DELETE</command>, либо пустой массив для <command>INSERT</command>. Индексами в массиве являются имена столбцов. Столбцы со значениями NULL в нём отсутствуют. Для триггеров уровня оператора этот массив не определяется.

source: A Tcl list of the arguments to the procedure as given in the <command>CREATE TRIGGER</command> statement. These arguments are also accessible as <literal>$1</literal> ... <literal>$<replaceable>n</replaceable></literal> in the procedure body.
ru: Список на языке Tcl аргументов процедуры, заданных в операторе <command>CREATE TRIGGER</command>. Эти аргументы также доступны под обозначениями <literal>$1</literal> ... <literal>$<replaceable>n</replaceable></literal> в теле процедуры.

source: The information from the trigger manager is passed to the procedure body in the following variables: <placeholder-1/>
ru: Информация от менеджера триггеров передаётся в тело процедуры в следующих переменных: <placeholder-1/>

source: The return value from a trigger procedure can be one of the strings <literal>OK</literal> or <literal>SKIP</literal>, or a list of column name/value pairs. If the return value is <literal>OK</literal>, the operation (<command>INSERT</command>/<command>UPDATE</command>/<command>DELETE</command>) that fired the trigger will proceed normally. <literal>SKIP</literal> tells the trigger manager to silently suppress the operation for this row. If a list is returned, it tells PL/Tcl to return a modified row to the trigger manager; the contents of the modified row are specified by the column names and values in the list. Any columns not mentioned in the list are set to null. Returning a modified row is only meaningful for row-level <literal>BEFORE</literal> <command>INSERT</command> or <command>UPDATE</command> triggers, for which the modified row will be inserted instead of the one given in <varname>$NEW</varname>; or for row-level <literal>INSTEAD OF</literal> <command>INSERT</command> or <command>UPDATE</command> triggers where the returned row is used as the source data for <command>INSERT RETURNING</command> or <command>UPDATE RETURNING</command> clauses. In row-level <literal>BEFORE</literal> <command>DELETE</command> or <literal>INSTEAD OF</literal> <command>DELETE</command> triggers, returning a modified row has the same effect as returning <literal>OK</literal>, that is the operation proceeds. The trigger return value is ignored for all other types of triggers.
ru: Возвращаемым значением триггерной процедуры может быть строка <literal>OK</literal> или <literal>SKIP</literal> либо список пар имя столбца/значение. Если возвращается значение <literal>OK</literal>, операция (<command>INSERT</command>/<command>UPDATE</command>/<command>DELETE</command>), которая привела к срабатыванию триггера, выполняется нормально. Значение <literal>SKIP</literal> указывает менеджеру триггеров просто пропустить эту операцию с текущей строкой данных. Если возвращается список, через него PL/Tcl передаёт менеджеру триггеров изменённую строку; содержимое изменённой строки задаётся именами и значениями столбцов в списке. Все столбцы, не перечисленные в этом списке, получают значения NULL. Возвращать изменённую строку имеет смысл только для триггеров уровня строки с порядком <literal>BEFORE</literal> команд <command>INSERT</command> и <command>UPDATE</command>, в которых вместо заданной в <varname>$NEW</varname> будет записываться изменённая строка; либо с порядком <literal>INSTEAD OF</literal> команд <command>INSERT</command> и <command>UPDATE</command>, в которых возвращаемая строка служит исходными данными для предложений <command>INSERT RETURNING</command> или <command>UPDATE RETURNING</command>. В триггерах уровня строки с порядком <literal>BEFORE</literal> или <literal>INSTEAD OF</literal> команды <command>DELETE</command> возврат изменённой строки воспринимается так же, как и возврат значения <literal>OK</literal>, то есть операция выполняется. Для всех остальных типов триггеров возвращаемое значение игнорируется.

source: The result list can be made from an array representation of the modified tuple with the <literal>array get</literal> Tcl command.
ru: Список результатов можно создать из изменённого кортежа, представленного в виде массива, с помощью команды <literal>array get</literal> языка Tcl.

source: Here's a little example trigger procedure that forces an integer value in a table to keep track of the number of updates that are performed on the row. For new rows inserted, the value is initialized to 0 and then incremented on every update operation. <placeholder-1/> Notice that the trigger procedure itself does not know the column name; that's supplied from the trigger arguments. This lets the trigger procedure be reused with different tables.
ru: Следующий небольшой пример показывает триггерную процедуру, которая ведёт в таблице целочисленный счётчик числа изменений, выполненных в строке. Для новых строк счётчик инициализируется нулевым значением, а затем увеличивается на единицу при каждом изменении. <placeholder-1/> Заметьте, что сама триггерная процедура не знает имени столбца; оно передаётся в аргументах триггера. Это позволяет применять эту триггерную процедуру для различных таблиц.

source: Event Trigger Procedures in PL/Tcl
ru: Процедуры событийных триггеров в PL/Tcl

source: <primary>event trigger</primary> <secondary>in PL/Tcl</secondary>
ru: <primary>событийный триггер</primary> <secondary>в PL/Tcl</secondary>

source: Event trigger procedures can be written in PL/Tcl. <productname>PostgreSQL</productname> requires that a procedure that is to be called as an event trigger must be declared as a function with no arguments and a return type of <literal>event_trigger</literal>.
ru: На PL/Tcl можно написать процедуры событийных триггеров. <productname>PostgreSQL</productname> требует, чтобы процедура, которая будет вызываться как событийный триггер, была объявлена как функция без аргументов и возвращала тип <literal>event_trigger</literal>.

source: The name of the event the trigger is fired for.
ru: Имя события, при котором срабатывает этот триггер.
