Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/pltcl.po
Languages: ru

source: The command tag for which the trigger is fired.
ru: Тег команды, для которой срабатывает этот триггер.

source: The return value of the trigger procedure is ignored.
ru: Возвращаемое значение триггерной процедуры игнорируется.

source: Here's a little example event trigger procedure that simply raises a <literal>NOTICE</literal> message each time a supported command is executed: <placeholder-1/>
ru: Следующий небольшой пример процедуры событийного триггера просто выдаёт замечание (<literal>NOTICE</literal>) при каждом выполнении поддерживаемой команды: <placeholder-1/>

source: Error Handling in PL/Tcl
ru: Обработка ошибок в PL/Tcl

source: <primary>exceptions</primary> <secondary>in PL/Tcl</secondary>
ru: <primary>исключения</primary> <secondary>в PL/Tcl</secondary>

source: Tcl code within or called from a PL/Tcl function can raise an error, either by executing some invalid operation or by generating an error using the Tcl <function>error</function> command or PL/Tcl's <function>elog</function> command. Such errors can be caught within Tcl using the Tcl <function>catch</function> command. If an error is not caught but is allowed to propagate out to the top level of execution of the PL/Tcl function, it is reported as a SQL error in the function's calling query.
ru: Tcl-код, содержащийся или вызываемый из функции PL/Tcl, может выдавать ошибку либо выполняя недопустимую операцию, либо генерируя ошибку с помощью команды <function>error</function> языка Tcl или команды <function>elog</function> языка PL/Tcl. Такие ошибки могут быть перехвачены в среде Tcl с помощью команды Tcl <function>catch</function>. Если ошибка не перехватывается, а распространяется выше уровня выполнения функций PL/Tcl, она передаётся в запрос, вызвавший функцию, как ошибка SQL.

source: Conversely, SQL errors that occur within PL/Tcl's <function>spi_exec</function>, <function>spi_prepare</function>, and <function>spi_execp</function> commands are reported as Tcl errors, so they are catchable by Tcl's <function>catch</function> command. (Each of these PL/Tcl commands runs its SQL operation in a subtransaction, which is rolled back on error, so that any partially-completed operation is automatically cleaned up.) Again, if an error propagates out to the top level without being caught, it turns back into a SQL error.
ru: И напротив, ошибки СУБД, возникающие внутри команд <function>spi_exec</function>, <function>spi_prepare</function> и <function>spi_execp</function> в среде PL/Tcl, выдаются как ошибки Tcl, так что их можно перехватить командой Tcl <function>catch</function>. (Каждая из этих команд PL/Tcl выполняет SQL-операцию в подтранзакции, которая откатывается в случае ошибки, так что для частично завершённых операций производится автоматическая очистка.) Опять же, если ошибка не перехватывается и распространяется выше верхнего уровня, она становится ошибкой SQL.

source: Tcl provides an <varname>errorCode</varname> variable that can represent additional information about an error in a form that is easy for Tcl programs to interpret. The contents are in Tcl list format, and the first word identifies the subsystem or library reporting the error; beyond that the contents are left to the individual subsystem or library. For database errors reported by PL/Tcl commands, the first word is <literal>POSTGRES</literal>, the second word is the PostgreSQL version number, and additional words are field name/value pairs providing detailed information about the error. Fields <varname>SQLSTATE</varname>, <varname>condition</varname>, and <varname>message</varname> are always supplied (the first two represent the error code and condition name as shown in <xref linkend="errcodes-appendix"/>). Fields that may be present include <varname>detail</varname>, <varname>hint</varname>, <varname>context</varname>, <varname>schema</varname>, <varname>table</varname>, <varname>column</varname>, <varname>datatype</varname>, <varname>constraint</varname>, <varname>statement</varname>, <varname>cursor_position</varname>, <varname>filename</varname>, <varname>lineno</varname>, and <varname>funcname</varname>.
ru: В Tcl имеется переменная <varname>errorCode</varname>, представляющая дополнительную информацию об ошибке в виде, удобном для обработки в программах на Tcl. Эта информация передаётся в формате списка Tcl, первое слово в котором указывает на подсистему или библиотеку, выдающую ошибку; последующее содержимое определяется в зависимости от подсистемы или библиотеки. Для ошибок СУБД, возникающих в командах PL/Tcl, первым словом будет <literal>POSTGRES</literal>, вторым — номер версии PostgreSQL, а дополнительные слова представляют пары имя/значения, передающие подробную информацию об ошибке. В этих парах всегда передаются поля <varname>SQLSTATE</varname>, <varname>condition</varname> и <varname>message</varname> (первые два представляют код ошибки и имя условия, как описано в <xref remap="6" linkend="errcodes-appendix"/>). Также могут передаваться поля <varname>detail</varname>, <varname>hint</varname>, <varname>context</varname>, <varname>schema</varname>, <varname>table</varname>, <varname>column</varname>, <varname>datatype</varname>, <varname>constraint</varname>, <varname>statement</varname>, <varname>cursor_position</varname>, <varname>filename</varname>, <varname>lineno</varname> и <varname>funcname</varname>.

source: While the <literal>unknown</literal> module could actually contain any initialization script you need, it normally defines a Tcl <function>unknown</function> procedure that is invoked whenever Tcl does not recognize an invoked procedure name. <application>PL/Tcl</application>'s standard version of this procedure tries to find a module in <literal>pltcl_modules</literal> that will define the required procedure. If one is found, it is loaded into the interpreter, and then execution is allowed to proceed with the originally attempted procedure call. A secondary table <literal>pltcl_modfuncs</literal> provides an index of which functions are defined by which modules, so that the lookup is reasonably quick.
ru: Хотя модуль <literal>unknown</literal> может на самом деле содержать любой нужный вам скрипт инициализации, обычно в нём определяется процедура <function>unknown</function> языка Tcl, которая вызывается всякий раз, когда Tcl не распознаёт имя вызываемой процедуры. Принятая в <application>PL/Tcl</application> версия этой процедуры пытается найти в <literal>pltcl_modules</literal> модуль, в котором будет определена требуемая процедура. Если такой модуль находится, он загружается в интерпретатор и затем выполнение изначального вызова процедуры может быть продолжено. Дополнительная таблица <literal>pltcl_modfuncs</literal> содержит индекс, связывающий функции с модулями, в которых они определены, так что поиск выполняется довольно быстро.

source: if {[catch { spi_exec $sql_command }]} { if {[lindex $::errorCode 0] == "POSTGRES"} { array set errorArray $::errorCode if {$errorArray(condition) == "undefined_table"} { # deal with missing table } else { # deal with some other type of SQL error } } }
ru: if {[catch { spi_exec $sql_command }]} { if {[lindex $::errorCode 0] == "POSTGRES"} { array set errorArray $::errorCode if {$errorArray(condition) == "undefined_table"} { # разобраться с отсутствием таблицы } else { # разобраться с другими типами ошибок SQL } } }

source: A convenient way to work with PL/Tcl's <varname>errorCode</varname> information is to load it into an array, so that the field names become array subscripts. Code for doing that might look like <placeholder-1/> (The double colons explicitly specify that <varname>errorCode</varname> is a global variable.)
ru: С информацией в переменной <varname>errorCode</varname> среды PL/Tcl удобно работать, загрузив переменную в массив, чтобы имена полей стали индексами в массиве. Пример такого кода: <placeholder-1/> (Двойные двоеточия явно указывают, что переменная <varname>errorCode</varname> является глобальной.)

source: Explicit Subtransactions in PL/Tcl
ru: Неявные подтранзакции в PL/Tcl

source: <primary>subtransactions</primary> <secondary>in PL/Tcl</secondary>
ru: <primary>подтранзакции</primary> <secondary>в PL/Tcl</secondary>

source: Recovering from errors caused by database access as described in <xref linkend="pltcl-error-handling"/> can lead to an undesirable situation where some operations succeed before one of them fails, and after recovering from that error the data is left in an inconsistent state. PL/Tcl offers a solution to this problem in the form of explicit subtransactions.
ru: Перехват ошибок, произошедших при обращении к базе данных, как описано в <xref remap="6" linkend="pltcl-error-handling"/>, может привести к нежелательной ситуации, когда часть операций будет успешно выполнена, прежде чем произойдёт сбой. Данные останутся в несогласованном состоянии после обработки такой ошибки. PL/Tcl предлагает решение этой проблемы в форме неявных подтранзакций.

source: Consider a function that implements a transfer between two accounts: <placeholder-1/> If the second <command>UPDATE</command> statement results in an exception being raised, this function will log the failure, but the result of the first <command>UPDATE</command> will nevertheless be committed. In other words, the funds will be withdrawn from Joe's account, but will not be transferred to Mary's account. This happens because each <function>spi_exec</function> is a separate subtransaction, and only one of those subtransactions got rolled back.
ru: Рассмотрите функцию, реализующую перевод денег между двумя счетами: <placeholder-1/> Если второй оператор <command>UPDATE</command> выдаст исключение, эта функция запишет в журнал сообщение об ошибке, но результат первого <command>UPDATE</command> будет тем не менее зафиксирован. Другими словами, денежные средства будут списаны со счёта Джо, но не поступят на счёт Мери. Это происходит потому, что каждый вызов <function>spi_exec</function> выполняется в отдельной подтранзакции, а откатывается только одна из подтранзакций.

source: To handle such cases, you can wrap multiple database operations in an explicit subtransaction, which will succeed or roll back as a whole. PL/Tcl provides a <function>subtransaction</function> command to manage this. We can rewrite our function as: <placeholder-1/> Note that use of <function>catch</function> is still required for this purpose. Otherwise the error would propagate to the top level of the function, preventing the desired insertion into the <structname>operations</structname> table. The <function>subtransaction</function> command does not trap errors, it only assures that all database operations executed inside its scope will be rolled back together when an error is reported.
ru: В таких случаях вы можете обернуть несколько операций с базой данных в одну явную подтранзакцию, которая будет выполнена успешно или отменена как единое целое. Для этого в PL/Tcl есть команда <function>subtransaction</function>. С ней мы можем переписать нашу функцию так: <placeholder-1/> Заметьте, что и в этом случае нужно использовать <function>catch</function>. В противном случае ошибка распространится на верхний уровень функции, что не даст произвести желаемое добавление записи в таблицу <structname>operations</structname>. Команда <function>subtransaction</function> не перехватывает ошибки, она только обеспечивает откат всех операций с базой данных в своей области действия в случае ошибки.

source: A rollback of an explicit subtransaction occurs on any error reported by the contained Tcl code, not only errors originating from database access. Thus a regular Tcl exception raised inside a <function>subtransaction</function> command will also cause the subtransaction to be rolled back. However, non-error exits out of the contained Tcl code (for instance, due to <function>return</function>) do not cause a rollback.
ru: Откат явной подтранзакции происходит в случае любых ошибок, сгенерированных вложенным кодом Tcl, а не только ошибок, возникающих при обращении к базе данных. Таким образом, обычное исключение Tcl, возникшее внутри команды <function>subtransaction</function>, также приведёт к откату подтранзакции. Однако при выходе из вложенного кода Tcl без ошибки (например, с помощью команды <function>return</function>) откат не производится.

source: PL/Tcl Configuration
ru: Конфигурация PL/Tcl

source: This section lists configuration parameters that affect <application>PL/Tcl</application>.
ru: В этом разделе описываются параметры конфигурации, влияющие на работу <application>PL/Tcl</application>.

source: <primary><varname>pltcl.start_proc</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>pltcl.start_proc</varname></primary>

source: This parameter, if set to a nonempty string, specifies the name (possibly schema-qualified) of a parameterless PL/Tcl function that is to be executed whenever a new Tcl interpreter is created for PL/Tcl. Such a function can perform per-session initialization, such as loading additional Tcl code. A new Tcl interpreter is created when a PL/Tcl function is first executed in a database session, or when an additional interpreter has to be created because a PL/Tcl function is called by a new SQL role.
ru: В этом параметре, если он не пуст, задаётся имя (возможно, дополненное схемой) функции на языке PL/Tcl без параметров, которая будет выполняться, когда для PL/Tcl будет создаваться новый экземпляр Tcl. Такая функция может выполнять инициализацию в рамках сеанса, например, загружать дополнительный код Tcl. Новый интерпретатор Tcl создаётся при первом выполнении какой-либо функции PL/Tcl в сеансе базы данных или когда требуется дополнительный интерпретатор из-за того, что функция PL/Tcl была вызвана новой ролью SQL.

source: The referenced function must be written in the <literal>pltcl</literal> language, and must not be marked <literal>SECURITY DEFINER</literal>. (These restrictions ensure that it runs in the interpreter it's supposed to initialize.) The current user must have permission to call it, too.
ru: Указанная функция должна быть написана на языке <literal>pltcl</literal> и не должна иметь свойство <literal>SECURITY DEFINER</literal>. (Благодаря этим ограничениям эта функция будет запускаться в интерпретаторе, который она должна инициализировать.) Текущий пользователь должен иметь право и на её выполнение тоже.

source: If the function fails with an error it will abort the function call that caused the new interpreter to be created and propagate out to the calling query, causing the current transaction or subtransaction to be aborted. Any actions already done within Tcl won't be undone; however, that interpreter won't be used again. If the language is used again the initialization will be attempted again within a fresh Tcl interpreter.
ru: Если эта функция завершится ошибкой, эта ошибка прервёт вызов функции, которой потребовался новый интерпретатор, и распространится в вызывающий запрос, приводя к прерыванию текущей транзакции или подтранзакции. Любые действия, уже произведённые в среде Tcl, отменены не будут; однако этот интерпретатор более не будет использоваться. При следующей попытке использования этого языка последует повторная попытка инициализации со свежим интерпретатором Tcl.

source: Only superusers can change this setting. Although this setting can be changed within a session, such changes will not affect Tcl interpreters that have already been created.
ru: Изменять этот параметр разрешено только суперпользователям. Хотя изменить его можно в рамках сеанса, такие изменения не повлияют на работу интерпретаторов Tcl, созданных ранее.

source: <primary><varname>pltclu.start_proc</varname> configuration parameter</primary>
ru: <primary>параметр конфигурации <varname>pltclu.start_proc</varname></primary>

source: This parameter is exactly like <varname>pltcl.start_proc</varname>, except that it applies to PL/TclU. The referenced function must be written in the <literal>pltclu</literal> language.
ru: Это параметр полностью аналогичен <varname>pltcl.start_proc</varname>, но применяется к PL/TclU. Указанная функция должна быть написана на языке <literal>pltclu</literal>.

source: Tcl Procedure Names
ru: Имена процедур Tcl

source: In <productname>PostgreSQL</productname>, the same function name can be used for different function definitions as long as the number of arguments or their types differ. Tcl, however, requires all procedure names to be distinct. PL/Tcl deals with this by making the internal Tcl procedure names contain the object ID of the function from the system table <structname>pg_proc</structname> as part of their name. Thus, <productname>PostgreSQL</productname> functions with the same name and different argument types will be different Tcl procedures, too. This is not normally a concern for a PL/Tcl programmer, but it might be visible when debugging.
ru: В <productname>PostgreSQL</productname> одно имя функции может использоваться разными определениями функций, если они имеют разное число и типы аргументов. Tcl, однако, требует, чтобы имена всех процедур различались. PL/Tcl решает эту проблему, устанавливая такие внутренние имена процедур Tcl, чтобы они включали в свой состав OID функции из системной таблицы <structname>pg_proc</structname>. Таким образом, функциям <productname>PostgreSQL</productname> с одним именем и разными типами аргументов так же будут соответствовать различные процедуры Tcl. Это обычно остаётся незамеченным для программиста PL/Tcl, но может проявиться при отладке.

source: The body of the function is simply a piece of Tcl script. When the function is called, the argument values are passed as variables <literal>$1</literal> ... <literal>$<replaceable>n</replaceable></literal> to the Tcl script. The result is returned from the Tcl code in the usual way, with a <literal>return</literal> statement.
ru: Тело функции содержит просто скрипт на Tcl. Когда вызывается функция, значения аргументов передаются скрипту Tcl в виде переменных <literal>$1</literal> ... <literal>$<replaceable>n</replaceable></literal>. Результат из кода Tcl возвращается как обычно, оператором <literal>return</literal>.

source: There is currently no support for returning a composite-type result value, nor for returning sets.
ru: В настоящее время возврат результатов составного типа не поддерживается, как и возврат множеств.

source: <application>PL/Tcl</application> does not currently have full support for domain types: it treats a domain the same as the underlying scalar type. This means that constraints associated with the domain will not be enforced. This is not an issue for function arguments, but it is a hazard if you declare a <application>PL/Tcl</application> function as returning a domain type.
ru: <application>PL/Tcl</application> в настоящее время не поддерживает полностью доменные типы: он воспринимает домен как нижележащий скалярный тип. Это означает, что ограничения, связанные с доменом, не будут действовать. Это не проблема для аргументов функции, но представляет опасность, когда функция <application>PL/Tcl</application> объявлена как возвращающая доменный тип.

source: The argument values supplied to a PL/Tcl function's code are simply the input arguments converted to text form (just as if they had been displayed by a <command>SELECT</command> statement). Conversely, the <literal>return</literal> command will accept any string that is acceptable input format for the function's declared return type. So, within the PL/Tcl function, all values are just text strings.
ru: Значения аргументов, передаваемые в код функции PL/Tcl, представляют собой просто входные аргументы, преобразованные в текстовый вид (так же, как при выводе оператором <command>SELECT</command>). И наоборот, команда <literal>return</literal> может принять любую строку, соответствующую формату ввода для типа результата функции. Таким образом, внутри функции PL/Tcl все значения представляют собой просто текстовые строки.

source: Tcl code within or called from a PL/Tcl function can raise an error, either by executing some invalid operation or by generating an error using the Tcl <function>error</function> command or PL/Tcl's <function>elog</function> command. Such errors can be caught within Tcl using the Tcl <function>catch</function> command. If they are not caught but are allowed to propagate out to the top level of execution of the PL/Tcl function, they turn into database errors.
ru: Tcl-код, содержащийся или вызываемый из функции PL/Tcl, может выдавать ошибку, либо выполняя недопустимую операцию, либо генерируя ошибку с помощью команды <function>error</function> языка Tcl или команды <function>elog</function> языка PL/Tcl. Такие ошибки могут быть перехвачены в среде Tcl с помощью команды Tcl <function>catch</function>. Если они не перехватываются, а распространяются выше уровня выполнения функций PL/Tcl, они становятся ошибками СУБД.

source: Conversely, database errors that occur within PL/Tcl's <function>spi_exec</function>, <function>spi_prepare</function>, and <function>spi_execp</function> commands are reported as Tcl errors, so they are catchable by Tcl's <function>catch</function> command. Again, if they propagate out to the top level without being caught, they turn back into database errors.
ru: И напротив, ошибки СУБД, возникающие внутри команд <function>spi_exec</function>, <function>spi_prepare</function> и <function>spi_execp</function> в среде PL/Tcl, выдаются как ошибки Tcl, так что их можно перехватить командой Tcl <function>catch</function>. Опять же, если они не перехватываются и распространяются на верхний уровень, они становятся ошибками СУБД.
