Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/problems.po
Languages: ru

source: Bug Reporting Guidelines
ru: Как правильно сообщить об ошибке

source: When you find a bug in <productname>PostgreSQL</productname> we want to hear about it. Your bug reports play an important part in making <productname>PostgreSQL</productname> more reliable because even the utmost care cannot guarantee that every part of <productname>PostgreSQL</productname> will work on every platform under every circumstance.
ru: Если вы найдёте ошибку в <productname>PostgreSQL</productname>, дайте нам знать о ней. Благодаря вашему отчёту об ошибке, <productname>PostgreSQL</productname> станет ещё более надёжным, ведь даже при самом высоком качестве кода нельзя гарантировать, что каждый блок и каждая функция <productname>PostgreSQL</productname> будет работать везде и при любых обстоятельствах.

source: The following suggestions are intended to assist you in forming bug reports that can be handled in an effective fashion. No one is required to follow them but doing so tends to be to everyone's advantage.
ru: Следующие предложения призваны помочь вам в составлении отчёта об ошибке, который можно будет обработать эффективно. Мы не требуем их неукоснительного выполнения, но всё же лучше следовать им для общего блага.

source: We cannot promise to fix every bug right away. If the bug is obvious, critical, or affects a lot of users, chances are good that someone will look into it. It could also happen that we tell you to update to a newer version to see if the bug happens there. Or we might decide that the bug cannot be fixed before some major rewrite we might be planning is done. Or perhaps it is simply too hard and there are more important things on the agenda. If you need help immediately, consider obtaining a commercial support contract.
ru: Мы не можем обещать, что каждая ошибка будет исправлена немедленно. Если ошибка очевидна, критична или касается множества пользователей, велики шансы, что ей кто-то займётся. Бывает, что мы рекомендуем обновить версию и проверить, сохраняется ли ошибка. Мы также можем решить, что ошибку нельзя исправить, пока не будет проделана большая работа, которая уже запланирована. Случается и так, что исправить ошибку слишком сложно, а на повестке дня есть много более важных дел. Если же вы хотите, чтобы вам помогли немедленно, возможно вам стоит заключить договор на коммерческую поддержку.

source: Identifying Bugs
ru: Диагностика ошибок

source: A program terminates with a fatal signal or an operating system error message that would point to a problem in the program. (A counterexample might be a <quote>disk full</quote> message, since you have to fix that yourself.)
ru: Программа завершается с аварийным сигналом или сообщением об ошибке операционной системы, указывающей на проблему в программе. (В качестве контрпримера можно привести сообщение <quote>Нет места на диске</quote> &mdash; эту проблему вы должны решить сами.)

source: A program produces the wrong output for any given input.
ru: Программа выдаёт неправильный результат для любых вводимых данных.

source: A program refuses to accept valid input (as defined in the documentation).
ru: Программа отказывается принимать допустимые (согласно документации) данные.

source: A program accepts invalid input without a notice or error message. But keep in mind that your idea of invalid input might be our idea of an extension or compatibility with traditional practice.
ru: Программа принимает недопустимые данные без сообщения об ошибке или предупреждения. Но помните: то, что вы считаете недопустимым, мы можем считать приемлемым расширением или совместимым с принятой практикой.

source: <productname>PostgreSQL</productname> fails to compile, build, or install according to the instructions on supported platforms.
ru: Не удаётся скомпилировать, собрать или установить <productname>PostgreSQL</productname> на поддерживаемой платформе, выполняя соответствующие инструкции.

source: Before you report a bug, please read and re-read the documentation to verify that you can really do whatever it is you are trying. If it is not clear from the documentation whether you can do something or not, please report that too; it is a bug in the documentation. If it turns out that a program does something different from what the documentation says, that is a bug. That might include, but is not limited to, the following circumstances: <placeholder-1/> Here <quote>program</quote> refers to any executable, not only the backend process.
ru: Прежде чем сообщать об ошибке, пожалуйста, прочитайте и перечитайте документацию и убедитесь, что вообще возможно сделать то, что вы хотите. Если из документации неясно, можно это сделать или нет, пожалуйста, сообщите и об этом (тогда это ошибка в документации). Если выясняется, что программа делает что-то не так, как написано в документации, это тоже ошибка. Вот лишь некоторые примеры возможных ошибок: <placeholder-1/> Здесь под <quote>программой</quote> подразумевается произвольный исполняемый файл, а не исключительно серверный процесс.

source: Being slow or resource-hogging is not necessarily a bug. Read the documentation or ask on one of the mailing lists for help in tuning your applications. Failing to comply to the <acronym>SQL</acronym> standard is not necessarily a bug either, unless compliance for the specific feature is explicitly claimed.
ru: Медленная работа или высокая загрузка ресурсов &mdash; это не обязательно ошибка. Попробуйте оптимизировать ваши приложения, прочитав документацию или попросив помощи в списках рассылки. Также может не быть ошибкой какое-то несоответствие стандарту <acronym>SQL</acronym>, если только явно не декларируется соответствие в данном аспекте.

source: Before you continue, check on the TODO list and in the FAQ to see if your bug is already known. If you cannot decode the information on the TODO list, report your problem. The least we can do is make the TODO list clearer.
ru: Прежде чем подготовить сообщение, проверьте, не упоминается ли эта ошибка в списке TODO или FAQ. Если вы не можете разобраться в нашем списке TODO, сообщите о своей проблеме. По крайней мере так мы сделаем список TODO более понятным.

source: What to Report
ru: Что сообщать

source: The most important thing to remember about bug reporting is to state all the facts and only facts. Do not speculate what you think went wrong, what <quote>it seemed to do</quote>, or which part of the program has a fault. If you are not familiar with the implementation you would probably guess wrong and not help us a bit. And even if you are, educated explanations are a great supplement to but no substitute for facts. If we are going to fix the bug we still have to see it happen for ourselves first. Reporting the bare facts is relatively straightforward (you can probably copy and paste them from the screen) but all too often important details are left out because someone thought it does not matter or the report would be understood anyway.
ru: Главное правило, которое нужно помнить &mdash; сообщайте все факты и только факты. Не стройте догадки, что по вашему мнению работает не так, что <quote>по-видимому происходит</quote>, или в какой части программы ошибка. Если вы не знакомы с тонкостями реализации, вы скорее всего ошибётесь и ничем нам не поможете. И даже если не ошибётесь, расширенные объяснения могут быть прекрасным дополнением, но не заменой фактам. Если мы соберёмся исправить ошибку, мы всё равно сами должны будем посмотреть, в чём она. С другой стороны, сообщить голые факты довольно просто (можно просто скопировать текст с экрана), но часто важные детали опускаются, потому что не считаются таковыми или кажется, что отчёт будет и без того понятен.

source: The exact sequence of steps <emphasis>from program start-up</emphasis> necessary to reproduce the problem. This should be self-contained; it is not enough to send in a bare <command>SELECT</command> statement without the preceding <command>CREATE TABLE</command> and <command>INSERT</command> statements, if the output should depend on the data in the tables. We do not have the time to reverse-engineer your database schema, and if we are supposed to make up our own data we would probably miss the problem.
ru: Точную последовательность действий для воспроизведения проблемы, начиная <emphasis>с запуска программы</emphasis>. Она должна быть самодостаточной; если вывод зависит от данных в таблицах, то недостаточно сообщить один лишь <command>SELECT</command>, без предшествующих операторов <command>CREATE TABLE</command> и <command>INSERT</command>. У нас не будет времени, чтобы восстанавливать схему базы данных по предоставленной информации, и если предполагается, что мы будем создавать свои тестовые данные, вероятнее всего мы пропустим это сообщение.

source: The best format for a test case for SQL-related problems is a file that can be run through the <application>psql</application> frontend that shows the problem. (Be sure to not have anything in your <filename>~/.psqlrc</filename> start-up file.) An easy way to create this file is to use <application>pg_dump</application> to dump out the table declarations and data needed to set the scene, then add the problem query. You are encouraged to minimize the size of your example, but this is not absolutely necessary. If the bug is reproducible, we will find it either way.
ru: Лучший формат теста для проблем с SQL &mdash; файл, который можно передать программе <application>psql</application> и увидеть проблему. (И убедитесь, что в вашем файле <filename>~/.psqlrc</filename> ничего нет.) Самый простой способ получить такой файл &mdash; выгрузить объявления таблиц и данные, необходимые для создания полигона, с помощью <application>pg_dump</application>, а затем добавить проблемный запрос. Постарайтесь сократить размер вашего тестового примера, хотя это не абсолютно необходимо. Если ошибка воспроизводится, мы найдём её в любом случае.

source: If your application uses some other client interface, such as <application>PHP</application>, then please try to isolate the offending queries. We will probably not set up a web server to reproduce your problem. In any case remember to provide the exact input files; do not guess that the problem happens for <quote>large files</quote> or <quote>midsize databases</quote>, etc. since this information is too inexact to be of use.
ru: Если ваше приложение использует какой-то другой клиентский интерфейс, например <application>PHP</application>, пожалуйста, попытайтесь свести ошибку к проблемным запросам. Мы вряд ли будем устанавливать веб-сервер у себя, чтобы воспроизвести вашу проблему. В любом случае помните, что нам нужны ваши конкретные входные файлы; мы не будем гадать, что подразумевается в сообщении о проблеме с <quote>большими файлами</quote> или <quote>базой среднего размера</quote>, так как это слишком расплывчатые понятия.

source: The output you got. Please do not say that it <quote>didn't work</quote> or <quote>crashed</quote>. If there is an error message, show it, even if you do not understand it. If the program terminates with an operating system error, say which. If nothing at all happens, say so. Even if the result of your test case is a program crash or otherwise obvious it might not happen on our platform. The easiest thing is to copy the output from the terminal, if possible.
ru: Результат, который вы получаете. Пожалуйста, не говорите, что что-то <quote>не работает</quote> или <quote>сбоит</quote>. Если есть сообщение об ошибке, покажите его, даже если вы его не понимаете. Если программа завершается ошибкой операционной системы, сообщите какой. Или если ничего не происходит, отразите это. Даже если в результате вашего теста происходит сбой программы или что-то очевидное, мы можем не наблюдать этого у себя. Проще всего будет скопировать текст с терминала, если это возможно.

source: If you are reporting an error message, please obtain the most verbose form of the message. In <application>psql</application>, say <literal>\set VERBOSITY verbose</literal> beforehand. If you are extracting the message from the server log, set the run-time parameter <xref linkend="guc-log-error-verbosity"/> to <literal>verbose</literal> so that all details are logged.
ru: Если вы упоминаете сообщение об ошибке, пожалуйста, укажите его в наиболее полной форме. Например, в <application>psql</application>, для этого сначала выполните <literal>\set VERBOSITY verbose</literal>. Если вы цитируете сообщения из журнала событий сервера, присвойте параметру выполнения <xref linkend="guc-log-error-verbosity"/> значение <literal>verbose</literal>, чтобы журнал был наиболее подробным.

source: In case of fatal errors, the error message reported by the client might not contain all the information available. Please also look at the log output of the database server. If you do not keep your server's log output, this would be a good time to start doing so.
ru: В случае фатальных ошибок сообщение на стороне клиента может не содержать всю необходимую информацию. Пожалуйста, также изучите журнал сервера баз данных. Если сообщения журнала у вас не сохраняются, это подходящий повод, чтобы начать сохранять их.

source: The output you expected is very important to state. If you just write <quote>This command gives me that output.</quote> or <quote>This is not what I expected.</quote>, we might run it ourselves, scan the output, and think it looks OK and is exactly what we expected. We should not have to spend the time to decode the exact semantics behind your commands. Especially refrain from merely saying that <quote>This is not what SQL says/Oracle does.</quote> Digging out the correct behavior from <acronym>SQL</acronym> is not a fun undertaking, nor do we all know how all the other relational databases out there behave. (If your problem is a program crash, you can obviously omit this item.)
ru: Очень важно отметить, какой результат вы ожидали получить. Если вы просто напишете <quote>Эта команда выдаёт это.</quote> или <quote>Это не то, что мне нужно.</quote>, мы можем запустить ваш пример, посмотреть на результат и решить, что всё в порядке и никакой ошибки нет. Не заставляйте нас тратить время на расшифровку точного смысла ваших команд. В частности, воздержитесь от утверждений типа <quote>Это не то, что делает Oracle/положено по стандарту SQL</quote>. Выяснять, как должно быть по стандарту <acronym>SQL</acronym>, не очень интересно, а кроме того мы не знаем, как ведут себя все остальные реляционные базы данных. (Если вы наблюдаете аварийное завершение программы, этот пункт, очевидно, неуместен.)

source: Any command line options and other start-up options, including any relevant environment variables or configuration files that you changed from the default. Again, please provide exact information. If you are using a prepackaged distribution that starts the database server at boot time, you should try to find out how that is done.
ru: Все параметры командной строки и другие параметры запуска, включая все связанные переменные окружения или файлы конфигурации, которые вы изменяли. Пожалуйста, предоставляйте точные сведения. Если вы используете готовый дистрибутив, в котором сервер БД запускается при загрузке системы, вам следует выяснить, как это происходит.

source: Anything you did at all differently from the installation instructions.
ru: Всё, что вы делали не так, как написано в инструкциях по установке.

source: The <productname>PostgreSQL</productname> version. You can run the command <literal>SELECT version();</literal> to find out the version of the server you are connected to. Most executable programs also support a <option>--version</option> option; at least <literal>postgres --version</literal> and <literal>psql --version</literal> should work. If the function or the options do not exist then your version is more than old enough to warrant an upgrade. If you run a prepackaged version, such as RPMs, say so, including any subversion the package might have. If you are talking about a Git snapshot, mention that, including the commit hash.
ru: Версию <productname>PostgreSQL</productname>. Чтобы выяснить версию сервера, к которому вы подключены, можно выполнить команду <literal>SELECT version();</literal>. Большинство исполняемых программ также поддерживают параметр <option>--version</option>; как минимум должно работать <literal>postgres --version</literal> и <literal>psql --version</literal>. Если такая функция или параметры не поддерживаются, вероятно вашу версию давно пора обновить. Если вы используете дистрибутивный пакет, например RPM, сообщите это, включая полную версию этого пакета. Если же вы работаете со снимком Git, укажите это и хеш последней правки.

source: If your version is older than &version; we will almost certainly tell you to upgrade. There are many bug fixes and improvements in each new release, so it is quite possible that a bug you have encountered in an older release of <productname>PostgreSQL</productname> has already been fixed. We can only provide limited support for sites using older releases of <productname>PostgreSQL</productname>; if you require more than we can provide, consider acquiring a commercial support contract.
ru: Если ваша версия старее, чем &version;, мы почти наверняка посоветуем вам обновиться. В каждом новом выпуске очень много улучшений и исправлений ошибок, так что ошибка, которую вы встретили в старой версии <productname>PostgreSQL</productname>, скорее всего уже исправлена. Мы можем обеспечить только ограниченную поддержку для тех, кто использует старые версии <productname>PostgreSQL</productname>; если вам этого недостаточно, подумайте о заключении договора коммерческой поддержки.

source: Platform information. This includes the kernel name and version, C library, processor, memory information, and so on. In most cases it is sufficient to report the vendor and version, but do not assume everyone knows what exactly <quote>Debian</quote> contains or that everyone runs on i386s. If you have installation problems then information about the toolchain on your machine (compiler, <application>make</application>, and so on) is also necessary.
ru: Сведения о платформе, включая название и версию ядра, библиотеки C, характеристики процессора, памяти и т. д. Часто бывает достаточно сообщить название и версию ОС, но не рассчитывайте, что все знают, что именно подразумевается под <quote>Debian</quote>, или что все используют i386. Если у вас возникают сложности со сборкой кода и установкой, также необходима информация о сборочной среде вашего компьютера (компилятор, <application>make</application> и т. д.).

source: The following items should be contained in every bug report: <placeholder-1/> Do not be afraid if your bug report becomes rather lengthy. That is a fact of life. It is better to report everything the first time than us having to squeeze the facts out of you. On the other hand, if your input files are huge, it is fair to ask first whether somebody is interested in looking into it. Here is an <ulink url="http://www.chiark.greenend.org.uk/~sgtatham/bugs.html">article</ulink> that outlines some more tips on reporting bugs.
ru: В каждом отчёте об ошибке следует указать: <placeholder-1/> Не бойтесь, если ваш отчёт об ошибке не будет краток. У таланта есть ещё и брат. Лучше сообщить обо всём сразу, чем мы будем потом выуживать факты из вас. С другой стороны, если файлы, которые вы хотите показать, велики, правильнее будет сначала спросить, хочет ли кто-то взглянуть на них. В <ulink url="http://www.chiark.greenend.org.uk/~sgtatham/bugs.html">этой статье</ulink> вы найдёте другие советы по составлению отчётов об ошибках.

source: Do not spend all your time to figure out which changes in the input make the problem go away. This will probably not help solving it. If it turns out that the bug cannot be fixed right away, you will still have time to find and share your work-around. Also, once again, do not waste your time guessing why the bug exists. We will find that out soon enough.
ru: Не тратьте всё своё время, чтобы выяснить, при каких входных данных исчезает проблема. Это вряд ли поможет решить её. Если выяснится, что быстро исправить ошибку нельзя, тогда у вас будет время найти обходной путь и сообщить о нём. И опять же, не тратьте своё время на выяснение, почему возникает эта ошибка. Мы найдём её причину достаточно быстро.

source: When writing a bug report, please avoid confusing terminology. The software package in total is called <quote>PostgreSQL</quote>, sometimes <quote>Postgres</quote> for short. If you are specifically talking about the backend process, mention that, do not just say <quote>PostgreSQL crashes</quote>. A crash of a single backend process is quite different from crash of the parent <quote>postgres</quote> process; please don't say <quote>the server crashed</quote> when you mean a single backend process went down, nor vice versa. Also, client programs such as the interactive frontend <quote><application>psql</application></quote> are completely separate from the backend. Please try to be specific about whether the problem is on the client or server side.
ru: Сообщая об ошибке, старайтесь не допускать путаницы в терминах. Программный пакет в целом называется <quote>PostgreSQL</quote>, иногда <quote>Postgres</quote> для краткости. Если вы говорите именно о серверном процессе, упомяните это; не следует говорить <quote>сбой в PostgreSQL</quote>. Сбой одного серверного процесса кардинально отличается от сбоя родительского процесса <quote>postgres</quote>, поэтому, пожалуйста, не называйте <quote>сбоем сервера</quote> отключение одного из подчинённых серверных процессов и наоборот. Кроме того, клиентские программы, такие как интерактивный <quote><application>psql</application></quote> существуют совершенно отдельно от серверной части. По возможности постарайтесь точно указать, где наблюдается проблема, на стороне клиента или сервера.

source: Where to Report Bugs
ru: Куда сообщать

source: In general, send bug reports to the bug report mailing list at <email>pgsql-bugs@postgresql.org</email>. You are requested to use a descriptive subject for your email message, perhaps parts of the error message.
ru: В общем случае посылать сообщения об ошибках следует в список рассылки <email>pgsql-bugs@postgresql.org</email>. Вам надо будет написать информативную тему письма, возможно включив в неё часть сообщения об ошибке.

source: Another method is to fill in the bug report web-form available at the project's <ulink url="https://www.postgresql.org/">web site</ulink>. Entering a bug report this way causes it to be mailed to the <email>pgsql-bugs@postgresql.org</email> mailing list.
ru: Ещё один вариант отправки сообщения &mdash; заполнить отчёт об ошибке в веб-форме на <ulink url="https://www.postgresql.org/">сайте проекта</ulink>. В этом случае ваше сообщение будет автоматически отправлено в список рассылки <email>pgsql-bugs@postgresql.org</email>.

source: Another method is to fill in the bug report web-form available at the project's <ulink url="http://www.postgresql.org/">web site</ulink>. Entering a bug report this way causes it to be mailed to the <email>pgsql-bugs@postgresql.org</email> mailing list.
ru: Ещё один вариант отправки сообщения &mdash; заполнить отчёт об ошибке в веб-форме на <ulink url="http://www.postgresql.org/">сайте проекта</ulink>. В этом случае ваше сообщение будет автоматически отправлено в список рассылки <email>pgsql-bugs@postgresql.org</email>.
