Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/problems.po
Languages: ru

source: If your bug report has security implications and you'd prefer that it not become immediately visible in public archives, don't send it to <literal>pgsql-bugs</literal>. Security issues can be reported privately to <email>security@postgresql.org</email>.
ru: Если вы сообщаете об ошибке, связанной с безопасностью, и не хотите, чтобы ваше сообщение появилось в публичных архивах, не отправляйте его в <literal>pgsql-bugs</literal>. Об уязвимостях вы можете написать в закрытую группу <email>security@postgresql.org</email>.

source: Do not send bug reports to any of the user mailing lists, such as <email>pgsql-sql@postgresql.org</email> or <email>pgsql-general@postgresql.org</email>. These mailing lists are for answering user questions, and their subscribers normally do not wish to receive bug reports. More importantly, they are unlikely to fix them.
ru: Не посылайте сообщения в списки рассылки для пользователей, например в <email>pgsql-sql@postgresql.org</email> или <email>pgsql-general@postgresql.org</email>. Эти рассылки предназначены для ответов на вопросы пользователей, и их подписчики обычно не хотят получать сообщения об ошибках, более того, они вряд ли исправят их.

source: Also, please do <emphasis>not</emphasis> send reports to the developers' mailing list <email>pgsql-hackers@postgresql.org</email>. This list is for discussing the development of <productname>PostgreSQL</productname>, and it would be nice if we could keep the bug reports separate. We might choose to take up a discussion about your bug report on <literal>pgsql-hackers</literal>, if the problem needs more review.
ru: Также, пожалуйста, <emphasis>не</emphasis> отправляйте отчёты об ошибках в список <email>pgsql-hackers@postgresql.org</email>. Этот список предназначен для обсуждения разработки <productname>PostgreSQL</productname>, и будет лучше, если сообщения об ошибках будут существовать отдельно. Хотя мы можем перенести обсуждение вашей ошибки в <literal>pgsql-hackers</literal>, если проблема требует дополнительного рассмотрения.

source: If you have a problem with the documentation, the best place to report it is the documentation mailing list <email>pgsql-docs@postgresql.org</email>. Please be specific about what part of the documentation you are unhappy with.
ru: Если вы столкнулись с ошибкой в документации, лучше всего написать об этом в список рассылки, посвящённый документации, <email>pgsql-docs@postgresql.org</email>. Пожалуйста, постарайтесь конкретизировать, какая часть документации вас не устраивает.

source: If your bug is a portability problem on a non-supported platform, send mail to <email>pgsql-hackers@postgresql.org</email>, so we (and you) can work on porting <productname>PostgreSQL</productname> to your platform.
ru: Если ваша ошибка связана с переносимостью на неподдерживаемой платформе, отправьте письмо по адресу <email>pgsql-hackers@postgresql.org</email>, чтобы мы (и вы) смогли запустить <productname>PostgreSQL</productname> на вашей платформе.

source: Due to the unfortunate amount of spam going around, all of the above email addresses are closed mailing lists. That is, you need to be subscribed to a list to be allowed to post on it. (You need not be subscribed to use the bug-report web form, however.) If you would like to send mail but do not want to receive list traffic, you can subscribe and set your subscription option to <literal>nomail</literal>. For more information send mail to <email>majordomo@postgresql.org</email> with the single word <literal>help</literal> in the body of the message.
ru: Из-за большого количества спама все вышеупомянутые адреса сделаны закрытыми. То есть, чтобы отправить сообщение в список рассылки, вы должны подписаться на него. (Хотя это не требуется при использовании веб-формы сообщения об ошибке.) Если вы хотите отправить сообщение, но не получать затем письма из рассылки, вы можете подписаться и поставить в параметрах подписки <literal>nomail</literal>. Получить дополнительную информацию вы можете, отправив по адресу <email>majordomo@postgresql.org</email> одно слово <literal>help</literal> в теле сообщения.
