Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/protocol.po
Languages: ru

source: The first ordinary result set contains the starting position of the backup, in a single row with two columns. The first column contains the start position given in XLogRecPtr format, and the second column contains the corresponding timeline ID.
ru: В первом обычном наборе результатов передаётся начальная позиция резервной копии, в одной строке с двумя столбцами. В первом столбце содержится стартовая позиция в формате XLogRecPtr, а во втором идентификатор соответствующей линии времени.

source: The OID of the tablespace, or null if it's the base directory.
ru: OID табличного пространства либо NULL, если это базовый каталог.

source: The full path of the tablespace directory, or null if it's the base directory.
ru: Полный путь к каталогу табличного пространства либо NULL, если это базовый каталог.

source: The approximate size of the tablespace, if progress report has been requested; otherwise it's null.
ru: Приблизительный размер табличного пространства, если была запрошена информация о прогрессе операции; в противном случае NULL.

source: The second ordinary result set has one row for each tablespace. The fields in this row are: <placeholder-1/>
ru: Во втором обычном наборе результатов передаётся по одной строке для каждого табличного пространства. Эта строка содержит следующие поля: <placeholder-1/>

source: After the second regular result set, one or more CopyResponse results will be sent, one for the main data directory and one for each additional tablespace other than <literal>pg_default</literal> and <literal>pg_global</literal>. The data in the CopyResponse results will be a tar format (following the <quote>ustar interchange format</quote> specified in the POSIX 1003.1-2008 standard) dump of the tablespace contents, except that the two trailing blocks of zeroes specified in the standard are omitted. After the tar data is complete, a final ordinary result set will be sent, containing the WAL end position of the backup, in the same format as the start position.
ru: За вторым обычным набором результатов следует одна или несколько серий результатов CopyResponse, одна для основного каталога данных и по одной для каждого табличного пространства, отличного от <literal>pg_default</literal> и <literal>pg_global</literal>. Данные в CopyResponse представляют собой выгруженное в формате tar (<quote>формате обмена ustar</quote>, описанном в стандарте POSIX 1003.1-2008) содержимое табличных пространств, за исключением того, что два замыкающих блока нулей, описанных в стандарте, не передаются. После завершения передачи данных tar передаётся заключительный обычный набор результатов, в котором сообщается конечная позиция копии в WAL, в том же формате, что и стартовая позиция.

source: Various temporary files and directories created during the operation of the PostgreSQL server, such as any file or directory beginning with <filename>pgsql_tmp</filename>.
ru: различные временные файлы и каталоги, создаваемые в процессе работы сервером PostgreSQL, в частности файлы и каталоги с именами, начинающимися с <filename>pgsql_tmp</filename>

source: <filename>pg_wal</filename>, including subdirectories. If the backup is run with WAL files included, a synthesized version of <filename>pg_wal</filename> will be included, but it will only contain the files necessary for the backup to work, not the rest of the contents.
ru: <filename>pg_wal</filename>, включая подкаталоги. Если в резервную копию включаются файлы WAL, в архив входит преобразованная версия <filename>pg_wal</filename>, в которой будут находиться только файлы, необходимые для восстановления копии, но не всё остальное содержимое этого каталога

source: <filename>pg_dynshmem</filename>, <filename>pg_notify</filename>, <filename>pg_replslot</filename>, <filename>pg_serial</filename>, <filename>pg_snapshots</filename>, <filename>pg_stat_tmp</filename>, and <filename>pg_subtrans</filename> are copied as empty directories (even if they are symbolic links).
ru: <filename>pg_dynshmem</filename>, <filename>pg_notify</filename>, <filename>pg_replslot</filename>, <filename>pg_serial</filename>, <filename>pg_snapshots</filename>, <filename>pg_stat_tmp</filename> и <filename>pg_subtrans</filename> копируются как пустые каталоги (даже если это символические ссылки)

source: Files other than regular files and directories, such as symbolic links (other than for the directories listed above) and special device files, are skipped. (Symbolic links in <filename>pg_tblspc</filename> are maintained.)
ru: файлы, кроме обычных файлов и каталогов, например, символические ссылки (кроме вышеупомянутых каталогов) и файлы специальных устройств, пропускаются (символические ссылки в <filename>pg_tblspc</filename> сохраняются).

source: The tar archive for the data directory and each tablespace will contain all files in the directories, regardless of whether they are <productname>PostgreSQL</productname> files or other files added to the same directory. The only excluded files are: <placeholder-1/> Owner, group, and file mode are set if the underlying file system on the server supports it.
ru: Архив tar каталога данных и всех табличных пространств будет содержать все файлы в этих каталогах, будь то файлы <productname>PostgreSQL</productname> или посторонние файлы, добавленные в эти каталоги. Исключение составляют только следующие файлы: <placeholder-1/> Если файловая система сервера поддерживает это, в архив включается информация о владельце, группе и режиме файла.

source: The commands accepted in walsender mode are: <placeholder-1/>
ru: В режиме walsender принимаются следующие команды: <placeholder-1/>

source: Logical Streaming Replication Protocol
ru: Протокол логической потоковой репликации

source: This section describes the logical replication protocol, which is the message flow started by the <literal>START_REPLICATION</literal> <literal>SLOT</literal> <replaceable class="parameter">slot_name</replaceable> <literal>LOGICAL</literal> replication command.
ru: В этом разделе описывается протокол логической репликации, регламентирующий поток сообщений, который запускается командой репликации <literal>START_REPLICATION</literal> <literal>SLOT</literal> <replaceable class="parameter">имя_слота</replaceable> <literal>LOGICAL</literal>.

source: The logical streaming replication protocol builds on the primitives of the physical streaming replication protocol.
ru: Протокол логической потоковой репликации построен на примитивах протокола физической потоковой репликации.

source: Logical Streaming Replication Parameters
ru: Параметры протокола логической потоковой репликации

source: Protocol version. Currently only version <literal>1</literal> is supported.
ru: Версия протокола. В настоящее время поддерживается только версия <literal>1</literal>.

source: Comma separated list of publication names for which to subscribe (receive changes). The individual publication names are treated as standard objects names and can be quoted the same as needed.
ru: Список разделённых запятыми имён публикаций, на которые подписывается клиент (будет получать их изменения). Имена отдельных публикаций обрабатываются как стандартные имена объектов и могут так же заключаться в кавычки при необходимости.

source: The logical replication <literal>START_REPLICATION</literal> command accepts following parameters: <placeholder-1/>
ru: Команда логической репликации <literal>START_REPLICATION</literal> принимает следующие параметры: <placeholder-1/>

source: Logical Replication Protocol Messages
ru: Сообщения протокола логической репликации

source: The individual protocol messages are discussed in the following subsections. Individual messages are described in <xref linkend="protocol-logicalrep-message-formats"/>.
ru: Отдельные сообщения протокола рассматриваются в следующих подразделах. Собственно сообщения описаны в <xref linkend="protocol-logicalrep-message-formats"/>.

source: All top-level protocol messages begin with a message type byte. While represented in code as a character, this is a signed byte with no associated encoding.
ru: Все сообщения верхнего уровня начинаются с байта, определяющего тип сообщения. Хотя он представлен в коде символьным типом, это знаковый байт без явно заданной кодировки.

source: Since the streaming replication protocol supplies a message length there is no need for top-level protocol messages to embed a length in their header.
ru: Так как в протоколе потоковой репликации передаётся длина сообщения, нет необходимости указывать длину в заголовках сообщений верхнего уровня.

source: Logical Replication Protocol Message Flow
ru: Поток сообщений протокола логической репликации

source: With the exception of the <literal>START_REPLICATION</literal> command and the replay progress messages, all information flows only from the backend to the frontend.
ru: За исключением команды <literal>START_REPLICATION</literal> и сообщений о прогрессе воспроизведения, весь информационный поток направлен от сервера к клиенту.

source: The logical replication protocol sends individual transactions one by one. This means that all messages between a pair of Begin and Commit messages belong to the same transaction.
ru: Протокол логической репликации передаёт отдельные транзакции одну за другой. Это значит, что все сообщения между парой сообщений Begin и Commit относятся к одной транзакции.

source: Every sent transaction contains zero or more DML messages (Insert, Update, Delete). In case of a cascaded setup it can also contain Origin messages. The origin message indicated that the transaction originated on different replication node. Since a replication node in the scope of logical replication protocol can be pretty much anything, the only identifier is the origin name. It's downstream's responsibility to handle this as needed (if needed). The Origin message is always sent before any DML messages in the transaction.
ru: Каждая передаваемая транзакция содержит ноль или более сообщений DML (Insert, Update, Delete). В каскадной схеме она может также содержать сообщения Origin. Это сообщение показывает, что транзакция пришла с другого узла в схеме репликации. Так как этим узлом в контексте протокола логической репликации может быть что угодно, единственным идентификатором является его имя. Как воспринимать это имя (если это вообще нужно), определяют нижестоящие узлы. Сообщение Origin всегда передаётся перед всеми остальными сообщениями DML в транзакции.

source: Every DML message contains an arbitrary relation ID, which can be mapped to an ID in the Relation messages. The Relation messages describe the schema of the given relation. The Relation message is sent for a given relation either because it is the first time we send a DML message for given relation in the current session or because the relation definition has changed since the last Relation message was sent for it. The protocol assumes that the client is capable of caching the metadata for as many relations as needed.
ru: Каждое DML-сообщение содержит произвольный идентификатор отношения, который можно сопоставить с идентификатором в сообщениях Relation. Сообщения Relation описывают схему данного отношения. Такие сообщения передаются для заданного отношения либо когда нужно впервые передать DML-сообщения для этого отношения в текущем сеансе, либо когда определение отношения изменилось со времени предыдущей передачи сообщения Relation о нём. В протоколе предполагается, что клиент сможет кешировать метаданные для достаточно большого числа отношений.

source: Message Data Types
ru: Типы данных в сообщениях

source: An <replaceable>n</replaceable>-bit integer in network byte order (most significant byte first). If <replaceable>i</replaceable> is specified it is the exact value that will appear, otherwise the value is variable. Eg. Int16, Int32(42).
ru: Целое число из <replaceable>n</replaceable> бит с сетевым порядком байт (наиболее значащий байт первый). Если указано <replaceable>i</replaceable>, это поле будет содержать именно указанное значение, в противном случае значение переменное. Например: Int16, Int32(42).

source: An array of <replaceable>k</replaceable> <replaceable>n</replaceable>-bit integers, each in network byte order. The array length <replaceable>k</replaceable> is always determined by an earlier field in the message. Eg. Int16[M].
ru: Массив из <replaceable>k</replaceable> <replaceable>n</replaceable>-битовых целых, каждое записывается с сетевым порядком байт. Длина массива <replaceable>k</replaceable> всегда определяется по предыдущему полю сообщения, например Int16[M].

source: A null-terminated string (C-style string). There is no specific length limitation on strings. If <replaceable>s</replaceable> is specified it is the exact value that will appear, otherwise the value is variable. Eg. String, String("user").
ru: Строка, оканчивающаяся нулём (строка в стиле C). На длину строк ограничение не накладывается. Если указывается <replaceable>s</replaceable>, это поле будет содержать именно указанное значение, в противном случае значение переменное. Например: String, String("user").

source: <emphasis>There is no predefined limit</emphasis> on the length of a string that can be returned by the backend. Good coding strategy for a frontend is to use an expandable buffer so that anything that fits in memory can be accepted. If that's not feasible, read the full string and discard trailing characters that don't fit into your fixed-size buffer.
ru: <emphasis>Нет никакого предопределённого ограничения</emphasis> длины строки, которую может возвратить сервер. Поэтому при реализации клиента лучше использовать расширяемый буфер, чтобы он мог принять строку любого размера, умещающуюся в памяти. Если такой возможности нет, прочитайте строку целиком и отбросьте последние символы, не помещающиеся в ваш буфер фиксированного размера.

source: Exactly <replaceable>n</replaceable> bytes. If the field width <replaceable>n</replaceable> is not a constant, it is always determinable from an earlier field in the message. If <replaceable>c</replaceable> is specified it is the exact value. Eg. Byte2, Byte1('\n').
ru: В точности <replaceable>n</replaceable> байт. Если размер поля <replaceable>n</replaceable> задаётся не константой, он всегда определяется по предыдущему полю сообщения. Если указывается <replaceable>c</replaceable>, оно задаёт точное значение. Например: Byte2, Byte1('\n').

source: This section describes the base data types used in messages. <placeholder-1/>
ru: В этом разделе описываются базовые типы данных, применяемые в сообщениях. <placeholder-1/>

source: Message Formats
ru: Форматы сообщений

source: This section describes the detailed format of each message. Each is marked to indicate that it can be sent by a frontend (F), a backend (B), or both (F &amp; B). Notice that although each message includes a byte count at the beginning, the message format is defined so that the message end can be found without reference to the byte count. This aids validity checking. (The CopyData message is an exception, because it forms part of a data stream; the contents of any individual CopyData message cannot be interpretable on their own.)
ru: В этом разделе подробно описывается формат каждого сообщения. Все сообщения помечены символами, обозначающими, какая сторона может их передавать: сервер (F), клиент (B) или обе стороны (F &amp; B). Заметьте, что хотя каждое сообщение включает счётчик байт в начале, формат сообщения разработан так, чтобы конец сообщения можно было найти, не обращаясь к счётчику байт. Это помогает проверять корректность сообщений. (Исключением является сообщение CopyData, так как оно образует часть потока данных; содержимое любого отдельного сообщения CopyData нельзя интерпретировать само по себе.)

source: Identifies the message as an authentication request.
ru: Указывает, что это сообщение представляет запрос аутентификации.

source: Length of message contents in bytes, including self.
ru: Длина содержимого сообщения в байтах, включая само поле длины.

source: Specifies that the authentication was successful.
ru: Показывает, что проверка подлинности прошла успешно.

source: Specifies that Kerberos V5 authentication is required.
ru: Указывает, что требуется проверка подлинности по протоколу Kerberos V5.

source: Specifies that a clear-text password is required.
ru: Указывает, что требуется пароль, передаваемый открытым текстом.

source: Specifies that an MD5-encrypted password is required.
ru: Указывает, что требуется пароль, преобразованный в хеш MD5.

source: The salt to use when encrypting the password.
ru: Значение соли, с которым должен хешироваться пароль.

source: Specifies that an SCM credentials message is required.
ru: Указывает, что требуется сообщение с учётными данными SCM.

source: Specifies that GSSAPI authentication is required.
ru: Указывает, что требуется проверка подлинности на базе GSSAPI.

source: Specifies that SSPI authentication is required.
ru: Указывает, что требуется проверка подлинности на базе SSPI.

source: Specifies that this message contains GSSAPI or SSPI data.
ru: Указывает, что это сообщение содержит данные GSSAPI или SSPI.

source: GSSAPI or SSPI authentication data.
ru: Данные аутентификации для GSSAPI или SSPI.

source: Specifies that SASL authentication is required.
ru: Указывает, что требуется проверка подлинности на базе SASL.

source: Name of a SASL authentication mechanism.
ru: Имя механизма аутентификации SASL.

source: <placeholder-1/> The message body is a list of SASL authentication mechanisms, in the server's order of preference. A zero byte is required as terminator after the last authentication mechanism name. For each mechanism, there is the following: <placeholder-2/>
ru: <placeholder-1/> Тело сообщения содержит список механизмов аутентификации SASL, в порядке предпочтений сервера. За последним именем механизма аутентификации должен идти завершающий нулевой байт. Для каждого механизма передаётся: <placeholder-2/>

source: Specifies that this message contains a SASL challenge.
ru: Указывает, что это сообщение содержит данные вызова SASL.

source: SASL data, specific to the SASL mechanism being used.
ru: Данные SASL, специфичные для применяемого механизма SASL.

source: Specifies that SASL authentication has completed.
ru: Указывает, что аутентификация SASL завершена.

source: SASL outcome "additional data", specific to the SASL mechanism being used.
ru: «Дополнительные данные» результата SASL, специфичные для применяемого механизма SASL.

source: Identifies the message as cancellation key data. The frontend must save these values if it wishes to be able to issue CancelRequest messages later.
ru: Указывает, что это сообщение содержит ключевые данные для отмены запросов. Клиент должен сохранить эти данные, если ему нужна возможность впоследствии выдавать сообщения CancelRequest.

source: The process ID of this backend.
ru: PID обслуживающего процесса.

source: The secret key of this backend.
ru: Секретный ключ обслуживающего процесса.

source: Identifies the message as a Bind command.
ru: Указывает, что это сообщение представляет команду Bind.

source: The name of the destination portal (an empty string selects the unnamed portal).
ru: Имя целевого портала (пустая строка выбирает безымянный портал).

source: The name of the source prepared statement (an empty string selects the unnamed prepared statement).
ru: Имя исходного подготовленного оператора (пустая строка выбирает безымянный подготовленный оператор).

source: The number of parameter format codes that follow (denoted <replaceable>C</replaceable> below). This can be zero to indicate that there are no parameters or that the parameters all use the default format (text); or one, in which case the specified format code is applied to all parameters; or it can equal the actual number of parameters.
ru: Количество кодов форматов следующих параметров (обозначается ниже символом <replaceable>C</replaceable>). Может быть нулевым, что показывает, что параметры отсутствуют или все параметры передаются в формате по умолчанию (текстовом); либо равняться одному, в этом случае указанный один код формата применяется ко всем параметрам; либо может равняться действительному количеству параметров.

source: The parameter format codes. Each must presently be zero (text) or one (binary).
ru: Коды форматов параметров. В настоящее время допускаются коды ноль (текстовый формат) и один (двоичный).

source: The number of parameter values that follow (possibly zero). This must match the number of parameters needed by the query.
ru: Количество следующих значений параметров (может быть нулевым). Оно должно совпадать с количеством параметров, требующихся для запроса.

source: The length of the parameter value, in bytes (this count does not include itself). Can be zero. As a special case, -1 indicates a NULL parameter value. No value bytes follow in the NULL case.
ru: Длина значения параметра, в байтах (само поле длины не считается). Может быть нулевой. В качестве особого значения, -1 представляет значение NULL. В случае с NULL никакие байты значений далее не следуют.

source: The value of the parameter, in the format indicated by the associated format code. <replaceable>n</replaceable> is the above length.
ru: Значение параметра в формате, определённом соответствующим кодом формата. Переменная <replaceable>n</replaceable> задаёт длину значения.

source: The number of result-column format codes that follow (denoted <replaceable>R</replaceable> below). This can be zero to indicate that there are no result columns or that the result columns should all use the default format (text); or one, in which case the specified format code is applied to all result columns (if any); or it can equal the actual number of result columns of the query.
ru: Количество кодов формата для следующих столбцов результата (обозначается ниже символом <replaceable>R</replaceable>). Может быть нулевым, что показывает, что столбцы результата отсутствуют или для всех столбцов должен использоваться формат по умолчанию (текстовый), либо равняться одному, в этом случае указанный один код формата применяется ко всем столбцам (если они есть), либо может равняться действительному количеству столбцов результата запроса.

source: The result-column format codes. Each must presently be zero (text) or one (binary).
ru: Коды форматов столбцов результата. В настоящее время допускаются коды ноль (текстовый формат) и один (двоичный).

source: <placeholder-1/> Next, the following pair of fields appear for each parameter: <placeholder-2/> After the last parameter, the following fields appear: <placeholder-3/>
ru: <placeholder-1/> Затем для каждого параметра идёт следующая пара полей: <placeholder-2/> За последним параметром идут следующие поля: <placeholder-3/>

source: Identifies the message as a Bind-complete indicator.
ru: Указывает, что это сообщение, сигнализирующее о завершении Bind.

source: The cancel request code. The value is chosen to contain <literal>1234</literal> in the most significant 16 bits, and <literal>5678</literal> in the least significant 16 bits. (To avoid confusion, this code must not be the same as any protocol version number.)
ru: Код запроса отмены. Это специально выбранное значение содержит <literal>1234</literal> в старших 16 битах и <literal>5678</literal> в младших 16 битах. (Во избежание неоднозначности этот код не должен совпадать с номером версии протокола.)

source: The process ID of the target backend.
ru: PID целевого обслуживающего процесса.

source: The secret key for the target backend.
ru: Секретный ключ целевого обслуживающего процесса.

source: Identifies the message as a Close command.
ru: Указывает, что это сообщение представляет команду Close.
