Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/protocol.po
Languages: ru

source: Decides what to do with the snapshot created during logical slot initialization. <literal>EXPORT_SNAPSHOT</literal>, which is the default, will export the snapshot for use in other sessions. This option can't be used inside a transaction. <literal>USE_SNAPSHOT</literal> will use the snapshot for the current transaction executing the command. This option must be used in a transaction, and <literal>CREATE_REPLICATION_SLOT</literal> must be the first command run in that transaction. Finally, <literal>NOEXPORT_SNAPSHOT</literal> will just use the snapshot for logical decoding as normal but won't do anything else with it.
ru: Эти указания выбирают, что делать со снимком, создаваемым при инициализации логического слота. С указанием <literal>EXPORT_SNAPSHOT</literal>, подразумеваемым по умолчанию, этот снимок будет экспортироваться для использования в других сеансах. Это указание нельзя использовать внутри транзакции. С указанием <literal>USE_SNAPSHOT</literal> снимок будет использоваться для текущей транзакции, в которой выполняется команда. Это указание должно использоваться в транзакции, при этом команда <literal>CREATE_REPLICATION_SLOT</literal> должна быть первой в этой транзакции. Наконец, с <literal>NOEXPORT_SNAPSHOT</literal> снимок будет использоваться только для логического декодирования в обычном режиме, но ничего больше с ним делать нельзя.

source: The name of the newly-created replication slot.
ru: Имя создаваемого слота репликации.

source: The WAL location at which the slot became consistent. This is the earliest location from which streaming can start on this replication slot.
ru: Позиция в WAL, в которой слот достиг согласованного состояния. Это самая ранняя позиция, с которой может начаться трансляция через этот слот репликации.

source: The identifier of the snapshot exported by the command. The snapshot is valid until a new command is executed on this connection or the replication connection is closed. Null if the created slot is physical.
ru: Идентификатор снимка, экспортированного командой. Этот снимок действителен до тех пор, пока через это соединение не будет выполнена следующая команда или соединение не будет закрыто. Null, если созданный слот — физический.

source: The name of the output plugin used by the newly-created replication slot. Null if the created slot is physical.
ru: Имя модуля вывода, используемого созданным слотом репликации. Null, если созданный слот — физический.

source: In response to this command, the server will send a one-row result set containing the following fields: <placeholder-1/>
ru: В ответ на эту команду сервер передаст набор результатов с одной строкой, содержащей следующие поля: <placeholder-1/>

source: <literal>START_REPLICATION</literal> [ <literal>SLOT</literal> <replaceable class="parameter">slot_name</replaceable> ] [ <literal>PHYSICAL</literal> ] <replaceable class="parameter">XXX/XXX</replaceable> [ <literal>TIMELINE</literal> <replaceable class="parameter">tli</replaceable> ] <placeholder-1/>
ru: <literal>START_REPLICATION</literal> [ <literal>SLOT</literal> <replaceable class="parameter">имя_слота</replaceable> ] [ <literal>PHYSICAL</literal> ] <replaceable class="parameter">XXX/XXX</replaceable> [ <literal>TIMELINE</literal> <replaceable class="parameter">лин_врем</replaceable> ] <placeholder-1/>

source: Instructs server to start streaming WAL, starting at WAL location <replaceable class="parameter">XXX/XXX</replaceable>. If <literal>TIMELINE</literal> option is specified, streaming starts on timeline <replaceable class="parameter">tli</replaceable>; otherwise, the server's current timeline is selected. The server can reply with an error, for example if the requested section of WAL has already been recycled. On success, server responds with a CopyBothResponse message, and then starts to stream WAL to the frontend.
ru: Указывает серверу начать потоковую передачу WAL, начиная с позиции <replaceable class="parameter">XXX/XXX</replaceable> в WAL. Если указывается параметр <literal>TIMELINE</literal>, передача начинается на линии времени <replaceable class="parameter">лин_врем</replaceable>, иначе выбирается текущая линия времени сервера. Сервер может вернуть в ответ ошибку, например, если запрошенный сегмент WAL уже потерян. Если проблем не возникает, сервер возвращает сообщение CopyBothResponse, а затем начинает передавать поток WAL клиенту.

source: If a slot's name is provided via <replaceable class="parameter">slot_name</replaceable>, it will be updated as replication progresses so that the server knows which WAL segments, and if <varname>hot_standby_feedback</varname> is on which transactions, are still needed by the standby.
ru: Если в параметрах передаётся <replaceable class="parameter">имя_слота</replaceable>, сервер будет отражать состояние репликации в этом слоте и отслеживать, какие сегменты, а если включён режим <varname>hot_standby_feedback</varname>, то и в каких транзакциях, всё ещё нужны этому резервному серверу.

source: If the client requests a timeline that's not the latest but is part of the history of the server, the server will stream all the WAL on that timeline starting from the requested start point up to the point where the server switched to another timeline. If the client requests streaming at exactly the end of an old timeline, the server responds immediately with CommandComplete without entering COPY mode.
ru: Если клиент запрашивает не последнюю, но существующую в истории сервера линию времени, сервер будет передавать весь WAL на этой линии времени, начиная с запрошенной стартовой точки до момента, когда сервер переключился на другую линию времени. Если клиент запрашивает передачу с начальной позицией точно в конце старой линии времени, сервер немедленно отвечает CommandComplete, не переходя в режим COPY.

source: After streaming all the WAL on a timeline that is not the latest one, the server will end streaming by exiting the COPY mode. When the client acknowledges this by also exiting COPY mode, the server sends a result set with one row and two columns, indicating the next timeline in this server's history. The first column is the next timeline's ID (type <type>int8</type>), and the second column is the WAL location where the switch happened (type <type>text</type>). Usually, the switch position is the end of the WAL that was streamed, but there are corner cases where the server can send some WAL from the old timeline that it has not itself replayed before promoting. Finally, the server sends CommandComplete message, and is ready to accept a new command.
ru: После передачи всех записей WAL на линии времени, не являющейся текущей, сервер завершает потоковую передачу, выходя из режима копирования. Когда клиент подтверждает завершение передачи, также выходя из режима копирования, сервер возвращает набор результатов в одной строке с двумя столбцами, сообщая таким образом о следующей линии времени в истории сервера. В первом столбце передаётся идентификатор следующей линии времени (типа <type>int8</type>), а во втором — позиция в WAL, в которой произошло переключение (типа <type>text</type>). Обычно в этой же позиции завершается передача потока WAL, но возможны исключения, когда сервер может передавать записи WAL из старой линии времени, которые он сам ещё не воспроизвёл до переключения. Наконец сервер передаёт сообщение CommandComplete, после чего он готов принять следующую команду.

source: WAL data is sent as a series of CopyData messages. (This allows other information to be intermixed; in particular the server can send an ErrorResponse message if it encounters a failure after beginning to stream.) The payload of each CopyData message from server to the client contains a message of one of the following formats:
ru: Данные WAL передаются в серии сообщений CopyData. (Это позволяет перемежать их с другой информацией; в частности, сервер может передать сообщение ErrorResponse, если он столкнулся с проблемами, уже начав передачу потока.) Полезная нагрузка каждого сообщения CopyData от сервера к клиенту содержит данные в одном из следующих форматов:

source: XLogData (B)
ru: XLogData (B) — данные журнала транзакций

source: Identifies the message as WAL data.
ru: Указывает, что в этом сообщении передаются данные WAL.

source: The starting point of the WAL data in this message.
ru: Начальная точка данных WAL в этом сообщении.

source: The current end of WAL on the server.
ru: Текущее положение конца WAL на сервере.

source: The WAL position to begin streaming at.
ru: Позиция в WAL, с которой должна начаться передача.

source: The server's system clock at the time of transmission, as microseconds since midnight on 2000-01-01.
ru: Показания системных часов сервера в момент передачи, в микросекундах с полуночи 2000-01-01.

source: A section of the WAL data stream.
ru: Фрагмент потока данных WAL.

source: A single WAL record is never split across two XLogData messages. When a WAL record crosses a WAL page boundary, and is therefore already split using continuation records, it can be split at the page boundary. In other words, the first main WAL record and its continuation records can be sent in different XLogData messages.
ru: Одна запись WAL никогда не разделяется на два сообщения XLogData. Когда запись WAL пересекает границу страницы WAL, и таким образом от неё уже оказывается отделена продолжающая запись, её можно разделить на сообщения по границе страницы. Другими словами, первая основная запись WAL и продолжающие её записи могут быть переданы в различных сообщениях XLogData.

source: Primary keepalive message (B)
ru: Primary keepalive message (B) — Сообщение об активности ведущего

source: Identifies the message as a sender keepalive.
ru: Указывает, что это сообщение об активности отправителя.

source: 1 means that the client should reply to this message as soon as possible, to avoid a timeout disconnect. 0 otherwise.
ru: Значение 1 означает, что клиент должен ответить на это сообщение как можно скорее, во избежание отключения по тайм-ауту. Со значением 0 это не требуется.

source: The receiving process can send replies back to the sender at any time, using one of the following message formats (also in the payload of a CopyData message):
ru: Принимающий процесс может передавать ответы отправителю в любое время, используя один из следующих форматов данных (также в полезной нагрузке сообщения CopyData):

source: Standby status update (F)
ru: Standby status update (F) — Обновление состояния резервного сервера

source: Identifies the message as a receiver status update.
ru: Указывает, что это сообщение передаёт обновлённое состояние получателя.

source: The location of the last WAL byte + 1 received and written to disk in the standby.
ru: Положение следующего за последним байтом WAL, полученным и записанным на диск на резервном сервере.

source: The location of the last WAL byte + 1 flushed to disk in the standby.
ru: Положение следующего за последним байтом WAL, сохранённым на диске на резервном сервере.

source: The location of the last WAL byte + 1 applied in the standby.
ru: Положение следующего за последним байтом WAL, применённым на резервном сервере.

source: The client's system clock at the time of transmission, as microseconds since midnight on 2000-01-01.
ru: Показания системных часов клиента в момент передачи, в микросекундах с полуночи 2000-01-01.

source: If 1, the client requests the server to reply to this message immediately. This can be used to ping the server, to test if the connection is still healthy.
ru: Если содержит 1, клиент запрашивает от сервера немедленный ответ на это сообщение. Так клиент может запросить отклик сервера и проверить, продолжает ли функционировать соединение.

source: Hot Standby feedback message (F)
ru: Hot Standby feedback message (F) — Сообщение обратной связи горячего резерва

source: Identifies the message as a Hot Standby feedback message.
ru: Указывает, что это сообщение обратной связи горячего резерва.

source: The standby's current global xmin, excluding the catalog_xmin from any replication slots. If both this value and the following catalog_xmin are 0 this is treated as a notification that Hot Standby feedback will no longer be sent on this connection. Later non-zero messages may reinitiate the feedback mechanism.
ru: Текущее глобальное значение xmin данного резервного сервера, не учитывающее catalog_xmin всех слотов репликации. Если и это значение, и следующее catalog_xmin, равны 0, это воспринимается как уведомление о том, что через данное подключение больше не будут передаваться сообщения обратной связи горячего резерва. Последующие ненулевые сообщения могут возобновить работу механизма обратной связи.

source: The epoch of the global xmin xid on the standby.
ru: Эпоха глобального идентификатора транзакции xmin на резервном сервере.

source: <filename>pg_xlog</filename>, including subdirectories. If the backup is run with WAL files included, a synthesized version of <filename>pg_xlog</filename> will be included, but it will only contain the files necessary for the backup to work, not the rest of the contents.
ru: <filename>pg_xlog</filename>, включая подкаталоги. Если в резервную копию включаются файлы WAL, в архив входит преобразованная версия <filename>pg_xlog</filename>, в которой будут находиться только файлы, необходимые для восстановления копии, но не всё остальное содержимое этого каталога.

source: The lowest catalog_xmin of any replication slots on the standby. Set to 0 if no catalog_xmin exists on the standby or if hot standby feedback is being disabled.
ru: Наименьшее значение catalog_xmin для всех слотов репликации на резервном сервере. Значение 0 показывает, что на резервном сервере нет catalog_xmin, либо обратная связь горячего резерва отключена.

source: The epoch of the catalog_xmin xid on the standby.
ru: Эпоха идентификатора транзакции catalog_xmin на резервном сервере.

source: <literal>START_REPLICATION</literal> <literal>SLOT</literal> <replaceable class="parameter">slot_name</replaceable> <literal>LOGICAL</literal> <replaceable class="parameter">XXX/XXX</replaceable> [ ( <replaceable>option_name</replaceable> [ <replaceable>option_value</replaceable> ] [, ...] ) ]
ru: <literal>START_REPLICATION</literal> <literal>SLOT</literal> <replaceable class="parameter">имя_слота</replaceable> <literal>LOGICAL</literal> <replaceable class="parameter">XXX/XXX</replaceable> [ ( <replaceable>имя_параметра</replaceable> [ <replaceable>значение_параметра</replaceable> ] [, ...] ) ]

source: Instructs server to start streaming WAL for logical replication, starting at WAL location <replaceable class="parameter">XXX/XXX</replaceable>. The server can reply with an error, for example if the requested section of WAL has already been recycled. On success, server responds with a CopyBothResponse message, and then starts to stream WAL to the frontend.
ru: Указывает серверу начать потоковую передачу WAL для логической репликации, начиная с позиции <replaceable class="parameter">XXX/XXX</replaceable> в WAL. Сервер может вернуть в ответ ошибку, например, если запрошенный сегмент WAL уже потерян. Если проблем не возникает, сервер возвращает сообщение CopyBothResponse, а затем начинает передавать поток WAL клиенту.

source: The messages inside the CopyBothResponse messages are of the same format documented for <literal>START_REPLICATION ... PHYSICAL</literal>.
ru: Данные, передаваемые внутри сообщений CopyBothResponse, имеют тот же формат, что описан для команды <literal>START_REPLICATION ... PHYSICAL</literal>.

source: The output plugin associated with the selected slot is used to process the output for streaming.
ru: Обработку выводимых данных для передачи выполняет модуль вывода, связанный с выбранным слотом.

source: The name of the slot to stream changes from. This parameter is required, and must correspond to an existing logical replication slot created with <literal>CREATE_REPLICATION_SLOT</literal> in <literal>LOGICAL</literal> mode.
ru: Имя слота, из которого передаются изменения. Это имя является обязательным, оно должно соответствовать существующему логическому слоту репликации, созданному командой <literal>CREATE_REPLICATION_SLOT</literal> в режиме <literal>LOGICAL</literal>.

source: The WAL location to begin streaming at.
ru: Позиция в WAL, с которой должна начаться передача.

source: option_name
ru: имя_параметра

source: The name of an option passed to the slot's logical decoding plugin.
ru: Имя параметра, передаваемого модулю логического декодирования для выбранного слота.

source: option_value
ru: значение_параметра

source: Optional value, in the form of a string constant, associated with the specified option.
ru: Необязательное значение, в форме строковой константы, связываемое с указанным параметром.

source: Drops a replication slot, freeing any reserved server-side resources. If the slot is a logical slot that was created in a database other than the database the walsender is connected to, this command fails.
ru: Удаляет слот репликации, что приводит к освобождению всех занятых им ресурсов на стороне сервера. Если слот представляет собой логический слот, созданный не в той базе данных, к которой подключён walsender, команда завершается ошибкой.

source: The name of the slot to drop.
ru: Имя слота, подлежащего удалению.

source: This option causes the command to wait if the slot is active until it becomes inactive, instead of the default behavior of raising an error.
ru: С этим указанием команда будет ждать, пока активный слот не станет неактивным (по умолчанию в этом случае выдаётся ошибка).

source: <literal>BASE_BACKUP</literal> [ <literal>LABEL</literal> <replaceable>'label'</replaceable> ] [ <literal>PROGRESS</literal> ] [ <literal>FAST</literal> ] [ <literal>WAL</literal> ] [ <literal>NOWAIT</literal> ] [ <literal>MAX_RATE</literal> <replaceable>rate</replaceable> ] [ <literal>TABLESPACE_MAP</literal> ] <placeholder-1/>
ru: <literal>BASE_BACKUP</literal> [ <literal>LABEL</literal> <replaceable>'метка'</replaceable> ] [ <literal>PROGRESS</literal> ] [ <literal>FAST</literal> ] [ <literal>WAL</literal> ] [ <literal>NOWAIT</literal> ] [ <literal>MAX_RATE</literal> <replaceable>скорость</replaceable> ] [ <literal>TABLESPACE_MAP</literal> ] <placeholder-1/>

source: 'label'
ru: 'метка'

source: Sets the label of the backup. If none is specified, a backup label of <literal>base backup</literal> will be used. The quoting rules for the label are the same as a standard SQL string with <xref linkend="guc-standard-conforming-strings"/> turned on.
ru: Устанавливает метку для резервной копии. Если метка не задана, по умолчанию устанавливается метка <literal>base backup</literal>. Для метки действуют те же правила применения кавычек, что и для стандартных строк SQL при включённым режиме <xref linkend="guc-standard-conforming-strings"/>.

source: Request information required to generate a progress report. This will send back an approximate size in the header of each tablespace, which can be used to calculate how far along the stream is done. This is calculated by enumerating all the file sizes once before the transfer is even started, and might as such have a negative impact on the performance. In particular, it might take longer before the first data is streamed. Since the database files can change during the backup, the size is only approximate and might both grow and shrink between the time of approximation and the sending of the actual files.
ru: Запрашивает информацию, необходимую для отслеживания прогресса операции. Сервер передаёт в ответ приблизительный размер в заголовке каждого табличного пространства, исходя из которого можно понять, насколько продвинулась передача потока. Для вычисления этого размера анализируются размеры всех файлов ещё до начала передачи, и это может негативно повлиять на производительность — в частности, может увеличиться задержка до передачи первых данных. Так как файлы базы данных могут меняться во время резервного копирования, оценка размера не будет точной; размер базы может увеличиться или уменьшиться за время от вычисления этой оценки до передачи актуальных файлов.

source: Request a fast checkpoint.
ru: Запрашивает быструю контрольную точку.

source: Include the necessary WAL segments in the backup. This will include all the files between start and stop backup in the <filename>pg_wal</filename> directory of the base directory tar file.
ru: Включает в резервную копию необходимые сегменты WAL. При этом в подкаталог <filename>pg_wal</filename> архива базового каталога будут включены все файлы с начала до конца копирования.

source: By default, the backup will wait until the last required WAL segment has been archived, or emit a warning if log archiving is not enabled. Specifying <literal>NOWAIT</literal> disables both the waiting and the warning, leaving the client responsible for ensuring the required log is available.
ru: По умолчанию при копировании ожидается завершение архивации последнего требуемого сегмента WAL либо выдаётся предупреждение, если архивация журнала не включена. Указание <literal>NOWAIT</literal> отключает и ожидание, и предупреждение, так что обеспечение наличия требуемого журнала становится задачей клиента.

source: rate
ru: скорость

source: Limit (throttle) the maximum amount of data transferred from server to client per unit of time. The expected unit is kilobytes per second. If this option is specified, the value must either be equal to zero or it must fall within the range from 32 kB through 1 GB (inclusive). If zero is passed or the option is not specified, no restriction is imposed on the transfer.
ru: Ограничивает (сдерживает) максимальный объём данных, передаваемый от сервера клиенту за единицу времени. Единица измерения этого параметра — килобайты в секунду. Если задаётся этот параметр, его значение должно быть равно нулю, либо должно находиться в диапазоне от 32 (килобайт/сек) до 1 Гбайта/сек (включая границы). Если передаётся ноль, либо параметр не задаётся, скорость передачи не ограничивается.

source: Include information about symbolic links present in the directory <filename>pg_tblspc</filename> in a file named <filename>tablespace_map</filename>. The tablespace map file includes each symbolic link name as it exists in the directory <filename>pg_tblspc/</filename> and the full path of that symbolic link.
ru: Включает информацию о символических ссылках, представленных в каталоге <filename>pg_tblspc</filename>, в файл <filename>tablespace_map</filename>. Файл карты табличных пространств содержит имена всех ссылок, содержащихся в каталоге <filename>pg_tblspc/</filename>, и полный путь для каждой ссылки.

source: Instructs the server to start streaming a base backup. The system will automatically be put in backup mode before the backup is started, and taken out of it when the backup is complete. The following options are accepted: <placeholder-1/>
ru: Указывает серверу начать потоковую передачу базовой копии. Система автоматически переходит в режим резервного копирования до начала передачи, и выходит из него после завершения копирования. Эта команда принимает следующие параметры: <placeholder-1/>

source: When the backup is started, the server will first send two ordinary result sets, followed by one or more CopyResponse results.
ru: Когда запускается копирование, сервер сначала передаёт два обычных набора результатов, за которыми следуют один или более результатов CopyResponse.
