Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/protocol.po
Languages: ru

source: Other termination scenarios arise from various failure cases, such as core dump at one end or the other, loss of the communications link, loss of message-boundary synchronization, etc. If either frontend or backend sees an unexpected closure of the connection, it should clean up and terminate. The frontend has the option of launching a new backend by recontacting the server if it doesn't want to terminate itself. Closing the connection is also advisable if an unrecognizable message type is received, since this probably indicates loss of message-boundary sync.
ru: Другие сценарии завершения возникают с различными вариантами отказа, например, при критическом сбое с дампом памяти на одной или другой стороне, при потере канала соединения, потере синхронизации по границам сообщений и т. д. Если клиент или сервер обнаруживает, что соединение было неожиданно закрыто, он должен очистить ресурсы и завершиться. Клиент при этом может запустить новый обслуживающий процесс, переподключившись к серверу, если он сам хочет продолжать работу. Закрывать соединение также рекомендуется при получении сообщений нераспознанного типа, так как это может быть признаком потери синхронизации по границам сообщений.

source: For either normal or abnormal termination, any open transaction is rolled back, not committed. One should note however that if a frontend disconnects while a non-<command>SELECT</command> query is being processed, the backend will probably finish the query before noticing the disconnection. If the query is outside any transaction block (<command>BEGIN</command> ... <command>COMMIT</command> sequence) then its results might be committed before the disconnection is recognized.
ru: При штатном или нештатном завершении сеанса любая открытая транзакция откатывается, а не фиксируется. Однако следует заметить, что при отключении клиента в процессе обработки запроса, отличного от <command>SELECT</command>, обслуживающий процесс вероятнее всего завершит запрос, прежде чем заметит отключение. Если запрос выполняется не в блоке транзакции (вне последовательности <command>BEGIN</command> ... <command>COMMIT</command>), его результаты могут быть зафиксированы до того, как будет обнаружено отключение.

source: <acronym>SSL</acronym> Session Encryption
ru: Защита сеанса с <acronym>SSL</acronym>

source: If <productname>PostgreSQL</productname> was built with <acronym>SSL</acronym> support, frontend/backend communications can be encrypted using <acronym>SSL</acronym>. This provides communication security in environments where attackers might be able to capture the session traffic. For more information on encrypting <productname>PostgreSQL</productname> sessions with <acronym>SSL</acronym>, see <xref linkend="ssl-tcp"/>.
ru: Если <productname>PostgreSQL</productname> был собран с поддержкой <acronym>SSL</acronym>, взаимодействие клиента с сервером может быть зашифровано с применением <acronym>SSL</acronym>. Это обеспечивает защиту на уровне канала в среде, где злоумышленники могут перехватить трафик сеанса. За дополнительными сведениями о шифровании трафика сеансов <productname>PostgreSQL</productname> с использованием <acronym>SSL</acronym>, обратитесь к <xref remap="3" linkend="ssl-tcp"/>.

source: To initiate an <acronym>SSL</acronym>-encrypted connection, the frontend initially sends an SSLRequest message rather than a StartupMessage. The server then responds with a single byte containing <literal>S</literal> or <literal>N</literal>, indicating that it is willing or unwilling to perform <acronym>SSL</acronym>, respectively. The frontend might close the connection at this point if it is dissatisfied with the response. To continue after <literal>S</literal>, perform an <acronym>SSL</acronym> startup handshake (not described here, part of the <acronym>SSL</acronym> specification) with the server. If this is successful, continue with sending the usual StartupMessage. In this case the StartupMessage and all subsequent data will be <acronym>SSL</acronym>-encrypted. To continue after <literal>N</literal>, send the usual StartupMessage and proceed without encryption.
ru: Чтобы начать сеанс с <acronym>SSL</acronym>-шифрованием, клиент передаёт серверу вместо StartupMessage сообщение SSLRequest. В ответ сервер передаёт один байт, содержащий символ <literal>S</literal> или <literal>N</literal>, показывающий, что он желает, либо не желает включать <acronym>SSL</acronym>, соответственно. Если клиент не удовлетворён ответом, он должен закрыть соединение на этом этапе. Чтобы продолжить установление соединения после получения <literal>S</literal>, он выполняет начальное согласование <acronym>SSL</acronym> с сервером (не описывается здесь, так как относится к протоколу <acronym>SSL</acronym>). Если эта процедура выполняется успешно, он продолжает соединение, передавая обычное сообщение StartupMessage. При этом StartupMessage и все последующие данные будут защищены <acronym>SSL</acronym>-шифрованием. Чтобы продолжить после получения <literal>N</literal>, клиент может передать обычное сообщение StartupMessage и дальше взаимодействовать с сервером без шифрования.

source: The frontend should also be prepared to handle an ErrorMessage response to SSLRequest from the server. This would only occur if the server predates the addition of <acronym>SSL</acronym> support to <productname>PostgreSQL</productname>. (Such servers are now very ancient, and likely do not exist in the wild anymore.) In this case the connection must be closed, but the frontend might choose to open a fresh connection and proceed without requesting <acronym>SSL</acronym>.
ru: Клиент также должен быть готов обработать сообщение ErrorMessage, полученное от сервера в ответ на SSLRequest. Такая ситуация возможна, только если сервер имеет версию, которая ещё не поддерживала <acronym>SSL</acronym> в <productname>PostgreSQL</productname>. (Такие серверы сейчас антикварная редкость, и скорее всего их уже не встретить в природе.) В этом случае соединение должно быть закрыто, но клиент может решить открыть новое соединение, не запрашивая <acronym>SSL</acronym>-шифрование.

source: For the purpose of testing replication commands, you can make a replication connection via <application>psql</application> or any other <literal>libpq</literal>-using tool with a connection string including the <literal>replication</literal> option, e.g.: <placeholder-1/> However, it is often more useful to use <xref linkend="app-pgreceivexlog"/> (for physical replication) or <xref linkend="app-pgrecvlogical"/> (for logical replication).
ru: Для тестирования команд репликации вы можете установить соединение для репликации, запустив <application>psql</application> или другую программу на базе <literal>libpq</literal> со строкой подключения, включающей параметр <literal>replication</literal>, например так: <placeholder-1/> Однако часто полезнее использовать <xref linkend="app-pgreceivexlog"/> (для физической репликации) или <xref linkend="app-pgrecvlogical"/> (для логической).

source: An initial SSLRequest can also be used in a connection that is being opened to send a CancelRequest message.
ru: Начальный запрос SSLRequest может также передаваться при установлении соединения, открываемого для передачи сообщения CancelRequest.

source: While the protocol itself does not provide a way for the server to force <acronym>SSL</acronym> encryption, the administrator can configure the server to reject unencrypted sessions as a byproduct of authentication checking.
ru: Так как в самом протоколе не предусмотрено принудительное включение <acronym>SSL</acronym>-шифрования сервером, администратор может настроить сервер так, чтобы в качестве дополнительного условия при проверке подлинности клиента он не принимал незашифрованные сеансы.

source: SASL Authentication
ru: Аутентификация SASL

source: <firstterm>SASL</firstterm> is a framework for authentication in connection-oriented protocols. At the moment, <productname>PostgreSQL</productname> implements only one SASL authentication mechanism, SCRAM-SHA-256, but more might be added in the future. The below steps illustrate how SASL authentication is performed in general, while the next subsection gives more details on SCRAM-SHA-256.
ru: <firstterm>SASL</firstterm> — это инфраструктура аутентификации для протоколов, ориентированных на соединения. На данный момент <productname>PostgreSQL</productname> реализует только один механизм SASL, SCRAM-SHA-256, но в будущем могут появиться и другие. Далее описывается, как в принципе осуществляется аутентификация SASL, а в следующем подразделе более подробно рассматривается SCRAM-SHA-256.

source: SASL Authentication Message Flow
ru: Поток сообщений аутентификации SASL

source: To begin a SASL authentication exchange, the server sends an AuthenticationSASL message. It includes a list of SASL authentication mechanisms that the server can accept, in the server's preferred order.
ru: Чтобы начать обмен по схеме аутентификации SASL, сервер передаёт сообщение AuthenticationSASL. Оно содержит список механизмов аутентификации SASL, с которыми может работать сервер, в порядке предпочтений сервера.

source: The client selects one of the supported mechanisms from the list, and sends a SASLInitialResponse message to the server. The message includes the name of the selected mechanism, and an optional Initial Client Response, if the selected mechanism uses that.
ru: Клиент выбирает один из поддерживаемых механизмов из списка и передаёт серверу сообщение SASLInitialResponse. Это сообщение содержит имя выбранного механизма и может содержать «Начальный ответ клиента», если это использует выбранный механизм.

source: One or more server-challenge and client-response message will follow. Each server-challenge is sent in an AuthenticationSASLContinue message, followed by a response from client in an SASLResponse message. The particulars of the messages are mechanism specific.
ru: За этим следует одно или нескольких сообщений вызова со стороны сервера и ответов со стороны клиента. Все вызовы сервер передаёт в сообщениях AuthenticationSASLContinue, а клиент отвечает на них сообщениями SASLResponse. Частные детали сообщений зависят от конкретного механизма.

source: Finally, when the authentication exchange is completed successfully, the server sends an AuthenticationSASLFinal message, followed immediately by an AuthenticationOk message. The AuthenticationSASLFinal contains additional server-to-client data, whose content is particular to the selected authentication mechanism. If the authentication mechanism doesn't use additional data that's sent at completion, the AuthenticationSASLFinal message is not sent.
ru: Наконец, когда обмен аутентификационной информацией заканчивается успешно, сервер передаёт сообщение AuthenticationSASLFinal и сразу за ним сообщение AuthenticationOk. В сообщении AuthenticationSASLFinal передаются дополнительные данные от сервера клиенту, содержимое которых определяется выбранным механизмом аутентификации. Если механизм аутентификации не требует передавать дополнительные данные в завершение обмена, сообщение AuthenticationSASLFinal опускается.

source: On error, the server can abort the authentication at any stage, and send an ErrorMessage.
ru: В случае ошибки сервер может прервать процесс аутентификации на любом этапе и передать сообщение ErrorMessage.

source: SCRAM-SHA-256 authentication
ru: Аутентификация SCRAM-SHA-256

source: <firstterm>SCRAM-SHA-256</firstterm> (called just <firstterm>SCRAM</firstterm> from now on) is the only implemented SASL mechanism, at the moment. It is described in detail in RFC 7677 and RFC 5802.
ru: Аутентификация <firstterm>SCRAM-SHA-256</firstterm> (далее называемая просто <firstterm>SCRAM</firstterm>) — единственный реализованный на данный момент механизм SASL. Она подробно описывается в RFC 7677 и RFC 5802.

source: When SCRAM-SHA-256 is used in PostgreSQL, the server will ignore the user name that the client sends in the <structname>client-first-message</structname>. The user name that was already sent in the startup message is used instead. <productname>PostgreSQL</productname> supports multiple character encodings, while SCRAM dictates UTF-8 to be used for the user name, so it might be impossible to represent the PostgreSQL user name in UTF-8.
ru: Когда в PostgreSQL задействуется SCRAM-SHA-256, сервер игнорирует имя пользователя, которое клиент передаёт в <structname>client-first-message</structname>. Вместо этого используется имя, переданное ранее в стартовом сообщении. Согласно спецификации SCRAM, имя пользователя должно быть в UTF-8, но <productname>PostgreSQL</productname> поддерживает разные кодировки символов, и значит, имя пользователя PostgreSQL не всегда будет представимо в UTF-8.

source: The SCRAM specification dictates that the password is also in UTF-8, and is processed with the <firstterm>SASLprep</firstterm> algorithm. <productname>PostgreSQL</productname>, however, does not require UTF-8 to be used for the password. When a user's password is set, it is processed with SASLprep as if it was in UTF-8, regardless of the actual encoding used. However, if it is not a legal UTF-8 byte sequence, or it contains UTF-8 byte sequences that are prohibited by the SASLprep algorithm, the raw password will be used without SASLprep processing, instead of throwing an error. This allows the password to be normalized when it is in UTF-8, but still allows a non-UTF-8 password to be used, and doesn't require the system to know which encoding the password is in.
ru: В спецификации SCRAM говорится, что пароль также должен передаваться в UTF-8 и обрабатываться алгоритмом <firstterm>SASLprep</firstterm>. Однако <productname>PostgreSQL</productname> не требует, чтобы пароль представлялся в UTF-8. Когда устанавливается пароль пользователя, он обрабатывается алгоритмом SASLprep как пароль в UTF-8, вне зависимости от фактической кодировки. Однако, если он представлен недопустимой для UTF-8 последовательностью байтов либо содержит комбинации байтов UTF-8, которые не принимает алгоритм SASLprep, это не будет считаться ошибкой — при аутентификации будет использоваться исходный пароль, без обработки SASLprep. Это позволяет нормализовать пароли, представленные в UTF-8, и при этом использовать пароли не в UTF-8, а также не требует, чтобы система знала, в какой кодировке задан пароль.

source: <firstterm>Channel binding</firstterm> has not been implemented yet.
ru: <firstterm>Связывание с каналом</firstterm> ещё не реализовано.

source: Example
ru: Пример

source: The server sends an AuthenticationSASL message. It includes a list of SASL authentication mechanisms that the server can accept.
ru: Сервер передаёт сообщение AuthenticationSASL. Оно содержит список механизмов аутентификации SASL, с которыми может работать сервер.

source: The client responds by sending a SASLInitialResponse message, which indicates the chosen mechanism, <literal>SCRAM-SHA-256</literal>. In the Initial Client response field, the message contains the SCRAM <structname>client-first-message</structname>.
ru: Клиент в ответ передаёт сообщение SASLInitialResponse, информирующее о выбранном механизме, <literal>SCRAM-SHA-256</literal>. В поле «Начального ответа клиента» это сообщение содержит данные SCRAM <structname>client-first-message</structname>.

source: Server sends an AuthenticationSASLContinue message, with a SCRAM <structname>server-first message</structname> as the content.
ru: Сервер передаёт сообщение AuthenticationSASLContinue, содержащее данные SCRAM <structname>server-first message</structname>.

source: Client sends a SASLResponse message, with SCRAM <structname>client-final-message</structname> as the content.
ru: Клиент передаёт сообщение SASLResponse, содержащее данные SCRAM <structname>client-final-message</structname>.

source: Server sends an AuthenticationSASLFinal message, with the SCRAM <structname>server-final-message</structname>, followed immediately by an AuthenticationOk message.
ru: Сервер передаёт сообщение AuthenticationSASLFinal, содержащее данные SCRAM <structname>server-final-message</structname>, и сразу за ним сообщение AuthenticationOk.

source: Streaming Replication Protocol
ru: Протокол потоковой репликации

source: To initiate streaming replication, the frontend sends the <literal>replication</literal> parameter in the startup message. A Boolean value of <literal>true</literal> tells the backend to go into walsender mode, wherein a small set of replication commands can be issued instead of SQL statements. Only the simple query protocol can be used in walsender mode. Replication commands are logged in the server log when <xref linkend="guc-log-replication-commands"/> is enabled. Passing <literal>database</literal> as the value instructs walsender to connect to the database specified in the <literal>dbname</literal> parameter, which will allow the connection to be used for logical replication from that database.
ru: Чтобы инициировать потоковую репликацию, клиент передаёт в стартовом сообщении параметр <literal>replication</literal>. Логическое значение <literal>true</literal> этого параметра указывает обслуживающему процессу перейти в режим передачи WAL (walsender), в котором вместо SQL-операторов клиент может выдавать только ограниченный набор команд репликации. В режиме walsender можно использовать только протокол простых запросов. Команды репликации будут записываться в журнал сообщений сервера, если включён режим <xref linkend="guc-log-replication-commands"/>. Если этот параметр имеет значение <literal>database</literal>, процесс walsender должен подключиться к базе данных, указанной в параметре <literal>dbname</literal>, что позволит использовать это подключение для логической репликации с указанной базой данных.

source: For the purpose of testing replication commands, you can make a replication connection via <application>psql</application> or any other <literal>libpq</literal>-using tool with a connection string including the <literal>replication</literal> option, e.g.: <placeholder-1/> However, it is often more useful to use <xref linkend="app-pgreceivewal"/> (for physical replication) or <xref linkend="app-pgrecvlogical"/> (for logical replication).
ru: Для тестирования команд репликации вы можете установить соединение для репликации, запустив <application>psql</application> или другую программу на базе <literal>libpq</literal> со строкой подключения, включающей параметр <literal>replication</literal>, например так: <placeholder-1/> Однако часто полезнее использовать <xref linkend="app-pgreceivewal"/> (для физической репликации) или <xref linkend="app-pgrecvlogical"/> (для логической).

source: Requests the server to identify itself. Server replies with a result set of a single row, containing four fields:
ru: Запрашивает идентификационные данные сервера. Сервер возвращает набор результатов с одной строкой, содержащей четыре поля:

source: The unique system identifier identifying the cluster. This can be used to check that the base backup used to initialize the standby came from the same cluster.
ru: Уникальный идентификатор системы, идентифицирующий кластер. По нему можно определить, что базовая резервная копия, из которой инициализировался резервный сервер, получена из того же кластера.

source: Current timeline ID. Also useful to check that the standby is consistent with the master.
ru: Идентификатор текущей линии времени. Также полезен для того, чтобы убедиться, что резервный сервер согласован с главным.

source: Current WAL flush location. Useful to get a known location in the write-ahead log where streaming can start.
ru: Текущее положение сохранённых данных в WAL. Позволяет узнать, с какой позиции в журнале предзаписи может начаться потоковая передача.

source: Database connected to or null.
ru: Подключённая база данных или NULL.

source: name
ru: имя

source: Requests the server to send the current setting of a run-time parameter. This is similar to the SQL command <xref linkend="sql-show"/>.
ru: Запрашивает у сервера текущее значение параметра времени выполнения. Эта команда подобна SQL-команде <xref linkend="sql-show"/>.

source: The name of a run-time parameter. Available parameters are documented in <xref linkend="runtime-config"/>.
ru: Имя параметра времени выполнения. Доступные параметры описаны в <xref remap="6" linkend="runtime-config"/>.

source: Requests the server to send over the timeline history file for timeline <replaceable class="parameter">tli</replaceable>. Server replies with a result set of a single row, containing two fields:
ru: Запрашивает с сервера файл истории для линии времени <replaceable class="parameter">лин_врем</replaceable>. Сервер возвращает набор результатов с одной строкой, содержащей два поля:

source: File name of the timeline history file, e.g., <filename>00000002.history</filename>.
ru: Имя файла с историей линии времени, например <filename>00000002.history</filename>.

source: Contents of the timeline history file.
ru: Содержимое файла с историей линией времени.

source: <literal>CREATE_REPLICATION_SLOT</literal> <replaceable class="parameter">slot_name</replaceable> [ <literal>TEMPORARY</literal> ] { <literal>PHYSICAL</literal> [ <literal>RESERVE_WAL</literal> ] | <literal>LOGICAL</literal> <replaceable class="parameter">output_plugin</replaceable> [ <literal>EXPORT_SNAPSHOT</literal> | <literal>NOEXPORT_SNAPSHOT</literal> | <literal>USE_SNAPSHOT</literal> ] } <placeholder-1/>
ru: <literal>CREATE_REPLICATION_SLOT</literal> <replaceable class="parameter">имя_слота</replaceable> [ <literal>TEMPORARY</literal> ] { <literal>PHYSICAL</literal> [ <literal>RESERVE_WAL</literal> ] | <literal>LOGICAL</literal> <replaceable class="parameter">модуль_вывода</replaceable> [ <literal>EXPORT_SNAPSHOT</literal> | <literal>NOEXPORT_SNAPSHOT</literal> | <literal>USE_SNAPSHOT</literal> ] } <placeholder-1/>

source: Create a physical or logical replication slot. See <xref linkend="streaming-replication-slots"/> for more about replication slots.
ru: Создаёт слот физической или логической репликации. Слоты репликации описаны подробно в <xref remap="6" linkend="streaming-replication-slots"/>.

source: slot_name
ru: имя_слота

source: The name of the slot to create. Must be a valid replication slot name (see <xref linkend="streaming-replication-slots-manipulation"/>).
ru: Имя создаваемого слота. Заданное имя должно быть допустимым для слота репликации (см. <xref remap="4" linkend="streaming-replication-slots-manipulation"/>).

source: output_plugin
ru: модуль_вывода

source: The name of the output plugin used for logical decoding (see <xref linkend="logicaldecoding-output-plugin"/>).
ru: Имя модуля вывода, применяемого для логического декодирования (см. <xref remap="4" linkend="logicaldecoding-output-plugin"/>).

source: Specify that this replication slot is a temporary one. Temporary slots are not saved to disk and are automatically dropped on error or when the session has finished.
ru: Это указание отмечает, что данный слот репликации является временным. Временные слоты не сохраняются на диске и автоматически удаляются при ошибке или завершении сеанса.

source: Specify that this physical replication slot reserves <acronym>WAL</acronym> immediately. Otherwise, <acronym>WAL</acronym> is only reserved upon connection from a streaming replication client.
ru: Указывает, что этот слот физической репликации резервирует <acronym>WAL</acronym> немедленно. Без этого указания <acronym>WAL</acronym> резервируется только при подключении клиента потоковой репликации.
