Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/protocol.po
Languages: ru

source: '<literal>S</literal>' to close a prepared statement; or '<literal>P</literal>' to close a portal.
ru: '<literal>S</literal>' для закрытия подготовленного оператора, '<literal>P</literal>' для закрытия портала.

source: The name of the prepared statement or portal to close (an empty string selects the unnamed prepared statement or portal).
ru: Имя подготовленного оператора или портала, который должен быть закрыт (пустая строка выбирает безымянный подготовленный оператор или портал).

source: Identifies the message as a Close-complete indicator.
ru: Указывает, что это сообщение, сигнализирующее о завершении Close.

source: Identifies the message as a command-completed response.
ru: Указывает, что это сообщение об успешном завершении команды.

source: The command tag. This is usually a single word that identifies which SQL command was completed.
ru: Тег команды. Обычно это одно слово, обозначающее завершённую команду SQL.

source: For an <command>INSERT</command> command, the tag is <literal>INSERT <replaceable>oid</replaceable> <replaceable>rows</replaceable></literal>, where <replaceable>rows</replaceable> is the number of rows inserted. <replaceable>oid</replaceable> is the object ID of the inserted row if <replaceable>rows</replaceable> is 1 and the target table has OIDs; otherwise <replaceable>oid</replaceable> is 0.
ru: Для команды <command>INSERT</command> в качестве тега передаётся <literal>INSERT <replaceable>oid</replaceable> <replaceable>строк</replaceable></literal>, где <replaceable>строк</replaceable> — количество вставленных строк. В поле <replaceable>oid</replaceable> передаётся идентификатор объекта вставленной строки, если число <replaceable>строк</replaceable> равно 1 и в целевой таблице содержатся OID; в противном случае вместо <replaceable>oid</replaceable> передаётся 0.

source: For a <command>DELETE</command> command, the tag is <literal>DELETE <replaceable>rows</replaceable></literal> where <replaceable>rows</replaceable> is the number of rows deleted.
ru: Для команды <command>DELETE</command> в качестве тега передаётся <literal>DELETE <replaceable>строк</replaceable></literal>, где <replaceable>строк</replaceable> — количество удалённых строк.

source: For an <command>UPDATE</command> command, the tag is <literal>UPDATE <replaceable>rows</replaceable></literal> where <replaceable>rows</replaceable> is the number of rows updated.
ru: Для команды <command>UPDATE</command> в качестве тега передаётся <literal>UPDATE <replaceable>строк</replaceable></literal>, где <replaceable>строк</replaceable> — количество изменённых строк.

source: For a <command>SELECT</command> or <command>CREATE TABLE AS</command> command, the tag is <literal>SELECT <replaceable>rows</replaceable></literal> where <replaceable>rows</replaceable> is the number of rows retrieved.
ru: Для команды <command>SELECT</command> или <command>CREATE TABLE AS</command> в качестве тега передаётся <literal>SELECT <replaceable>строк</replaceable></literal>, где <replaceable>строк</replaceable> — число полученных строк.

source: For a <command>MOVE</command> command, the tag is <literal>MOVE <replaceable>rows</replaceable></literal> where <replaceable>rows</replaceable> is the number of rows the cursor's position has been changed by.
ru: Для команды <command>MOVE</command> в качестве тега передаётся <literal>MOVE <replaceable>строк</replaceable></literal>, где <replaceable>строк</replaceable> — количество строк, на которое изменилась позиция курсора.

source: For a <command>FETCH</command> command, the tag is <literal>FETCH <replaceable>rows</replaceable></literal> where <replaceable>rows</replaceable> is the number of rows that have been retrieved from the cursor.
ru: Для команды <command>FETCH</command> в качестве тега передаётся <literal>FETCH <replaceable>строк</replaceable></literal>, где <replaceable>строк</replaceable> — количество строк, полученное через курсор.

source: For a <command>COPY</command> command, the tag is <literal>COPY <replaceable>rows</replaceable></literal> where <replaceable>rows</replaceable> is the number of rows copied. (Note: the row count appears only in <productname>PostgreSQL</productname> 8.2 and later.)
ru: Для команды <command>COPY</command> в качестве тега передаётся <literal>COPY <replaceable>строк</replaceable></literal>, где <replaceable>строк</replaceable> — количество скопированных строк. (Заметьте: число строк выводится, начиная только с <productname>PostgreSQL</productname> 8.2.)

source: Identifies the message as <command>COPY</command> data.
ru: Указывает, что в этом сообщении передаются данные <command>COPY</command>.

source: Data that forms part of a <command>COPY</command> data stream. Messages sent from the backend will always correspond to single data rows, but messages sent by frontends might divide the data stream arbitrarily.
ru: Данные, образующие часть информационного потока <command>COPY</command>. Сообщения от сервера всегда соответствуют отдельным строкам данных, но сообщения, передаваемые клиентами, могут разделять поток произвольным образом.

source: Identifies the message as a <command>COPY</command>-complete indicator.
ru: Указывает, что это сообщение, сигнализирующее о завершении <command>COPY</command>.

source: Identifies the message as a <command>COPY</command>-failure indicator.
ru: Указывает, что это сообщение, сигнализирующее об ошибке операции <command>COPY</command>.

source: An error message to report as the cause of failure.
ru: Сообщение об ошибке, описывающее причину сбоя операции.

source: Identifies the message as a Start Copy In response. The frontend must now send copy-in data (if not prepared to do so, send a CopyFail message).
ru: Указывает, что это сообщение является ответом на запуск входящего копирования. Получив его, клиент начинает передавать данные на вход операции копирования (если клиент не готов к этому, он передаёт сообщение CopyFail).

source: 0 indicates the overall <command>COPY</command> format is textual (rows separated by newlines, columns separated by separator characters, etc). 1 indicates the overall copy format is binary (similar to DataRow format). See <xref linkend="sql-copy"/> for more information.
ru: Значение 0 указывает, что для всей операции <command>COPY</command> применяется текстовый формат (строки разделяются символами новой строки, столбцы разделяются символами-разделителями и т. д.). Значение 1 указывает, что для всей операции копирования применяется двоичный формат (подобный формату DataRow). За дополнительными сведениями обратитесь к <xref remap="3" linkend="sql-copy"/>.

source: The number of columns in the data to be copied (denoted <replaceable>N</replaceable> below).
ru: Количество столбцов в копируемых данных (ниже обозначается символом <replaceable>N</replaceable>).

source: The format codes to be used for each column. Each must presently be zero (text) or one (binary). All must be zero if the overall copy format is textual.
ru: Коды формата для каждого столбца. В настоящее время допускаются коды ноль (текстовый формат) и один (двоичный). Если общий формат копирования — текстовый, все эти коды должны быть нулевыми.

source: Identifies the message as a Start Copy Out response. This message will be followed by copy-out data.
ru: Указывает, что это сообщение является ответом на запуск исходящего копирования. За этим сообщением следуют данные, исходящие со стороны сервера.

source: Identifies the message as a Start Copy Both response. This message is used only for Streaming Replication.
ru: Указывает, что это сообщение является ответом на запуск двустороннего копирования. Это сообщение используется только для потоковой репликации.

source: Identifies the message as a data row.
ru: Указывает, что в этом сообщении передаётся строка данных.

source: The number of column values that follow (possibly zero).
ru: Количество последующих значений столбцов (может быть нулевым).

source: The length of the column value, in bytes (this count does not include itself). Can be zero. As a special case, -1 indicates a NULL column value. No value bytes follow in the NULL case.
ru: Длина значения столбца, в байтах (само поле длины не считается). Может быть нулевой. В качестве особого значения, -1 представляет значение NULL. В случае с NULL никакие байты значений далее не следуют.

source: The value of the column, in the format indicated by the associated format code. <replaceable>n</replaceable> is the above length.
ru: Значение столбца в формате, определённом соответствующим кодом формата. Переменная <replaceable>n</replaceable> задаёт длину значения.

source: <placeholder-1/> Next, the following pair of fields appear for each column: <placeholder-2/>
ru: <placeholder-1/> Затем для каждого столбца идёт следующая пара полей: <placeholder-2/>

source: Identifies the message as a Describe command.
ru: Указывает, что это сообщение представляет команду Describe.

source: '<literal>S</literal>' to describe a prepared statement; or '<literal>P</literal>' to describe a portal.
ru: '<literal>S</literal>' для получения описания подготовленного оператора, '<literal>P</literal>' — портала.

source: The name of the prepared statement or portal to describe (an empty string selects the unnamed prepared statement or portal).
ru: Имя подготовленного оператора или портала, описание которого запрашивается (пустая строка выбирает безымянный подготовленный оператор или портал).

source: Identifies the message as a response to an empty query string. (This substitutes for CommandComplete.)
ru: Указывает, что это сообщение является ответом на пустую строку запроса. (Это сообщение заменяет CommandComplete.)

source: Identifies the message as an error.
ru: Указывает, что это сообщение ошибки.

source: A code identifying the field type; if zero, this is the message terminator and no string follows. The presently defined field types are listed in <xref linkend="protocol-error-fields"/>. Since more field types might be added in future, frontends should silently ignore fields of unrecognized type.
ru: Код, задающий тип поля; ноль обозначает конец сообщения, после которого ничего нет. Типы полей, определённые в настоящее время, перечислены в <xref remap="6" linkend="protocol-error-fields"/>. Так как в будущем могут появиться другие типы полей, клиенты должны просто игнорировать поля нераспознанного типа.

source: The field value.
ru: Значение поля.

source: <placeholder-1/> The message body consists of one or more identified fields, followed by a zero byte as a terminator. Fields can appear in any order. For each field there is the following: <placeholder-2/>
ru: <placeholder-1/> Тело сообщения состоит из одного или нескольких определённых полей, за которыми в качестве завершающего следует нулевой байт. Поля могут идти в любом порядке. Для каждого поля передаётся: <placeholder-2/>

source: Identifies the message as an Execute command.
ru: Указывает, что это сообщение представляет команду Execute.

source: The name of the portal to execute (an empty string selects the unnamed portal).
ru: Имя портала, подлежащего выполнению (пустая строка выбирает безымянный портал).

source: Maximum number of rows to return, if portal contains a query that returns rows (ignored otherwise). Zero denotes <quote>no limit</quote>.
ru: Максимальное число строк, которое должно быть возвращено, если портал содержит запрос, возвращающий строки (в противном случае игнорируется). Ноль означает <quote>без ограничения</quote>.

source: Identifies the message as a Flush command.
ru: Указывает, что это сообщение представляет команду Flush.

source: Identifies the message as a function call.
ru: Указывает, что это сообщение представляет вызов функции.

source: Specifies the object ID of the function to call.
ru: Задаёт идентификатор объекта вызываемой функции.

source: The number of argument format codes that follow (denoted <replaceable>C</replaceable> below). This can be zero to indicate that there are no arguments or that the arguments all use the default format (text); or one, in which case the specified format code is applied to all arguments; or it can equal the actual number of arguments.
ru: Количество кодов форматов следующих аргументов (обозначается ниже символом <replaceable>C</replaceable>). Может быть нулевым, что показывает, что аргументы отсутствуют или все аргументы передаются в формате по умолчанию (текстовом); либо равняться одному, в этом случае указанный один код формата применяется ко всем аргументами, либо может равняться действительному количеству аргументов.

source: The argument format codes. Each must presently be zero (text) or one (binary).
ru: Коды форматов аргументов. В настоящее время допускаются коды ноль (текстовый формат) и один (двоичный).

source: Specifies the number of arguments being supplied to the function.
ru: Задаёт число аргументов, передаваемых функции.

source: The length of the argument value, in bytes (this count does not include itself). Can be zero. As a special case, -1 indicates a NULL argument value. No value bytes follow in the NULL case.
ru: Длина значения аргумента, в байтах (само поле длины не считается). Может быть нулевой. В качестве особого значения, -1 представляет значение NULL. В случае с NULL никакие байты значений далее не следуют.

source: The value of the argument, in the format indicated by the associated format code. <replaceable>n</replaceable> is the above length.
ru: Значение аргумента, в формате, определённом соответствующим кодом формата. Переменная <replaceable>n</replaceable> задаёт длину значения.

source: The format code for the function result. Must presently be zero (text) or one (binary).
ru: Код формата результата функции. В настоящее время допускается код ноль (текстовый формат) и один (двоичный).

source: <placeholder-1/> Next, the following pair of fields appear for each argument: <placeholder-2/> After the last argument, the following field appears: <placeholder-3/>
ru: <placeholder-1/> Затем для каждого аргумента идёт следующая пара полей: <placeholder-2/> За последним аргументом идут следующие поля: <placeholder-3/>

source: Identifies the message as a function call result.
ru: Указывает, что в этом сообщении передаётся результат вызова функции.

source: The length of the function result value, in bytes (this count does not include itself). Can be zero. As a special case, -1 indicates a NULL function result. No value bytes follow in the NULL case.
ru: Длина значения результата функции, в байтах (само поле длины не считается). Может быть нулевой. В качестве особого значения, -1 представляет значение NULL. В случае с NULL никакие байты значения далее не следуют.

source: The value of the function result, in the format indicated by the associated format code. <replaceable>n</replaceable> is the above length.
ru: Значение результата функции в формате, определённом соответствующим кодом формата. Переменная <replaceable>n</replaceable> задаёт длину значения.

source: Identifies the message as a GSSAPI or SSPI response. Note that this is also used for SASL and password response messages. The exact message type can be deduced from the context.
ru: Обозначает это сообщение как ответ GSSAPI или SSPI. Заметьте, что оно также применяется для ответов SASL и при аутентификации по паролю. Точный тип сообщения можно определить из контекста.

source: GSSAPI/SSPI specific message data.
ru: Данные сообщения, специфичные для GSSAPI/SSPI.

source: Identifies the message as a no-data indicator.
ru: Указывает, что это сообщение сигнализирует об отсутствии данных.

source: Identifies the message as a notice.
ru: Указывает, что это сообщение представляет замечание.

source: Identifies the message as a notification response.
ru: Указывает, что это сообщение представляет уведомление.

source: The process ID of the notifying backend process.
ru: PID обслуживающего процесса, отправляющего уведомление.

source: The name of the channel that the notify has been raised on.
ru: Имя канала, для которого было выдано уведомление.

source: The <quote>payload</quote> string passed from the notifying process.
ru: Строка <quote>сообщения</quote>, сопровождающего уведомление.

source: Identifies the message as a parameter description.
ru: Указывает, что это сообщение представляет описание параметра.

source: The number of parameters used by the statement (can be zero).
ru: Количество параметров для оператора (может быть нулевым).

source: Specifies the object ID of the parameter data type.
ru: Задаёт идентификатор объекта типа данных параметра.

source: <placeholder-1/> Then, for each parameter, there is the following: <placeholder-2/>
ru: <placeholder-1/> Затем для каждого параметра передаётся: <placeholder-2/>

source: Identifies the message as a run-time parameter status report.
ru: Указывает, что в этом сообщении передаётся состояние параметра времени выполнения.

source: The name of the run-time parameter being reported.
ru: Имя параметра времени выполнения, состояние которого передаётся.

source: The current value of the parameter.
ru: Текущее значение параметра.

source: Identifies the message as a Parse command.
ru: Указывает, что это сообщение представляет команду Parse.

source: The name of the destination prepared statement (an empty string selects the unnamed prepared statement).
ru: Имя целевого подготовленного оператора (пустая строка выбирает безымянный подготовленный оператор).

source: The query string to be parsed.
ru: Строка запроса, которая должна быть разобрана.

source: The number of parameter data types specified (can be zero). Note that this is not an indication of the number of parameters that might appear in the query string, only the number that the frontend wants to prespecify types for.
ru: Количество типов параметров (может быть нулевым). Заметьте, что это значение представляет не число параметров, которые могут фигурировать в строке запроса, а число параметров, для которых клиент хочет предопределить типы.

source: Specifies the object ID of the parameter data type. Placing a zero here is equivalent to leaving the type unspecified.
ru: Задаёт идентификатор объекта типа данных параметра. Указание нулевого значения равносильно отсутствию указания типа.

source: Identifies the message as a Parse-complete indicator.
ru: Указывает, что это сообщение, сигнализирующее о завершении Parse.

source: Identifies the message as a password response. Note that this is also used for GSSAPI, SSPI and SASL response messages. The exact message type can be deduced from the context.
ru: Обозначает это сообщение как ответ SASL. Заметьте, что оно также применяется для ответов GSSAPI, SSPI и SASL. Точный тип сообщения можно определить из контекста.

source: The password (encrypted, if requested).
ru: Пароль (зашифрованный, если требуется).

source: Identifies the message as a portal-suspended indicator. Note this only appears if an Execute message's row-count limit was reached.
ru: Указывает, что это сообщение сигнализирует о приостановке портала. Заметьте, что оно выдаётся только при достижении ограничения числа строк, заданного в сообщении Execute.

source: Identifies the message as a simple query.
ru: Указывает, что это сообщение представляет простой запрос.

source: The query string itself.
ru: Собственно строка запроса.

source: Identifies the message type. ReadyForQuery is sent whenever the backend is ready for a new query cycle.
ru: Определяет тип сообщения. Сообщение ReadyForQuery передаётся, когда сервер готов к новому циклу запросов.

source: Current backend transaction status indicator. Possible values are '<literal>I</literal>' if idle (not in a transaction block); '<literal>T</literal>' if in a transaction block; or '<literal>E</literal>' if in a failed transaction block (queries will be rejected until block is ended).
ru: Индикатор текущего состояния транзакции на сервере. Возможные значения: '<literal>I</literal>', транзакция неактивна (вне блока транзакции), '<literal>T</literal>' в блоке транзакции, либо '<literal>E</literal>' в блоке прерванной транзакции (запросы не будут обрабатываться до завершения блока).

source: Identifies the message as a row description.
ru: Указывает, что это сообщение представляет описание строки.

source: Specifies the number of fields in a row (can be zero).
ru: Задаёт количество полей в строке (может быть нулевым).

source: The field name.
ru: Имя поля.

source: If the field can be identified as a column of a specific table, the object ID of the table; otherwise zero.
ru: Если поле связано со столбцом определённой таблицы, идентификатор объекта этой таблицы; в противном случае — ноль.

source: If the field can be identified as a column of a specific table, the attribute number of the column; otherwise zero.
ru: Если поле связано со столбцом определённой таблицы, номер атрибута для этого столбца; в противном случае — ноль.

source: The object ID of the field's data type.
ru: Идентификатор объекта типа данных поля.

source: The data type size (see <varname>pg_type.typlen</varname>). Note that negative values denote variable-width types.
ru: Размер типа данных (см. <varname>pg_type.typlen</varname>). Заметьте, что отрицательные значения показывают, что тип имеет переменную длину.

source: The type modifier (see <varname>pg_attribute.atttypmod</varname>). The meaning of the modifier is type-specific.
ru: Модификатор типа (см. <varname>pg_attribute.atttypmod</varname>). Смысл этого модификатора зависит от типа.

source: The format code being used for the field. Currently will be zero (text) or one (binary). In a RowDescription returned from the statement variant of Describe, the format code is not yet known and will always be zero.
ru: Код формата, используемого для поля. В настоящее время допускаются коды ноль (текстовый формат) и один (двоичный). В сообщении RowDescription, возвращаемом вариацией Describe для оператора, код формата ещё не известен и всегда будет нулевым.

source: <placeholder-1/> Then, for each field, there is the following: <placeholder-2/>
ru: <placeholder-1/> Затем для каждого поля передаётся: <placeholder-2/>

source: Identifies the message as an initial SASL response. Note that this is also used for GSSAPI, SSPI and password response messages. The exact message type is deduced from the context.
ru: Обозначает это сообщение как начальный ответ SASL. Заметьте, что оно также применяется для ответов GSSAPI, SSPI и при аутентификации по паролю. Точный тип сообщения определяется из контекста.

source: Name of the SASL authentication mechanism that the client selected.
ru: Имя механизма аутентификации SASL, выбранного клиентом.

source: Length of SASL mechanism specific "Initial Client Response" that follows, or -1 if there is no Initial Response.
ru: Длина последующего сообщения «Начальный ответ клиента», специфичного для механизма SASL, или -1, если начального ответа нет.

source: SASL mechanism specific "Initial Response".
ru: «Начальный ответ», специфичный для механизма SASL.

source: Identifies the message as a SASL response. Note that this is also used for GSSAPI, SSPI and password response messages. The exact message type can be deduced from the context.
ru: Обозначает это сообщение как ответ SASL. Заметьте, что оно также применяется для ответов GSSAPI, SSPI и при аутентификации по паролю. Точный тип сообщения можно определить из контекста.

source: SASL mechanism specific message data.
ru: Данные сообщения, специфичные для механизма SASL.
