Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/protocol.po
Languages: ru

source: ErrorResponse and NoticeResponse ('<literal>E</literal>' and '<literal>N</literal>') messages now contain multiple fields, from which the client code can assemble an error message of the desired level of verbosity. Note that individual fields will typically not end with a newline, whereas the single string sent in the older protocol always did.
ru: Сообщения ErrorResponse и NoticeResponse ('<literal>E</literal>' и '<literal>N</literal>') могут содержать несколько полей, из которых клиентский код может собрать сообщение об ошибке желаемого уровня детализации. Заметьте, что текст отдельных полей обычно не завершается новой строкой, тогда как в старом протоколе одиночная строка всегда завершалась так.

source: The ReadyForQuery ('<literal>Z</literal>') message includes a transaction status indicator.
ru: Сообщение ReadyForQuery ('<literal>Z</literal>') включает индикатор статуса транзакции.

source: The distinction between BinaryRow and DataRow message types is gone; the single DataRow message type serves for returning data in all formats. Note that the layout of DataRow has changed to make it easier to parse. Also, the representation of binary values has changed: it is no longer directly tied to the server's internal representation.
ru: Различие между типами данных BinaryRow и DataRow ушло; один тип сообщений DataRow позволяет возвращать данные во всех форматах. Заметьте, что формат DataRow был изменён для упрощения его разбора. Также изменилось представление двоичных значений: оно больше не привязано к внутреннему представлению сервера.

source: There is a new <quote>extended query</quote> sub-protocol, which adds the frontend message types Parse, Bind, Execute, Describe, Close, Flush, and Sync, and the backend message types ParseComplete, BindComplete, PortalSuspended, ParameterDescription, NoData, and CloseComplete. Existing clients do not have to concern themselves with this sub-protocol, but making use of it might allow improvements in performance or functionality.
ru: В протоколе появился новый подраздел <quote>расширенный запрос</quote>, в котором добавлены типы сообщений для команд Parse, Bind, Execute, Describe, Close, Flush и Sync, а также типы серверных сообщений ParseComplete, BindComplete, PortalSuspended, ParameterDescription, NoData и CloseComplete. Существующие клиенты могут не подстраиваться под этот раздел протокола, но если они задействует его, это позволит улучшить производительность или функциональность.

source: <command>COPY</command> data is now encapsulated into CopyData and CopyDone messages. There is a well-defined way to recover from errors during <command>COPY</command>. The special <quote><literal>\.</literal></quote> last line is not needed anymore, and is not sent during <command>COPY OUT</command>. (It is still recognized as a terminator during <command>COPY IN</command>, but its use is deprecated and will eventually be removed.) Binary <command>COPY</command> is supported. The CopyInResponse and CopyOutResponse messages include fields indicating the number of columns and the format of each column.
ru: Данные <command>COPY</command> теперь внедряются в сообщения CopyData и CopyDone. Есть чётко определённый способ восстановить работу в случае ошибок в процессе <command>COPY</command>. Специальная последняя строка <quote><literal>\.</literal></quote> больше не нужна, она не передаётся при выполнении <command>COPY OUT</command>. (Она по-прежнему воспринимается как завершающая последовательность в потоке <command>COPY IN</command>, но это считается устаревшим способом завершения, и в конце концов он будет исключён.) Поддерживается <command>COPY</command> в двоичном режиме. Сообщения CopyInResponse и CopyOutResponse включают поля, определяющие число столбцов и формат каждого столбца.

source: The layout of FunctionCall and FunctionCallResponse messages has changed. FunctionCall can now support passing NULL arguments to functions. It also can handle passing parameters and retrieving results in either text or binary format. There is no longer any reason to consider FunctionCall a potential security hole, since it does not offer direct access to internal server data representations.
ru: Изменилась структура сообщений FunctionCall и FunctionCallResponse. Сообщение FunctionCall теперь позволяет передавать функциям аргументы NULL. Ещё в нём могут передаваться параметры и получаться результаты в текстовом или двоичном формате. Не осталось повода считать сообщение FunctionCall потенциально небезопасным, так как оно не даёт прямого доступа к внутренней презентации данных на сервере.

source: The backend sends ParameterStatus ('<literal>S</literal>') messages during connection startup for all parameters it considers interesting to the client library. Subsequently, a ParameterStatus message is sent whenever the active value changes for any of these parameters.
ru: Сервер отправляет сообщения ParameterStatus ('<literal>S</literal>') при попытке подключения для всех параметров, которые он считает интересными для клиентской библиотеки. Как следствие, при любом изменении активного значения одного из этих параметров также выдаётся сообщение ParameterStatus.

source: The RowDescription ('<literal>T</literal>') message carries new table OID and column number fields for each column of the described row. It also shows the format code for each column.
ru: Сообщение RowDescription ('<literal>T</literal>') содержит поля с OID таблицы и номером столбца для каждого столбца описываемой строки. В нём также передаётся код формата для каждого столбца.

source: The CursorResponse ('<literal>P</literal>') message is no longer generated by the backend.
ru: Сервер более не выдаёт сообщение CursorResponse ('<literal>P</literal>').

source: The NotificationResponse ('<literal>A</literal>') message has an additional string field, which can carry a <quote>payload</quote> string passed from the <command>NOTIFY</command> event sender.
ru: В сообщении NotificationResponse ('<literal>A</literal>') добавилось ещё одно строковое поле, в котором может передаваться строка <quote>сообщения</quote> от отправителя события <command>NOTIFY</command>.

source: The EmptyQueryResponse ('<literal>I</literal>') message used to include an empty string parameter; this has been removed.
ru: Раньше сообщение EmptyQueryResponse ('<literal>I</literal>') включало пустой строковый параметр; теперь он ликвидирован.

source: A parameter data type can be left unspecified by setting it to zero, or by making the array of parameter type OIDs shorter than the number of parameter symbols (<literal>$</literal><replaceable>n</replaceable>) used in the query string. Another special case is that a parameter's type can be specified as <type>void</type> (that is, the OID of the <type>void</type> pseudotype). This is meant to allow parameter symbols to be used for function parameters that are actually OUT parameters. Ordinarily there is no context in which a <type>void</type> parameter could be used, but if such a parameter symbol appears in a function's parameter list, it is effectively ignored. For example, a function call such as <literal>foo($1,$2,$3,$4)</literal> could match a function with two IN and two OUT arguments, if <literal>$3</literal> and <literal>$4</literal> are specified as having type <type>void</type>.
ru: Тип данных параметра можно оставить неопределённым, задав для него значение ноль, либо сделав массив с OID типов параметров короче, чем набор символов параметров (<literal>$</literal><replaceable>n</replaceable>), используемых в строке запроса. Другой особый случай — передача типа параметра как <type>void</type> (то есть передача OID псевдотипа <type>void</type>). Это предусмотрено для того, чтобы символы параметров можно было использовать для параметров функций, на самом деле представляющих собой параметры OUT. Обычно параметр <type>void</type> нельзя использовать ни в каком контексте, но если такой параметр фигурирует в списке параметров функции, он фактически игнорируется. Например, вызову функции <literal>foo($1,$2,$3,$4)</literal> может соответствовать функция с аргументами IN и двумя OUT, если аргументы <literal>$3</literal> и <literal>$4</literal> объявлены как имеющие тип <type>void</type>.

source: Current xlog flush location. Useful to get a known location in the transaction log where streaming can start.
ru: Текущее положение сохранённых данных в xlog. Позволяет узнать, с какой позиции в журнале транзакций может начаться потоковая передача.

source: <literal>CREATE_REPLICATION_SLOT</literal> <replaceable class="parameter">slot_name</replaceable> { <literal>PHYSICAL</literal> [ <literal>RESERVE_WAL</literal> ] | <literal>LOGICAL</literal> <replaceable class="parameter">output_plugin</replaceable> } <placeholder-1/>
ru: <literal>CREATE_REPLICATION_SLOT</literal> <replaceable class="parameter">имя_слота</replaceable> { <literal>PHYSICAL</literal> [ <literal>RESERVE_WAL</literal> ] | <literal>LOGICAL</literal> <replaceable class="parameter">модуль_вывода</replaceable> } <placeholder-1/>

source: Instructs server to start streaming WAL, starting at WAL position <replaceable class="parameter">XXX/XXX</replaceable>. If <literal>TIMELINE</literal> option is specified, streaming starts on timeline <replaceable class="parameter">tli</replaceable>; otherwise, the server's current timeline is selected. The server can reply with an error, for example if the requested section of WAL has already been recycled. On success, server responds with a CopyBothResponse message, and then starts to stream WAL to the frontend.
ru: Указывает серверу начать потоковую передачу WAL, начиная с позиции <replaceable class="parameter">XXX/XXX</replaceable> в WAL. Если указывается параметр <literal>TIMELINE</literal>, передача начинается на линии времени <replaceable class="parameter">лин_врем</replaceable>, иначе выбирается текущая линия времени сервера. Сервер может вернуть в ответ ошибку, например, если запрошенный сегмент WAL уже потерян. Если проблем не возникает, сервер возвращает сообщение CopyBothResponse, а затем начинает передавать поток WAL клиенту.

source: After streaming all the WAL on a timeline that is not the latest one, the server will end streaming by exiting the COPY mode. When the client acknowledges this by also exiting COPY mode, the server sends a result set with one row and two columns, indicating the next timeline in this server's history. The first column is the next timeline's ID (type <type>int8</type>), and the second column is the WAL position where the switch happened (type <type>text</type>). Usually, the switch position is the end of the WAL that was streamed, but there are corner cases where the server can send some WAL from the old timeline that it has not itself replayed before promoting. Finally, the server sends CommandComplete message, and is ready to accept a new command.
ru: После передачи всех записей WAL на линии времени, не являющейся текущей, сервер завершает потоковую передачу, выходя из режима копирования. Когда клиент подтверждает завершение передачи, также выходя из режима копирования, сервер возвращает набор результатов в одной строке с двумя столбцами, сообщая таким образом о следующей линии времени в истории сервера. В первом столбце передаётся идентификатор следующей линии времени (типа <type>int8</type>), а во втором — позиция в WAL, в которой произошло переключение (типа <type>text</type>). Обычно в этой же позиции завершается передача потока WAL, но возможны исключения, когда сервер может передавать записи WAL из старой линии времени, которые он сам ещё не воспроизвёл до переключения. Наконец сервер передаёт сообщение CommandComplete, после чего он готов принять следующую команду.

source: The standby's current xmin. This may be 0, if the standby is sending notification that Hot Standby feedback will no longer be sent on this connection. Later non-zero messages may reinitiate the feedback mechanism.
ru: Текущее значение xmin данного резервного сервера. Может быть нулевым; это означает, что резервный сервер уведомляет о том, что сообщения обратной связи горячего резерва больше не будут передаваться через это подключение. Последующие ненулевые значения могут восстановить работу механизма обратной связи.

source: The standby's current epoch.
ru: Текущая эпоха резервного сервера.

source: Instructs server to start streaming WAL for logical replication, starting at WAL position <replaceable class="parameter">XXX/XXX</replaceable>. The server can reply with an error, for example if the requested section of WAL has already been recycled. On success, server responds with a CopyBothResponse message, and then starts to stream WAL to the frontend.
ru: Указывает серверу начать потоковую передачу WAL для логической репликации, начиная с позиции <replaceable class="parameter">XXX/XXX</replaceable> в WAL. Сервер может вернуть в ответ ошибку, например, если запрошенный сегмент WAL уже потерян. Если проблем не возникает, сервер возвращает сообщение CopyBothResponse, а затем начинает передавать поток WAL клиенту.

source: Drops a replication slot, freeing any reserved server-side resources. If the slot is currently in use by an active connection, this command fails.
ru: Удаляет слот репликации, что приводит к освобождению всех зарезервированных для него ресурсов на стороне сервера. Если слот в настоящий момент используется активным соединением, команда завершается ошибкой.

source: Include the necessary WAL segments in the backup. This will include all the files between start and stop backup in the <filename>pg_xlog</filename> directory of the base directory tar file.
ru: Включает в резервную копию необходимые сегменты WAL. При этом в подкаталог <filename>pg_xlog</filename> архива базового каталога будут включены все файлы с начала до конца копирования.

source: various temporary files created during the operation of the PostgreSQL server
ru: различные временные файлы, создаваемые в процессе работы сервером PostgreSQL

source: <filename>pg_replslot</filename> is copied as an empty directory.
ru: <filename>pg_replslot</filename> копируется в виде пустого каталога.

source: Files other than regular files and directories, such as symbolic links and special device files, are skipped. (Symbolic links in <filename>pg_tblspc</filename> are maintained.)
ru: файлы, отличные от обычных файлов и каталогов, например, символические ссылки и файлы специальных устройств, пропускаются. (Символические ссылки в <filename>pg_tblspc</filename> сохраняются.)

source: Identifies the message as a password response. Note that this is also used for GSSAPI and SSPI response messages (which is really a design error, since the contained data is not a null-terminated string in that case, but can be arbitrary binary data).
ru: Указывает, что это сообщение, в котором передаётся пароль. Заметьте, что оно также применяется для передачи сообщений обмена GSSAPI и SSPI (это на самом деле ошибка проектирования, так как в этом случае сообщение может содержать произвольные двоичные данные, а не текстовую строку, оканчивающуюся нулём).
