Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/protocol.po
Languages: ru

source: The <acronym>SSL</acronym> request code. The value is chosen to contain <literal>1234</literal> in the most significant 16 bits, and <literal>5679</literal> in the least significant 16 bits. (To avoid confusion, this code must not be the same as any protocol version number.)
ru: Код запроса <acronym>SSL</acronym>. Это специально выбранное значение содержит <literal>1234</literal> в старших 16 битах и <literal>5679</literal> в младших 16 битах. (Во избежание неоднозначности этот код не должен совпадать с номером версии протокола.)

source: The protocol version number. The most significant 16 bits are the major version number (3 for the protocol described here). The least significant 16 bits are the minor version number (0 for the protocol described here).
ru: Номер версии протокола. В старших 16 битах задаётся старший номер версии (3 для протокола, описываемого здесь). В младших 16 битах задаётся младший номер версии (0 для протокола, описываемого здесь).

source: The database user name to connect as. Required; there is no default.
ru: Имя пользователя баз данных, с которым выполняется подключение. Является обязательным, значения по умолчанию нет.

source: The database to connect to. Defaults to the user name.
ru: База данных, к которой выполняется подключение. По умолчанию подставляется имя пользователя.

source: Command-line arguments for the backend. (This is deprecated in favor of setting individual run-time parameters.) Spaces within this string are considered to separate arguments, unless escaped with a backslash (<literal>\</literal>); write <literal>\\</literal> to represent a literal backslash.
ru: Аргументы командной строки для обслуживающего процесса. (Этот способ считается устаревшим; теперь следует устанавливать отдельные параметры времени выполнения.) Пробелы в этой строке воспринимаются как разделяющие аргументы, если перед ними нет обратной косой черты (<literal>\</literal>); чтобы представить обратную косую черту буквально, продублируйте её (<literal>\\</literal>).

source: Used to connect in streaming replication mode, where a small set of replication commands can be issued instead of SQL statements. Value can be <literal>true</literal>, <literal>false</literal>, or <literal>database</literal>, and the default is <literal>false</literal>. See <xref linkend="protocol-replication"/> for details.
ru: Используется для подключения в режиме потоковой репликации, в котором вместо операторов SQL может выполняться небольшой набор команд репликации. Допустимые значения: <literal>true</literal>, <literal>false</literal> (по умолчанию) и <literal>database</literal>. За подробностями обратитесь к <xref remap="3" linkend="protocol-replication"/>.

source: The parameter name. Currently recognized names are: <placeholder-1/> In addition to the above, any run-time parameter that can be set at backend start time might be listed. Such settings will be applied during backend start (after parsing the command-line arguments if any). The values will act as session defaults.
ru: Имя параметра. В настоящее время принимаются имена: <placeholder-1/> В дополнение к этим параметрам можно установить любые параметры времени выполнения, значение которых может быть задано во время запуска обслуживающего процесса. Заданные значения будут применены при запуске обслуживающего процесса (после разбора аргументов командной строки, если они были переданы). Эти значения станут значениями по умолчанию в новом сеансе.

source: The parameter value.
ru: Значение параметра.

source: <placeholder-1/> The protocol version number is followed by one or more pairs of parameter name and value strings. A zero byte is required as a terminator after the last name/value pair. Parameters can appear in any order. <literal>user</literal> is required, others are optional. Each parameter is specified as: <placeholder-2/>
ru: <placeholder-1/> За номером версии протокола следует одна или несколько пар из имени параметра и строки значения. За последней парой имя/значение должен следовать нулевой байт. Передаваться параметры могут в любом порядке. Обязательным является только параметр <literal>user</literal>, остальные могут отсутствовать. Каждый параметр задаётся так: <placeholder-2/>

source: Identifies the message as a Sync command.
ru: Указывает, что это сообщение представляет команду Sync.

source: Identifies the message as a termination.
ru: Указывает, что это сообщение завершает сеанс.

source: Error and Notice Message Fields
ru: Поля сообщений с ошибками и замечаниями

source: This section describes the fields that can appear in ErrorResponse and NoticeResponse messages. Each field type has a single-byte identification token. Note that any given field type should appear at most once per message.
ru: В этом разделе описываются поля, которые могут содержаться в сообщениях ErrorResponse и NoticeResponse. Для каждого типа поля определён свой идентификационный маркер. Заметьте, что в сообщении может содержаться поле любого из этих типов, но не больше одного раза.

source: Severity: the field contents are <literal>ERROR</literal>, <literal>FATAL</literal>, or <literal>PANIC</literal> (in an error message), or <literal>WARNING</literal>, <literal>NOTICE</literal>, <literal>DEBUG</literal>, <literal>INFO</literal>, or <literal>LOG</literal> (in a notice message), or a localized translation of one of these. Always present.
ru: Важность: поле содержит <literal>ERROR</literal>, <literal>FATAL</literal> или <literal>PANIC</literal> (в сообщении об ошибке), либо <literal>WARNING</literal>, <literal>NOTICE</literal>, <literal>DEBUG</literal>, <literal>INFO</literal> или <literal>LOG</literal> (в сообщении с замечанием), либо переведённые значения (ОШИБКА, ВАЖНО, ПАНИКА, ПРЕДУПРЕЖДЕНИЕ, ЗАМЕЧАНИЕ, ОТЛАДКА, ИНФОРМАЦИЯ, СООБЩЕНИЕ, соответственно). Это поле присутствует всегда.

source: Severity: the field contents are <literal>ERROR</literal>, <literal>FATAL</literal>, or <literal>PANIC</literal> (in an error message), or <literal>WARNING</literal>, <literal>NOTICE</literal>, <literal>DEBUG</literal>, <literal>INFO</literal>, or <literal>LOG</literal> (in a notice message). This is identical to the <literal>S</literal> field except that the contents are never localized. This is present only in messages generated by <productname>PostgreSQL</productname> versions 9.6 and later.
ru: Важность: поле содержит <literal>ERROR</literal>, <literal>FATAL</literal> или <literal>PANIC</literal> (в сообщении об ошибке) либо <literal>WARNING</literal>, <literal>NOTICE</literal>, <literal>DEBUG</literal>, <literal>INFO</literal> или <literal>LOG</literal> (в сообщении с замечанием). Это поле подобно <literal>S</literal>, но его содержимое никогда не переводится. Присутствует только в сообщениях, выдаваемых <productname>PostgreSQL</productname> версии 9.6 и новее.

source: Code: the SQLSTATE code for the error (see <xref linkend="errcodes-appendix"/>). Not localizable. Always present.
ru: Код: код SQLSTATE выданной ошибки (см. <xref remap="4" linkend="errcodes-appendix"/>). Не переводится на другие языки, присутствует всегда.

source: Message: the primary human-readable error message. This should be accurate but terse (typically one line). Always present.
ru: Сообщение: основное сообщение об ошибке, предназначенное для человека. Должно быть точным, но кратким (обычно в одну строку). Присутствует всегда.

source: Detail: an optional secondary error message carrying more detail about the problem. Might run to multiple lines.
ru: Необязательное дополнительное сообщение об ошибке, передающее более детальную информацию о проблеме. Может занимать несколько строк.

source: Hint: an optional suggestion what to do about the problem. This is intended to differ from Detail in that it offers advice (potentially inappropriate) rather than hard facts. Might run to multiple lines.
ru: Подсказка: необязательное предложение решения проблемы. Оно должно отличаться от подробного описания тем, что предлагает совет (не обязательно подходящий во всех случаях), а не сухие факты. Может располагаться в нескольких строках.

source: Position: the field value is a decimal ASCII integer, indicating an error cursor position as an index into the original query string. The first character has index 1, and positions are measured in characters not bytes.
ru: Позиция: значение поля представляет целочисленное число в ASCII, указывающее на положение ошибки в исходной строке запроса. Первый символ находится в позиции 1, при этом позиции отсчитываются по символам, а не по байтам.

source: Internal position: this is defined the same as the <literal>P</literal> field, but it is used when the cursor position refers to an internally generated command rather than the one submitted by the client. The <literal>q</literal> field will always appear when this field appears.
ru: Внутренняя позиция: она определяется так же, как поле <literal>P</literal>, но отражает положение ошибки во внутренне сгенерированной команде, а не в строке, переданной клиентом. Вместе с этим полем всегда присутствует поле <literal>q</literal>.

source: Internal query: the text of a failed internally-generated command. This could be, for example, a SQL query issued by a PL/pgSQL function.
ru: Внутренний запрос: текст внутренне сгенерированной команды, в которой произошла ошибка. Это может быть, например, SQL-запрос, выполняемый функцией на PL/pgSQL.

source: Where: an indication of the context in which the error occurred. Presently this includes a call stack traceback of active procedural language functions and internally-generated queries. The trace is one entry per line, most recent first.
ru: Где: указывает на контекст, в котором произошла ошибка. В настоящее время включает трассировку стека вызовов текущей функции на процедурном языке и внутренне сгенерированных запросов. Записи трассировки разделяются по строкам, вначале последняя.

source: Schema name: if the error was associated with a specific database object, the name of the schema containing that object, if any.
ru: Имя схемы: если ошибка связана с некоторым объектом базы данных, это поле содержит имя схемы, к которой относится объект (если такая есть).

source: Table name: if the error was associated with a specific table, the name of the table. (Refer to the schema name field for the name of the table's schema.)
ru: Имя таблицы: если ошибка связана с некоторой таблицей, это поле содержит имя таблицы. (Узнать имя схемы таблицы можно из соответствующего отдельного поля.)

source: Column name: if the error was associated with a specific table column, the name of the column. (Refer to the schema and table name fields to identify the table.)
ru: Имя столбца: если ошибка связана с некоторым столбцом таблицы, это поле содержит имя столбца. (Идентифицировать таблицу можно, обратившись к полям, содержащим имя таблицы и схемы.)

source: Data type name: if the error was associated with a specific data type, the name of the data type. (Refer to the schema name field for the name of the data type's schema.)
ru: Имя типа данных: если ошибка связана с некоторым типом данных, это поле содержит имя типа. (Узнать имя схемы типа можно из соответствующего поля.)

source: Constraint name: if the error was associated with a specific constraint, the name of the constraint. Refer to fields listed above for the associated table or domain. (For this purpose, indexes are treated as constraints, even if they weren't created with constraint syntax.)
ru: Имя ограничения: если ошибка связана с некоторым ограничением, это поле содержит имя ограничения. Чтобы узнать, к какой таблице или домену она относится, обратитесь к полям, описанным выше. (В данном контексте индексы считаются ограничениями, даже если они были созданы не с синтаксисом ограничений.)

source: File: the file name of the source-code location where the error was reported.
ru: Файл: имя файла с исходным кодом, в котором была обнаружена ошибка.

source: Line: the line number of the source-code location where the error was reported.
ru: Строка: номер строки в исходном коде, в которой была обнаружена ошибка.

source: Routine: the name of the source-code routine reporting the error.
ru: Программа: имя программы в исходном коде, в которой была обнаружена ошибка.

source: The fields for schema name, table name, column name, data type name, and constraint name are supplied only for a limited number of error types; see <xref linkend="errcodes-appendix"/>. Frontends should not assume that the presence of any of these fields guarantees the presence of another field. Core error sources observe the interrelationships noted above, but user-defined functions may use these fields in other ways. In the same vein, clients should not assume that these fields denote contemporary objects in the current database.
ru: Поля, содержащие имена схемы, таблицы, столбца, типа данных и ограничения, выдаются только для ограниченного числа типов ошибок; см. <xref remap="4" linkend="errcodes-appendix"/>. Клиенты не должны рассчитывать на то, что присутствие одного из полей обязательно влечёт присутствие другого поля. Системные источники ошибок устанавливают связь между ними, но пользовательские функции могут использовать эти поля по-другому. Подобным образом, клиенты не должны полагаться на то, что эти поля ссылаются на актуальные объекты в текущей базе данных.

source: The client is responsible for formatting displayed information to meet its needs; in particular it should break long lines as needed. Newline characters appearing in the error message fields should be treated as paragraph breaks, not line breaks.
ru: Клиент отвечает за форматирование отображаемой информации в соответствии с его нуждами; в частности, он должен разбивать длинные строки, как требуется. Символы новой строки, встречающиеся в полях сообщения об ошибке, должны обрабатываться, как разрывы абзацев, а не строк.

source: Logical Replication Message Formats
ru: Форматы сообщений логической репликации

source: This section describes the detailed format of each logical replication message. These messages are returned either by the replication slot SQL interface or are sent by a walsender. In case of a walsender they are encapsulated inside the replication protocol WAL messages as described in <xref linkend="protocol-replication"/> and generally obey same message flow as physical replication.
ru: В этом разделе подробно описывается формат каждого сообщения логической репликации. Эти сообщения или выдаются через SQL-интерфейс слота репликации или передаются процессом walsender. Когда их передаёт walsender, они помещаются внутрь WAL-сообщений протокола репликации, описанных в <xref remap="6" linkend="protocol-replication"/>, и в общем следуют тому же потоку сообщений, что и сообщения физической репликации.

source: Identifies the message as a begin message.
ru: Указывает, что это начальное сообщение.

source: The final LSN of the transaction.
ru: Окончательный LSN транзакции.

source: Commit timestamp of the transaction. The value is in number of microseconds since PostgreSQL epoch (2000-01-01).
ru: Время фиксации транзакции. Значение задаётся в микросекундах, прошедших с начала эпохи PostgreSQL (2000-01-01).

source: Xid of the transaction.
ru: Идентификатор транзакции.

source: Identifies the message as a commit message.
ru: Указывает, что это сообщение о фиксации.

source: Flags; currently unused (must be 0).
ru: Флаги; в настоящее время не используются (поле должно содержать 0).

source: The LSN of the commit.
ru: LSN записи фиксации.

source: The end LSN of the transaction.
ru: Конечный LSN транзакции.

source: Identifies the message as an origin message.
ru: Указывает, что это сообщение об источнике.

source: The LSN of the commit on the origin server.
ru: LSN записи фиксации на сервере-источнике.

source: Name of the origin.
ru: Имя источника.

source: Note that there can be multiple Origin messages inside a single transaction.
ru: Заметьте, что внутри одной транзакции может быть несколько сообщений Origin.

source: Identifies the message as a relation message.
ru: Указывает, что это сообщение об отношении.

source: ID of the relation.
ru: Идентификатор отношения.

source: Namespace (empty string for <literal>pg_catalog</literal>).
ru: Пространство имён (пустая строка для <literal>pg_catalog</literal>).

source: Relation name.
ru: Имя отношения.

source: Replica identity setting for the relation (same as <structfield>relreplident</structfield> in <structname>pg_class</structname>).
ru: Свойство идентификации реплики для отношения (то же, что и <structfield>relreplident</structfield> в <structname>pg_class</structname>).

source: Number of columns.
ru: Число столбцов.

source: Flags for the column. Currently can be either 0 for no flags or 1 which marks the column as part of the key.
ru: Флаги столбца. В настоящее время это может быть 0 (флагов нет) или 1 (столбец помечается как часть ключа).

source: Name of the column.
ru: Имя столбца.

source: ID of the column's data type.
ru: Идентификатор типа данных столбца.

source: Type modifier of the column (<structfield>atttypmod</structfield>).
ru: Модификатор типа столбца (<structfield>atttypmod</structfield>).

source: <placeholder-1/> Next, the following message part appears for each column: <placeholder-2/>
ru: <placeholder-1/> Затем для каждого столбца идёт следующий блок сообщения: <placeholder-2/>

source: Type
ru: Тип

source: Identifies the message as a type message.
ru: Указывает, что это сообщение о типе.

source: ID of the data type.
ru: Идентификатор типа данных.

source: Name of the data type.
ru: Имя типа данных.

source: Identifies the message as an insert message.
ru: Указывает, что это сообщение о добавлении данных.

source: ID of the relation corresponding to the ID in the relation message.
ru: Идентификатор отношения, соответствующий идентификатору в сообщении об отношении.

source: Identifies the following TupleData message as a new tuple.
ru: Обозначает следующее сообщение TupleData как содержащее новый кортеж.

source: TupleData message part representing the contents of new tuple.
ru: Блок сообщения TupleData, представляющий содержимое нового кортежа.

source: Identifies the message as an update message.
ru: Указывает, что это сообщение об изменении данных.

source: Identifies the following TupleData submessage as a key. This field is optional and is only present if the update changed data in any of the column(s) that are part of the REPLICA IDENTITY index.
ru: Указывает, что следующий блок TupleData содержит ключ. Это поле является необязательным и присутствует, только если изменение затронуло столбцы, являющиеся частью индекса REPLICA IDENTITY.

source: Identifies the following TupleData submessage as an old tuple. This field is optional and is only present if table in which the update happened has REPLICA IDENTITY set to FULL.
ru: Указывает, что следующий блок TupleData содержит старый кортеж. Это поле является необязательным и присутствует, только если у таблицы, в которой произошло изменение, свойство REPLICA IDENTITY равно FULL.

source: TupleData message part representing the contents of the old tuple or primary key. Only present if the previous 'O' or 'K' part is present.
ru: Блок сообщения TupleData, представляющий содержимое старого кортежа или первичного ключа. Присутствует, только если перед ним идёт признак 'O' или 'K'.

source: TupleData message part representing the contents of a new tuple.
ru: Блок сообщения TupleData, представляющий содержимое нового кортежа.

source: The Update message may contain either a 'K' message part or an 'O' message part or neither of them, but never both of them.
ru: Сообщение Update может содержать либо блок 'K', либо блок 'O', либо ни один из них, но не оба сразу.

source: Identifies the message as a delete message.
ru: Указывает, что это сообщение об удалении данных.

source: Identifies the following TupleData submessage as a key. This field is present if the table in which the delete has happened uses an index as REPLICA IDENTITY.
ru: Указывает, что следующий блок TupleData содержит ключ. Это поле присутствует, если таблица, в которой произошло удаление, использует индекс в качестве REPLICA IDENTITY.

source: Identifies the following TupleData message as a old tuple. This field is is present if the table in which the delete has happened has REPLICA IDENTITY set to FULL.
ru: Указывает, что следующий блок TupleData содержит старый кортеж. Это поле присутствует, если у таблицы, в которой произошло удаление, свойство REPLICA IDENTITY равно FULL.

source: TupleData message part representing the contents of the old tuple or primary key, depending on the previous field.
ru: Блок сообщения TupleData, представляющий содержимое старого кортежа или первичного ключа, в зависимости от предыдущего поля.

source: The Delete message may contain either a 'K' message part or an 'O' message part, but never both of them.
ru: Сообщение Delete может содержать либо блок 'K', либо блок 'O', но не оба сразу.

source: The following message parts are shared by the above messages.
ru: Описанные выше сообщения имеют следующие общие блоки.

source: Identifies the data as NULL value.
ru: Обозначает данные как значение NULL.

source: Identifies unchanged TOASTed value (the actual value is not sent).
ru: Обозначает неизменённое значение TOAST (само значение не передаётся).

source: Identifies the data as text formatted value.
ru: Обозначает данные как значение в текстовом формате.

source: Length of the column value.
ru: Длина значения столбца.

source: The value of the column, in text format. (A future release might support additional formats.) <replaceable>n</replaceable> is the above length.
ru: Значение столбца в текстовом формате. (В будущих выпусках могут поддерживаться и другие форматы.) Здесь <replaceable>n</replaceable> — заданная выше длина.

source: <placeholder-1/> Next, one of the following submessages appears for each column: <placeholder-2/> Or <placeholder-3/> Or <placeholder-4/>
ru: <placeholder-1/> Затем для каждого столбца следует один из следующих блоков для каждого столбца: <placeholder-2/> Или <placeholder-3/> Или <placeholder-4/>

source: Summary of Changes since Protocol 2.0
ru: Сводка изменений по сравнению с протоколом версии 2.0

source: This section provides a quick checklist of changes, for the benefit of developers trying to update existing client libraries to protocol 3.0.
ru: В этом разделе представлен краткий список изменений к сведению разработчиков, желающих модернизировать существующие клиентские библиотеки до протокола 3.0.

source: The initial startup packet uses a flexible list-of-strings format instead of a fixed format. Notice that session default values for run-time parameters can now be specified directly in the startup packet. (Actually, you could do that before using the <literal>options</literal> field, but given the limited width of <literal>options</literal> and the lack of any way to quote whitespace in the values, it wasn't a very safe technique.)
ru: В начальном стартовом пакете вместо фиксированного формата применяется гибкий формат списка строк. Заметьте, что теперь сеансовые значения по умолчанию для параметров времени выполнения можно задать непосредственно в стартовом пакете. (Вообще, это можно было делать и раньше, используя поле <literal>options</literal>, но из-за ограниченного размера <literal>options</literal> и невозможности задавать значения с пробелами, это вариант был не очень безопасным.)

source: All messages now have a length count immediately following the message type byte (except for startup packets, which have no type byte). Also note that PasswordMessage now has a type byte.
ru: Во всех сообщениях непосредственно за байтом типа сообщения следует счётчик длины (за исключением стартовых пакетов, в которых нет байта типа). Также заметьте, что байт типа теперь есть в сообщении PasswordMessage.
