Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/query.po
Languages: ru

source: Joins Between Tables
ru: Соединения таблиц

source: <primary>join</primary>
ru: <primary>соединение</primary>

source: This is only a conceptual model. The join is usually performed in a more efficient manner than actually comparing each possible pair of rows, but this is invisible to the user.
ru: Это не совсем точная модель. Обычно соединения выполняются эффективнее (сравниваются не все возможные пары строк), но это скрыто от пользователя.

source: Thus far, our queries have only accessed one table at a time. Queries can access multiple tables at once, or access the same table in such a way that multiple rows of the table are being processed at the same time. A query that accesses multiple rows of the same or different tables at one time is called a <firstterm>join</firstterm> query. As an example, say you wish to list all the weather records together with the location of the associated city. To do that, we need to compare the <structfield>city</structfield> column of each row of the <structname>weather</structname> table with the <structfield>name</structfield> column of all rows in the <structname>cities</structname> table, and select the pairs of rows where these values match. <placeholder-1/> This would be accomplished by the following query: <placeholder-2/> <screen> city | temp_lo | temp_hi | prcp | date | name | location ---------------+---------+---------+------+------------+---------------+----------- San Francisco | 46 | 50 | 0.25 | 1994-11-27 | San Francisco | (-194,53) San Francisco | 43 | 57 | 0 | 1994-11-29 | San Francisco | (-194,53) (2 rows) </screen>
ru: До этого все наши запросы обращались только к одной таблице. Однако запросы могут также обращаться сразу к нескольким таблицам или обращаться к той же таблице так, что одновременно будут обрабатываться разные наборы её строк. Запрос, обращающийся к разным наборам строк одной или нескольких таблиц, называется <firstterm>соединением</firstterm> (JOIN). Например, мы захотели перечислить все погодные события вместе с координатами соответствующих городов. Для этого мы должны сравнить столбец <structfield>city</structfield> каждой строки таблицы <structname>weather</structname> со столбцом <structfield>name</structfield> всех строк таблицы <structname>cities</structname> и выбрать пары строк, для которых эти значения совпадают. <placeholder-1/> Это можно сделать с помощью следующего запроса: <placeholder-2/> <screen> city |temp_lo|temp_hi| prcp| date | name | location --------------+-------+-------+-----+-----------+--------------+---------- San Francisco| 46| 50| 0.25| 1994-11-27| San Francisco| (-194,53) San Francisco| 43| 57| 0| 1994-11-29| San Francisco| (-194,53) (2 rows) </screen>

source: There is no result row for the city of Hayward. This is because there is no matching entry in the <structname>cities</structname> table for Hayward, so the join ignores the unmatched rows in the <structname>weather</structname> table. We will see shortly how this can be fixed.
ru: В результате нет строки с городом Хейуорд (Hayward). Так получилось потому, что в таблице <structname>cities</structname> нет строки для данного города, а при соединении все строки таблицы <structname>weather</structname>, для которых не нашлось соответствие, опускаются. Вскоре мы увидим, как это можно исправить.

source: There are two columns containing the city name. This is correct because the lists of columns from the <structname>weather</structname> and <structname>cities</structname> tables are concatenated. In practice this is undesirable, though, so you will probably want to list the output columns explicitly rather than using <literal>*</literal>: <placeholder-1/>
ru: Название города оказалось в двух столбцах. Это правильно и объясняется тем, что столбцы таблиц <structname>weather</structname> и <structname>cities</structname> были объединены. Хотя на практике это нежелательно, поэтому лучше перечислить нужные столбцы явно, а не использовать <literal>*</literal>: <placeholder-1/>

source: Observe two things about the result set: <placeholder-1/>
ru: Обратите внимание на две особенности полученных данных: <placeholder-1/>

source: Exercise:
ru: Упражнение:

source: Attempt to determine the semantics of this query when the <literal>WHERE</literal> clause is omitted.
ru: Попробуйте определить, что будет делать этот запрос без предложения <literal>WHERE</literal>.

source: Since the columns all had different names, the parser automatically found which table they belong to. If there were duplicate column names in the two tables you'd need to <firstterm>qualify</firstterm> the column names to show which one you meant, as in: <placeholder-1/> It is widely considered good style to qualify all column names in a join query, so that the query won't fail if a duplicate column name is later added to one of the tables.
ru: Так как все столбцы имеют разные имена, анализатор запроса автоматически понимает, к какой таблице они относятся. Если бы имена столбцов в двух таблицах повторялись, вам пришлось бы <firstterm>дополнить</firstterm> имена столбцов, конкретизируя, что именно вы имели в виду: <placeholder-1/> Вообще хорошим стилем считается указывать полные имена столбцов в запросе соединения, чтобы запрос не поломался, если позже в таблицы будут добавлены столбцы с повторяющимися именами.

source: Join queries of the kind seen thus far can also be written in this alternative form: <placeholder-1/> This syntax is not as commonly used as the one above, but we show it here to help you understand the following topics.
ru: Запросы соединения, которые вы видели до этого, можно также записать в другом виде: <placeholder-1/> Эта запись не так распространена, как первый вариант, но мы показываем её, чтобы вам было проще понять следующие темы.

source: <primary>join</primary><secondary>outer</secondary>
ru: <primary>соединение</primary> <secondary>внешнее</secondary>

source: <placeholder-1/> Now we will figure out how we can get the Hayward records back in. What we want the query to do is to scan the <structname>weather</structname> table and for each row to find the matching <structname>cities</structname> row(s). If no matching row is found we want some <quote>empty values</quote> to be substituted for the <structname>cities</structname> table's columns. This kind of query is called an <firstterm>outer join</firstterm>. (The joins we have seen so far are inner joins.) The command looks like this: <placeholder-2/> This query is called a <firstterm>left outer join</firstterm> because the table mentioned on the left of the join operator will have each of its rows in the output at least once, whereas the table on the right will only have those rows output that match some row of the left table. When outputting a left-table row for which there is no right-table match, empty (null) values are substituted for the right-table columns.
ru: <placeholder-1/> Сейчас мы выясним, как вернуть записи о погоде в городе Хейуорд. Мы хотим, чтобы запрос просканировал таблицу <structname>weather</structname> и для каждой её строки нашёл соответствующую строку в таблице <structname>cities</structname>. Если же такая строка не будет найдена, мы хотим, чтобы вместо значений столбцов из таблицы <structname>cities</structname> были подставлены <quote>пустые значения</quote>. Запросы такого типа называются <firstterm>внешними соединениями</firstterm>. (Соединения, которые мы видели до этого, называются внутренними.) Эта команда будет выглядеть так: <placeholder-2/> Этот запрос называется <firstterm>левым внешним соединением</firstterm>, потому что из таблицы в левой части оператора будут выбраны все строки, а из таблицы справа только те, которые удалось сопоставить каким-нибудь строкам из левой. При выводе строк левой таблицы, для которых не удалось найти соответствия в правой, вместо столбцов правой таблицы подставляются пустые значения (NULL).

source: There are also right outer joins and full outer joins. Try to find out what those do.
ru: Существуют также правые внешние соединения и полные внешние соединения. Попробуйте выяснить, что они собой представляют.

source: <primary>join</primary><secondary>self</secondary>
ru: <primary>соединение</primary> <secondary>замкнутое</secondary>

source: <primary>alias</primary><secondary>for table name in query</secondary>
ru: <primary>псевдоним</primary> <secondary>таблицы в запросе</secondary>

source: <placeholder-1/> <placeholder-2/> We can also join a table against itself. This is called a <firstterm>self join</firstterm>. As an example, suppose we wish to find all the weather records that are in the temperature range of other weather records. So we need to compare the <structfield>temp_lo</structfield> and <structfield>temp_hi</structfield> columns of each <structname>weather</structname> row to the <structfield>temp_lo</structfield> and <structfield>temp_hi</structfield> columns of all other <structname>weather</structname> rows. We can do this with the following query: <placeholder-3/> Here we have relabeled the weather table as <literal>W1</literal> and <literal>W2</literal> to be able to distinguish the left and right side of the join. You can also use these kinds of aliases in other queries to save some typing, e.g.: <placeholder-4/> You will encounter this style of abbreviating quite frequently.
ru: <placeholder-1/> <placeholder-2/> В соединении мы также можем замкнуть таблицу на себя. Это называется <firstterm>замкнутым соединением</firstterm>. Например, представьте, что мы хотим найти все записи погоды, в которых температура лежит в диапазоне температур других записей. Для этого мы должны сравнить столбцы <structfield>temp_lo</structfield> и <structfield>temp_hi</structfield> каждой строки таблицы <structname>weather</structname> со столбцами <structfield>temp_lo</structfield> и <structfield>temp_hi</structfield> другого набора строк <structname>weather</structname>. Это можно сделать с помощью следующего запроса: <placeholder-3/> Здесь мы ввели новые обозначения таблицы weather: <literal>W1</literal> и <literal>W2</literal>, чтобы можно было различить левую и правую стороны соединения. Вы можете использовать подобные псевдонимы и в других запросах для сокращения: <placeholder-4/> Вы будете встречать сокращения такого рода довольно часто.

source: Aggregate Functions
ru: Агрегатные функции

source: <primary>aggregate function</primary>
ru: <primary>агрегатная функция</primary>

source: Like most other relational database products, <productname>PostgreSQL</productname> supports <firstterm>aggregate functions</firstterm>. An aggregate function computes a single result from multiple input rows. For example, there are aggregates to compute the <function>count</function>, <function>sum</function>, <function>avg</function> (average), <function>max</function> (maximum) and <function>min</function> (minimum) over a set of rows.
ru: Как большинство других серверов реляционных баз данных, <productname>PostgreSQL</productname> поддерживает <firstterm>агрегатные функции</firstterm>. Агрегатная функция вычисляет единственное значение, обрабатывая множество строк. Например, есть агрегатные функции, вычисляющие: <function>count</function> (количество), <function>sum</function> (сумму), <function>avg</function> (среднее), <function>max</function> (максимум) и <function>min</function> (минимум) для набора строк.

source: As an example, we can find the highest low-temperature reading anywhere with: <placeholder-1/> <screen> max ----- 46 (1 row) </screen>
ru: К примеру, мы можем найти самую высокую из всех минимальных дневных температур: <placeholder-1/> <screen> max ----- 46 (1 row) </screen>

source: <primary>subquery</primary>
ru: <primary>подзапрос</primary>

source: SELECT city FROM weather WHERE temp_lo = max(temp_lo); <lineannotation>WRONG</lineannotation>
ru: SELECT city FROM weather WHERE temp_lo = max(temp_lo); <lineannotation>НЕВЕРНО</lineannotation>

source: <placeholder-1/> If we wanted to know what city (or cities) that reading occurred in, we might try: <placeholder-2/> but this will not work since the aggregate <function>max</function> cannot be used in the <literal>WHERE</literal> clause. (This restriction exists because the <literal>WHERE</literal> clause determines which rows will be included in the aggregate calculation; so obviously it has to be evaluated before aggregate functions are computed.) However, as is often the case the query can be restated to accomplish the desired result, here by using a <firstterm>subquery</firstterm>: <placeholder-3/> <screen> city --------------- San Francisco (1 row) </screen> This is OK because the subquery is an independent computation that computes its own aggregate separately from what is happening in the outer query.
ru: <placeholder-1/> Если мы хотим узнать, в каком городе (или городах) наблюдалась эта температура, можно попробовать: <placeholder-2/> но это не будет работать, так как агрегатную функцию <function>max</function> нельзя использовать в предложении <literal>WHERE</literal>. (Это ограничение объясняется тем, что предложение <literal>WHERE</literal> должно определить, для каких строк вычислять агрегатную функцию, так что оно, очевидно, должно вычисляться до агрегатных функций.) Однако, как часто бывает, запрос можно перезапустить и получить желаемый результат, применив <firstterm>подзапрос</firstterm>: <placeholder-3/> <screen> city --------------- San Francisco (1 row) </screen> Теперь всё в порядке &mdash; подзапрос выполняется отдельно и результат агрегатной функции вычисляется вне зависимости от того, что происходит во внешнем запросе.

source: The <literal>LIKE</literal> operator does pattern matching and is explained in <xref linkend="functions-matching"/>.
ru: Оператор <literal>LIKE</literal> (выполняющий сравнение по шаблону) рассматривается в <xref remap="6" linkend="functions-matching"/>.

source: <placeholder-1/> <placeholder-2/> Aggregates are also very useful in combination with <literal>GROUP BY</literal> clauses. For example, we can get the maximum low temperature observed in each city with: <placeholder-3/> <screen> city | max ---------------+----- Hayward | 37 San Francisco | 46 (2 rows) </screen> which gives us one output row per city. Each aggregate result is computed over the table rows matching that city. We can filter these grouped rows using <literal>HAVING</literal>: <placeholder-4/> <screen> city | max ---------+----- Hayward | 37 (1 row) </screen> which gives us the same results for only the cities that have all <structfield>temp_lo</structfield> values below 40. Finally, if we only care about cities whose names begin with <quote><literal>S</literal></quote>, we might do: <placeholder-5/> <placeholder-6/>
ru: <placeholder-1/> <placeholder-2/> Агрегатные функции также очень полезны в сочетании с предложением <literal>GROUP BY</literal>. Например, мы можем получить максимум минимальной дневной температуры в разрезе городов: <placeholder-3/> <screen> city | max ---------------+----- Hayward | 37 San Francisco | 46 (2 rows) </screen> Здесь мы получаем по одной строке для каждого города. Каждый агрегатный результат вычисляется по строкам таблицы, соответствующим отдельному городу. Мы можем отфильтровать сгруппированные строки с помощью предложения <literal>HAVING</literal>: <placeholder-4/> <screen> city | max ---------+----- Hayward | 37 (1 row) </screen> Мы получаем те же результаты, но только для тех городов, где все значения <structfield>temp_lo</structfield> меньше 40. Наконец, если нас интересуют только города, названия которых начинаются с <quote><literal>S</literal></quote>, мы можем сделать: <placeholder-5/> <placeholder-6/>

source: It is important to understand the interaction between aggregates and <acronym>SQL</acronym>'s <literal>WHERE</literal> and <literal>HAVING</literal> clauses. The fundamental difference between <literal>WHERE</literal> and <literal>HAVING</literal> is this: <literal>WHERE</literal> selects input rows before groups and aggregates are computed (thus, it controls which rows go into the aggregate computation), whereas <literal>HAVING</literal> selects group rows after groups and aggregates are computed. Thus, the <literal>WHERE</literal> clause must not contain aggregate functions; it makes no sense to try to use an aggregate to determine which rows will be inputs to the aggregates. On the other hand, the <literal>HAVING</literal> clause always contains aggregate functions. (Strictly speaking, you are allowed to write a <literal>HAVING</literal> clause that doesn't use aggregates, but it's seldom useful. The same condition could be used more efficiently at the <literal>WHERE</literal> stage.)
ru: Важно понимать, как соотносятся агрегатные функции и <acronym>SQL</acronym>-предложения <literal>WHERE</literal> и <literal>HAVING</literal>. Основное отличие <literal>WHERE</literal> от <literal>HAVING</literal> заключается в том, что <literal>WHERE</literal> сначала выбирает строки, а затем группирует их и вычисляет агрегатные функции (таким образом, она отбирает строки для вычисления агрегатов), тогда как <literal>HAVING</literal> отбирает строки групп после группировки и вычисления агрегатных функций. Как следствие, предложение <literal>WHERE</literal> не должно содержать агрегатных функций; не имеет смысла использовать агрегатные функции для определения строк для вычисления агрегатных функций. Предложение <literal>HAVING</literal>, напротив, всегда содержит агрегатные функции. (Строго говоря, вы можете написать предложение <literal>HAVING</literal>, не используя агрегаты, но это редко бывает полезно. То же самое условие может работать более эффективно на стадии <literal>WHERE</literal>.)

source: In the previous example, we can apply the city name restriction in <literal>WHERE</literal>, since it needs no aggregate. This is more efficient than adding the restriction to <literal>HAVING</literal>, because we avoid doing the grouping and aggregate calculations for all rows that fail the <literal>WHERE</literal> check.
ru: В предыдущем примере мы смогли применить фильтр по названию города в предложении <literal>WHERE</literal>, так как названия не нужно агрегировать. Такой фильтр эффективнее, чем дополнительное ограничение <literal>HAVING</literal>, потому что с ним не приходится группировать и вычислять агрегаты для всех строк, не удовлетворяющих условию <literal>WHERE</literal>.

source: Updates
ru: Изменение данных

source: You can update existing rows using the <command>UPDATE</command> command. Suppose you discover the temperature readings are all off by 2 degrees after November 28. You can correct the data as follows: <placeholder-1/>
ru: Данные в существующих строках можно изменять, используя команду <command>UPDATE</command>. Например, предположим, что вы обнаружили, что все значения температуры после 28 ноября завышены на два градуса. Вы можете поправить ваши данные следующим образом: <placeholder-1/>

source: Look at the new state of the data: <placeholder-1/>
ru: Посмотрите на новое состояние данных: <placeholder-1/>

source: Deletions
ru: Удаление данных

source: Rows can be removed from a table using the <command>DELETE</command> command. Suppose you are no longer interested in the weather of Hayward. Then you can do the following to delete those rows from the table: <placeholder-1/> All weather records belonging to Hayward are removed. <placeholder-2/> <screen> city | temp_lo | temp_hi | prcp | date ---------------+---------+---------+------+------------ San Francisco | 46 | 50 | 0.25 | 1994-11-27 San Francisco | 41 | 55 | 0 | 1994-11-29 (2 rows) </screen>
ru: Строки также можно удалить из таблицы, используя команду <command>DELETE</command>. Предположим, что вас больше не интересует погода в Хейуорде. В этом случае вы можете удалить ненужные строки из таблицы: <placeholder-1/> Записи всех наблюдений, относящиеся к Хейуорду, удалены. <placeholder-2/> <screen> city | temp_lo | temp_hi | prcp | date ---------------+---------+---------+------+------------ San Francisco | 46 | 50 | 0.25 | 1994-11-27 San Francisco | 41 | 55 | 0 | 1994-11-29 (2 rows) </screen>

source: One should be wary of statements of the form <synopsis> DELETE FROM <replaceable>tablename</replaceable>; </synopsis> Without a qualification, <command>DELETE</command> will remove <emphasis>all</emphasis> rows from the given table, leaving it empty. The system will not request confirmation before doing this!
ru: Остерегайтесь операторов вида <synopsis> DELETE FROM <replaceable>имя_таблицы</replaceable>; </synopsis> Без указания условия <command>DELETE</command> удалит <emphasis>все</emphasis> строки данной таблицы, полностью очистит её. При этом система не попросит вас подтвердить операцию!
