Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/query.po
Languages: ru

source: The <acronym>SQL</acronym> Language
ru: Язык <acronym>SQL</acronym>

source: Introduction
ru: Введение

source: This chapter provides an overview of how to use <acronym>SQL</acronym> to perform simple operations. This tutorial is only intended to give you an introduction and is in no way a complete tutorial on <acronym>SQL</acronym>. Numerous books have been written on <acronym>SQL</acronym>, including <xref linkend="melt93"/> and <xref linkend="date97"/>. You should be aware that some <productname>PostgreSQL</productname> language features are extensions to the standard.
ru: В этой главе рассматривается использование <acronym>SQL</acronym> для выполнения простых операций. Она призвана только познакомить вас с <acronym>SQL</acronym>, но ни в коей мере не претендует на исчерпывающее руководство. Про <acronym>SQL</acronym> написано множество книг, включая <xref linkend="melt93"/> и <xref linkend="date97"/>. При этом следует учитывать, что некоторые возможности языка <productname>PostgreSQL</productname> являются расширениями стандарта.

source: In the examples that follow, we assume that you have created a database named <literal>mydb</literal>, as described in the previous chapter, and have been able to start <application>psql</application>.
ru: В следующих примерах мы предполагаем, что вы создали базу данных <literal>mydb</literal>, как описано в предыдущей главе, и смогли запустить <application>psql</application>.

source: Examples in this manual can also be found in the <productname>PostgreSQL</productname> source distribution in the directory <filename>src/tutorial/</filename>. (Binary distributions of <productname>PostgreSQL</productname> might not compile these files.) To use those files, first change to that directory and run <application>make</application>: <screen> <prompt>$</prompt> <userinput>cd <replaceable>....</replaceable>/src/tutorial</userinput> <prompt>$</prompt> <userinput>make</userinput> </screen> This creates the scripts and compiles the C files containing user-defined functions and types. Then, to start the tutorial, do the following: <screen> <prompt>$</prompt> <userinput>cd <replaceable>....</replaceable>/tutorial</userinput> <prompt>$</prompt> <userinput>psql -s mydb</userinput> <computeroutput> ... </computeroutput> <prompt>mydb=&gt;</prompt> <userinput>\i basics.sql</userinput> </screen> The <literal>\i</literal> command reads in commands from the specified file. <command>psql</command>'s <literal>-s</literal> option puts you in single step mode which pauses before sending each statement to the server. The commands used in this section are in the file <filename>basics.sql</filename>.
ru: Примеры этого руководства также можно найти в пакете исходного кода <productname>PostgreSQL</productname> в каталоге <filename>src/tutorial/</filename>. (Двоичные дистрибутивы <productname>PostgreSQL</productname> могут не включать эти файлы.) Чтобы использовать эти файлы, перейдите в этот каталог и запустите <application>make</application>: <screen> <prompt>$</prompt> <userinput>cd <replaceable>....</replaceable>/src/tutorial</userinput> <prompt>$</prompt> <userinput>make</userinput> </screen> При этом будут созданы скрипты и скомпилированы модули C, содержащие пользовательские функции и типы. Затем, чтобы начать работу с учебным материалом, выполните следующее: <screen> <prompt>$</prompt> <userinput>cd <replaceable>....</replaceable>/tutorial</userinput> <prompt>$</prompt> <userinput>psql -s mydb</userinput> <computeroutput> ... </computeroutput> <prompt>mydb=&gt;</prompt> <userinput>\i basics.sql</userinput> </screen> Команда <literal>\i</literal> считывает и выполняет команды из заданного файла. Переданный <command>psql</command> параметр <literal>-s</literal> переводит его в пошаговый режим, когда он делает паузу перед отправкой каждого оператора серверу. Команды, используемые в этом разделе, содержатся в файле <filename>basics.sql</filename>.

source: Concepts
ru: Основные понятия

source: <primary>relational database</primary>
ru: <primary>реляционная база данных</primary>

source: <primary>hierarchical database</primary>
ru: <primary>иерархическая база данных</primary>

source: <primary>object-oriented database</primary>
ru: <primary>объектно-ориентированная база данных</primary>

source: <primary>relation</primary>
ru: <primary>отношение</primary>

source: <primary>table</primary>
ru: <primary>таблица</primary>

source: <placeholder-1/> <placeholder-2/> <placeholder-3/> <placeholder-4/> <placeholder-5/> <productname>PostgreSQL</productname> is a <firstterm>relational database management system</firstterm> (<acronym>RDBMS</acronym>). That means it is a system for managing data stored in <firstterm>relations</firstterm>. Relation is essentially a mathematical term for <firstterm>table</firstterm>. The notion of storing data in tables is so commonplace today that it might seem inherently obvious, but there are a number of other ways of organizing databases. Files and directories on Unix-like operating systems form an example of a hierarchical database. A more modern development is the object-oriented database.
ru: <placeholder-1/> <placeholder-2/> <placeholder-3/> <placeholder-4/> <placeholder-5/> <productname>PostgreSQL</productname> &mdash; это <firstterm>реляционная система управления базами данных </firstterm> (<acronym>РСУБД</acronym>). Это означает, что это система управления данными, представленными в виде <firstterm>отношений</firstterm> (relation). Отношение &mdash; это математически точное обозначение <firstterm>таблицы</firstterm>. Хранение данных в таблицах так распространено сегодня, что это кажется самым очевидным вариантом, хотя есть множество других способов организации баз данных. Например, файлы и каталоги в Unix-подобных операционных системах образуют иерархическую базу данных, а сегодня активно развиваются объектно-ориентированные базы данных.

source: <primary>row</primary>
ru: <primary>строка</primary>

source: <primary>column</primary>
ru: <primary>столбец</primary>

source: <placeholder-1/> <placeholder-2/> Each table is a named collection of <firstterm>rows</firstterm>. Each row of a given table has the same set of named <firstterm>columns</firstterm>, and each column is of a specific data type. Whereas columns have a fixed order in each row, it is important to remember that SQL does not guarantee the order of the rows within the table in any way (although they can be explicitly sorted for display).
ru: <placeholder-1/> <placeholder-2/> Любая таблица представляет собой именованный набор <firstterm>строк</firstterm>. Все строки таблицы имеют одинаковый набор именованных <firstterm>столбцов</firstterm>, при этом каждому столбцу назначается определённый тип данных. Хотя порядок столбцов во всех строках фиксирован, важно помнить, что SQL не гарантирует какой-либо порядок строк в таблице (хотя их можно явно отсортировать при выводе).

source: <primary>database cluster</primary>
ru: <primary>кластер баз данных</primary>

source: <primary>cluster</primary><secondary>of databases</secondary><see>database cluster</see>
ru: <primary>кластер</primary> <secondary>баз данных</secondary> <see>кластер баз данных</see>

source: <placeholder-1/> <placeholder-2/> Tables are grouped into databases, and a collection of databases managed by a single <productname>PostgreSQL</productname> server instance constitutes a database <firstterm>cluster</firstterm>.
ru: <placeholder-1/> <placeholder-2/> Таблицы объединяются в базы данных, а набор баз данных, управляемый одним экземпляром сервера <productname>PostgreSQL</productname>, образует <firstterm>кластер</firstterm> баз данных.

source: Creating a New Table
ru: Создание таблицы

source: CREATE TABLE weather ( city varchar(80), temp_lo int, -- low temperature temp_hi int, -- high temperature prcp real, -- precipitation date date );
ru: CREATE TABLE weather ( city varchar(80), temp_lo int, -- минимальная температура дня temp_hi int, -- максимальная температура дня prcp real, -- уровень осадков date date );

source: You can create a new table by specifying the table name, along with all column names and their types: <placeholder-1/> You can enter this into <command>psql</command> with the line breaks. <command>psql</command> will recognize that the command is not terminated until the semicolon.
ru: Вы можете создать таблицу, указав её имя и перечислив все имена столбцов и их типы: <placeholder-1/> Весь этот текст можно ввести в <command>psql</command> вместе с символами перевода строк. <command>psql</command> понимает, что команда продолжается до точки с запятой.

source: White space (i.e., spaces, tabs, and newlines) can be used freely in SQL commands. That means you can type the command aligned differently than above, or even all on one line. Two dashes (<quote><literal>--</literal></quote>) introduce comments. Whatever follows them is ignored up to the end of the line. SQL is case insensitive about key words and identifiers, except when identifiers are double-quoted to preserve the case (not done above).
ru: В командах SQL можно свободно использовать пробельные символы (пробелы, табуляции и переводы строк). Это значит, что вы можете ввести команду, выровняв её по-другому или даже уместив в одной строке. Два минуса (<quote><literal>--</literal></quote>) обозначают начало комментария. Всё, что идёт за ними до конца строки, игнорируется. SQL не чувствителен к регистру в ключевых словах и идентификаторах, за исключением идентификаторов, взятых в кавычки (в данном случае это не так).

source: <type>varchar(80)</type> specifies a data type that can store arbitrary character strings up to 80 characters in length. <type>int</type> is the normal integer type. <type>real</type> is a type for storing single precision floating-point numbers. <type>date</type> should be self-explanatory. (Yes, the column of type <type>date</type> is also named <structfield>date</structfield>. This might be convenient or confusing &mdash; you choose.)
ru: <type>varchar(80)</type> определяет тип данных, допускающий хранение произвольных символьных строк длиной до 80 символов. <type>int</type> &mdash; обычный целочисленный тип. <type>real</type> &mdash; тип для хранения чисел с плавающей точкой одинарной точности. <type>date</type> &mdash; тип даты. (Да, столбец типа <type>date</type> также называется <structfield>date</structfield>. Это может быть удобно или вводить в заблуждение &mdash; как посмотреть.)

source: <productname>PostgreSQL</productname> supports the standard <acronym>SQL</acronym> types <type>int</type>, <type>smallint</type>, <type>real</type>, <type>double precision</type>, <type>char(<replaceable>N</replaceable>)</type>, <type>varchar(<replaceable>N</replaceable>)</type>, <type>date</type>, <type>time</type>, <type>timestamp</type>, and <type>interval</type>, as well as other types of general utility and a rich set of geometric types. <productname>PostgreSQL</productname> can be customized with an arbitrary number of user-defined data types. Consequently, type names are not key words in the syntax, except where required to support special cases in the <acronym>SQL</acronym> standard.
ru: <productname>PostgreSQL</productname> поддерживает стандартные типы <acronym>SQL</acronym>: <type>int</type>, <type>smallint</type>, <type>real</type>, <type>double precision</type>, <type>char(<replaceable>N</replaceable>)</type>, <type>varchar(<replaceable>N</replaceable>)</type>, <type>date</type>, <type>time</type>, <type>timestamp</type> и <type>interval</type>, а также другие универсальные типы и богатый набор геометрических типов. Кроме того, <productname>PostgreSQL</productname> можно расширять, создавая набор собственных типов данных. Как следствие, имена типов не являются ключевыми словами в данной записи, кроме тех случаев, когда это требуется для реализации особых конструкций стандарта <acronym>SQL</acronym>.

source: The second example will store cities and their associated geographical location: <placeholder-1/> The <type>point</type> type is an example of a <productname>PostgreSQL</productname>-specific data type.
ru: Во втором примере мы сохраним в таблице города и их географическое положение: <placeholder-1/> Здесь <type>point</type> &mdash; пример специфического типа данных <productname>PostgreSQL</productname>.

source: <placeholder-1/> Finally, it should be mentioned that if you don't need a table any longer or want to recreate it differently you can remove it using the following command: <synopsis> DROP TABLE <replaceable>tablename</replaceable>; </synopsis>
ru: <placeholder-1/> Наконец, следует сказать, что если вам больше не нужна какая-либо таблица, или вы хотите пересоздать её по-другому, вы можете удалить её, используя следующую команду: <synopsis> DROP TABLE <replaceable>имя_таблицы</replaceable>; </synopsis>

source: Populating a Table With Rows
ru: Добавление строк в таблицу

source: The <command>INSERT</command> statement is used to populate a table with rows: <placeholder-1/> Note that all data types use rather obvious input formats. Constants that are not simple numeric values usually must be surrounded by single quotes (<literal>'</literal>), as in the example. The <type>date</type> type is actually quite flexible in what it accepts, but for this tutorial we will stick to the unambiguous format shown here.
ru: Для добавления строк в таблицу используется оператор <command>INSERT</command>: <placeholder-1/> Заметьте, что для всех типов данных применяются довольно очевидные форматы. Константы, за исключением простых числовых значений, обычно заключаются в апострофы (<literal>'</literal>), как в данном примере. Тип <type>date</type> на самом деле очень гибок и принимает разные форматы, но в данном введении мы будем придерживаться простого и однозначного.

source: The <type>point</type> type requires a coordinate pair as input, as shown here: <placeholder-1/>
ru: Тип <type>point</type> требует ввода пары координат, например таким образом: <placeholder-1/>

source: The syntax used so far requires you to remember the order of the columns. An alternative syntax allows you to list the columns explicitly: <placeholder-1/> You can list the columns in a different order if you wish or even omit some columns, e.g., if the precipitation is unknown: <placeholder-2/> Many developers consider explicitly listing the columns better style than relying on the order implicitly.
ru: Показанный здесь синтаксис требует, чтобы вы запомнили порядок столбцов. Можно также применить альтернативную запись, перечислив столбцы явно: <placeholder-1/>Вы можете перечислить столбцы в другом порядке, если желаете опустить некоторые из них, например, если уровень осадков (столбец prcp) неизвестен: <placeholder-2/> Многие разработчики предпочитают явно перечислять столбцы, а не полагаться на их порядок в таблице.

source: Please enter all the commands shown above so you have some data to work with in the following sections.
ru: Пожалуйста, введите все показанные выше команды, чтобы у вас были данные, с которыми можно будет работать дальше.

source: <placeholder-1/> You could also have used <command>COPY</command> to load large amounts of data from flat-text files. This is usually faster because the <command>COPY</command> command is optimized for this application while allowing less flexibility than <command>INSERT</command>. An example would be: <placeholder-2/> where the file name for the source file must be available on the machine running the backend process, not the client, since the backend process reads the file directly. You can read more about the <command>COPY</command> command in <xref linkend="sql-copy"/>.
ru: <placeholder-1/> Вы также можете загрузить большой объём данных из обычных текстовых файлов, применив команду <command>COPY</command>. Обычно это будет быстрее, так как команда <command>COPY</command> оптимизирована для такого применения, хотя и менее гибка, чем <command>INSERT</command>. Например, её можно использовать так: <placeholder-2/> здесь подразумевается, что данный файл доступен на компьютере, где работает серверный процесс, а не на клиенте, так как указанный файл будет прочитан непосредственно на сервере. Подробнее об этом вы можете узнать в описании команды <xref linkend="sql-copy"/>.

source: Querying a Table
ru: Выполнение запроса

source: <primary>query</primary>
ru: <primary>запрос</primary>

source: While <literal>SELECT *</literal> is useful for off-the-cuff queries, it is widely considered bad style in production code, since adding a column to the table would change the results.
ru: Хотя запросы <literal>SELECT *</literal> часто пишут экспромтом, это считается плохим стилем в производственном коде, так как результат таких запросов будет меняться при добавлении новых столбцов.

source: <placeholder-1/> <placeholder-2/> To retrieve data from a table, the table is <firstterm>queried</firstterm>. An <acronym>SQL</acronym> <command>SELECT</command> statement is used to do this. The statement is divided into a select list (the part that lists the columns to be returned), a table list (the part that lists the tables from which to retrieve the data), and an optional qualification (the part that specifies any restrictions). For example, to retrieve all the rows of table <structname>weather</structname>, type: <placeholder-3/> Here <literal>*</literal> is a shorthand for <quote>all columns</quote>. <placeholder-4/> So the same result would be had with: <placeholder-5/> The output should be: <screen> city | temp_lo | temp_hi | prcp | date ---------------+---------+---------+------+------------ San Francisco | 46 | 50 | 0.25 | 1994-11-27 San Francisco | 43 | 57 | 0 | 1994-11-29 Hayward | 37 | 54 | | 1994-11-29 (3 rows) </screen>
ru: <placeholder-1/> <placeholder-2/> Чтобы получить данные из таблицы, нужно выполнить <firstterm>запрос</firstterm>. Для этого предназначен <acronym>SQL</acronym>-оператор <command>SELECT</command>. Он состоит из нескольких частей: выборки (в которой перечисляются столбцы, которые должны быть получены), списка таблиц (в нём перечисляются таблицы, из которых будут получены данные) и необязательного условия (определяющего ограничения). Например, чтобы получить все строки таблицы <structname>weather</structname>, введите: <placeholder-3/> Здесь <literal>*</literal> &mdash; это краткое обозначение <quote>всех столбцов</quote>. <placeholder-4/> Таким образом, это равносильно записи: <placeholder-5/> В результате должно получиться: <screen> city | temp_lo | temp_hi | prcp | date ---------------+---------+---------+------+------------ San Francisco | 46 | 50 | 0.25 | 1994-11-27 San Francisco | 43 | 57 | 0 | 1994-11-29 Hayward | 37 | 54 | | 1994-11-29 (3 rows) </screen>

source: You can write expressions, not just simple column references, in the select list. For example, you can do: <placeholder-1/> This should give: <screen> city | temp_avg | date ---------------+----------+------------ San Francisco | 48 | 1994-11-27 San Francisco | 50 | 1994-11-29 Hayward | 45 | 1994-11-29 (3 rows) </screen> Notice how the <literal>AS</literal> clause is used to relabel the output column. (The <literal>AS</literal> clause is optional.)
ru: В списке выборки вы можете писать не только ссылки на столбцы, но и выражения. Например, вы можете написать: <placeholder-1/> И получить в результате: <screen> city | temp_avg | date ---------------+----------+------------ San Francisco | 48 | 1994-11-27 San Francisco | 50 | 1994-11-29 Hayward | 45 | 1994-11-29 (3 rows) </screen> Обратите внимание, как предложение <literal>AS</literal> позволяет переименовать выходной столбец. (Само слово <literal>AS</literal> можно опускать.)

source: A query can be <quote>qualified</quote> by adding a <literal>WHERE</literal> clause that specifies which rows are wanted. The <literal>WHERE</literal> clause contains a Boolean (truth value) expression, and only rows for which the Boolean expression is true are returned. The usual Boolean operators (<literal>AND</literal>, <literal>OR</literal>, and <literal>NOT</literal>) are allowed in the qualification. For example, the following retrieves the weather of San Francisco on rainy days: <placeholder-1/> Result: <screen> city | temp_lo | temp_hi | prcp | date ---------------+---------+---------+------+------------ San Francisco | 46 | 50 | 0.25 | 1994-11-27 (1 row) </screen>
ru: Запрос можно дополнить <quote>условием</quote>, добавив предложение <literal>WHERE</literal>, ограничивающее множество возвращаемых строк. В предложении <literal>WHERE</literal> указывается логическое выражение (проверка истинности), которое служит фильтром строк: в результате оказываются только те строки, для которых это выражение истинно. В этом выражении могут присутствовать обычные логические операторы (<literal>AND</literal>, <literal>OR</literal> и <literal>NOT</literal>). Например, следующий запрос покажет, какая погода была в Сан-Франциско в дождливые дни: <placeholder-1/> Результат: <screen> city | temp_lo | temp_hi | prcp | date ---------------+---------+---------+------+------------ San Francisco | 46 | 50 | 0.25 | 1994-11-27 (1 row) </screen>

source: <placeholder-1/> You can request that the results of a query be returned in sorted order: <placeholder-2/> <screen> city | temp_lo | temp_hi | prcp | date ---------------+---------+---------+------+------------ Hayward | 37 | 54 | | 1994-11-29 San Francisco | 43 | 57 | 0 | 1994-11-29 San Francisco | 46 | 50 | 0.25 | 1994-11-27 </screen> In this example, the sort order isn't fully specified, and so you might get the San Francisco rows in either order. But you'd always get the results shown above if you do: <placeholder-3/>
ru: <placeholder-1/> Вы можете получить результаты запроса в определённом порядке: <placeholder-2/> <screen> city | temp_lo | temp_hi | prcp | date ---------------+---------+---------+------+------------ Hayward | 37 | 54 | | 1994-11-29 San Francisco | 43 | 57 | 0 | 1994-11-29 San Francisco | 46 | 50 | 0.25 | 1994-11-27 </screen> В этом примере порядок сортировки определён не полностью, поэтому вы можете получить строки Сан-Франциско в любом порядке. Но вы всегда получите результат, показанный выше, если напишете: <placeholder-3/>

source: <primary>duplicate</primary>
ru: <primary>дублирование</primary>

source: In some database systems, including older versions of <productname>PostgreSQL</productname>, the implementation of <literal>DISTINCT</literal> automatically orders the rows and so <literal>ORDER BY</literal> is unnecessary. But this is not required by the SQL standard, and current <productname>PostgreSQL</productname> does not guarantee that <literal>DISTINCT</literal> causes the rows to be ordered.
ru: В некоторых СУБД, включая старые версии <productname>PostgreSQL</productname>, реализация предложения <literal>DISTINCT</literal> автоматически упорядочивает строки, так что <literal>ORDER BY</literal> добавлять не обязательно. Но стандарт SQL этого не требует и текущая версия <productname>PostgreSQL</productname> не гарантирует определённого порядка строк после <literal>DISTINCT</literal>.

source: <placeholder-1/> <placeholder-2/> You can request that duplicate rows be removed from the result of a query: <placeholder-3/> <screen> city --------------- Hayward San Francisco (2 rows) </screen> Here again, the result row ordering might vary. You can ensure consistent results by using <literal>DISTINCT</literal> and <literal>ORDER BY</literal> together: <placeholder-4/> <placeholder-5/>
ru: <placeholder-1/> <placeholder-2/> Если требуется, вы можете убрать дублирующиеся строки из результата запроса: <placeholder-3/> <screen> city --------------- Hayward San Francisco (2 rows) </screen> И здесь порядок строк также может варьироваться. Чтобы получать неизменные результаты, соедините предложения <literal>DISTINCT</literal> и <literal>ORDER BY</literal>: <placeholder-4/> <placeholder-5/>
