Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/reference.po
Languages: ru

source: Reference
ru: Справочное руководство

source: The entries in this Reference are meant to provide in reasonable length an authoritative, complete, and formal summary about their respective subjects. More information about the use of <productname>PostgreSQL</productname>, in narrative, tutorial, or example form, can be found in other parts of this book. See the cross-references listed on each reference page.
ru: Статьи этого справочного руководства составлены так, чтобы дать в разумном объёме авторитетную, полную и формальную сводку по соответствующим темам. Дополнительные сведения об использовании <productname>PostgreSQL</productname> в повествовательной, ознакомительной или показательной форме можно найти в других частях этой книги. Ссылки на них можно найти на страницах этого руководства.

source: The reference entries are also available as traditional <quote>man</quote> pages.
ru: Все эти справочные статьи также публикуются в виде традиционных страниц <quote>man</quote>.

source: SQL Commands
ru: Команды SQL

source: This part contains reference information for the <acronym>SQL</acronym> commands supported by <productname>PostgreSQL</productname>. By <quote>SQL</quote> the language in general is meant; information about the standards conformance and compatibility of each command can be found on the respective reference page.
ru: Эта часть документации содержит справочную информацию по командам <acronym>SQL</acronym>, поддерживаемым <productname>PostgreSQL</productname>. Под <quote>SQL</quote> здесь понимается язык вообще; сведения о соответствии стандартам и совместимости всех команд приведены на соответствующих страниц справочника.

source: PostgreSQL Client Applications
ru: Клиентские приложения PostgreSQL

source: This part contains reference information for <productname>PostgreSQL</productname> client applications and utilities. Not all of these commands are of general utility; some might require special privileges. The common feature of these applications is that they can be run on any host, independent of where the database server resides.
ru: Раздел описывает клиентские приложения и утилиты <productname>PostgreSQL</productname>. Некоторые из описанных приложений требуют особые привилегии. Основной отличительной особенностью этих приложений является возможность исполнения на любом компьютере, независимо от расположения сервера баз данных.

source: When specified on the command line, user and database names have their case preserved &mdash; the presence of spaces or special characters might require quoting. Table names and other identifiers do not have their case preserved, except where documented, and might require quoting.
ru: Имя пользователя и базы данных передаются из командной строки на сервер без изменения регистра &mdash; все пробельные и специальные символы необходимо экранировать с помощью кавычек. Имена таблиц и другие идентификаторы передаются регистр-независимо, за исключением отдельно описанных ситуаций, где может требоваться экранирование.

source: PostgreSQL Server Applications
ru: Серверные приложения PostgreSQL

source: This part contains reference information for <productname>PostgreSQL</productname> server applications and support utilities. These commands can only be run usefully on the host where the database server resides. Other utility programs are listed in <xref linkend="reference-client"/>.
ru: В этой части содержится справочная информация о серверных приложениях и вспомогательных утилитах <productname>PostgreSQL</productname>. Описываемые команды могут быть полезны только на том компьютере, где работает сервер баз данных. Другие утилиты рассмотрены в <xref remap="6" linkend="reference-client"/>.
