Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/release-10.po
Languages: ru

source: Prevent unnecessary checkpoints and <acronym>WAL</acronym> archiving on otherwise-idle systems (Michael Paquier)
ru: Предотвращение ненужных контрольных точек и архивации <acronym>WAL</acronym> в простаивающих системах (Мишель Пакье)

source: Add <xref linkend="guc-wal-consistency-checking"/> server parameter to add details to <acronym>WAL</acronym> that can be sanity-checked on the standby (Kuntal Ghosh, Robert Haas)
ru: Добавление серверного параметра <xref linkend="guc-wal-consistency-checking"/> для внесения в <acronym>WAL</acronym> информации, позволяющей проверять целостность на ведомом сервере (Кунтал Гхош, Роберт Хаас)

source: Any sanity-check failure generates a fatal error on the standby.
ru: В случае выявления любого нарушения при проверке целостности на ведомом сервере выдаётся критическая ошибка.

source: Increase the maximum configurable <acronym>WAL</acronym> segment size to one gigabyte (Beena Emerson)
ru: Увеличение максимально допустимого размера сегмента <acronym>WAL</acronym> до одного гигабайта (Бина Емерсон)

source: A larger <acronym>WAL</acronym> segment size allows for fewer <xref linkend="guc-archive-command"/> invocations and fewer <acronym>WAL</acronym> files to manage.
ru: Увеличивая размер сегментов <acronym>WAL</acronym>, можно сократить частоту вызова <xref linkend="guc-archive-command"/> и уменьшить число файлов <acronym>WAL</acronym>.

source: Replication and Recovery
ru: Репликация и восстановление

source: Add the ability to <link linkend="logical-replication">logically replicate</link> tables to standby servers (Petr Jelinek)
ru: Реализация возможности <link linkend="logical-replication">логически реплицировать</link> таблицы на подчинённые серверы (Петр Желинек)

source: Logical replication allows more flexibility than physical replication does, including replication between different major versions of <productname>PostgreSQL</productname> and selective replication.
ru: Логическая репликация даёт большую гибкость, чем физическая; в том числе позволяет организовывать репликацию между разными основными версиями <productname>PostgreSQL</productname>, а также избирательную репликацию.

source: Allow waiting for commit acknowledgement from standby servers irrespective of the order they appear in <xref linkend="guc-synchronous-standby-names"/> (Masahiko Sawada)
ru: Возможность ожидания подтверждения фиксации от ведомых серверов вне зависимости от их порядка в списке <xref linkend="guc-synchronous-standby-names"/> (Масахико Савада)

source: Previously the server always waited for the active standbys that appeared first in <varname>synchronous_standby_names</varname>. The new <varname>synchronous_standby_names</varname> keyword <literal>ANY</literal> allows waiting for any number of standbys irrespective of their ordering. This is known as quorum commit.
ru: Ранее сервер всегда ожидал ответа от активных ведомых серверов, стоящих первыми в списке <varname>synchronous_standby_names</varname>. Новое ключевое слово <literal>ANY</literal> в <varname>synchronous_standby_names</varname> позволяет выбрать ожидание любого числа серверов, вне зависимости от их порядка. Это называется фиксацией на основе кворума.

source: Reduce configuration changes necessary to perform streaming backup and replication (Magnus Hagander, Dang Minh Huong)
ru: Упрощение изменений конфигурации, которые необходимо внести для организации потокового копирования и репликации (Магнус Хагандер, Дан Мин Хыонг)

source: Specifically, the defaults were changed for <xref linkend="guc-wal-level"/>, <xref linkend="guc-max-wal-senders"/>, <xref linkend="guc-max-replication-slots"/>, and <xref linkend="guc-hot-standby"/> to make them suitable for these usages out-of-the-box.
ru: В частности, были изменены значения по умолчанию для параметров <xref linkend="guc-wal-level"/>, <xref linkend="guc-max-wal-senders"/>, <xref linkend="guc-max-replication-slots"/> и <xref linkend="guc-hot-standby"/>, чтобы они были пригодны для такого использования в исходном состоянии.

source: Enable replication from localhost connections by default in <link linkend="auth-pg-hba-conf"><filename>pg_hba.conf</filename></link> (Michael Paquier)
ru: По умолчанию репликация разрешается для локальных подключений в <link linkend="auth-pg-hba-conf"><filename>pg_hba.conf</filename></link> (Мишель Пакье)

source: Previously <filename>pg_hba.conf</filename>'s replication connection lines were commented out by default. This is particularly useful for <application><xref linkend="app-pgbasebackup"/></application>.
ru: Ранее строки для подключений репликации в <filename>pg_hba.conf</filename> по умолчанию были закомментированы. Это особенно полезно для <application><xref linkend="app-pgbasebackup"/></application>.

source: Add columns to <link linkend="monitoring-stats-views-table"><structname>pg_stat_replication</structname></link> to report replication delay times (Thomas Munro)
ru: Добавление в <link linkend="monitoring-stats-views-table"><structname>pg_stat_replication</structname></link> столбцов с информацией о задержках репликации (Томас Мунро)

source: The new columns are <structfield>write_lag</structfield>, <structfield>flush_lag</structfield>, and <structfield>replay_lag</structfield>.
ru: Новые столбцы называются <structfield>write_lag</structfield>, <structfield>flush_lag</structfield> и <structfield>replay_lag</structfield>.

source: Allow specification of the recovery stopping point by Log Sequence Number (<acronym>LSN</acronym>) in <link linkend="recovery-config"><filename>recovery.conf</filename></link> (Michael Paquier)
ru: Возможность указания точки остановки восстановления по <acronym>LSN</acronym> (последовательному номеру в журнале) в <link linkend="recovery-config"><filename>recovery.conf</filename></link> (Мишель Пакье)

source: Previously the stopping point could only be selected by timestamp or XID.
ru: Ранее точку остановки можно было задать только по времени или идентификатору транзакции.

source: Allow users to disable <link linkend="functions-admin"><function>pg_stop_backup()</function></link>'s waiting for all <acronym>WAL</acronym> to be archived (David Steele)
ru: Предоставление пользователям возможности отключить в функции <link linkend="functions-admin"><function>pg_stop_backup()</function></link> ожидание архивации всех файлов <acronym>WAL</acronym> (Дэвид Стил)

source: An optional second argument to <function>pg_stop_backup()</function> controls that behavior.
ru: Этим поведением управляет необязательный второй аргумент функции <function>pg_stop_backup()</function>.

source: Allow creation of <link linkend="functions-replication-table">temporary replication slots</link> (Petr Jelinek)
ru: Возможность создания <link linkend="functions-replication-table">временных слотов репликации</link> (Петр Желинек)

source: Temporary slots are automatically removed on session exit or error.
ru: Временные слоты автоматически удаляются при завершении сеанса или при ошибке.

source: Improve performance of hot standby replay with better tracking of Access Exclusive locks (Simon Riggs, David Rowley)
ru: Увеличение производительности воспроизведения в режиме горячего резерва благодаря оптимизации обработки исключительных блокировок (Саймон Риггс, Дэвид Роули)

source: Speed up two-phase commit recovery performance (Stas Kelvich, Nikhil Sontakke, Michael Paquier)
ru: Ускорение восстановления при двухфазной фиксации (Стас Кельвич, Никхил Сонтакке, Мишель Пакье)

source: Queries
ru: Запросы

source: Add <link linkend="functions-xml-processing-xmltable"><function>XMLTABLE</function></link> function that converts <type>XML</type>-formatted data into a row set (Pavel Stehule, &Aacute;lvaro Herrera)
ru: Добавление функции <link linkend="functions-xml-processing-xmltable"><function>XMLTABLE</function></link>, преобразующей данные в формате <type>XML</type> в набор табличных строк (Павел Стехуле, Альваро Эррера)

source: Allow standard row constructor syntax in <literal>UPDATE ... SET (<replaceable>column_list</replaceable>) = <replaceable>row_constructor</replaceable></literal> (Tom Lane)
ru: Поддержка стандартного синтаксиса конструктора строки в <literal>UPDATE ... SET (<replaceable>список_столбцов</replaceable>) = <replaceable>конструктор_строки</replaceable></literal> (Том Лейн)

source: The <replaceable>row_constructor</replaceable> can now begin with the keyword <literal>ROW</literal>; previously that had to be omitted. Also, an occurrence of <literal><replaceable>table_name</replaceable>.*</literal> within the <replaceable>row_constructor</replaceable> is now expanded into multiple columns, as in other uses of <replaceable>row_constructor</replaceable>s.
ru: Теперь <replaceable>конструктор_строки</replaceable> может начинаться со слова <literal>ROW</literal>; ранее его надо было опускать. Также запись <literal><replaceable>имя_таблицы</replaceable>.*</literal> в <replaceable>конструкторе_строки</replaceable> теперь разворачивается в набор столбцов, как и в других случаях использования <replaceable>конструктора_строки</replaceable>.

source: Fix regular expressions' character class handling for large character codes, particularly Unicode characters above <literal>U+7FF</literal> (Tom Lane)
ru: Исправление обработки в регулярных выражениях классов символов для символов с большими кодами, в частности, для символов Unicode больше <literal>U+7FF</literal> (Том Лейн)

source: Previously, such characters were never recognized as belonging to locale-dependent character classes such as <literal>[[:alpha:]]</literal>.
ru: Ранее такие символы никогда не воспринимались как принадлежащие классам, зависящим от локали, например <literal>[[:alpha:]]</literal>.

source: Utility Commands
ru: Служебные команды

source: Add table <link linkend="sql-createtable-partition">partitioning syntax</link> that automatically creates partition constraints and handles routing of tuple insertions and updates (Amit Langote)
ru: Добавление <link linkend="sql-createtable-partition">синтаксиса секционирования</link> для автоматического создания ограничений секций и распределения операций добавления и изменения кортежей (Амит Ланготе)

source: The syntax supports range and list partitioning.
ru: Этот синтаксис поддерживает секционирование по спискам и по диапазонам.

source: Add <link linkend="sql-createtrigger"><literal>AFTER</literal> trigger</link> transition tables to record changed rows (Kevin Grittner, Thomas Munro)
ru: Добавление для <link linkend="sql-createtrigger">триггеров <literal>AFTER</literal></link> переходных таблиц, содержащих изменённые строки (Кевин Гриттнер, Томас Мунро)

source: Transition tables are accessible from triggers written in server-side languages.
ru: Содержимое переходных таблиц доступно в триггерах, написанных на языках программирования на стороне сервера.

source: Allow <link linkend="sql-createpolicy">restrictive row-level security policies</link> (Stephen Frost)
ru: Реализация <link linkend="sql-createpolicy">ограничительных политик защиты на уровне строк</link> (Стивен Фрост)

source: Previously all security policies were permissive, meaning that any matching policy allowed access. A restrictive policy must match for access to be granted. These policy types can be combined.
ru: Ранее все политики были разрешительными, то есть при выполнении условия любой политики доступ разрешался. Но теперь при невыполнении ограничительной политики доступ будет запрещён. Эти типы политик можно комбинировать вместе.

source: When creating a foreign-key constraint, check for <literal>REFERENCES</literal> permission on only the referenced table (Tom Lane)
ru: При создании ограничения внешнего ключа разрешение <literal>REFERENCES</literal> должно требоваться только для целевой таблицы (Том Лейн)

source: Previously <literal>REFERENCES</literal> permission on the referencing table was also required. This appears to have stemmed from a misreading of the SQL standard. Since creating a foreign key (or any other type of) constraint requires ownership privilege on the constrained table, additionally requiring <literal>REFERENCES</literal> permission seems rather pointless.
ru: Ранее также требовалось разрешение <literal>REFERENCES</literal> в таблице внешнего ключа. Это требование было реализовано из-за недопонимания SQL-стандарта. Так как для создания в таблице ограничения внешнего ключа (или подобного) требуются иметь права владельца этой таблицы, дополнительное требование разрешения <literal>REFERENCES</literal> кажется довольно бессмысленным.

source: Allow <link linkend="sql-alterdefaultprivileges">default permissions</link> on schemas (Matheus Oliveira)
ru: Реализация <link linkend="sql-alterdefaultprivileges">прав по умолчанию</link> для схем (Матеус Оливейра)

source: This is done using the <literal>ALTER DEFAULT PRIVILEGES</literal> command.
ru: Эти права задаются командой <literal>ALTER DEFAULT PRIVILEGES</literal>.

source: Add <link linkend="sql-createsequence"><command>CREATE SEQUENCE AS</command></link> command to create a sequence matching an integer data type (Peter Eisentraut)
ru: Добавление команды <link linkend="sql-createsequence"><command>CREATE SEQUENCE AS</command></link> для создания последовательностей определённого целочисленного типа данных (Питер Эйзентраут)

source: This simplifies the creation of sequences matching the range of base columns.
ru: Это упрощает создание последовательностей с интервалом значений, соответствующим типу базовых столбцов.

source: Allow <literal>COPY <replaceable>view</replaceable> FROM <replaceable>source</replaceable></literal> on views with <literal>INSTEAD INSERT</literal> triggers (Haribabu Kommi)
ru: Поддержка команды <literal>COPY <replaceable>представление</replaceable> FROM <replaceable>источник</replaceable></literal> для представлений с триггерами <literal>INSTEAD INSERT</literal> (Харибабу Комми)

source: The triggers are fed the data rows read by <command>COPY</command>.
ru: Триггеры получают строки данных, которые читает команда <command>COPY</command>.

source: Allow the specification of a function name without arguments in <acronym>DDL</acronym> commands, if it is unique (Peter Eisentraut)
ru: Допущение указания имени функции без аргументов в командах <acronym>DDL</acronym>, если это имя уникально (Питер Эйзентраут)

source: For example, allow <link linkend="sql-dropfunction"><command>DROP FUNCTION</command></link> on a function name without arguments if there is only one function with that name. This behavior is required by the <acronym>SQL</acronym> standard.
ru: Например, теперь допускается указание <link linkend="sql-dropfunction"><command>DROP FUNCTION</command></link> с именем функции без аргументов, если существует только одна функция с таким именем. Такое поведение требуется стандартом <acronym>SQL</acronym>.

source: Allow multiple functions, operators, and aggregates to be dropped with a single <command>DROP</command> command (Peter Eisentraut)
ru: Реализация возможности удалять несколько функций, операторов и агрегатов одной командой <command>DROP</command> (Питер Эйзентраут)

source: Support <literal>IF NOT EXISTS</literal> in <link linkend="sql-createserver"><command>CREATE SERVER</command></link>, <link linkend="sql-createusermapping"><command>CREATE USER MAPPING</command></link>, and <link linkend="sql-createcollation"><command>CREATE COLLATION</command></link> (Anastasia Lubennikova, Peter Eisentraut)
ru: Поддержка предложения <literal>IF NOT EXISTS</literal> в командах <link linkend="sql-createserver"><command>CREATE SERVER</command></link>, <link linkend="sql-createusermapping"><command>CREATE USER MAPPING</command></link> и <link linkend="sql-createcollation"><command>CREATE COLLATION</command></link> (Анастасия Лубенникова, Питер Эйзентраут)

source: Make <link linkend="sql-vacuum"><command>VACUUM VERBOSE</command></link> report the number of skipped frozen pages and oldest xmin (Masahiko Sawada, Simon Riggs)
ru: Добавление в вывод <link linkend="sql-vacuum"><command>VACUUM VERBOSE</command></link> количества пропущенных замороженных страниц и старейшего xmin (Масахико Савада, Саймон Риггс)

source: This information is also included in <xref linkend="guc-log-autovacuum-min-duration"/> output.
ru: Эта информация также включается в вывод с <xref linkend="guc-log-autovacuum-min-duration"/>.

source: Improve speed of <command>VACUUM</command>'s removal of trailing empty heap pages (Claudio Freire, &Aacute;lvaro Herrera)
ru: Ускорение удаления конечных пустых страниц кучи в процессе операции <command>VACUUM</command> (Клаудио Фрейре, Альваро Эррера)

source: Data Types
ru: Типы данных

source: Add full text search support for <type>JSON</type> and <type>JSONB</type> (Dmitry Dolgov)
ru: Добавление поддержки полнотекстового поиска для типов <type>JSON</type> и <type>JSONB</type> (Дмитрий Долгов)

source: The functions <function>ts_headline()</function> and <function>to_tsvector()</function> can now be used on these data types.
ru: С этими типами данных теперь могут использоваться функции <function>ts_headline()</function> и <function>to_tsvector()</function>.

source: Add support for <acronym>EUI-64</acronym> <acronym>MAC</acronym> addresses, as a new data type <link linkend="datatype-macaddr8"><type>macaddr8</type></link> (Haribabu Kommi)
ru: Добавление поддержки <acronym>MAC</acronym>-адресов <acronym>EUI-64</acronym> в виде нового типа данных <link linkend="datatype-macaddr8"><type>macaddr8</type></link> (Харибабу Комми)

source: This complements the existing support for <acronym>EUI-48</acronym> <acronym>MAC</acronym> addresses (type <type>macaddr</type>).
ru: Этот тип дополняет ранее реализованную поддержку <acronym>MAC</acronym>-адресов <acronym>EUI-48</acronym> (тип <type>macaddr</type>).

source: Add <link linkend="sql-createtable">identity columns</link> for assigning a numeric value to columns on insert (Peter Eisentraut)
ru: Добавление <link linkend="sql-createtable">столбцов идентификации</link> для назначения числовых значений столбцам при добавлении данных (Питер Эйзентраут)

source: These are similar to <type>SERIAL</type> columns, but are <acronym>SQL</acronym> standard compliant.
ru: Этот механизм подобен столбцам <type>SERIAL</type>, но соответствует стандарту <acronym>SQL</acronym>.

source: Allow <link linkend="datatype-enum"><type>ENUM</type></link> values to be renamed (Dagfinn Ilmari Manns&aring;ker)
ru: Реализация возможности переименовывать значения <link linkend="datatype-enum"><type>ENUM</type></link> (Дагфинн Ильмари Маннсакер)

source: This uses the syntax <link linkend="sql-altertype"><command>ALTER TYPE ... RENAME VALUE</command></link>.
ru: Для этого используется синтаксис <link linkend="sql-altertype"><command>ALTER TYPE ... RENAME VALUE</command></link>.

source: Properly treat array pseudotypes (<type>anyarray</type>) as arrays in <link linkend="functions-json-creation-table"><function>to_json()</function></link> and <function>to_jsonb()</function> (Andrew Dunstan)
ru: Исправление обращения с псевдотипами массивов (<type>anyarray</type>) как с массивами в функциях <link linkend="functions-json-creation-table"><function>to_json()</function></link> и <function>to_jsonb()</function> (Эндрю Дунстан)

source: Previously columns declared as <type>anyarray</type> (particularly those in the <structname>pg_stats</structname> view) were converted to <type>JSON</type> strings rather than arrays.
ru: Ранее столбцы, объявленные как <type>anyarray</type>, (в частности, столбцы в представлении <structname>pg_stats</structname>) преобразовывались не в массивы, а в строки <type>JSON</type>.

source: Add operators for multiplication and division of <link linkend="datatype-money"><type>money</type></link> values with <type>int8</type> values (Peter Eisentraut)
ru: Добавление операторов для умножения и деления значений <link linkend="datatype-money"><type>money</type></link> на значения <type>int8</type> (Питер Эйзентраут)

source: Previously such cases would result in converting the <type>int8</type> values to <type>float8</type> and then using the <type>money</type>-and-<type>float8</type> operators. The new behavior avoids possible precision loss. But note that division of <type>money</type> by <type>int8</type> now truncates the quotient, like other integer-division cases, while the previous behavior would have rounded.
ru: Ранее в таких случаях значения <type>int8</type> приводились к типу <type>float8</type>, а затем использовались операторы <type>money</type>-и-<type>float8</type>. Новое поведение предупреждает возможную потерю точности. Но заметьте, что при делении <type>money</type> на <type>int8</type> теперь дробная часть отбрасывается, как и в других случаях целочисленного деления, тогда как ранее происходило округление.

source: Check for overflow in the <type>money</type> type's input function (Peter Eisentraut)
ru: Проверка переполнения в функции ввода типа <type>money</type> (Питер Эйзентраут)

source: Functions
ru: Функции

source: Add simplified <link linkend="functions-posix-regexp"><function>regexp_match()</function></link> function (Emre Hasegeli)
ru: Добавление упрощённой функции <link linkend="functions-posix-regexp"><function>regexp_match()</function></link> (Эмре Хасегели)

source: This is similar to <function>regexp_matches()</function>, but it only returns results from the first match so it does not need to return a set, making it easier to use for simple cases.
ru: Эта функция подобна <function>regexp_matches()</function>, но возвращает только результаты первого вхождения, поэтому для её результата не требуется множество, так что её удобнее использовать в простых случаях.

source: Add a version of <type>jsonb</type>'s <link linkend="functions-jsonb-op-table">delete operator</link> that takes an array of keys to delete (Magnus Hagander)
ru: Новая версия <link linkend="functions-jsonb-op-table">оператора удаления</link> для <type>jsonb</type>, принимающая массив ключей для удаления (Магнус Хагандер)

source: Make <link linkend="functions-json-processing-table"><function>json_populate_record()</function></link> and related functions process JSON arrays and objects recursively (Nikita Glukhov)
ru: Реализация рекурсивной обработки объектов и массивов JSON в функции <link linkend="functions-json-processing-table"><function>json_populate_record()</function></link> и родственных ей (Никита Глухов)

source: With this change, array-type fields in the destination SQL type are properly converted from JSON arrays, and composite-type fields are properly converted from JSON objects. Previously, such cases would fail because the text representation of the JSON value would be fed to <function>array_in()</function> or <function>record_in()</function>, and its syntax would not match what those input functions expect.
ru: Благодаря этому изменению массивы JSON корректно преобразуются в поля-массивы в целевом типе SQL, а объекты JSON — в поля, представляющие собой составные типы. Ранее в таких случаях происходила ошибка при попытке передать строковое представление JSON-значения функциям <function>array_in()</function> и <function>record_in()</function>, так как синтаксис полученной строки не соответствовал ожидаемому этими функциями.

source: Add function <link linkend="functions-txid-snapshot"><function>txid_current_ifassigned()</function></link> to return the current transaction ID or <literal>NULL</literal> if no transaction ID has been assigned (Craig Ringer)
ru: Добавление функции <link linkend="functions-txid-snapshot"><function>txid_current_ifassigned()</function></link>, возвращающей идентификатор текущей транзакции или <literal>NULL</literal>, если транзакции не присвоен идентификатор (Крейг Рингер)
