Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/release-10.po
Languages: ru

source: Release 10
ru: Выпуск 10

source: Release date:
ru: Дата выпуска:

source: Overview
ru: Обзор

source: Major enhancements in <productname>PostgreSQL</productname> 10 include:
ru: В число ключевых усовершенствований <productname>PostgreSQL</productname> 10 входят:

source: Logical replication using publish/subscribe
ru: Логическая репликация по схеме публикации/подписки

source: Declarative table partitioning
ru: Декларативное секционирование таблиц

source: Improved query parallelism
ru: Улучшение распараллеливания запросов

source: Significant general performance improvements
ru: Значительное увеличение общей производительности

source: Stronger password authentication based on SCRAM-SHA-256
ru: Более сильная защита паролей с использованием SCRAM-SHA-256

source: Improved monitoring and control
ru: Улучшенные средства мониторинга и управления

source: The above items are explained in more detail in the sections below.
ru: Предыдущие пункты более подробно описаны в следующих разделах.

source: Migration to Version 10
ru: Миграция на версию 10

source: A dump/restore using <xref linkend="app-pg-dumpall"/>, or use of <xref linkend="pgupgrade"/>, is required for those wishing to migrate data from any previous release.
ru: Тем, кто хочет мигрировать данные из любой предыдущей версии, необходимо выполнить выгрузку/загрузку данных с помощью <xref linkend="app-pg-dumpall"/> или воспользоваться <xref linkend="pgupgrade"/>.

source: Version 10 contains a number of changes that may affect compatibility with previous releases. Observe the following incompatibilities:
ru: В версии 10 реализован ряд изменений, которые могут повлиять на совместимость с предыдущими выпусками. Примите к сведению следующие несовместимости:

source: Hash indexes must be rebuilt after <application>pg_upgrade</application>-ing from any previous major <productname>PostgreSQL</productname> version (Mithun Cy, Robert Haas, Amit Kapila)
ru: После обновления с помощью <application>pg_upgrade</application> с любой предыдущей основной версии <productname>PostgreSQL</productname> необходимо перестроить хеш-индексы (Митхун Ки, Роберт Хаас, Амит Капила)

source: Major hash index improvements necessitated this requirement. <application>pg_upgrade</application> will create a script to assist with this.
ru: Необходимость данного требования продиктована значительным усовершенствованием механизма хеш-индексов. Для облегчения задачи переиндексации <application>pg_upgrade</application> создаст вспомогательный скрипт.

source: Rename write-ahead log directory <filename>pg_xlog</filename> to <link linkend="wal"><filename>pg_wal</filename></link>, and rename transaction status directory <filename>pg_clog</filename> to <filename>pg_xact</filename> (Michael Paquier)
ru: Переименование каталога с журналом предзаписи из <filename>pg_xlog</filename> в <link linkend="wal"><filename>pg_wal</filename></link>, а также переименование каталога с информацией о состоянии транзакций из <filename>pg_clog</filename> в <filename>pg_xact</filename> (Мишель Пакье)

source: Users have occasionally thought that these directories contained only inessential log files, and proceeded to remove write-ahead log files or transaction status files manually, causing irrecoverable data loss. These name changes are intended to discourage such errors in future.
ru: Старые имена неоднократно вводили пользователей в заблуждение — пользователи думали, что эти каталоги содержат только несущественные файлы журналов, и вручную удаляли файлы журналов предзаписи или состояния транзакций, что приводило к необратимой потере данных. Эти переименования призваны предотвратить такие ошибки в будущем.

source: Rename <acronym>SQL</acronym> functions, tools, and options that reference <quote>xlog</quote> to <quote>wal</quote> (Robert Haas)
ru: Замена в именах функций <acronym>SQL</acronym>, утилит и параметров всех упоминаний <quote>xlog</quote> на <quote>wal</quote> (Роберт Хаас)

source: For example, <function>pg_switch_xlog()</function> becomes <function>pg_switch_wal()</function>, <application>pg_receivexlog</application> becomes <application>pg_receivewal</application>, and <option>--xlogdir</option> becomes <option>--waldir</option>. This is for consistency with the change of the <filename>pg_xlog</filename> directory name; in general, the <quote>xlog</quote> terminology is no longer used in any user-facing places.
ru: Например, имя <function>pg_switch_xlog()</function> поменялось на <function>pg_switch_wal()</function>, <application>pg_receivexlog</application> — на <application>pg_receivewal</application>, а <option>--xlogdir</option> — на <option>--waldir</option>. Это было сделано вместе с переименованием каталога <filename>pg_xlog</filename> для согласованности; и вообще термин <quote>xlog</quote> теперь нигде не может встретиться пользователю.

source: Rename <acronym>WAL</acronym>-related functions and views to use <literal>lsn</literal> instead of <literal>location</literal> (David Rowley)
ru: Замена в связанных с <acronym>WAL</acronym> функциях и представлениях <literal>location</literal> на <literal>lsn</literal> (Дэвид Роули)

source: There was previously an inconsistent mixture of the two terminologies.
ru: Ранее имело место несогласованное употребление обоих терминов.

source: Change the implementation of set-returning functions appearing in a query's <literal>SELECT</literal> list (Andres Freund)
ru: Изменение реализации функций, возвращающих множества, в списке <literal>SELECT</literal> (Андрес Фройнд)

source: Set-returning functions are now evaluated before evaluation of scalar expressions in the <literal>SELECT</literal> list, much as though they had been placed in a <literal>LATERAL FROM</literal>-clause item. This allows saner semantics for cases where multiple set-returning functions are present. If they return different numbers of rows, the shorter results are extended to match the longest result by adding nulls. Previously the results were cycled until they all terminated at the same time, producing a number of rows equal to the least common multiple of the functions' periods. In addition, set-returning functions are now disallowed within <literal>CASE</literal> and <literal>COALESCE</literal> constructs. For more information see <xref linkend="xfunc-sql-functions-returning-set"/>.
ru: Функции, возвращающие множества, теперь вычисляются до вычисления скалярных выражений в списке <literal>SELECT</literal>, практически так же, как если бы они были помещены в предложение <literal>LATERAL FROM</literal>. Это даёт более понятное поведение в случаях, когда присутствуют несколько таких функций. Если они возвращают разное количество строк, все результаты дополняются до наибольшего количества строк значениями NULL. Ранее результаты обрабатывались в цикле, пока все функции не завершались, и в результате получалось количество строк, равное наименьшему общему кратному периодов функций. Кроме того, функции, возвращающие множества, теперь нельзя использовать в конструкциях <literal>CASE</literal> и <literal>COALESCE</literal>. За дополнительными сведениями обратитесь к <xref remap="3" linkend="xfunc-sql-functions-returning-set"/>.

source: When <command>ALTER TABLE ... ADD PRIMARY KEY</command> marks columns <literal>NOT NULL</literal>, that change now propagates to inheritance child tables as well (Michael Paquier)
ru: Когда <command>ALTER TABLE ... ADD PRIMARY KEY</command> помечает столбцы как <literal>NOT NULL</literal>, это изменение теперь распространяется также на дочерние таблицы в иерархии наследования (Мишель Пакье)

source: Prevent statement-level triggers from firing more than once per statement (Tom Lane)
ru: Предотвращение срабатывания триггеров уровня оператора более одного раза для одного оператора (Том Лейн)

source: Cases involving writable CTEs updating the same table updated by the containing statement, or by another writable CTE, fired <literal>BEFORE STATEMENT</literal> or <literal>AFTER STATEMENT</literal> triggers more than once. Also, if there were statement-level triggers on a table affected by a foreign key enforcement action (such as <literal>ON DELETE CASCADE</literal>), they could fire more than once per outer SQL statement. This is contrary to the SQL standard, so change it.
ru: В случаях, когда пишущие CTE изменяли одну таблицу, изменяемую внешним оператором либо другими пишущими CTE, триггеры <literal>BEFORE STATEMENT</literal> и <literal>AFTER STATEMENT</literal> вызывались неоднократно. Также, если в таблице были определены триггеры уровня оператора, в результате действий для обеспечения целостности внешнего ключа (например, <literal>ON DELETE CASCADE</literal>), они могли вызываться несколько раз для одного внешнего SQL-оператора. Это поведение противоречит стандарту SQL и было исправлено.

source: Move sequences' metadata fields into a new <link linkend="catalog-pg-sequence"><structname>pg_sequence</structname></link> system catalog (Peter Eisentraut)
ru: Перемещение полей метаданных последовательностей в новый системный каталог <link linkend="catalog-pg-sequence"><structname>pg_sequence</structname></link> (Питер Эйзентраут)

source: A sequence relation now stores only the fields that can be modified by <function>nextval()</function>, that is <structfield>last_value</structfield>, <structfield>log_cnt</structfield>, and <structfield>is_called</structfield>. Other sequence properties, such as the starting value and increment, are kept in a corresponding row of the <structname>pg_sequence</structname> catalog. <command>ALTER SEQUENCE</command> updates are now fully transactional, implying that the sequence is locked until commit. The <function>nextval()</function> and <function>setval()</function> functions remain nontransactional.
ru: Отношение последовательности содержит теперь только поля, которые могут быть изменены функцией <function>nextval()</function>, то есть <structfield>last_value</structfield>, <structfield>log_cnt</structfield> и <structfield>is_called</structfield>. Другие свойства последовательности, такие как начальное значение и шаг увеличения, сохраняются в соответствующей строке в каталоге <structname>pg_sequence</structname>. Действие <command>ALTER SEQUENCE</command> теперь полностью транзакционное и, как следствие, блокирует последовательность до фиксации транзакции. Функции <function>nextval()</function> и <function>setval()</function> остаются нетранзакционными.

source: The main incompatibility introduced by this change is that selecting from a sequence relation now returns only the three fields named above. To obtain the sequence's other properties, applications must look into <structname>pg_sequence</structname>. The new system view <link linkend="view-pg-sequences"><structname>pg_sequences</structname></link> can also be used for this purpose; it provides column names that are more compatible with existing code.
ru: Основная несовместимость, привнесённая этим изменением, состоит в том, что из отношения последовательности теперь можно прочитать только три поля, перечисленные выше. Чтобы получить другие свойства последовательности, приложения должны обратиться к <structname>pg_sequence</structname>. Также для этого можно использовать новое системное представление <link linkend="view-pg-sequences"><structname>pg_sequences</structname></link>; оно выдаёт столбцы с именами, более подходящими для существующего кода.

source: The output of <application>psql</application>'s <command>\d</command> command for a sequence has been redesigned, too.
ru: Переработан и вывод команды <application>psql</application> <command>\d</command> для последовательностей.

source: Make <application><xref linkend="app-pgbasebackup"/></application> stream the <acronym>WAL</acronym> needed to restore the backup by default (Magnus Hagander)
ru: Передача по умолчанию программой <application><xref linkend="app-pgbasebackup"/></application> данных <acronym>WAL</acronym>, необходимых для восстановления резервной копии (Магнус Хагандер)

source: This changes <application>pg_basebackup</application>'s <option>-X</option>/<option>--xlog-method</option> default to <literal>stream</literal>. An option value <literal>none</literal> has been added to reproduce the old behavior. The <application>pg_basebackup</application> option <option>-x</option> has been removed (instead, use <literal>-X fetch</literal>).
ru: При этом в <application>pg_basebackup</application> подразумеваемое значение <option>-X</option>/<option>--xlog-method</option> меняется на <literal>stream</literal>. Для воспроизведения старого поведения был добавлен вариант значения <literal>none</literal>. Параметр <application>pg_basebackup</application> <option>-x</option> был удалён (используйте вместо него <literal>-X fetch</literal>).

source: Change how logical replication uses <link linkend="auth-pg-hba-conf"><filename>pg_hba.conf</filename></link> (Peter Eisentraut)
ru: Изменение записей логической репликации в <link linkend="auth-pg-hba-conf"><filename>pg_hba.conf</filename></link> (Питер Эйзентраут)

source: In previous releases, a logical replication connection required the <literal>replication</literal> keyword in the database column. As of this release, logical replication matches a normal entry with a database name or keywords such as <literal>all</literal>. Physical replication continues to use the <literal>replication</literal> keyword. Since built-in logical replication is new in this release, this change only affects users of third-party logical replication plugins.
ru: В предыдущих версиях для подключения логической репликации требовалось указать <literal>replication</literal> в столбце базы данных. С этого выпуска логической репликации соответствует обычная запись с именем базы данных или ключевым словом, например, <literal>all</literal>. Для физической репликации по-прежнему используется ключевое слово <literal>replication</literal>. Так как встроенная логическая репликация появилась только в этом выпуске, это изменение может затронуть только пользователей сторонних средств логической репликации.

source: Make all <application><xref linkend="app-pg-ctl"/></application> actions wait for completion by default (Peter Eisentraut)
ru: Все действия в <application><xref linkend="app-pg-ctl"/></application> по умолчанию должны ожидать завершения операции (Питер Эйзентраут)

source: Previously some <application>pg_ctl</application> actions didn't wait for completion, and required the use of <option>-w</option> to do so.
ru: Ранее некоторые действия <application>pg_ctl</application> не ждали завершения и для ожидания требовалось использовать ключ <option>-w</option>.

source: Change the default value of the <xref linkend="guc-log-directory"/> server parameter from <filename>pg_log</filename> to <filename>log</filename> (Andreas Karlsson)
ru: Изменение значения по умолчанию серверного параметра <xref linkend="guc-log-directory"/> с <filename>pg_log</filename> на <filename>log</filename> (Андреас Карлссон)

source: Add configuration option <xref linkend="guc-ssl-dh-params-file"/> to specify file name for custom OpenSSL DH parameters (Heikki Linnakangas)
ru: Добавление параметра конфигурации <xref linkend="guc-ssl-dh-params-file"/> для указания имени файла с нестандартными параметрами OpenSSL DH (Хейкки Линнакангас)

source: This replaces the hardcoded, undocumented file name <filename>dh1024.pem</filename>. Note that <filename>dh1024.pem</filename> is no longer examined by default; you must set this option if you want to use custom DH parameters.
ru: Тем самым заменяется жёстко заданное и недокументированное имя файла <filename>dh1024.pem</filename>. Заметьте, что файл <filename>dh1024.pem</filename> по умолчанию больше не обрабатывается; вы должны задать этот параметр, если хотите использовать свои параметры DH.

source: Increase the size of the default DH parameters used for OpenSSL ephemeral DH ciphers to 2048 bits (Heikki Linnakangas)
ru: Увеличение размера стандартных параметров DH, используемых для эфемерных DH-шифров OpenSSL, до 2048 бит (Хейкки Линнакангас)

source: The size of the compiled-in DH parameters has been increased from 1024 to 2048 bits, making DH key exchange more resistant to brute-force attacks. However, some old SSL implementations, notably some revisions of Java Runtime Environment version 6, will not accept DH parameters longer than 1024 bits, and hence will not be able to connect over SSL. If it's necessary to support such old clients, you can use custom 1024-bit DH parameters instead of the compiled-in defaults. See <xref linkend="guc-ssl-dh-params-file"/>.
ru: Размер предопределённых в коде параметров DH был увеличен с 1024 до 2048 бит, так что обмен ключами DH стал более устойчивым к подбору шифра. Однако некоторые старые реализации SSL, в частности некоторые ревизии Java Runtime Environment версии 6, не принимают параметры DH длиннее 1024 бит и, таким образом, не смогут подключиться через SSL. Если вам необходимо поддерживать такие старые клиенты, вы можете использовать нестандартные параметры DH размером 1024 бита вместо предопределённых параметров по умолчанию. См. <xref remap="4" linkend="guc-ssl-dh-params-file"/>.

source: Remove the ability to store unencrypted passwords on the server (Heikki Linnakangas)
ru: Ликвидация возможности хранения незашифрованных паролей на сервере (Хейкки Линнакангас)

source: The <xref linkend="guc-password-encryption"/> server parameter no longer supports <literal>off</literal> or <literal>plain</literal>. The <literal>UNENCRYPTED</literal> option is no longer supported in <command>CREATE/ALTER USER ... PASSSWORD</command>. Similarly, the <option>--unencrypted</option> option has been removed from <application>createuser</application>. Unencrypted passwords migrated from older versions will be stored encrypted in this release. The default setting for <varname>password_encryption</varname> is still <literal>md5</literal>.
ru: Серверный параметр <xref linkend="guc-password-encryption"/> больше не поддерживает значения <literal>off</literal> и <literal>plain</literal>. Вариант <literal>UNENCRYPTED</literal> также теперь не поддерживается в командах <command>CREATE/ALTER USER ... PASSSWORD</command>. Аналогично был удалён ключ <option>--unencrypted</option> команды <application>createuser</application>. Незашифрованные пароли, перенесённые из старых версий, в этой версии будут храниться в зашифрованном виде. Значением по умолчанию параметра <varname>password_encryption</varname> остаётся <literal>md5</literal>.

source: Add <xref linkend="guc-min-parallel-table-scan-size"/> and <xref linkend="guc-min-parallel-index-scan-size"/> server parameters to control parallel queries (Amit Kapila, Robert Haas)
ru: Добавление серверных параметров <xref linkend="guc-min-parallel-table-scan-size"/> и <xref linkend="guc-min-parallel-index-scan-size"/> для управления параллельными запросами (Амит Капила, Роберт Хаас)

source: These replace <varname>min_parallel_relation_size</varname>, which was found to be too generic.
ru: Они заменяют переменную <varname>min_parallel_relation_size</varname>, которая была слишком общей.

source: Don't downcase unquoted text within <xref linkend="guc-shared-preload-libraries"/> and related server parameters (QL Zhuo)
ru: Не заключённый в кавычки текст в <xref linkend="guc-shared-preload-libraries"/> и связанных серверных параметрах не должен переводиться в нижний регистр (Куэль Чжо)

source: These settings are really lists of file names, but they were previously treated as lists of SQL identifiers, which have different parsing rules.
ru: Эти параметры на самом деле представляют собой списки имён файлов, но ранее они воспринимались как списки SQL-идентификаторов и обрабатывались по другим правилам.

source: Remove <varname>sql_inheritance</varname> server parameter (Robert Haas)
ru: Удаление серверного параметра <varname>sql_inheritance</varname> (Роберт Хаас)

source: Changing this setting from the default value caused queries referencing parent tables to not include child tables. The <acronym>SQL</acronym> standard requires them to be included, however, and this has been the default since <productname>PostgreSQL</productname> 7.1.
ru: При выключенном значении этого параметра запросы, обращающиеся к родительским таблицам, перестают учитывать дочерние. Однако стандарт <acronym>SQL</acronym> требует, чтобы они учитывались, и это поведение было принято по умолчанию в <productname>PostgreSQL</productname> 7.1.

source: Allow multi-dimensional arrays to be passed into PL/Python functions, and returned as nested Python lists (Alexey Grishchenko, Dave Cramer, Heikki Linnakangas)
ru: Реализация возможности передавать многомерные массивы в функции на PL/Python и возвращать вложенные списки Python (Алексей Грищенко, Дэйв Крамер, Хейкки Линнакангас)

source: This feature requires a backwards-incompatible change to the handling of arrays of composite types in PL/Python. Previously, you could return an array of composite values by writing, e.g., <literal>[[col1, col2], [col1, col2]]</literal>; but now that is interpreted as a two-dimensional array. Composite types in arrays must now be written as Python tuples, not lists, to resolve the ambiguity; that is, write <literal>[(col1, col2), (col1, col2)]</literal> instead.
ru: Это изменение потребовало нарушить обратную совместимость в части обработки массивов составных типов в PL/Python. Раньше можно было вернуть массив составных типов как <literal>[[col1, col2], [col1, col2]]</literal>; но теперь это будет интерпретироваться как двухмерный массив. Составные типы в массивах для однозначности должны возвращаться теперь в виде кортежей Python, а не в виде списков. То есть предыдущую запись нужно заменить на <literal>[(col1, col2), (col1, col2)]</literal>.

source: Remove PL/Tcl's <quote>module</quote> auto-loading facility (Tom Lane)
ru: Удаление механизма автозагрузки <quote>модулей</quote> PL/Tcl (Том Лейн)

source: This functionality has been replaced by new server parameters <xref linkend="guc-pltcl-start-proc"/> and <xref linkend="guc-pltclu-start-proc"/>, which are easier to use and more similar to features available in other PLs.
ru: На замену этой функциональности пришли новые серверные параметры <xref linkend="guc-pltcl-start-proc"/> и <xref linkend="guc-pltclu-start-proc"/>, которые проще в использовании и дают возможности, подобные имеющимся в других языках программирования.

source: Remove <application>pg_dump</application>/<application>pg_dumpall</application> support for dumping from pre-8.0 servers (Tom Lane)
ru: Ликвидация поддержки выгрузки данных с серверов до 8.0 утилитами <application>pg_dump</application>/<application>pg_dumpall</application> (Том Лейн)

source: Users needing to dump from pre-8.0 servers will need to use dump programs from <productname>PostgreSQL</productname> 9.6 or earlier. The resulting output should still load successfully into newer servers.
ru: Пользователям, которым нужно выгрузить данные с серверов до 8.0, остаётся использовать dump из <productname>PostgreSQL</productname> версии 9.6 или старее. Выгруженные этими версиями данные должны успешно загружаться на новых серверах.

source: Remove support for floating-point timestamps and intervals (Tom Lane)
ru: Ликвидация поддержки хранения даты/времени и интервалов в виде чисел с плавающей точкой (Том Лейн)

source: This removes configure's <option>--disable-integer-datetimes</option> option. Floating-point timestamps have few advantages and have not been the default since <productname>PostgreSQL</productname> 8.3.
ru: Параметр configure <option>--disable-integer-datetimes</option> был удалён. Использование для таких значений чисел с плавающей точкой не давало значимых преимуществ и не было вариантом по умолчанию, начиная с <productname>PostgreSQL</productname> 8.3.
