Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/release-10.po
Languages: ru

source: Remove server support for client/server protocol version 1.0 (Tom Lane)
ru: Ликвидация поддержки сервером клиент-серверного протокола версии 1.0 (Том Лейн)

source: This protocol hasn't had client support since <productname>PostgreSQL</productname> 6.3.
ru: Этот протокол не поддерживался клиентами со времён <productname>PostgreSQL</productname> 6.3.

source: Remove <filename>contrib/tsearch2</filename> module (Robert Haas)
ru: Удаление модуля <filename>contrib/tsearch2</filename> (Роберт Хаас)

source: This module provided compatibility with the version of full text search that shipped in pre-8.3 <productname>PostgreSQL</productname> releases.
ru: Этот модуль обеспечивал совместимость с версией полнотекстового поиска, которая поставлялась с серверами <productname>PostgreSQL</productname> до версии 8.3.

source: Remove <application>createlang</application> and <application>droplang</application> command-line applications (Peter Eisentraut)
ru: Ликвидация приложений командной строки <application>createlang</application> и <application>droplang</application> (Питер Эйзентраут)

source: These had been deprecated since <productname>PostgreSQL</productname> 9.1. Instead, use <command>CREATE EXTENSION</command> and <command>DROP EXTENSION</command> directly.
ru: Они перешли в разряд устаревших в <productname>PostgreSQL</productname> 9.1. Вместо них можно непосредственно использовать команды <command>CREATE EXTENSION</command> и <command>DROP EXTENSION</command>.

source: Remove support for version-0 function calling conventions (Andres Freund)
ru: Ликвидация поддержки вызовов функций версии 0 (Андрес Фройнд)

source: Extensions providing C-coded functions must now conform to version 1 calling conventions. Version 0 has been deprecated since 2001.
ru: Расширения, предоставляющие функции, реализованные на C, теперь должны использовать соглашение о вызовах версии 1. Версия 0 считалась устаревшей с 2001 года.

source: Changes
ru: Изменения

source: Below you will find a detailed account of the changes between <productname>PostgreSQL</productname> 10 and the previous major release.
ru: Ниже вы найдёте подробный список изменений, произошедших между предыдущим основным выпуском и <productname>PostgreSQL</productname> 10.

source: Server
ru: Сервер

source: Parallel Queries
ru: Параллельное выполнение запросов

source: Support parallel B-tree index scans (Rahila Syed, Amit Kapila, Robert Haas, Rafia Sabih)
ru: Поддержка параллельного сканирования индексов типа B-дерево (Рахила Сьед, Амит Капила, Роберт Хаас, Рафия Сабих)

source: This change allows B-tree index pages to be searched by separate parallel workers.
ru: Благодаря этому поиск в страницах индекса-B-дерева могут производить параллельно несколько рабочих процессов.

source: Support parallel bitmap heap scans (Dilip Kumar)
ru: Поддержка параллельного сканирования кучи по битовой карте (Дилип Кумар)

source: This allows a single index scan to dispatch parallel workers to process different areas of the heap.
ru: Это позволяет распределить одно сканирование индекса между параллельными исполнителями, обрабатывающими разные области кучи.

source: Allow merge joins to be performed in parallel (Dilip Kumar)
ru: Реализована возможность выполнения соединения слиянием в параллельном режиме (Дилип Кумар)

source: Allow non-correlated subqueries to be run in parallel (Amit Kapila)
ru: Реализована возможность выполнения несвязанных запросов в параллельном режиме (Амит Капила)

source: Improve ability of parallel workers to return pre-sorted data (Rushabh Lathia)
ru: Улучшение возможности параллельных процессов возвращать ранее отсортированные данные (Рушаб Латиа)

source: Increase parallel query usage in procedural language functions (Robert Haas, Rafia Sabih)
ru: Расширение использования параллельных запросов в функциях процедурных языков (Роберт Хаас, Рафия Сабих)

source: Add <xref linkend="guc-max-parallel-workers"/> server parameter to limit the number of worker processes that can be used for query parallelism (Julien Rouhaud)
ru: Добавление серверного параметра <xref linkend="guc-max-parallel-workers"/> для ограничения числа рабочих процессов, которые могут использоваться для распараллеливания запросов (Жульен Рухо)

source: This parameter can be set lower than <xref linkend="guc-max-worker-processes"/> to reserve worker processes for purposes other than parallel queries.
ru: Значение этого параметра можно сделать меньше <xref linkend="guc-max-worker-processes"/>, чтобы зарезервировать рабочие процессы для других целей, кроме параллельных запросов.

source: Indexes
ru: Индексы

source: Add write-ahead logging support to hash indexes (Amit Kapila)
ru: Добавление регистрации в журнале предзаписи операций с хеш-индексами (Амит Капила)

source: This makes hash indexes crash-safe and replicatable. The former warning message about their use is removed.
ru: В результате хеш-индексы становятся отказоустойчивыми и пригодными к репликации. Прежнее предостережение относительно их использование удалено.

source: Improve hash index performance (Amit Kapila, Mithun Cy, Ashutosh Sharma)
ru: Улучшение производительности хеш-индекса (Амит Капила, Митхун Ки, Ашутош Шарма)

source: Add <acronym>SP-GiST</acronym> index support for <type>INET</type> and <type>CIDR</type> data types (Emre Hasegeli)
ru: Добавление поддержки индексов <acronym>SP-GiST</acronym> для типов данных <type>INET</type> и <type>CIDR</type> (Эмре Хасегели)

source: Add option to allow <acronym>BRIN</acronym> index summarization to happen more aggressively (&Aacute;lvaro Herrera)
ru: Добавление параметра для включения более активного вычисления сводных данных индекса <acronym>BRIN</acronym> (Альваро Эррера)

source: A new <link linkend="sql-createindex"><command>CREATE INDEX</command></link> option enables auto-summarization of the previous <acronym>BRIN</acronym> page range when a new page range is created.
ru: Новый параметр <link linkend="sql-createindex"><command>CREATE INDEX</command></link> позволяет автоматически обновлять сводную запись для предыдущей зоны страниц <acronym>BRIN</acronym> при создании новой зоны.

source: Add functions to remove and re-add <acronym>BRIN</acronym> summarization for <acronym>BRIN</acronym> index ranges (&Aacute;lvaro Herrera)
ru: Добавление функций для удаления и повторного добавления сводных записей <acronym>BRIN</acronym> для зон индекса <acronym>BRIN</acronym> (Альваро Эррера)

source: The new <acronym>SQL</acronym> function <link linkend="functions-admin-index-table"><function>brin_summarize_range()</function></link> updates <acronym>BRIN</acronym> index summarization for a specified range and <function>brin_desummarize_range()</function> removes it. This is helpful to update summarization of a range that is now smaller due to <command>UPDATE</command>s and <command>DELETE</command>s.
ru: Новая <acronym>SQL</acronym>-функция <link linkend="functions-admin-index-table"><function>brin_summarize_range()</function></link> обновляет сводные записи индекса <acronym>BRIN</acronym> для определённой зоны, а <function>brin_desummarize_range()</function> удаляет их. Это полезно для обновления данных зоны, которая стала меньше в результате действия команд <command>UPDATE</command> и <command>DELETE</command>.

source: Improve accuracy in determining if a <acronym>BRIN</acronym> index scan is beneficial (David Rowley, Emre Hasegeli)
ru: Более точный расчёт выгоды от применения сканирования по индексу <acronym>BRIN</acronym> (Дэвид Роули, Эмре Хасегели)

source: Allow faster <acronym>GiST</acronym> inserts and updates by reusing index space more efficiently (Andrey Borodin)
ru: Ускорение операций добавления и изменения записей в <acronym>GiST</acronym> благодаря более эффективному использованию пространства индекса (Андрей Бородин)

source: Reduce page locking during vacuuming of <acronym>GIN</acronym> indexes (Andrey Borodin)
ru: Минимизация блокировок страниц при очистке индексов <acronym>GIN</acronym> (Андрей Бородин)

source: Locking
ru: Блокировки

source: Reduce locking required to change table parameters (Simon Riggs, Fabr&iacute;zio Mello)
ru: Сокращение блокировок, необходимых для изменения параметров таблиц (Саймон Риггс, Фабрицио де Ройес Мелло)

source: For example, changing a table's <xref linkend="guc-effective-io-concurrency"/> setting can now be done with a more lightweight lock.
ru: Например, изменить параметр <xref linkend="guc-effective-io-concurrency"/> для таблицы теперь можно с более лёгкой блокировкой.

source: Allow tuning of predicate lock promotion thresholds (Dagfinn Ilmari Manns&aring;ker)
ru: Реализация регулировки пределов для повышения уровня предикатных блокировок (Дагфинн Ильмари Маннсакер)

source: Lock promotion can now be controlled through two new server parameters, <xref linkend="guc-max-pred-locks-per-relation"/> and <xref linkend="guc-max-pred-locks-per-page"/>.
ru: Повышением уровня блокировок теперь можно управлять с помощью двух новых параметров сервера, <xref linkend="guc-max-pred-locks-per-relation"/> и <xref linkend="guc-max-pred-locks-per-page"/>.

source: Optimizer
ru: Оптимизатор

source: Add multi-column optimizer statistics to compute the correlation ratio and number of distinct values (Tomas Vondra, David Rowley, &Aacute;lvaro Herrera)
ru: Добавление статистики по нескольким столбцам, позволяющей вычислять коэффициент корреляции и число различных значений (Томаш Вондра, Дэвид Роули, Альваро Эррера)

source: New commands are <link linkend="sql-createstatistics"><command>CREATE STATISTICS</command></link>, <link linkend="sql-alterstatistics"><command>ALTER STATISTICS</command></link>, and <link linkend="sql-dropstatistics"><command>DROP STATISTICS</command></link>. This feature is helpful in estimating query memory usage and when combining the statistics from individual columns.
ru: Появились новые команды: <link linkend="sql-createstatistics"><command>CREATE STATISTICS</command></link>, <link linkend="sql-alterstatistics"><command>ALTER STATISTICS</command></link> и <link linkend="sql-dropstatistics"><command>DROP STATISTICS</command></link>. Это полезно для оценки использования памяти запросом и для консолидации статистики по отдельным столбцам.

source: Improve performance of queries affected by row-level security restrictions (Tom Lane)
ru: Увеличение производительности запросов, сталкивающихся с ограничениями безопасности на уровне строк (Том Лейн)

source: The optimizer now has more knowledge about where it can place RLS filter conditions, allowing better plans to be generated while still enforcing the RLS conditions safely.
ru: Теперь оптимизатор лучше понимает, куда можно поместить условия фильтра RLS, благодаря чему он может строить лучшие планы, при этом гарантируя выполнение условий RLS.

source: General Performance
ru: Общая производительность

source: Speed up aggregate functions that calculate a running sum using <type>numeric</type>-type arithmetic, including some variants of <function>SUM()</function>, <function>AVG()</function>, and <function>STDDEV()</function> (Heikki Linnakangas)
ru: Ускорение агрегатных функций, которые вычисляют сумму с накоплением, используя арифметику типа <type>numeric</type>, включая некоторые вариации <function>SUM()</function>, <function>AVG()</function> и <function>STDDEV()</function> (Хейкки Линнакангас)

source: Improve performance of character encoding conversions by using radix trees (Kyotaro Horiguchi, Heikki Linnakangas)
ru: Увеличение скорости преобразований кодировок символов с использованием цифровых деревьев (Кётаро Хоригути, Хейкки Линнакангас)

source: Reduce expression evaluation overhead during query execution, as well as plan node calling overhead (Andres Freund)
ru: Уменьшение издержек вычисления выражений при выполнении запросов, а также издержек обращения к узлу плана (Андрес Фройнд)

source: This is particularly helpful for queries that process many rows.
ru: Это особенно полезно для запросов, обрабатывающих множество строк.

source: Allow hashed aggregation to be used with grouping sets (Andrew Gierth)
ru: Возможность использования агрегирования по хешу при обработке наборов группирования (Эндрю Гирт)

source: Use uniqueness guarantees to optimize certain join types (David Rowley)
ru: Использование гарантий уникальности для оптимизации определённых типов соединений (Дэвид Роули)

source: Improve sort performance of the <type>macaddr</type> data type (Brandur Leach)
ru: Ускорение сортировки типа данных <type>macaddr</type> (Брандур Лич)

source: Reduce statistics tracking overhead in sessions that reference many thousands of relations (Aleksander Alekseev)
ru: Сокращение издержек на отслеживание статистики в сеансах, когда задействуются тысячи отношений (Александр Алексеев)

source: Monitoring
ru: Мониторинг

source: Allow explicit control over <link linkend="sql-explain"><command>EXPLAIN</command></link>'s display of planning and execution time (Ashutosh Bapat)
ru: Возможность явного управления отображением командой <link linkend="sql-explain"><command>EXPLAIN</command></link> времени планирования и выполнения (Ашутош Бапат)

source: By default planning and execution time are displayed by <command>EXPLAIN ANALYZE</command> and are not displayed in other cases. The new <command>EXPLAIN</command> option <literal>SUMMARY</literal> allows explicit control of this.
ru: По умолчанию время планирования и выполнения выводится командой <command>EXPLAIN ANALYZE</command> и не выводится в других случаях. Явно управлять этим позволяет новый параметр <literal>SUMMARY</literal> команды <command>EXPLAIN</command>.

source: Add default monitoring roles (Dave Page)
ru: Добавлены новые стандартные роли для мониторинга (Дейв Пейдж)

source: New roles <literal>pg_monitor</literal>, <literal>pg_read_all_settings</literal>, <literal>pg_read_all_stats</literal>, and <literal>pg_stat_scan_tables</literal> allow simplified permission configuration.
ru: Новые роли <literal>pg_monitor</literal>, <literal>pg_read_all_settings</literal>, <literal>pg_read_all_stats</literal> и <literal>pg_stat_scan_tables</literal> позволяют упростить конфигурацию разрешений.

source: Properly update the statistics collector during <link linkend="sql-refreshmaterializedview"><command>REFRESH MATERIALIZED VIEW</command></link> (Jim Mlodgenski)
ru: Исправление передачи информации сборщику статистики во время <link linkend="sql-refreshmaterializedview"><command>REFRESH MATERIALIZED VIEW</command></link> (Джим Млодженски)

source: Logging
ru: Ведение журнала

source: Change the default value of <xref linkend="guc-log-line-prefix"/> to include current timestamp (with milliseconds) and the process ID in each line of postmaster log output (Christoph Berg)
ru: Изменение префикса <xref linkend="guc-log-line-prefix"/>, чтобы по умолчанию все строки журнала postmaster содержали текущее время (с миллисекундами) и идентификатор процесса (Кристоф Берг)

source: The previous default was an empty prefix.
ru: Ранее префикс по умолчанию был пустым.

source: Add functions to return the log and <acronym>WAL</acronym> directory contents (Dave Page)
ru: Добавление функций для получения содержимого каталогов журнала сообщений и <acronym>WAL</acronym> (Дейв Пейдж)

source: The new functions are <link linkend="functions-admin-genfile-table"><function>pg_ls_logdir()</function></link> and <link linkend="functions-admin-genfile-table"><function>pg_ls_waldir()</function></link> and can be executed by non-superusers with the proper permissions.
ru: Новые функции называются соответственно <link linkend="functions-admin-genfile-table"><function>pg_ls_logdir()</function></link> и <link linkend="functions-admin-genfile-table"><function>pg_ls_waldir()</function></link> и могут выполняться не только суперпользователями (при наличии достаточных разрешений).

source: Add function <link linkend="functions-info-session-table"><function>pg_current_logfile()</function></link> to read logging collector's current stderr and csvlog output file names (Gilles Darold)
ru: Добавление функции <link linkend="functions-info-session-table"><function>pg_current_logfile()</function></link> для чтения имён текущих файлов, в которые сборщик сообщений выводит потоки stderr и csvlog (Жиль Даролд)

source: Report the address and port number of each listening socket in the server log during postmaster startup (Tom Lane)
ru: Вывод в журнал сервера адреса и номера порта для каждого принимающего соединения сокета при запуске postmaster (Том Лейн)

source: Also, when logging failure to bind a listening socket, include the specific address we attempted to bind to.
ru: Также добавление в сообщение об ошибке привязки к определённому сокету адреса этого сокета.

source: Reduce log chatter about the starting and stopping of launcher subprocesses (Tom Lane)
ru: Устранение лишних сообщений о запуске и остановке подпроцессов запускающего процесса (Том Лейн)

source: These are now <literal>DEBUG1</literal>-level messages.
ru: Теперь уровень этих сообщений понижен до <literal>DEBUG1</literal>.

source: Reduce message verbosity of lower-numbered debug levels controlled by <xref linkend="guc-log-min-messages"/> (Robert Haas)
ru: Уменьшение уровня важности сообщений для уровней отладки, контролируемых параметром <xref linkend="guc-log-min-messages"/> (Роберт Хаас)

source: This also changes the verbosity of <xref linkend="guc-client-min-messages"/> debug levels.
ru: Это затрагивает также сообщения отладочных уровней <xref linkend="guc-client-min-messages"/>.

source: <link linkend="pg-stat-activity-view"><structname>pg_stat_activity</structname></link>
ru: Представление <link linkend="pg-stat-activity-view"><structname>pg_stat_activity</structname></link>

source: Add <structname>pg_stat_activity</structname> reporting of low-level wait states (Michael Paquier, Robert Haas, Rushabh Lathia)
ru: Добавление в <structname>pg_stat_activity</structname> информации о состоянии низкоуровневых ожиданий (Мишель Пакье, Роберт Хаас)

source: This change enables reporting of numerous low-level wait conditions, including latch waits, file reads/writes/fsyncs, client reads/writes, and synchronous replication.
ru: Это позволяет отслеживать множество событий ожидания на низком уровне, включая ожидания защёлок, записи/чтения/сброса файлов, чтения/записи со стороны клиента и синхронной репликации.

source: Show auxiliary processes, background workers, and walsender processes in <structname>pg_stat_activity</structname> (Kuntal Ghosh, Michael Paquier)
ru: Отображение в <structname>pg_stat_activity</structname> вспомогательных и фоновых рабочих процессов, а также процессов-передатчиков WAL (Кунтал Гхош, Мишель Пакье)

source: This simplifies monitoring. A new column <structfield>backend_type</structfield> identifies the process type.
ru: Это упрощает мониторинг. Тип процесса обозначается в новом столбце <structfield>backend_type</structfield>.

source: Allow <structname>pg_stat_activity</structname> to show the SQL query being executed by parallel workers (Rafia Sabih)
ru: В <structname>pg_stat_activity</structname> реализовано отображение SQL-запросов, выполняемых параллельными исполнителями (Рафия Сабих)

source: Rename <structname>pg_stat_activity</structname>.<structfield>wait_event_type</structfield> values <literal>LWLockTranche</literal> and <literal>LWLockNamed</literal> to <literal>LWLock</literal> (Robert Haas)
ru: Переименование в <structname>pg_stat_activity</structname>.<structfield>wait_event_type</structfield> значений <literal>LWLockTranche</literal> и <literal>LWLockNamed</literal> в <literal>LWLock</literal> (Роберт Хаас)

source: This makes the output more consistent.
ru: Это делает вывод более согласованным.

source: Authentication
ru: Аутентификация

source: Add <link linkend="auth-password">SCRAM-SHA-256</link> support for password negotiation and storage (Michael Paquier, Heikki Linnakangas)
ru: Добавление поддержки <link linkend="auth-password">SCRAM-SHA-256</link> для проверки и хранения паролей (Мишель Пакье, Хейкки Линнакангас)

source: This provides better security than the existing <literal>md5</literal> negotiation and storage method.
ru: Это обеспечивает лучшую безопасность по сравнению с существующим методом <literal>md5</literal>.

source: Change the <xref linkend="guc-password-encryption"/> server parameter from <type>boolean</type> to <type>enum</type> (Michael Paquier)
ru: Изменение типа серверного параметра <xref linkend="guc-password-encryption"/> с <type>boolean</type> на <type>enum</type> (Мишель Пакье)

source: This was necessary to support additional password hashing options.
ru: Это потребовалось для поддержки различных вариантов хеширования паролей.

source: Add view <link linkend="view-pg-hba-file-rules"><structname>pg_hba_file_rules</structname></link> to display the contents of <filename>pg_hba.conf</filename> (Haribabu Kommi)
ru: Добавление представления <link linkend="view-pg-hba-file-rules"><structname>pg_hba_file_rules</structname></link> для просмотра содержимого <filename>pg_hba.conf</filename> (Харибабу Комми)

source: This shows the file contents, not the currently active settings.
ru: Это представление показывает содержимое файла, а не действующие в данный момент параметры.

source: Support multiple <acronym>RADIUS</acronym> servers (Magnus Hagander)
ru: Поддержка нескольких серверов <acronym>RADIUS</acronym> (Магнус Хагандер)

source: All the <acronym>RADIUS</acronym> related parameters are now plural and support a comma-separated list of servers.
ru: Все связанные с <acronym>RADIUS</acronym> параметры теперь стали множественными и принимают список серверов через запятую.

source: Server Configuration
ru: Конфигурация сервера

source: Allow <acronym>SSL</acronym> configuration to be updated during configuration reload (Andreas Karlsson, Tom Lane)
ru: Возможность обновления конфигурации <acronym>SSL</acronym> при перезагрузке конфигурации (Андреас Карлссон, Том Лейн)

source: This allows <acronym>SSL</acronym> to be reconfigured without a server restart, by using <command>pg_ctl reload</command>, <command>SELECT pg_reload_conf()</command>, or sending a <literal>SIGHUP</literal> signal. However, reloading the <acronym>SSL</acronym> configuration does not work if the server's <acronym>SSL</acronym> key requires a passphrase, as there is no way to re-prompt for the passphrase. The original configuration will apply for the life of the postmaster in that case.
ru: Это позволяет переконфигурировать <acronym>SSL</acronym> без перезапуска сервера, используя <command>pg_ctl reload</command>, <command>SELECT pg_reload_conf()</command> или отправив сигнал <literal>SIGHUP</literal>. Однако, перезагрузка конфигурации <acronym>SSL</acronym> не сработает, если для использования <acronym>SSL</acronym>-ключа сервера требуется пароль, так как никакой возможности запросить его нет. В этом случае главный процесс (postmaster) продолжит использовать изначальную конфигурацию, пока не будет перезапущен.

source: Make the maximum value of <xref linkend="guc-bgwriter-lru-maxpages"/> effectively unlimited (Jim Nasby)
ru: Устранение практического предела для максимального значения <xref linkend="guc-bgwriter-lru-maxpages"/> (Джим Нэсби)

source: Reliability
ru: Надёжность

source: After creating or unlinking files, perform an fsync on their parent directory (Michael Paquier)
ru: После создания или удаления файлов следует выполнять fsync для каталога их содержащего (Мишель Пакье)

source: This reduces the risk of data loss after a power failure.
ru: Это сокращает риск потери данных при отключении питания.

source: <link linkend="wal">Write-Ahead Log</link> (<acronym>WAL</acronym>)
ru: <link linkend="wal">Журнал предзаписи</link> (<acronym>WAL</acronym>)
