Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/release-10.po
Languages: ru

source: We have switched to a new version of <application>pg_bsd_indent</application> based on recent improvements made by the FreeBSD project. This fixes numerous small bugs that led to odd C code formatting decisions. Most notably, lines within parentheses (such as in a multi-line function call) are now uniformly indented to match the opening paren, even if that would result in code extending past the right margin.
ru: Мы перешли на новую версию <application>pg_bsd_indent</application>, включающую последние усовершенствования из проекта FreeBSD. В результате устранено множество мелких ошибок, которые приводили к странным решениям относительно форматирования кода C. Одно из самых заметных изменений — строки в скобках (например, вызов функции, записанный в нескольких строках) теперь единообразно выравниваются по открывающей скобке, даже если в результате код будет выходить за правую границу.

source: Allow the <link linkend="configure"><acronym>ICU</acronym></link> library to optionally be used for collation support (Peter Eisentraut)
ru: Возможность использования библиотеки <link linkend="configure"><acronym>ICU</acronym></link> для поддержки правил сортировки (Питер Эйзентраут)

source: The <acronym>ICU</acronym> library has versioning that allows detection of collation changes between versions. It is enabled via configure option <option>--with-icu</option>. The default still uses the operating system's native collation library.
ru: Библиотека <acronym>ICU</acronym> реализует версионирование, что позволяет выявлять изменения правил сортировки от версии к версии. Она подключается параметром configure <option>--with-icu</option>. По умолчанию для сортировки по-прежнему используется встроенная библиотека операционной системы.

source: Automatically mark all <link linkend="xfunc-c"><function>PG_FUNCTION_INFO_V1</function></link> functions as <literal>DLLEXPORT</literal>-ed on <systemitem class="osname">Windows</systemitem> (Laurenz Albe)
ru: Автоматическое добавление для всех функций <link linkend="xfunc-c"><function>PG_FUNCTION_INFO_V1</function></link> пометки <literal>DLLEXPORT</literal> в <systemitem class="osname">Windows</systemitem> (Лауренц Альбе)

source: If third-party code is using <literal>extern</literal> function declarations, they should also add <literal>DLLEXPORT</literal> markers to those declarations.
ru: Если сторонний код использует объявления функций с характеристикой <literal>extern</literal>, они также должны иметь пометки <literal>DLLEXPORT</literal> в этих объявлениях.

source: Remove <acronym>SPI</acronym> functions <function>SPI_push()</function>, <function>SPI_pop()</function>, <function>SPI_push_conditional()</function>, <function>SPI_pop_conditional()</function>, and <function>SPI_restore_connection()</function> as unnecessary (Tom Lane)
ru: Ликвидация ставших ненужными <acronym>SPI</acronym>-функций <function>SPI_push()</function>, <function>SPI_pop()</function>, <function>SPI_push_conditional()</function>, <function>SPI_pop_conditional()</function> и <function>SPI_restore_connection()</function> (Том Лейн)

source: Their functionality now happens automatically. There are now no-op macros by these names so that external modules don't need to be updated immediately, but eventually such calls should be removed.
ru: Теперь их функциональность реализуется автоматически. Сейчас остались пустые макросы с такими именами (чтобы не требовалось немедленно обновлять внешние модули), но в конце концов их вызовы должны быть удалены.

source: A side effect of this change is that <function>SPI_palloc()</function> and allied functions now require an active SPI connection; they do not degenerate to simple <function>palloc()</function> if there is none. That previous behavior was not very useful and posed risks of unexpected memory leaks.
ru: Побочным эффектом этого изменения стало то, что <function>SPI_palloc()</function> и родственные функции теперь требуют активного SPI-подключения; их действие не сводится к простому <function>palloc()</function>, если его нет. Предыдущее такое поведение оказалось не очень полезным и было чревато неожиданными утечками памяти.

source: Allow shared memory to be dynamically allocated (Thomas Munro, Robert Haas)
ru: Возможность динамического выделения разделяемой памяти (Томас Мунро, Роберт Хаас)

source: Add slab-like memory allocator for efficient fixed-size allocations (Tomas Vondra)
ru: Добавление механизма выделения памяти, подобного slab, для эффективного выделения памяти фиксированного размера (Томаш Вондра)

source: Use <acronym>POSIX</acronym> semaphores rather than SysV semaphores on <systemitem class="osname">Linux</systemitem> and <systemitem class="osname">FreeBSD</systemitem> (Tom Lane)
ru: Использование семафоров <acronym>POSIX</acronym> вместо SysV в <systemitem class="osname">Linux</systemitem> и <systemitem class="osname">FreeBSD</systemitem> (Том Лейн)

source: This avoids platform-specific limits on SysV semaphore usage.
ru: Это снимает некоторые присущие платформе лимиты на использование семафоров SysV.

source: Improve support for 64-bit atomics (Andres Freund)
ru: Улучшение поддержки 64-битных атомарных операций (Андрес Фройнд)

source: Enable 64-bit atomic operations on <acronym>ARM64</acronym> (Roman Shaposhnik)
ru: Использование 64-битных атомарных операций на платформе <acronym>ARM64</acronym> (Роман Шапошник)

source: Switch to using <function>clock_gettime()</function>, if available, for duration measurements (Tom Lane)
ru: Переход к использованию функции <function>clock_gettime()</function>, если она доступна, для замеров длительности (Том Лейн)

source: <function>gettimeofday()</function> is still used if <function>clock_gettime()</function> is not available.
ru: Если <function>clock_gettime()</function> недоступна, по-прежнему будет использоваться <function>gettimeofday()</function>.

source: Add more robust random number generators to be used for cryptographically secure uses (Magnus Hagander, Michael Paquier, Heikki Linnakangas)
ru: Добавление более надёжных генераторов случайных чисел для криптографического использования (Магнус Хагандер, Мишель Пакье, Хейкки Линнакангас)

source: If no strong random number generator can be found, <link linkend="configure">configure</link> will fail unless the <option>--disable-strong-random</option> option is used. However, with this option, <link linkend="pgcrypto"><application>pgcrypto</application></link> functions requiring a strong random number generator will be disabled.
ru: Если надёжный генератор случайных чисел не обнаруживается, процедура <link linkend="configure">configure</link> прервётся, если только дополнительно не передать ключ <option>--disable-strong-random</option>. Однако с этим ключом функции <link linkend="pgcrypto"><application>pgcrypto</application></link>, которым требуется надёжный генератор случайных чисел, будут отключены.

source: Allow <function>WaitLatchOrSocket()</function> to wait for socket connection on Windows (Andres Freund)
ru: В функции <function>WaitLatchOrSocket()</function> налажено ожидание подключения сокета в Windows (Андрес Фройнд)

source: <filename>tupconvert.c</filename> functions no longer convert tuples just to embed a different composite-type OID in them (Ashutosh Bapat, Tom Lane)
ru: Функции <filename>tupconvert.c</filename> более не преобразуют кортежи только для того, чтобы включить в них другой OID составного типа (Ашутош Бапат, Том Лейн)

source: The majority of callers don't care about the composite-type OID; but if the result tuple is to be used as a composite Datum, steps should be taken to make sure the correct OID is inserted in it.
ru: В большинстве точек вызова этот OID составного типа не нужен; но если результирующий кортеж будет использоваться как составное значение Datum, требуются дополнительные действия, чтобы в нём оказался корректный OID.

source: Remove <systemitem class="osname">SCO</systemitem> and <systemitem class="osname">Unixware</systemitem> ports (Tom Lane)
ru: Ликвидация портов <systemitem class="osname">SCO</systemitem> и <systemitem class="osname">Unixware</systemitem> (Том Лейн)

source: Overhaul documentation <link linkend="docguide-toolsets">build process</link> (Alexander Lakhin)
ru: Переработка <link linkend="docguide-toolsets">процесса сборки</link> документации (Александр Лахин)

source: Use <acronym>XSLT</acronym> to build the <productname>PostgreSQL</productname> documentation (Peter Eisentraut)
ru: Использование <acronym>XSLT</acronym> для сборки документации <productname>PostgreSQL</productname> (Питер Эйзентраут)

source: Previously <application>Jade</application>, <acronym>DSSSL</acronym>, and <application>JadeTex</application> were used.
ru: Ранее использовались программы <application>Jade</application>, <acronym>DSSSL</acronym> и <application>JadeTex</application>.

source: Build <acronym>HTML</acronym> documentation using <acronym>XSLT</acronym> stylesheets by default (Peter Eisentraut)
ru: Сборка <acronym>HTML</acronym>-документации по умолчанию со стилями <acronym>XSLT</acronym> (Питер Эйзентраут)

source: Additional Modules
ru: Дополнительные модули

source: Allow <link linkend="file-fdw"><application>file_fdw</application></link> to read from program output as well as files (Corey Huinker, Adam Gomaa)
ru: Реализация в <link linkend="file-fdw"><application>file_fdw</application></link> возможности читать вывод программ, так же как и содержимое файлов (Кори Хинкер, Адам Гомаа)

source: In <link linkend="postgres-fdw"><application>postgres_fdw</application></link>, push aggregate functions to the remote server, when possible (Jeevan Chalke, Ashutosh Bapat)
ru: В <link linkend="postgres-fdw"><application>postgres_fdw</application></link> реализована передача агрегатных функций на удалённый сервер, когда это возможно (Дживан Чок, Ашутош Бапат)

source: This reduces the amount of data that must be passed from the remote server, and offloads aggregate computation from the requesting server.
ru: Это сокращает объём данных, который должен передаваться со стороннего сервера и избавляет запрашивающий сервер от вычисления агрегатной функции.

source: In <application>postgres_fdw</application>, push joins to the remote server in more cases (David Rowley, Ashutosh Bapat, Etsuro Fujita)
ru: <application>postgres_fdw</application> может передавать соединения отношений на сторонний сервер в большем числе случаев (Дэвид Роули, Ашутош Бапат, Эцуро Фудзита)

source: Properly support <type>OID</type> columns in <application>postgres_fdw</application> tables (Etsuro Fujita)
ru: Исправление поддержки столбцов <type>OID</type> в таблицах <application>postgres_fdw</application> (Эцуро Фудзита)

source: Previously <type>OID</type> columns always returned zeros.
ru: Ранее в столбцах <type>OID</type> всегда возвращались нули.

source: Allow <link linkend="btree-gist"><application>btree_gist</application></link> and <link linkend="btree-gin"><application>btree_gin</application></link> to index enum types (Andrew Dunstan)
ru: Реализация в <link linkend="btree-gist"><application>btree_gist</application></link> и <link linkend="btree-gin"><application>btree_gin</application></link> возможности индексировать типы-перечисления (Эндрю Дунстан)

source: This allows enums to be used in exclusion constraints.
ru: Это позволяет использовать перечисления в ограничениях-исключениях.

source: Add indexing support to <application>btree_gist</application> for the <type>UUID</type> data type (Paul Jungwirth)
ru: Добавление в <application>btree_gist</application> поддержки индексации для типа данных <type>UUID</type> (Пол Юнгвирт)

source: Add <link linkend="amcheck"><application>amcheck</application></link> which can check the validity of B-tree indexes (Peter Geoghegan)
ru: Добавлено расширение <link linkend="amcheck"><application>amcheck</application></link>, которое может проверять корректность индексов-B-деревьев (Питер Геохеган)

source: Show ignored constants as <literal>$N</literal> rather than <literal>?</literal> in <link linkend="pgstatstatements"><application>pg_stat_statements</application></link> (Lukas Fittl)
ru: Отображение в <link linkend="pgstatstatements"><application>pg_stat_statements</application></link> игнорируемых констант как <literal>$N</literal>, а не как <literal>?</literal> (Лукас Фиттл)

source: Improve <link linkend="cube"><application>cube</application></link>'s handling of zero-dimensional cubes (Tom Lane)
ru: Улучшение в модуле <link linkend="cube"><application>cube</application></link> обработки кубов с нулевой размерностью (Том Лейн)

source: This also improves handling of <literal>infinite</literal> and <literal>NaN</literal> values.
ru: При этом также улучшена работа со значениями <literal>infinite</literal> и <literal>NaN</literal>.

source: Allow <link linkend="pgbuffercache"><application>pg_buffercache</application></link> to run with fewer locks (Ivan Kartyshov)
ru: Сокращение числа блокировок при обращении к представлению <link linkend="pgbuffercache"><application>pg_buffercache</application></link> (Иван Картышов)

source: This makes it less disruptive when run on production systems.
ru: Как следствие, его можно более беспрепятственно использовать в производственных средах.

source: Add <link linkend="pgstattuple"><application>pgstattuple</application></link> function <function>pgstathashindex()</function> to view hash index statistics (Ashutosh Sharma)
ru: Добавление в <link linkend="pgstattuple"><application>pgstattuple</application></link> функции <function>pgstathashindex()</function> для просмотра статистики хеш-индексов (Ашутош Шарма)

source: Use <command>GRANT</command> permissions to control <application>pgstattuple</application> function usage (Stephen Frost)
ru: Возможность использовать <command>GRANT</command> для управления доступом к функциям <application>pgstattuple</application> (Стивен Фрост)

source: This allows DBAs to allow non-superusers to run these functions.
ru: Это позволяет администраторам разрешать вызывать эти функции не только суперпользователям.

source: Reduce locking when <application>pgstattuple</application> examines hash indexes (Amit Kapila)
ru: Сокращение числа блокировок в <application>pgstattuple</application> при просмотре хеш-индексов (Амит Капила)

source: Add <link linkend="pageinspect"><application>pageinspect</application></link> function <function>page_checksum()</function> to show a page's checksum (Tomas Vondra)
ru: Добавление в <link linkend="pageinspect"><application>pageinspect</application></link> функции <function>page_checksum()</function> для получения контрольной суммы страницы (Томаш Вондра)

source: Add <application>pageinspect</application> function <function>bt_page_items()</function> to print page items from a page image (Tomas Vondra)
ru: Добавление в <application>pageinspect</application> функции <function>bt_page_items()</function>, которая выводит элементы страницы для переданного образа страницы (Томаш Вондра)

source: Add hash index support to <application>pageinspect</application> (Jesper Pedersen, Ashutosh Sharma)
ru: Добавление поддержки хеш-индексов в <application>pageinspect</application> (Джеспер Педерсен, Ашутош Шарма)

source: Acknowledgments
ru: Благодарственный список

source: The following individuals (in alphabetical order) have contributed to this release as patch authors, committers, reviewers, testers, or reporters of issues.
ru: Перечисленные ниже (в алфавитном порядке) лица сделали вклад в этот выпуск, разрабатывая, совершенствуя и рецензируя код, принимая правки, проводя тестирование или сообщая о проблемах.

source: Adam Brightwell
ru: Адам Брайтвелл (Adam Brightwell)

source: Adam Brusselback
ru: Адам Брюссельбек (Adam Brusselback)

source: Adam Gomaa
ru: Адам Гомаа (Adam Gomaa)

source: Adam Sah
ru: Адам Сах (Adam Sah)

source: Adrian Klaver
ru: Адриан Клавер (Adrian Klaver)

source: Aidan Van Dyk
ru: Аидан Ван Дик (Aidan Van Dyk)

source: Aleksander Alekseev
ru: Александр Алексеев (Aleksander Alekseev)

source: Alexander Korotkov
ru: Александр Коротков (Alexander Korotkov)

source: Alexander Lakhin
ru: Александр Лахин (Alexander Lakhin)

source: Alexander Sosna
ru: Александр Сосна (Alexander Sosna)

source: Alexey Bashtanov
ru: Алексей Баштанов (Alexey Bashtanov)

source: Alexey Grishchenko
ru: Алексей Грищенко (Alexey Grishchenko)

source: Alexey Isayko
ru: Алексей Исайко (Alexey Isayko)

source: &Aacute;lvaro Hern&aacute;ndez Tortosa
ru: Альваро Эрнандес Тортоза (&Aacute;lvaro Hern&aacute;ndez Tortosa)

source: &Aacute;lvaro Herrera
ru: Альваро Эррера (&Aacute;lvaro Herrera)

source: Amit Kapila
ru: Амит Капила (Amit Kapila)

source: Amit Khandekar
ru: Амит Хандекар (Amit Khandekar)

source: Amit Langote
ru: Амит Ланготе (Amit Langote)

source: Amul Sul
ru: Амул Сул (Amul Sul)

source: Anastasia Lubennikova
ru: Анастасия Лубенникова (Anastasia Lubennikova)

source: Andreas Joseph Krogh
ru: Андреас Джозеф Крог (Andreas Joseph Krogh)

source: Andreas Karlsson
ru: Андреас Карлссон (Andreas Karlsson)

source: Andreas Scherbaum
ru: Андреас Шербаум (Andreas Scherbaum)

source: Andreas Seltenreich
ru: Андреас Зельтенрейх (Andreas Seltenreich)

source: Andres Freund
ru: Андрес Фройнд (Andres Freund)

source: Andrew Dunstan
ru: Эндрю Дунстан (Andrew Dunstan)

source: Andrew Gierth
ru: Эндрю Гирт (Andrew Gierth)

source: Andrew Wheelwright
ru: Эндрю Вилрайт (Andrew Wheelwright)

source: Andrey Borodin
ru: Андрей Бородин (Andrey Borodin)

source: Andrey Lizenko
ru: Андрей Лизенко (Andrey Lizenko)

source: Andy Abelisto
ru: Энди Абелисто (Andy Abelisto)

source: Antonin Houska
ru: Антонин Хоуска (Antonin Houska)

source: Ants Aasma
ru: Антс Аасма (Ants Aasma)

source: Arjen Nienhuis
ru: Арьен Нинхаус (Arjen Nienhuis)

source: Arseny Sher
ru: Арсений Шер (Arseny Sher)

source: Artur Zakirov
ru: Артур Закиров (Artur Zakirov)

source: Ashutosh Bapat
ru: Ашутош Бапат (Ashutosh Bapat)

source: Ashutosh Sharma
ru: Ашутош Шарма (Ashutosh Sharma)

source: Ashwin Agrawal
ru: Ашвин Агравал (Ashwin Agrawal)

source: Atsushi Torikoshi
ru: Атсуши Торикоши (Atsushi Torikoshi)

source: Ayumi Ishii
ru: Аюми Исии (Ayumi Ishii)

source: Basil Bourque
ru: Бейзил Бурк (Basil Bourque)

source: Beena Emerson
ru: Бина Емерсон (Beena Emerson)

source: Ben de Graaff
ru: Бен де Грааф (Ben de Graaff)

source: Benedikt Grundmann
ru: Бенедикт Грундман (Benedikt Grundmann)

source: Bernd Helmle
ru: Бернд Хелмле (Bernd Helmle)

source: Brad DeJong
ru: Брэд Дейонг (Brad DeJong)

source: Brandur Leach
ru: Брандур Лич (Brandur Leach)

source: Breen Hagan
ru: Брин Хаган (Breen Hagan)

source: Bruce Momjian
ru: Брюс Момджян (Bruce Momjian)

source: Bruno Wolff III
ru: Бруно Вольф III (Bruno Wolff III)

source: Catalin Iacob
ru: Каталин Якоб (Catalin Iacob)

source: Chapman Flack
ru: Чепмен Флэк (Chapman Flack)

source: Chen Huajun
ru: Чэнь Хуацзюнь (Chen Huajun)

source: Choi Doo-Won
ru: Чхве Ду-Вон (Choi Doo-Won)

source: Chris Bandy
ru: Крис Бенди (Chris Bandy)

source: Chris Richards
ru: Крис Ричардс (Chris Richards)

source: Chris Ruprecht
ru: Крис Рупрехт (Chris Ruprecht)

source: Christian Ullrich
ru: Кристиан Ульрих (Christian Ullrich)

source: Christoph Berg
ru: Кристоф Берг (Christoph Berg)

source: Chuanting Wang
ru: Чуаньтин Ван (Chuanting Wang)

source: Claudio Freire
ru: Клаудио Фрейре (Claudio Freire)

source: Clinton Adams
ru: Клинтон Адамс (Clinton Adams)

source: Const Zhang
ru: Конст Чжан (Const Zhang)

source: Constantin Pan
ru: Константин Пан (Constantin Pan)

source: Corey Huinker
ru: Кори Хинкер (Corey Huinker)

source: Craig Ringer
ru: Крейг Рингер (Craig Ringer)

source: Cynthia Shang
ru: Синтия Шан (Cynthia Shang)

source: Dagfinn Ilmari Manns&aring;ker
ru: Дагфинн Ильмари Маннсакер (Dagfinn Ilmari Mannsåker)

source: Daisuke Higuchi
ru: Дайсукэ Хигути (Daisuke Higuchi)

source: Damian Quiroga
ru: Дамиан Кирога (Damian Quiroga)

source: Dan Wood
ru: Дэн Вуд (Dan Wood)

source: Daniel Gustafsson
ru: Даниэль Густафсон (Daniel Gustafsson)

source: Daniel V&eacute;rit&eacute;
ru: Даниэль Верите (Daniel Vérité)

source: Daniel Westermann
ru: Даниель Вестерман (Daniel Westermann)

source: Daniele Varrazzo
ru: Даниэле Вараццо (Daniele Varrazzo)

source: Danylo Hlynskyi
ru: Данило Глинский (Danylo Hlynskyi)

source: Darko Prelec
ru: Дарко Прелец (Darko Prelec)

source: Dave Cramer
ru: Дейв Крамер (Dave Cramer)

source: Dave Page
ru: Дейв Пейдж (Dave Page)

source: David Christensen
ru: Дэвид Кристенсен (David Christensen)

source: David Fetter
ru: Давид Феттер (David Fetter)

source: David Johnston
ru: Дэвид Джонстон (David Johnston)

source: David Rader
ru: Дэвид Рэйдер (David Rader)

source: David Rowley
ru: Дэвид Роули (David Rowley)

source: David Steele
ru: Дэвид Стил (David Steele)

source: Dean Rasheed
ru: Дин Рашид (Dean Rasheed)

source: Denis Smirnov
ru: Денис Смирнов (Denis Smirnov)

source: Denish Patel
ru: Дениш Патель (Denish Patel)

source: Dennis Bj&ouml;rklund
ru: Деннис Бьорклунд (Dennis Björklund)

source: Devrim G&uuml;nd&uuml;z
ru: Деврим Гюндюз (Devrim Gündüz)

source: Dilip Kumar
ru: Дилип Кумар (Dilip Kumar)

source: Dilyan Palauzov
ru: Дилян Палаузов (Dilyan Palauzov)

source: Dima Pavlov
ru: Дмитрий Павлов (Dima Pavlov)

source: Dimitry Ivanov
ru: Дмитрий Иванов (Dimitry Ivanov)

source: Dmitriy Sarafannikov
ru: Дмитрий Сарафанников (Dmitriy Sarafannikov)

source: Dmitry Dolgov
ru: Дмитрий Долгов (Dmitry Dolgov)

source: Dmitry Fedin
ru: Дмитрий Федин (Dmitry Fedin)

source: Don Morrison
ru: Дон Моррисон (Don Morrison)

source: Egor Rogov
ru: Егор Рогов (Egor Rogov)

source: Eiji Seki
ru: Эйдзи Сэки (Eiji Seki)

source: Emil Iggland
ru: Эмил Иггланд (Emil Iggland)

source: Emre Hasegeli
ru: Эмре Хасегели (Emre Hasegeli)

source: Enrique Meneses
ru: Энрике Менесес (Enrique Meneses)

source: Erik Nordstr&ouml;m
ru: Эрик Нордстром (Erik Nordström)

source: Erik Rijkers
ru: Эрик Рижкерс (Erik Rijkers)

source: Erwin Brandstetter
ru: Эрвин Брандштеттер (Erwin Brandstetter)

source: Etsuro Fujita
ru: Эцуро Фудзита (Etsuro Fujita)

source: Eugen Konkov
ru: Евгений Коньков (Eugen Konkov)

source: Eugene Kazakov
ru: Евгений Казаков (Eugene Kazakov)

source: Euler Taveira
ru: Эйлер Тавейра (Euler Taveira)

source: Fabien Coelho
ru: Фабьен Коэльо (Fabien Coelho)

source: Fabr&iacute;zio de Royes Mello
ru: Фабрицио де Ройес Мелло (Fabrízio de Royes Mello)

source: Fakhroutdinov Evgenievich
ru: Тахир Фахрутдинов (Tahir Fakhroutdinov)

source: Feike Steenbergen
ru: Фейке Стинберген (Feike Steenbergen)

source: Felix Gerzaguet
ru: Феликс Герзаге (Felix Gerzaguet)

source: Filip Jirs&aacute;k
ru: Филип Йирсак (Filip Jirs&aacute;k)

source: Fujii Masao
ru: Фудзии Масао (Fujii Masao)

source: Gabriele Bartolini
ru: Габриэль Бартолини (Gabriele Bartolini)

source: Gabrielle Roth
ru: Габриэль Рот (Gabrielle Roth)

source: Gao Zengqi
ru: Гао Зенджи (Gao Zengqi)

source: Gerdan Santos
ru: Гердан Сантос (Gerdan Santos)

source: Gianni Ciolli
ru: Джанни Чиолли (Gianni Ciolli)

source: Gilles Darold
ru: Жиль Даролд (Gilles Darold)

source: Giuseppe Broccolo
ru: Джузеппе Брокколо (Giuseppe Broccolo)

source: Graham Dutton
ru: Грэхем Даттон (Graham Dutton)

source: Greg Atkins
ru: Грег Аткинс (Greg Atkins)

source: Greg Burek
ru: Грег Бурек (Greg Burek)

source: Grigory Smolkin
ru: Григорий Смолкин (Grigory Smolkin)

source: Guillaume Lelarge
ru: Гийом Леларж (Guillaume Lelarge)

source: Hans Buschmann
ru: Ханс Бушман (Hans Buschmann)

source: Haribabu Kommi
ru: Харибабу Комми (Haribabu Kommi)

source: Heikki Linnakangas
ru: Хейкки Линнакангас (Heikki Linnakangas)

source: Henry Boehlert
ru: Генри Болерт (Henry Boehlert)

source: Huan Ruan
ru: Хуань Жуань (Huan Ruan)

source: Huong Dangminh
ru: Хыонг Дангминь (Huong Dangminh)

source: Ian Barwick
ru: Иэн Барвик (Ian Barwick)

source: Igor Korot
ru: Игорь Корот (Igor Korot)
