Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/release-10.po
Languages: ru

source: Ildus Kurbangaliev
ru: Ильдус Курбангалиев (Ildus Kurbangaliev)

source: Ivan Kartyshov
ru: Иван Картышов (Ivan Kartyshov)

source: Jaime Casanova
ru: Хайме Казанова (Jaime Casanova)

source: Jakob Egger
ru: Якоб Еггер (Jakob Egger)

source: James Parks
ru: Джеймс Паркс (James Parks)

source: Jarred Ward
ru: Джаред Уорд (Jarred Ward)

source: Jason Li
ru: Джейсон Ли (Jason Li)

source: Jason O'Donnell
ru: Джейсон О'Доннелл (Jason O'Donnell)

source: Jason Petersen
ru: Джейсон Петерсен (Jason Petersen)

source: Jeevan Chalke
ru: Дживан Чок (Jeevan Chalke)

source: Jeevan Ladhe
ru: Дживан Ладхе (Jeevan Ladhe)

source: Jeff Dafoe
ru: Джефф Дэфо (Jeff Dafoe)

source: Jeff Davis
ru: Джефф Девис (Jeff Davis)

source: Jeff Janes
ru: Джефф Джейнс (Jeff Janes)

source: Jelte Fennema
ru: Йелте Феннема (Jelte Fennema)

source: Jeremy Finzel
ru: Джереми Финцель (Jeremy Finzel)

source: Jeremy Schneider
ru: Джереми Шнайдер (Jeremy Schneider)

source: Jeroen van der Ham
ru: Йерун ван дер Хам (Jeroen van der Ham)

source: Jesper Pedersen
ru: Джеспер Педерсен (Jesper Pedersen)

source: Jim Mlodgenski
ru: Джим Млодженски (Jim Mlodgenski)

source: Jim Nasby
ru: Джим Нэсби (Jim Nasby)

source: Jinyu Zhang
ru: Джинью Чжан (Jinyu Zhang)

source: Joe Conway
ru: Джо Конвей (Joe Conway)

source: Joel Jacobson
ru: Джоэл Джейкобсон (Joel Jacobson)

source: John Harvey
ru: Джон Харви (John Harvey)

source: Jon Nelson
ru: Йон Нельсон (Jon Nelson)

source: Jordan Gigov
ru: Джордан Гигов (Jordan Gigov)

source: Josh Berkus
ru: Джон Беркус (Josh Berkus)

source: Josh Soref
ru: Джош Сореф (Josh Soref)

source: Julian Markwort
ru: Джулиан Маркворт (Julian Markwort)

source: Julien Rouhaud
ru: Жульен Рухо (Julien Rouhaud)

source: Junseok Yang
ru: Джун-сок Ян (Junseok Yang)

source: Justin Muise
ru: Джастин Муис (Justin Muise)

source: Justin Pryzby
ru: Джастин Призби (Justin Pryzby)

source: Kacper Zuk
ru: Каспер Жук (Kacper Zuk)

source: KaiGai Kohei
ru: КайГай Кохэй (KaiGai Kohei)

source: Karen Huddleston
ru: Карен Хаддлстон (Karen Huddleston)

source: Karl Lehenbauer
ru: Карл Лехенбауэр (Karl Lehenbauer)

source: Karl O. Pinc
ru: Карл О. Пинц (Karl O. Pinc)

source: Keith Fiske
ru: Кейт Фиске (Keith Fiske)

source: Kevin Grittner
ru: Кевин Гриттнер (Kevin Grittner)

source: Kim Rose Carlsen
ru: Ким Росе Карлсен (Kim Rose Carlsen)

source: Konstantin Evteev
ru: Константин Евтеев (Konstantin Evteev)

source: Konstantin Knizhnik
ru: Константин Книжник (Konstantin Knizhnik)

source: Kuntal Ghosh
ru: Кунтал Гхош (Kuntal Ghosh)

source: Kurt Kartaltepe
ru: Курт Карталтепе (Kurt Kartaltepe)

source: Kyle Conroy
ru: Кайл Конрой (Kyle Conroy)

source: Kyotaro Horiguchi
ru: Кётаро Хоригути (Kyotaro Horiguchi)

source: Laurenz Albe
ru: Лауренц Альбе (Laurenz Albe)

source: Leonardo Cecchi
ru: Леонардо Чекки (Leonardo Cecchi)

source: Ludovic Vaugeois-Pepin
ru: Людовик Вожуа-Пепин (Ludovic Vaugeois-Pepin)

source: Lukas Fittl
ru: Лукас Фиттл (Lukas Fittl)

source: Magnus Hagander
ru: Магнус Хагандер (Magnus Hagander)

source: Maksim Milyutin
ru: Максим Милютин (Maksim Milyutin)

source: Maksym Sobolyev
ru: Максим Соболев (Maksym Sobolyev)

source: Marc Rassbach
ru: Марк Расбах (Marc Rassbach)

source: Marc-Olaf Jaschke
ru: Марк-Олаф Яшке (Marc-Olaf Jaschke)

source: Marcos Castedo
ru: Маркос Кастедо (Marcos Castedo)

source: Marek Cvoren
ru: Марек Чворен (Marek Cvoren)

source: Mark Dilger
ru: Марк Дилгер (Mark Dilger)

source: Mark Kirkwood
ru: Марк Кирквуд (Mark Kirkwood)

source: Mark Pether
ru: Марк Петер (Mark Pether)

source: Marko Tiikkaja
ru: Марко Тииккая (Marko Tiikkaja)

source: Markus Winand
ru: Маркус Винанд (Markus Winand)

source: Marllius Ribeiro
ru: Марллиус Рибейро (Marllius Ribeiro)

source: Marti Raudsepp
ru: Марти Раудсепп (Marti Raudsepp)

source: Mart&iacute;n Marqu&eacute;s
ru: Мартин Маркес (Martín Marqués)

source: Masahiko Sawada
ru: Масахико Савада (Masahiko Sawada)

source: Matheus Oliveira
ru: Матеус Оливейра (Matheus Oliveira)

source: Mathieu Fenniak
ru: Мэтью Феньяк (Mathieu Fenniak)

source: Merlin Moncure
ru: Мерлин Монкьюр (Merlin Moncure)

source: Michael Banck
ru: Михаэль Банк (Michael Banck)

source: Michael Day
ru: Майкл Дэй (Michael Day)

source: Michael Meskes
ru: Михаэль Мескес (Michael Meskes)

source: Michael Overmeyer
ru: Михаэль Овермайер (Michael Overmeyer)

source: Michael Paquier
ru: Мишель Пакье (Michael Paquier)

source: Mike Palmiotto
ru: Майк Пальмиотто (Mike Palmiotto)

source: Milos Urbanek
ru: Милош Урбанек (Milos Urbanek)

source: Mithun Cy
ru: Митхун Ки (Mithun Cy)

source: Moshe Jacobson
ru: Мойше Джейкобсон (Moshe Jacobson)

source: Murtuza Zabuawala
ru: Муртуза Забуавала (Murtuza Zabuawala)

source: Naoki Okano
ru: Наоки Окано (Naoki Okano)

source: Nathan Bossart
ru: Натан Боссарт (Nathan Bossart)

source: Nathan Wagner
ru: Натан Вагнер (Nathan Wagner)

source: Neha Khatri
ru: Неха Хатри (Neha Khatri)

source: Neha Sharma
ru: Неха Шарма (Neha Sharma)

source: Neil Anderson
ru: Нил Андерсон (Neil Anderson)

source: Nicolas Baccelli
ru: Николас Бачелли (Nicolas Baccelli)

source: Nicolas Guini
ru: Николас Гини (Nicolas Guini)

source: Nicolas Thauvin
ru: Николас Товен (Nicolas Thauvin)

source: Nikhil Sontakke
ru: Никхил Сонтакке (Nikhil Sontakke)

source: Nikita Glukhov
ru: Никита Глухов (Nikita Glukhov)

source: Nikolaus Thiel
ru: Николаус Тиль (Nikolaus Thiel)

source: Nikolay Nikitin
ru: Николай Никитин (Nikolay Nikitin)

source: Nikolay Shaplov
ru: Николай Шаплов (Nikolay Shaplov)

source: Noah Misch
ru: Ной Миш (Noah Misch)

source: Noriyoshi Shinoda
ru: Нориёси Синода (Noriyoshi Shinoda)

source: Olaf Gawenda
ru: Олаф Гавенда (Olaf Gawenda)

source: Oleg Bartunov
ru: Олег Бартунов (Oleg Bartunov)

source: Oskari Saarenmaa
ru: Оскари Сааренмаа (Oskari Saarenmaa)

source: Otar Shavadze
ru: Отар Шавадзе (Otar Shavadze)

source: Paresh More
ru: Пареш Мор (Paresh More)

source: Paul Jungwirth
ru: Пол Юнгвирт (Paul Jungwirth)

source: Paul Ramsey
ru: Пол Рамсей (Paul Ramsey)

source: Pavan Deolasee
ru: Паван Деоласи (Pavan Deolasee)

source: Pavel Golub
ru: Павел Голубь (Pavel Golub)

source: Pavel Han&aacute;k
ru: Павел Ханак (Pavel Han&aacute;k)

source: Pavel Raiskup
ru: Павел Райскуп (Pavel Raiskup)

source: Pavel Stehule
ru: Павел Стехуле (Pavel Stehule)

source: Peng Sun
ru: Пэн Сунь (Peng Sun)

source: Peter Eisentraut
ru: Питер Эйзентраут (Peter Eisentraut)

source: Peter Geoghegan
ru: Питер Геохеган (Peter Geoghegan)

source: Petr Jel&iacute;nek
ru: Петр Желинек (Petr Jelínek)

source: Philippe Beaudoin
ru: Филипп Бодуэн (Philippe Beaudoin)

source: Pierre-Emmanuel Andr&eacute;
ru: Пьер-Эммануэль Андре (Pierre-Emmanuel André)

source: Piotr Stefaniak
ru: Пётр Стефаняк (Piotr Stefaniak)

source: Prabhat Sahu
ru: Прабхат Саху (Prabhat Sahu)

source: QL Zhuo
ru: Куэль Чжо (QL Zhuo)

source: Radek Slupik
ru: Радек Слупик (Radek Slupik)

source: Rafa de la Torre
ru: Рафа де ла Торре (Rafa de la Torre)

source: Rafia Sabih
ru: Рафия Сабих (Rafia Sabih)

source: Ragnar Ouchterlony
ru: Рагнар Оухтерлони (Ragnar Ouchterlony)

source: Rahila Syed
ru: Рахила Сьед (Rahila Syed)

source: Rajkumar Raghuwanshi
ru: Раджкумар Рагхуванши (Rajkumar Raghuwanshi)

source: Regina Obe
ru: Регина Обе (Regina Obe)

source: Richard Pistole
ru: Ричард Пистоль (Richard Pistole)

source: Robert Haas
ru: Роберт Хаас (Robert Haas)

source: Robins Tharakan
ru: Робинс Таракан (Robins Tharakan)

source: Rod Taylor
ru: Род Тейлор (Rod Taylor)

source: Roman Shaposhnik
ru: Роман Шапошник (Roman Shaposhnik)

source: Rushabh Lathia
ru: Рушаб Латиа (Rushabh Lathia)

source: Ryan Murphy
ru: Райан Мерфи (Ryan Murphy)

source: Sandeep Thakkar
ru: Сандип Таккар (Sandeep Thakkar)

source: Scott Milliken
ru: Скотт Милликен (Scott Milliken)

source: Sean Farrell
ru: Шон Фаррел (Sean Farrell)

source: Sebastian Luque
ru: Себастьян Луке (Sebastian Luque)

source: Sehrope Sarkuni
ru: Сероп Саркуни (Sehrope Sarkuni)

source: Sergey Burladyan
ru: Сергей Бурладян (Sergey Burladyan)

source: Sergey Koposov
ru: Сергей Копосов (Sergey Koposov)

source: Shay Rojansky
ru: Шэй Роджански (Shay Rojansky)

source: Shinichi Matsuda
ru: Синъити Мацуда (Shinichi Matsuda)

source: Sho Kato
ru: Шо Като (Sho Kato)

source: Simon Riggs
ru: Саймон Риггс (Simon Riggs)

source: Simone Gotti
ru: Симоне Готти (Simone Gotti)

source: Spencer Thomason
ru: Спенсер Томасон (Spencer Thomason)

source: Stas Kelvich
ru: Стас Кельвич (Stas Kelvich)

source: Stepan Pesternikov
ru: Степан Пестерников (Stepan Pesternikov)

source: Stephen Frost
ru: Стивен Фрост (Stephen Frost)

source: Steve Randall
ru: Стив Рэндалл (Steve Randall)

source: Steve Singer
ru: Стив Сингер (Steve Singer)

source: Steven Fackler
ru: Стивен Фэклер (Steven Fackler)

source: Steven Winfield
ru: Стивен Винфилд (Steven Winfield)

source: Suraj Kharage
ru: Сурадж Хараге (Suraj Kharage)

source: Sveinn Sveinsson
ru: Свейн Свейнссон (Sveinn Sveinsson)

source: Sven R. Kunze
ru: Свен Р. Кунце (Sven R. Kunze)

source: Taiki Kondo
ru: Тайки Кондо (Taiki Kondo)

source: Takayuki Tsunakawa
ru: Такаюки Цунакава (Takayuki Tsunakawa)

source: Takeshi Ideriha
ru: Такэси Идэриха (Takeshi Ideriha)

source: Tatsuo Ishii
ru: Тацуо Исии (Tatsuo Ishii)

source: Tatsuro Yamada
ru: Тацуро Ямада (Tatsuro Yamada)

source: Teodor Sigaev
ru: Фёдор Сигаев (Teodor Sigaev)

source: Thom Brown
ru: Том Браун (Thom Brown)

source: Thomas Kellerer
ru: Томас Келлерер (Thomas Kellerer)

source: Thomas Munro
ru: Томас Мунро (Thomas Munro)

source: Tim Goodaire
ru: Тим Гудэйр (Tim Goodaire)

source: Tobias Bussmann
ru: Тобиас Бусман (Tobias Bussmann)

source: Tom Dunstan
ru: Том Дунстан (Tom Dunstan)

source: Tom Lane
ru: Том Лейн (Tom Lane)

source: Tom van Tilburg
ru: Тома ван Тилбург (Tom van Tilburg)

source: Tomas Vondra
ru: Томаш Вондра (Tomas Vondra)

source: Tomonari Katsumata
ru: Томонари Кацумата (Tomonari Katsumata)

source: Tushar Ahuja
ru: Тушар Ахуджа (Tushar Ahuja)

source: Vaishnavi Prabakaran
ru: Вайшнави Прабакаран (Vaishnavi Prabakaran)

source: Venkata Balaji Nagothi
ru: Венката Балажи Наготи (Venkata Balaji Nagothi)

source: Vicky Vergara
ru: Вики Вергара (Vicky Vergara)

source: Victor Wagner
ru: Виктор Вагнер (Victor Wagner)

source: Vik Fearing
ru: Вик Фиринг (Vik Fearing)

source: Vinayak Pokale
ru: Винаяк Покале (Vinayak Pokale)

source: Viren Negi
ru: Вирен Неги (Viren Negi)

source: Vitaly Burovoy
ru: Виталий Буровой (Vitaly Burovoy)

source: Vladimir Kunshchikov
ru: Владимир Кунщиков (Vladimir Kunshchikov)

source: Vladimir Rusinov
ru: Владимир Русинов (Vladimir Rusinov)

source: Yi Wen Wong
ru: И Вэнь Вон (Yi Wen Wong)

source: Yugo Nagata
ru: Юго Нагата (Yugo Nagata)

source: Zhen Ming Yang
ru: Чжэнь Мин Ян (Zhen Ming Yang)

source: Zhou Digoal
ru: Чжоу Дигоал (Zhou Digoal)
