Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/release-10.po
Languages: ru

source: This is different from <link linkend="functions-txid-snapshot"><function>txid_current()</function></link>, which always returns a transaction ID, assigning one if necessary. Unlike that function, this function can be run on standby servers.
ru: Этим данная функция отличается от <link linkend="functions-txid-snapshot"><function>txid_current()</function></link>, которая всегда возвращает идентификатор транзакции (назначая его, если он отсутствует). Данную функцию, в отличие от неё, можно выполнять на ведомых серверах.

source: Add function <link linkend="functions-txid-snapshot"><function>txid_status()</function></link> to check if a transaction was committed (Craig Ringer)
ru: Добавление функции <link linkend="functions-txid-snapshot"><function>txid_status()</function></link>, проверяющей, была ли зафиксирована транзакция (Крейг Рингер)

source: This is useful for checking after an abrupt disconnection whether your previous transaction committed and you just didn't receive the acknowledgement.
ru: Это позволяет проверить после неожиданного обрыва соединения, была ли зафиксирована предыдущая транзакция, если вы просто не успели получить уведомление об этом.

source: Allow <link linkend="functions-formatting-table"><function>make_date()</function></link> to interpret negative years as <acronym>BC</acronym> years (&Aacute;lvaro Herrera)
ru: Добавление функции <link linkend="functions-formatting-table"><function>make_date()</function></link>, интерпретирующей отрицательные числа, как годы до нашей эры (Альваро Эррера)

source: Make <function>to_timestamp()</function> and <function>to_date()</function> reject out-of-range input fields (Artur Zakirov)
ru: Функции <function>to_timestamp()</function> и <function>to_date()</function> не должны принимать поля вне допустимых пределов (Артур Закиров)

source: For example, previously <literal>to_date('2009-06-40','YYYY-MM-DD')</literal> was accepted and returned <literal>2009-07-10</literal>. It will now generate an error.
ru: Например, ранее вызов <literal>to_date('2009-06-40','YYYY-MM-DD')</literal> выполнялся успешно и возвращалась дата <literal>2009-07-10</literal>. Теперь с такими аргументами будет выдаваться ошибка.

source: Server-Side Languages
ru: Языки программирования на стороне сервера

source: Allow PL/Python's <function>cursor()</function> and <function>execute()</function> functions to be called as methods of their plan-object arguments (Peter Eisentraut)
ru: Возможность вызывать функции <function>cursor()</function> и <function>execute()</function> в PL/Python как методы их аргумента — объекта plan (Питер Эйзентраут)

source: This allows a more object-oriented programming style.
ru: Это позволяет придерживаться более объектно-ориентированного стиля программирования.

source: Allow PL/pgSQL's <command>GET DIAGNOSTICS</command> statement to retrieve values into array elements (Tom Lane)
ru: Реализована возможность получать значения оператора <command>GET DIAGNOSTICS</command> в PL/pgSQL в элементах массива (Том Лейн)

source: Previously, a syntactic restriction prevented the target variable from being an array element.
ru: Ранее синтаксическое ограничение не допускало использования в качестве целевой переменной элемента массива.

source: Allow PL/Tcl functions to return composite types and sets (Karl Lehenbauer)
ru: Возможность возвращать составные типы и наборы данных из функций PL/Tcl (Карл Лехенбауэр)

source: Add a subtransaction command to PL/Tcl (Victor Wagner)
ru: Добавление команды subtransaction в PL/Tcl (Виктор Вагнер)

source: This allows PL/Tcl queries to fail without aborting the entire function.
ru: Это позволяет обработать ошибку в запросах PL/Tcl, не прерывая всю функцию.

source: Add server parameters <xref linkend="guc-pltcl-start-proc"/> and <xref linkend="guc-pltclu-start-proc"/>, to allow initialization functions to be called on PL/Tcl startup (Tom Lane)
ru: Добавление серверных параметров <xref linkend="guc-pltcl-start-proc"/> и <xref linkend="guc-pltclu-start-proc"/> для указания функций инициализации, которые будут вызываться при запуске PL/Tcl (Том Лейн)

source: Client Interfaces
ru: Клиентские интерфейсы

source: Allow specification of <link linkend="libpq-connect-host">multiple host names or addresses</link> in libpq connection strings and URIs (Robert Haas, Heikki Linnakangas)
ru: Реализована возможность указания <link linkend="libpq-connect-host">нескольких адресов или имён серверов</link> в строках подключения libpq и в строках URI (Роберт Хаас, Хейкки Линнакангас)

source: libpq will connect to the first responsive server in the list.
ru: Функции libpq будут подключаться к первому работоспособному узлу из этого списка.

source: Allow libpq connection strings and URIs to request a <link linkend="libpq-connect-target-session-attrs">read/write host</link>, that is a master server rather than a standby server (Victor Wagner, Mithun Cy)
ru: В строках подключения libpq и URI добавлена возможность затребовать <link linkend="libpq-connect-target-session-attrs">сервер для чтения/записи</link>, то есть ведущий, а не ведомый сервер (Виктор Вагнер, Митхун Ки)

source: This is useful when multiple host names are specified. It is controlled by libpq connection parameter <option>target_session_attrs</option>.
ru: Это полезно при указании нескольких имён узлов. Соответствующий параметр подключения libpq — <option>target_session_attrs</option>.

source: Allow the <link linkend="libpq-connect-passfile">password file name</link> to be specified as a libpq connection parameter (Julian Markwort)
ru: Реализована возможность задавать в параметрах подключения libpq <link linkend="libpq-connect-passfile">имя файла паролей</link> (Джулиан Маркворт)

source: Previously this could only be specified via an environment variable.
ru: Ранее его можно было задать только в переменной окружения.

source: Add function <link linkend="libpq-pqencryptpasswordconn"><function>PQencryptPasswordConn()</function></link> to allow creation of more types of encrypted passwords on the client side (Michael Paquier, Heikki Linnakangas)
ru: Добавлена функция <link linkend="libpq-pqencryptpasswordconn"><function>PQencryptPasswordConn()</function></link>, позволяющая создавать больше видов зашифрованных паролей на стороне клиента (Мишель Пакье, Хейкки Линнакангас)

source: Previously only <literal>MD5</literal>-encrypted passwords could be created using <link linkend="libpq-pqencryptpassword"><function>PQencryptPassword()</function></link>. This new function can also create <link linkend="auth-pg-hba-conf"><literal>SCRAM-SHA-256</literal></link>-encrypted passwords.
ru: Ранее функцией <link linkend="libpq-pqencryptpassword"><function>PQencryptPassword()</function></link> можно было создавать только пароли, зашифрованные <literal>MD5</literal>. Новая функция может также создавать и пароли, зашифрованные методом <link linkend="auth-pg-hba-conf"><literal>SCRAM-SHA-256</literal></link>.

source: Change <application>ecpg</application> preprocessor version from 4.12 to 10 (Tom Lane)
ru: Изменение версии препроцессора <application>ecpg</application> с 4.12 на 10 (Том Лейн)

source: Henceforth the <application>ecpg</application> version will match the <productname>PostgreSQL</productname> distribution version number.
ru: Впредь версия <application>ecpg</application> будет соответствовать номеру версии дистрибутива <productname>PostgreSQL</productname>.

source: Client Applications
ru: Клиентские приложения

source: Add conditional branch support to <application>psql</application> (Corey Huinker)
ru: Добавлена поддержка условных ветвлений в <application>psql</application> (Кори Хинкер)

source: This feature adds <application>psql</application> meta-commands <command>\if</command>, <command>\elif</command>, <command>\else</command>, and <command>\endif</command>. This is primarily helpful for scripting.
ru: В <application>psql</application> появились метакоманды <command>\if</command>, <command>\elif</command>, <command>\else</command> и <command>\endif</command>. Это полезно в первую очередь для скриптов.

source: Add <application>psql</application> <command>\gx</command> meta-command to execute (<command>\g</command>) a query in expanded mode (<command>\x</command>) (Christoph Berg)
ru: Добавление в <application>psql</application> метакоманды <command>\gx</command> для выполнения запроса (запуска команды <command>\g</command>) в расширенном режиме (<command>\x</command>) (Кристоф Берг)

source: Expand <application>psql</application> variable references in backtick-executed strings (Tom Lane)
ru: Расширение переменных <application>psql</application> внутри строк, заключённых в обратные апострофы (Том Лейн)

source: This is particularly useful in the new <application>psql</application> conditional branch commands.
ru: Это особенно полезно в новых командах условного ветвления <application>psql</application>.

source: Prevent <application>psql</application>'s special variables from being set to invalid values (Daniel V&eacute;rit&eacute;, Tom Lane)
ru: Недопущение установки некорректных значений для специальных переменных <application>psql</application> (Даниэль Верите, Том Лейн)

source: Previously, setting one of <application>psql</application>'s special variables to an invalid value silently resulted in the default behavior. <command>\set</command> on a special variable now fails if the proposed new value is invalid. As a special exception, <command>\set</command> with an empty or omitted new value, on a boolean-valued special variable, still has the effect of setting the variable to <literal>on</literal>; but now it actually acquires that value rather than an empty string. <command>\unset</command> on a special variable now explicitly sets the variable to its default value, which is also the value it acquires at startup. In sum, a control variable now always has a displayable value that reflects what <application>psql</application> is actually doing.
ru: Ранее, если какой-либо специальной переменной <application>psql</application> присваивалось некорректное значение, оно просто игнорировалось и применялось поведение по умолчанию. Теперь <command>\set</command> со специальной переменной выдаст ошибку при недопустимом новом значении. В виде особого исключения <command>\set</command> с пустым или без нового значения по-прежнему действует как присвоение переменной значения <literal>on</literal>; но теперь в переменной действительно оказывается это значение, а не пустая строка. Команда <command>\unset</command> со специальной переменной теперь действительно сбрасывает переменную так, что она получает значение по умолчанию, то есть то значение, которая она имела при запуске. В итоге управляющая переменная теперь всегда имеет отображаемое значение, отражающее, что фактически делает <application>psql</application>.

source: Add variables showing server version and <application>psql</application> version (Fabien Coelho)
ru: Добавление переменных, показывающих версию сервера и <application>psql</application> (Фабьен Коэльо)

source: Improve <application>psql</application>'s <command>\d</command> (display relation) and <command>\dD</command> (display domain) commands to show collation, nullable, and default properties in separate columns (Peter Eisentraut)
ru: Добавление в команды <command>\d</command> (показать отношение) и <command>\dD</command> (показать домен) вывода правила сортировки, допустимости NULL и свойств по умолчанию в отдельных столбцах (Питер Эйзентраут)

source: Previously they were shown in a single <quote>Modifiers</quote> column.
ru: Ранее вся эта информация выводилась в одном столбце <quote>Модификаторы</quote>.

source: Make the various <command>\d</command> commands handle no-matching-object cases more consistently (Daniel Gustafsson)
ru: Унификация поведения команд <command>\d</command> в случаях, когда запрошенный объект не найден (Даниэль Густафсон)

source: They now all print the message about that to stderr, not stdout, and the message wording is more consistent.
ru: Теперь все они выводят сообщения об этом в stderr, а не в stdout, и текст сообщения стал более единообразным.

source: Improve <application>psql</application>'s tab completion (Jeff Janes, Ian Barwick, Andreas Karlsson, Sehrope Sarkuni, Thomas Munro, Kevin Grittner, Dagfinn Ilmari Manns&aring;ker)
ru: Усовершенствование дополнения табуляцией в <application>psql</application> (Джефф Джейнс, Иэн Барвик, Андреас Карлссон, Сероп Саркуни, Томас Мунро, Кевин Гриттнер. Дагфинн Ильмари Маннсакер)

source: Add <application>pgbench</application> option <option>--log-prefix</option> to control the log file prefix (Masahiko Sawada)
ru: Добавление в <application>pgbench</application> параметра <option>--log-prefix</option> для установки префикса файла журнала (Масахико Савада)

source: Allow <application>pgbench</application>'s meta-commands to span multiple lines (Fabien Coelho)
ru: Возможность разбивать метакоманды <application>pgbench</application> на несколько строк (Фабьен Коэльо)

source: A meta-command can now be continued onto the next line by writing backslash-return.
ru: Теперь метакоманду можно продолжить на следующей строке, введя обратную косую черту перед переводом строки.

source: Remove restriction on placement of <option>-M</option> option relative to other command line options (Tom Lane)
ru: Устранение ограничения на положение параметра <option>-M</option> по отношению к другим параметрам командной строки (Том Лейн)

source: Server Applications
ru: Серверные приложения

source: Add <link linkend="app-pgreceivewal"><application>pg_receivewal</application></link> option <option>-Z</option>/<option>--compress</option> to specify compression (Michael Paquier)
ru: Добавление в <link linkend="app-pgreceivewal"><application>pg_receivewal</application></link> параметра <option>-Z</option>/<option>--compress</option> для включения сжатия (Мишель Пакье)

source: Add <link linkend="app-pgrecvlogical"><application>pg_recvlogical</application></link> option <option>--endpos</option> to specify the ending position (Craig Ringer)
ru: Добавление в <link linkend="app-pgrecvlogical"><application>pg_recvlogical</application></link> параметра <option>--endpos</option> для указания конечной позиции (Крейг Рингер)

source: This complements the existing <option>--startpos</option> option.
ru: Этот параметр дополняет существовавший ранее параметр <option>--startpos</option>.

source: Rename <link linkend="app-initdb"><application>initdb</application></link> options <option>--noclean</option> and <option>--nosync</option> to be spelled <option>--no-clean</option> and <option>--no-sync</option> (Vik Fearing, Peter Eisentraut)
ru: Переименование параметров <link linkend="app-initdb"><application>initdb</application></link> <option>--noclean</option> и <option>--nosync</option> в <option>--no-clean</option> и <option>--no-sync</option> (Вик Фиринг, Питер Эйзентраут)

source: The old spellings are still supported.
ru: Старое написание по-прежнему поддерживается.

source: Allow <application>pg_restore</application> to exclude schemas (Michael Banck)
ru: В <application>pg_restore</application> реализована возможность исключать схемы (Михаэль Банк)

source: This adds a new <option>-N</option>/<option>--exclude-schema</option> option.
ru: Для этого добавлен новый ключ <option>-N</option>/<option>--exclude-schema</option>.

source: Add <option>--no-blobs</option> option to <application>pg_dump</application> (Guillaume Lelarge)
ru: В <application>pg_dump</application> добавлен параметр <option>--no-blobs</option> (Гийом Леларж)

source: This suppresses dumping of large objects.
ru: Этот ключ отключает выгрузку больших объектов.

source: Add <application>pg_dumpall</application> option <option>--no-role-passwords</option> to omit role passwords (Robins Tharakan, Simon Riggs)
ru: В <application>pg_dumpall</application> добавлен ключ <option>--no-role-passwords</option> для отказа от чтения паролей ролей (Робинс Таракан, Саймон Риггс)

source: This allows use of <application>pg_dumpall</application> by non-superusers; without this option, it fails due to inability to read passwords.
ru: Это позволяет использовать <application>pg_dumpall</application> не только суперпользователям; без этого ключа <application>pg_dumpall</application> пытается прочитать пароли, а обычным пользователям это не разрешается.

source: Support using synchronized snapshots when dumping from a standby server (Petr Jelinek)
ru: Поддержка использования синхронных снимков при выгрузке данных с ведомого сервера (Петр Желинек)

source: Issue <function>fsync()</function> on the output files generated by <application>pg_dump</application> and <application>pg_dumpall</application> (Michael Paquier)
ru: Выполнение <function>fsync()</function> (синхронизации с ФС) для файлов, записываемых утилитами <application>pg_dump</application> и <application>pg_dumpall</application> (Мишель Пакье)

source: This provides more security that the output is safely stored on disk before the program exits. This can be disabled with the new <option>--no-sync</option> option.
ru: Это позволяет более уверенно гарантировать, что выгруженные файлы безопасно сохранены на диске, до завершения работы программы. Это поведение можно отключить новым ключом <option>--no-sync</option>.

source: Allow <application>pg_basebackup</application> to stream write-ahead log in tar mode (Magnus Hagander)
ru: В <application>pg_basebackup</application> реализована возможность передавать журнал предзаписи в режиме tar (Магнус Хагандер)

source: The <acronym>WAL</acronym> will be stored in a separate tar file from the base backup.
ru: Содержимое <acronym>WAL</acronym> будет храниться в отдельном от основной копии файле tar.

source: Make <application>pg_basebackup</application> use temporary replication slots (Magnus Hagander)
ru: Использование в <application>pg_basebackup</application> временных слотов репликации (Магнус Хагандер)

source: Temporary replication slots will be used by default when <application>pg_basebackup</application> uses WAL streaming with default options.
ru: Временные слоты репликации будут задействоваться по умолчанию, когда <application>pg_basebackup</application> использует передачу WAL с параметрами по умолчанию.

source: Be more careful about fsync'ing in all required places in <application>pg_basebackup</application> and <application>pg_receivewal</application> (Michael Paquier)
ru: Более аккуратное выполнение синхронизации с ФС везде, где это требуется в <application>pg_basebackup</application> и <application>pg_receivewal</application> (Мишель Пакье)

source: Add <application>pg_basebackup</application> option <option>--no-sync</option> to disable fsync (Michael Paquier)
ru: Добавление в <application>pg_basebackup</application> ключа <option>--no-sync</option> для отключения синхронизации с ФС (Мишель Пакье)

source: Improve <application>pg_basebackup</application>'s handling of which directories to skip (David Steele)
ru: Улучшение обработки в <application>pg_basebackup</application> пропускаемых каталогов (Дэвид Стил)

source: Add wait option for <application><xref linkend="app-pg-ctl"/></application>'s promote operation (Peter Eisentraut)
ru: Добавление параметра ожидания для операции повышения роли в <application><xref linkend="app-pg-ctl"/></application> (Питер Эйзентраут)

source: Add long options for <application>pg_ctl</application> wait (<option>--wait</option>) and no-wait (<option>--no-wait</option>) (Vik Fearing)
ru: Добавление длинных ключей для работы <application>pg_ctl</application> с ожиданием (<option>--wait</option>) и без ожидания (<option>--no-wait</option>) (Вик Фиринг)

source: Add long option for <application>pg_ctl</application> server options (<option>--options</option>) (Peter Eisentraut)
ru: Добавление длинного ключа для параметров, которые <application>pg_ctl</application> передаёт серверу (<option>--options</option>) (Питер Эйзентраут)

source: Make <literal>pg_ctl start --wait</literal> detect server-ready by watching <filename>postmaster.pid</filename>, not by attempting connections (Tom Lane)
ru: В ожидании готовности сервера команда <literal>pg_ctl start --wait</literal> должна наблюдать за <filename>postmaster.pid</filename>, а не пытаться установить подключение (Том Лейн)

source: The postmaster has been changed to report its ready-for-connections status in <filename>postmaster.pid</filename>, and <application>pg_ctl</application> now examines that file to detect whether startup is complete. This is more efficient and reliable than the old method, and it eliminates postmaster log entries about rejected connection attempts during startup.
ru: Процесс postmaster теперь может сигнализировать о своей готовности принимать подключения в файле <filename>postmaster.pid</filename>, и <application>pg_ctl</application> теперь проверяет этот файл, чтобы определить, что сервер запущен. Этот метод эффективнее и надёжнее старого, а кроме того он избавляет от сообщений о неудавшихся попытках подключения при запуске.

source: Reduce <application>pg_ctl</application>'s reaction time when waiting for postmaster start/stop (Tom Lane)
ru: Уменьшение времени реакции <application>pg_ctl</application> в ожидании запуска/остановки процесса postmaster (Том Лейн)

source: <application>pg_ctl</application> now probes ten times per second when waiting for a postmaster state change, rather than once per second.
ru: Теперь <application>pg_ctl</application> проверяет изменения состояния postmaster не один (как раньше), а десять раз в секунду.

source: Ensure that <application>pg_ctl</application> exits with nonzero status if an operation being waited for does not complete within the timeout (Peter Eisentraut)
ru: Возврат ненулевого кода состояния при выходе <application>pg_ctl</application>, если ожидаемая операция не завершилась за отведённое время (Питер Эйзентраут)

source: The <literal>start</literal> and <literal>promote</literal> operations now return exit status 1, not 0, in such cases. The <literal>stop</literal> operation has always done that.
ru: Теперь операции <literal>start</literal> и <literal>promote</literal> возвращают в таких случаях код состояния 1, а не 0. Операция <literal>stop</literal> делала это всегда.

source: Source Code
ru: Исходный код

source: Change to two-part release version numbering (Peter Eisentraut, Tom Lane)
ru: Переход на нумерацию версий с двумя компонентами (Питер Эйзентраут, Том Лейн)

source: Release numbers will now have two parts (e.g., <literal>10.1</literal>) rather than three (e.g., <literal>9.6.3</literal>). Major versions will now increase just the first number, and minor releases will increase just the second number. Release branches will be referred to by single numbers (e.g., <literal>10</literal> rather than <literal>9.6</literal>). This change is intended to reduce user confusion about what is a major or minor release of <productname>PostgreSQL</productname>.
ru: Номера выпусков теперь состоят из двух частей (например, <literal>10.1</literal>), а не из трёх (например, <literal>9.6.3</literal>). Основные версии теперь будут увеличивать только первое число, а корректирующие выпуски — только второе. В названии ветвей выпусков будет включаться только одно число (например, <literal>10</literal> вместо <literal>9.6</literal>). Это изменение произведено для того, чтобы пользователям было понятнее, что есть основная, а что — дополнительная версия <productname>PostgreSQL</productname>.

source: Improve behavior of <application>pgindent</application> (Piotr Stefaniak, Tom Lane)
ru: Улучшение поведения <application>pgindent</application> (Пётр Стефаняк, Том Лейн)
