Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/alter_publication.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of a publication
ru: изменить определение публикации

source: name
ru: имя

source: table_name
ru: имя_таблицы

source: publication_parameter
ru: параметр_публикации

source: value
ru: значение

source: new_owner
ru: новый_владелец

source: new_name
ru: новое_имя

source: Description
ru: Описание

source: The command <command>ALTER PUBLICATION</command> can change the attributes of a publication.
ru: Команда <command>ALTER PUBLICATION</command> может изменять атрибуты публикации.

source: The first three variants change which tables are part of the publication. The <literal>SET TABLE</literal> clause will replace the list of tables in the publication with the specified one. The <literal>ADD TABLE</literal> and <literal>DROP TABLE</literal> clauses will add and remove one or more tables from the publication. Note that adding tables to a publication that is already subscribed to will require a <literal>ALTER SUBSCRIPTION ... REFRESH PUBLICATION</literal> action on the subscribing side in order to become effective.
ru: Первые три формы управляют вхождением таблиц в публикации. Предложение <literal>SET TABLE</literal> заменяет список таблиц в публикации заданным. Предложения <literal>ADD TABLE</literal> и <literal>DROP TABLE</literal> добавляют и удаляют таблицы в публикации, соответственно. Заметьте, что при добавлении таблиц в публикацию, на которую уже оформлена подписка, необходимо выполнить <literal>ALTER SUBSCRIPTION ... REFRESH PUBLICATION</literal> на стороне подписчика, чтобы это изменение вступило в силу.

source: The fourth variant of this command listed in the synopsis can change all of the publication properties specified in <xref linkend="sql-createpublication"/>. Properties not mentioned in the command retain their previous settings.
ru: Четвёртая форма этой команды, показанная в сводке синтаксиса, может изменять все свойства публикации, заданные в <xref linkend="sql-createpublication"/>. Свойства, которые не упоминаются в этой команде, сохраняют предыдущие значения.

source: The remaining variants change the owner and the name of the publication.
ru: Остальные формы команды меняют владельца и имя публикации.

source: You must own the publication to use <command>ALTER PUBLICATION</command>. To alter the owner, you must also be a direct or indirect member of the new owning role. The new owner must have <literal>CREATE</literal> privilege on the database. Also, the new owner of a <literal>FOR ALL TABLES</literal> publication must be a superuser. However, a superuser can change the ownership of a publication while circumventing these restrictions.
ru: Для выполнения <command>ALTER PUBLICATION</command> необходимо владеть данной публикацией. Чтобы сменить владельца, необходимо быть непосредственным или опосредованным членом новой роли-владельца, а эта роль должна иметь право <literal>CREATE</literal> в базе данных. Кроме того, новым владельцем публикации <literal>FOR ALL TABLES</literal> должен быть суперпользователь. Однако суперпользователь может менять владение публикацией, обходя эти ограничения.

source: Parameters
ru: Параметры

source: The name of an existing publication whose definition is to be altered.
ru: Имя существующей публикации, определение которой изменяется.

source: Name of an existing table. If <literal>ONLY</literal> is specified before the table name, only that table is affected. If <literal>ONLY</literal> is not specified, the table and all its descendant tables (if any) are affected. Optionally, <literal>*</literal> can be specified after the table name to explicitly indicate that descendant tables are included.
ru: Имя существующей таблицы. Если перед именем таблицы указано <literal>ONLY</literal>, затрагивается только заданная таблица. Без <literal>ONLY</literal> затрагивается и заданная таблица, и все её потомки (если таковые есть). После имени таблицы можно добавить необязательное указание <literal>*</literal>, чтобы явно обозначить, что должны затрагиваться и все дочерние таблицы.

source: This clause alters publication parameters originally set by <xref linkend="sql-createpublication"/>. See there for more information.
ru: Это предложение изменяет параметры публикации, изначально установленные командой <xref linkend="sql-createpublication"/>. За дополнительными сведениями обратитесь к её описанию.

source: The user name of the new owner of the publication.
ru: Имя пользователя, назначаемого новым владельцем публикации.

source: The new name for the publication.
ru: Новое имя публикации.

source: Examples
ru: Примеры

source: Change the publication to publish only deletes and updates: <placeholder-1/>
ru: Изменение публикации, чтобы публиковались только удаления и изменения: <placeholder-1/>

source: Add some tables to the publication: <placeholder-1/>
ru: Добавление таблиц в публикацию: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>ALTER PUBLICATION</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>ALTER PUBLICATION</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
