Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/alter_conversion.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of a conversion
ru: изменить определение перекодировки

source: name
ru: имя

source: new_name
ru: новое_имя

source: new_owner
ru: новый_владелец

source: new_schema
ru: новая_схема

source: Description
ru: Описание

source: <command>ALTER CONVERSION</command> changes the definition of a conversion.
ru: <command>ALTER CONVERSION</command> изменяет определение перекодировки.

source: You must own the conversion to use <command>ALTER CONVERSION</command>. To alter the owner, you must also be a direct or indirect member of the new owning role, and that role must have <literal>CREATE</literal> privilege on the conversion's schema. (These restrictions enforce that altering the owner doesn't do anything you couldn't do by dropping and recreating the conversion. However, a superuser can alter ownership of any conversion anyway.)
ru: Выполнить <command>ALTER CONVERSION</command> может только владелец соответствующей перекодировки. Чтобы сменить владельца, необходимо быть непосредственным или опосредованным членом новой роли-владельца, а эта роль должна иметь право <literal>CREATE</literal> в схеме перекодировки. (С такими ограничениями при смене владельца не происходит ничего такого, что нельзя было бы сделать, имея право удалить и вновь создать перекодировку. Однако суперпользователь может сменить владельца перекодировки в любом случае.)

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of an existing conversion.
ru: Имя (возможно, дополненное схемой) существующей перекодировки.

source: The new name of the conversion.
ru: Новое имя перекодировки.

source: The new owner of the conversion.
ru: Новый владелец перекодировки.

source: The new schema for the conversion.
ru: Новая схема перекодировки.

source: Examples
ru: Примеры

source: To rename the conversion <literal>iso_8859_1_to_utf8</literal> to <literal>latin1_to_unicode</literal>: <placeholder-1/>
ru: Переименование перекодировки <literal>iso_8859_1_to_utf8</literal> в <literal>latin1_to_unicode</literal>: <placeholder-1/>

source: To change the owner of the conversion <literal>iso_8859_1_to_utf8</literal> to <literal>joe</literal>: <placeholder-1/>
ru: Смена владельца перекодировки <literal>iso_8859_1_to_utf8</literal> на <literal>joe</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: There is no <command>ALTER CONVERSION</command> statement in the SQL standard.
ru: Оператор <command>ALTER CONVERSION</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
