Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/alter_policy.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of a row level security policy
ru: изменить определение политики защиты на уровне строк

source: name
ru: имя

source: table_name
ru: имя_таблицы

source: new_name
ru: новое_имя

source: role_name
ru: имя_роли

source: using_expression
ru: выражение_использования

source: check_expression
ru: выражение_проверки

source: Description
ru: Описание

source: <command>ALTER POLICY</command> changes the definition of an existing row-level security policy. Note that <command>ALTER POLICY</command> only allows the set of roles to which the policy applies and the <literal>USING</literal> and <literal>WITH CHECK</literal> expressions to be modified. To change other properties of a policy, such as the command to which it applies or whether it is permissive or restrictive, the policy must be dropped and recreated.
ru: <command>ALTER POLICY</command> изменяет определение существующей политики на уровне строк. Заметьте, что <command>ALTER POLICY</command> позволяет изменить только набор ролей, для которых применяется политика, и выражения <literal>USING</literal> и <literal>WITH CHECK</literal>. Чтобы изменить другие свойства политики, например команду, к которой она применяется, а также характеристику разрешительная/ограничительная, политику надо удалить и создать заново.

source: <command>ALTER POLICY</command> changes the definition of an existing row-level security policy.
ru: <command>ALTER POLICY</command> изменяет определение существующей политики на уровне строк.

source: To use <command>ALTER POLICY</command>, you must own the table that the policy applies to.
ru: Использовать <command>ALTER POLICY</command> может только владелец таблицы (или представления), к которой применяется эта политика.

source: In the second form of <command>ALTER POLICY</command>, the role list, <replaceable class="parameter">using_expression</replaceable>, and <replaceable class="parameter">check_expression</replaceable> are replaced independently if specified. When one of those clauses is omitted, the corresponding part of the policy is unchanged.
ru: Во второй форме <command>ALTER POLICY</command> список ролей, <replaceable class="parameter">выражение_использования</replaceable> и <replaceable class="parameter">выражение_проверки</replaceable> заменяются независимо, если они указаны. Когда одно из этих предложений опущено, соответствующая часть политики остаётся неизменной.

source: Parameters
ru: Параметры

source: The name of an existing policy to alter.
ru: Имя существующей политики, подлежащей изменению.

source: The name (optionally schema-qualified) of the table that the policy is on.
ru: Имя (возможно, дополненное схемой) таблицы, к которой применяется эта политика.

source: The new name for the policy.
ru: Новое имя политики.

source: The role(s) to which the policy applies. Multiple roles can be specified at one time. To apply the policy to all roles, use <literal>PUBLIC</literal>.
ru: Роль (роли), на которую действует политика. В одной команде можно указать несколько ролей. Чтобы применить политику ко всем ролям, укажите <literal>PUBLIC</literal>.

source: The <literal>USING</literal> expression for the policy. See <xref linkend="sql-createpolicy"/> for details.
ru: Выражение <literal>USING</literal> для политики. За подробностями обратитесь к <xref remap="3" linkend="sql-createpolicy"/>.

source: The <literal>WITH CHECK</literal> expression for the policy. See <xref linkend="sql-createpolicy"/> for details.
ru: Выражение <literal>WITH CHECK</literal> для политики. За подробностями обратитесь к <xref remap="3" linkend="sql-createpolicy"/>.

source: Compatibility
ru: Совместимость

source: <command>ALTER POLICY</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>ALTER POLICY</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
