Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/alter_subscription.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: change the definition of a subscription
ru: изменить определение подписки

source: name
ru: имя

source: conninfo
ru: строка_подключения

source: publication_name
ru: имя_публикации

source: set_publication_option
ru: параметр_set_publication

source: value
ru: значение

source: refresh_option
ru: параметр_обновления

source: subscription_parameter
ru: параметр_подписки

source: new_owner
ru: новый_владелец

source: new_name
ru: новое_имя

source: Description
ru: Описание

source: <command>ALTER SUBSCRIPTION</command> can change most of the subscription properties that can be specified in <xref linkend="sql-createsubscription"/>.
ru: <command>ALTER SUBSCRIPTION</command> может менять многие свойства подписки, которые могут задаваться в <xref linkend="sql-createsubscription"/>.

source: You must own the subscription to use <command>ALTER SUBSCRIPTION</command>. To alter the owner, you must also be a direct or indirect member of the new owning role. The new owner has to be a superuser. (Currently, all subscription owners must be superusers, so the owner checks will be bypassed in practice. But this might change in the future.)
ru: Чтобы выполнить <command>ALTER SUBSCRIPTION</command> для подписки, нужно быть её владельцем. Чтобы сменить владельца, нужно быть непосредственным или опосредованным членом новой роли-владельца. Новый владелец должен быть суперпользователем. (В настоящее время все владельцы подписок должны быть суперпользователями, так что на практике проверка владельца будет пропущена. Но в будущем это может быть изменено.)

source: Parameters
ru: Параметры

source: The name of a subscription whose properties are to be altered.
ru: Имя подписки, свойства которой изменяются.

source: This clause alters the connection property originally set by <xref linkend="sql-createsubscription"/>. See there for more information.
ru: Это предложение изменяет строку соединения, изначально установленную командой <xref linkend="sql-createsubscription"/>. За дополнительными сведениями обратитесь к описанию этой команды.

source: Changes list of subscribed publications. See <xref linkend="sql-createsubscription"/> for more information. By default this command will also act like <literal>REFRESH PUBLICATION</literal>.
ru: Изменяет список публикаций, на которые оформлена подписка. За подробностями обратитесь к описанию <xref linkend="sql-createsubscription"/>. По умолчанию эта команда также выполняет действие <literal>REFRESH PUBLICATION</literal>.

source: When false, the command will not try to refresh table information. <literal>REFRESH PUBLICATION</literal> should then be executed separately. The default is <literal>true</literal>.
ru: Со значением <literal>false</literal> данная команда не будет обновлять информацию о таблицах. В этом случае следует выполнить <literal>REFRESH PUBLICATION</literal> отдельно. Значение по умолчанию — <literal>true</literal>.

source: <replaceable>set_publication_option</replaceable> specifies additional options for this operation. The supported options are: <placeholder-1/> Additionally, refresh options as described under <literal>REFRESH PUBLICATION</literal> may be specified.
ru: В указании <replaceable>параметр_set_publication</replaceable> задаются дополнительные свойства операции. Поддерживаются следующие параметры: <placeholder-1/> Кроме того, здесь могут задаваться параметры обновления, упомянутые в описании <literal>REFRESH PUBLICATION</literal>.

source: Fetch missing table information from publisher. This will start replication of tables that were added to the subscribed-to publications since the last invocation of <command>REFRESH PUBLICATION</command> or since <command>CREATE SUBSCRIPTION</command>.
ru: Считывает недостающую информацию о таблицах с публикующего сервера. В результате производится репликация таблиц, добавленных в публикации, на которые оформлена подписка, после последнего вызова <command>REFRESH PUBLICATION</command> или <command>CREATE SUBSCRIPTION</command>.

source: Specifies whether the existing data in the publications that are being subscribed to should be copied once the replication starts. The default is <literal>true</literal>.
ru: Определяет, должны ли копироваться существующие данные в публикациях, на которые оформляется подписка, сразу после начала репликации. Значение по умолчанию — <literal>true</literal>.

source: <replaceable>refresh_option</replaceable> specifies additional options for the refresh operation. The supported options are: <placeholder-1/>
ru: В указании <replaceable>параметр_обновления</replaceable> задаются дополнительные свойства операции обновления. Поддерживаются следующие параметры: <placeholder-1/>

source: Enables the previously disabled subscription, starting the logical replication worker at the end of transaction.
ru: Включает ранее отключённую подписку, запуская процесс логической репликации в конце транзакции.

source: Disables the running subscription, stopping the logical replication worker at the end of transaction.
ru: Отключает активную подписку, останавливая процесс логической репликации в конце транзакции.

source: This clause alters parameters originally set by <xref linkend="sql-createsubscription"/>. See there for more information. The allowed options are <literal>slot_name</literal> and <literal>synchronous_commit</literal>
ru: Это предложение изменяет параметры, изначально установленные командой <xref linkend="sql-createsubscription"/>. За подробностями обратитесь к её описанию. Оно принимает параметры <literal>slot_name</literal> и <literal>synchronous_commit</literal>

source: The user name of the new owner of the subscription.
ru: Имя пользователя, назначаемого новым владельцем подписки.

source: The new name for the subscription.
ru: Новое имя подписки.

source: Examples
ru: Примеры

source: Change the publication subscribed by a subscription to <literal>insert_only</literal>: <placeholder-1/>
ru: Изменение подписки, заключающееся в подписывании на публикацию <literal>insert_only</literal>: <placeholder-1/>

source: Disable (stop) the subscription: <placeholder-1/>
ru: Отключение (остановка) подписки: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>ALTER SUBSCRIPTION</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>ALTER SUBSCRIPTION</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
