Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/alter_default_privileges.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define default access privileges
ru: определить права доступа по умолчанию

source: target_role
ru: целевая_роль

source: schema_name
ru: имя_схемы

source: abbreviated_grant_or_revoke
ru: предложение_GRANT_или_REVOKE

source: where <placeholder-1/> is one of:
ru: Где <placeholder-1/> может быть следующим:

source: role_name
ru: имя_роли

source: Description
ru: Описание

source: <command>ALTER DEFAULT PRIVILEGES</command> allows you to set the privileges that will be applied to objects created in the future. (It does not affect privileges assigned to already-existing objects.) Currently, only the privileges for schemas, tables (including views and foreign tables), sequences, functions, and types (including domains) can be altered.
ru: <command>ALTER DEFAULT PRIVILEGES</command> позволяет задавать права, применяемые к объектам, которые будут создаваться в будущем. (Эта команда не затрагивает права, назначенные уже существующим объектам.) В настоящее время можно задавать права только для схем, таблиц (включая представления и сторонние таблицы), последовательностей, функций и типов (включая домены).

source: You can change default privileges only for objects that will be created by yourself or by roles that you are a member of. The privileges can be set globally (i.e., for all objects created in the current database), or just for objects created in specified schemas. Default privileges that are specified per-schema are added to whatever the global default privileges are for the particular object type.
ru: Вы можете изменить права по умолчанию только для объектов, которые будут созданы вами или ролями, членами которых вы являетесь. Права можно задать глобально (т. е. для всех объектов, создаваемых в текущей базе данных) или для определённых схем. Заданные на уровне схемы права по умолчанию добавляются к тем, что определены глобально для конкретного типа объекта.

source: As explained under <xref linkend="sql-grant"/>, the default privileges for any object type normally grant all grantable permissions to the object owner, and may grant some privileges to <literal>PUBLIC</literal> as well. However, this behavior can be changed by altering the global default privileges with <command>ALTER DEFAULT PRIVILEGES</command>.
ru: Как объясняется в <xref remap="6" linkend="sql-grant"/>, права по умолчанию для объектов любого типа обычно дают все назначаемые разрешения владельцу объекта, а также могут давать некоторые разрешения роли <literal>PUBLIC</literal>. Однако это поведение можно поменять, изменив права по умолчанию командой <command>ALTER DEFAULT PRIVILEGES</command>.

source: Parameters
ru: Параметры

source: The name of an existing role of which the current role is a member. If <literal>FOR ROLE</literal> is omitted, the current role is assumed.
ru: Имя существующей роли, членом которой является текущая. Если <literal>FOR ROLE</literal> опущено, подразумевается текущая роль.

source: The name of an existing schema. If specified, the default privileges are altered for objects later created in that schema. If <literal>IN SCHEMA</literal> is omitted, the global default privileges are altered. <literal>IN SCHEMA</literal> is not allowed when using <literal>ON SCHEMAS</literal> as schemas can't be nested.
ru: Имя существующей схемы. Если указано, права по умолчанию меняются для объектов, которые будут созданы в этой схеме. Если <literal>IN SCHEMA</literal> опущено, меняются глобальные права по умолчанию. Указание <literal>IN SCHEMA</literal> не допускается вместе с <literal>ON SCHEMAS</literal>, так как схемы не могут быть вложенными.

source: The name of an existing role to grant or revoke privileges for. This parameter, and all the other parameters in <replaceable class="parameter">abbreviated_grant_or_revoke</replaceable>, act as described under <xref linkend="sql-grant"/> or <xref linkend="sql-revoke"/>, except that one is setting permissions for a whole class of objects rather than specific named objects.
ru: Имя существующей роли, для которой даются или отзываются права. Этот и все другие параметры в <replaceable class="parameter">предложении_grant_или_revoke</replaceable> действуют как описано в <xref remap="6" linkend="sql-grant"/> или <xref remap="6" linkend="sql-revoke"/>, за исключением того, что они распространяются не на один конкретный объект, а на целый класс объектов.

source: Notes
ru: Замечания

source: Use <xref linkend="app-psql"/>'s <command>\ddp</command> command to obtain information about existing assignments of default privileges. The meaning of the privilege values is the same as explained for <command>\dp</command> under <xref linkend="sql-grant"/>.
ru: Чтобы узнать текущие назначенные права по умолчанию, воспользуйтесь командой <command>\ddp</command> в <xref linkend="app-psql"/>. Интерпретация значений прав приведена в описании команды <command>\dp</command> в <xref remap="6" linkend="sql-grant"/>.

source: If you wish to drop a role for which the default privileges have been altered, it is necessary to reverse the changes in its default privileges or use <command>DROP OWNED BY</command> to get rid of the default privileges entry for the role.
ru: Если вы желаете удалить роль, права по умолчанию для которой были изменены, необходимо явно отменить изменения прав по умолчанию или воспользоваться командой <command>DROP OWNED BY</command> для избавления от назначенных для этой роли прав по умолчанию.

source: Examples
ru: Примеры

source: Grant SELECT privilege to everyone for all tables (and views) you subsequently create in schema <literal>myschema</literal>, and allow role <literal>webuser</literal> to INSERT into them too: <placeholder-1/>
ru: Наделение всех правом SELECT для всех таблиц (и представлений), которые будут созданы в дальнейшем в схеме <literal>myschema</literal>, и наделение роли <literal>webuser</literal> правом INSERT для этих же таблиц: <placeholder-1/>

source: Undo the above, so that subsequently-created tables won't have any more permissions than normal: <placeholder-1/>
ru: Отмена предыдущих изменений с тем, чтобы для таблиц, создаваемых в будущем, были определены только обычные права, без дополнительных: <placeholder-1/>

source: Remove the public EXECUTE permission that is normally granted on functions, for all functions subsequently created by role <literal>admin</literal>: <placeholder-1/>
ru: Лишение роли public права на выполнение (EXECUTE), которое обычно даётся для функций (для всех функций, которые будут созданы ролью <literal>admin</literal>): <placeholder-1/>

source: Compatibility
ru: Совместимость

source: There is no <command>ALTER DEFAULT PRIVILEGES</command> statement in the SQL standard.
ru: Оператор <command>ALTER DEFAULT PRIVILEGES</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также

source: <command>ALTER DEFAULT PRIVILEGES</command> allows you to set the privileges that will be applied to objects created in the future. (It does not affect privileges assigned to already-existing objects.) Currently, only the privileges for tables (including views and foreign tables), sequences, functions, and types (including domains) can be altered.
ru: <command>ALTER DEFAULT PRIVILEGES</command> позволяет задавать права, применяемые к объектам, которые будут создаваться в будущем. (Эта команда не затрагивает права, назначенные уже существующим объектам.) В настоящее время можно задавать права только для таблиц (включая представления и сторонние таблицы), последовательностей, функций и типов (включая домены).

source: The name of an existing schema. If specified, the default privileges are altered for objects later created in that schema. If <literal>IN SCHEMA</literal> is omitted, the global default privileges are altered.
ru: Имя существующей схемы. Если указано, права по умолчанию меняются для объектов, которые будут созданы в этой схеме. Если <literal>IN SCHEMA</literal> опущено, меняются глобальные права по умолчанию.
