Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/checkpoint.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: force a write-ahead log checkpoint
ru: произвести контрольную точку в журнале предзаписи

source: force a transaction log checkpoint
ru: записать контрольную точку в журнал транзакций

source: Description
ru: Описание

source: A checkpoint is a point in the write-ahead log sequence at which all data files have been updated to reflect the information in the log. All data files will be flushed to disk. Refer to <xref linkend="wal-configuration"/> for more details about what happens during a checkpoint.
ru: Контрольная точка — это момент в последовательности событий в журнале предзаписи, когда все файлы данных приводятся в актуальное состояние, соответствующее информации в журнале. При этом все файлы данных сохраняются на диск. Более подробно о том, что происходит во время контрольной точки, можно узнать в <xref remap="6" linkend="wal-configuration"/>.

source: A checkpoint is a point in the transaction log sequence at which all data files have been updated to reflect the information in the log. All data files will be flushed to disk. Refer to <xref linkend="wal-configuration"/> for more details about what happens during a checkpoint.
ru: Контрольная точка — это момент в последовательности событий в журнале транзакций, когда все файлы данных приводятся в актуальное состояние, соответствующее информации в журнале. При этом все файлы данных сохраняются на диск. Более подробно о том, что происходит во время контрольной точки, можно узнать в <xref remap="6" linkend="wal-configuration"/>.

source: The <command>CHECKPOINT</command> command forces an immediate checkpoint when the command is issued, without waiting for a regular checkpoint scheduled by the system (controlled by the settings in <xref linkend="runtime-config-wal-checkpoints"/>). <command>CHECKPOINT</command> is not intended for use during normal operation.
ru: Команда <command>CHECKPOINT</command> приводит к принудительному выполнению контрольной точки в момент вызова, не дожидаясь периодической контрольной точки, производимой системой по графику (это настраивается параметрами в <xref linkend="runtime-config-wal-checkpoints"/>). Команда <command>CHECKPOINT</command> не предназначена для применения при обычном использовании базы данных.

source: If executed during recovery, the <command>CHECKPOINT</command> command will force a restartpoint (see <xref linkend="wal-configuration"/>) rather than writing a new checkpoint.
ru: Если <command>CHECKPOINT</command> выполняется в процессе восстановления, вместо записи новой контрольной точки производится точка перезапуска (см. <xref remap="4" linkend="wal-configuration"/>).

source: Only superusers can call <command>CHECKPOINT</command>.
ru: Выполнять <command>CHECKPOINT</command> могут только суперпользователи.

source: Compatibility
ru: Совместимость

source: The <command>CHECKPOINT</command> command is a <productname>PostgreSQL</productname> language extension.
ru: Команда <command>CHECKPOINT</command> является языковым расширением <productname>PostgreSQL</productname>.
