Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/create_foreign_data_wrapper.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new foreign-data wrapper
ru: создать новую обёртку сторонних данных

source: name
ru: имя

source: handler_function
ru: функция_обработчик

source: validator_function
ru: функция_проверки

source: option
ru: параметр

source: value
ru: значение

source: Description
ru: Описание

source: <command>CREATE FOREIGN DATA WRAPPER</command> creates a new foreign-data wrapper. The user who defines a foreign-data wrapper becomes its owner.
ru: <command>CREATE FOREIGN DATA WRAPPER</command> создаёт обёртку сторонних данных. Владельцем обёртки становится создавший её пользователь.

source: The foreign-data wrapper name must be unique within the database.
ru: Имя обёртки сторонних данных должно быть уникальным в базе данных.

source: Only superusers can create foreign-data wrappers.
ru: Создавать обёртки сторонних данных могут только суперпользователи.

source: Parameters
ru: Параметры

source: The name of the foreign-data wrapper to be created.
ru: Имя создаваемой обёртки сторонних данных.

source: <replaceable class="parameter">handler_function</replaceable> is the name of a previously registered function that will be called to retrieve the execution functions for foreign tables. The handler function must take no arguments, and its return type must be <type>fdw_handler</type>.
ru: В аргументе <replaceable class="parameter">функция_обработчик</replaceable> указывается имя ранее зарегистрированной функции, которая будет вызываться для получения функций, реализующих обращения к сторонним таблицам. Функция-обработчик не принимает аргументы и возвращает результат типа <type>fdw_handler</type>.

source: It is possible to create a foreign-data wrapper with no handler function, but foreign tables using such a wrapper can only be declared, not accessed.
ru: Обёртку сторонних таблиц можно создать и без функции-обработчика, но через такую обёртку нельзя будет использовать сторонние таблицы, хотя объявить их вполне возможно.

source: <replaceable class="parameter">validator_function</replaceable> is the name of a previously registered function that will be called to check the generic options given to the foreign-data wrapper, as well as options for foreign servers, user mappings and foreign tables using the foreign-data wrapper. If no validator function or <literal>NO VALIDATOR</literal> is specified, then options will not be checked at creation time. (Foreign-data wrappers will possibly ignore or reject invalid option specifications at run time, depending on the implementation.) The validator function must take two arguments: one of type <type>text[]</type>, which will contain the array of options as stored in the system catalogs, and one of type <type>oid</type>, which will be the OID of the system catalog containing the options. The return type is ignored; the function should report invalid options using the <function>ereport(ERROR)</function> function.
ru: В аргументе <replaceable class="parameter">функция_проверки</replaceable> указывается имя ранее зарегистрированной функции, которая будет вызываться для проверки общих параметров, передаваемых обёртке сторонних данных, а также параметров сторонних серверов, сопоставлений пользователей и сторонних таблиц, доступных через эту обёртку. Если функция проверки не задана или указано <literal>NO VALIDATOR</literal>, параметры не будут проверяться во время создания объектов. (Обёртка сторонних данных может игнорировать или не принимать неверные указания параметров во время выполнения, в зависимости от реализации.) Функция проверки должна принимать два аргумента: первый типа <type>text[]</type> (в нём содержится массив параметров, хранящихся в системном каталоге), а второй типа <type>oid</type> (в нём указывается OID системного каталога с этими параметрами). Возвращаемое значение игнорируется; функция проверки должна сообщать о неверных параметрах, вызывая системную функцию <function>ereport(ERROR)</function>.

source: This clause specifies options for the new foreign-data wrapper. The allowed option names and values are specific to each foreign data wrapper and are validated using the foreign-data wrapper's validator function. Option names must be unique.
ru: Это предложение определяет параметры для создаваемой обёртки сторонних данных. Набор допустимых параметров и значений для каждой обёртки свой, контроль их правильности осуществляет функция проверки сторонних данных. Имена параметров должны быть уникальными.

source: Notes
ru: Замечания

source: <productname>PostgreSQL</productname>'s foreign-data functionality is still under active development. Optimization of queries is primitive (and mostly left to the wrapper, too). Thus, there is considerable room for future performance improvements.
ru: Функциональность <productname>PostgreSQL</productname> по работе со сторонними данными продолжает активно развиваться. На данный момент выполняется только примитивная оптимизация запросов (и по большей части это тоже делает обёртка), так что в этом направлении есть поле для улучшения производительности.

source: Examples
ru: Примеры

source: Create a useless foreign-data wrapper <literal>dummy</literal>: <placeholder-1/>
ru: Создание бесполезной обёртки сторонних данных <literal>dummy</literal>: <placeholder-1/>

source: Create a foreign-data wrapper <literal>file</literal> with handler function <literal>file_fdw_handler</literal>: <placeholder-1/>
ru: Создание обёртки сторонних данных <literal>file</literal> с функцией-обработчиком <literal>file_fdw_handler</literal>: <placeholder-1/>

source: Create a foreign-data wrapper <literal>mywrapper</literal> with some options: <placeholder-1/>
ru: Создание обёртки сторонних данных <literal>mywrapper</literal> с параметрами: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>CREATE FOREIGN DATA WRAPPER</command> conforms to ISO/IEC 9075-9 (SQL/MED), with the exception that the <literal>HANDLER</literal> and <literal>VALIDATOR</literal> clauses are extensions and the standard clauses <literal>LIBRARY</literal> and <literal>LANGUAGE</literal> are not implemented in <productname>PostgreSQL</productname>.
ru: <command>CREATE FOREIGN DATA WRAPPER</command> соответствует стандарту ISO/IEC 9075-9 (SQL/MED), за исключением того, что предложения <literal>HANDLER</literal> и <literal>VALIDATOR</literal> стандартом не предусмотрены, а предложения <literal>LIBRARY</literal> и <literal>LANGUAGE</literal>, напротив, не реализованы в <productname>PostgreSQL</productname>.

source: Note, however, that the SQL/MED functionality as a whole is not yet conforming.
ru: Учтите, однако, что функциональность SQL/MED в целом ещё не обеспечивается.

source: See Also
ru: См. также
