Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/create_subscription.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new subscription
ru: создать подписку

source: subscription_name
ru: имя_подписки

source: conninfo
ru: строка_подключения

source: publication_name
ru: имя_публикации

source: subscription_parameter
ru: параметр_подписки

source: value
ru: значение

source: Description
ru: Описание

source: <command>CREATE SUBSCRIPTION</command> adds a new subscription for the current database. The subscription name must be distinct from the name of any existing subscription in the database.
ru: <command>CREATE SUBSCRIPTION</command> создаёт подписку для текущей базы данных. Имя подписки должно отличаться от имён других существующих подписок в текущей базе.

source: The subscription represents a replication connection to the publisher. As such this command does not only add definitions in the local catalogs but also creates a replication slot on the publisher.
ru: Подписка представляет собой реплицирующее подключение к публикующему серверу. Поэтому данная команда не только добавляет определения подписки в локальные каталоги, но также создаёт слот репликации на удалённом сервере.

source: A logical replication worker will be started to replicate data for the new subscription at the commit of the transaction where this command is run.
ru: В момент фиксации транзакции, в рамках которой выполняется эта команда, будет запущен рабочий процесс логической репликации.

source: Additional info about subscriptions and logical replication as a whole can is available at <xref linkend="logical-replication-subscription"/> and <xref linkend="logical-replication"/>.
ru: Дополнительные сведения о подписках и логической репликации в целом можно найти в <xref remap="6" linkend="logical-replication-subscription"/> и <xref remap="6" linkend="logical-replication"/>.

source: Parameters
ru: Параметры

source: The name of the new subscription.
ru: Имя новой подписки.

source: The connection string to the publisher. For details see <xref linkend="libpq-connstring"/>.
ru: Строка подключения к публикующему серверу. Подробности описаны в <xref remap="6" linkend="libpq-connstring"/>.

source: Names of the publications on the publisher to subscribe to.
ru: Имена публикаций на публикующем сервере, на которые оформляется подписка.

source: Specifies whether the existing data in the publications that are being subscribed to should be copied once the replication starts. The default is <literal>true</literal>.
ru: Определяет, должны ли копироваться существующие данные в публикациях, на которые оформляется подписка, сразу после начала репликации. Значение по умолчанию — <literal>true</literal>.

source: Specifies whether the command should create the replication slot on the publisher. The default is <literal>true</literal>.
ru: Определяет, должна ли команда создавать слот репликации на публикующем сервере. Значение по умолчанию — <literal>true</literal>.

source: Specifies whether the subscription should be actively replicating, or whether it should be just setup but not started yet. The default is <literal>true</literal>.
ru: Определяет, активировать ли репликацию в подписке, или её нужно только настроить, но не запускать сразу. Значение по умолчанию — <literal>true</literal>.

source: Name of the replication slot to use. The default behavior is to use the name of the subscription for the slot name.
ru: Имя слота репликации, которое должно использоваться. По умолчанию в качестве имени слота используется имя подписки.

source: When <literal>slot_name</literal> is set to <literal>NONE</literal>, there will be no replication slot associated with the subscription. This can be used if the replication slot will be created later manually. Such subscriptions must also have both <literal>enabled</literal> and <literal>create_slot</literal> set to <literal>false</literal>.
ru: Когда в качестве <literal>slot_name</literal> задаётся <literal>NONE</literal>, с подпиской не будет связан слот репликации. Это может быть полезно, если слот репликации позднее будет создаваться вручную. У таких подписок также должны быть равны <literal>false</literal> свойства <literal>enabled</literal> и <literal>create_slot</literal>.

source: The value of this parameter overrides the <xref linkend="guc-synchronous-commit"/> setting. The default value is <literal>off</literal>.
ru: Значение этого параметра переопределяет свойство <xref linkend="guc-synchronous-commit"/>. По умолчанию — <literal>off</literal>.

source: It is safe to use <literal>off</literal> for logical replication: If the subscriber loses transactions because of missing synchronization, the data will be resent from the publisher.
ru: Значение <literal>off</literal> безопасно для логической репликации: если подписчик потеряет транзакции из-за нарушения синхронизации, данные будут повторно переданы с публикующего сервера.

source: A different setting might be appropriate when doing synchronous logical replication. The logical replication workers report the positions of writes and flushes to the publisher, and when using synchronous replication, the publisher will wait for the actual flush. This means that setting <literal>synchronous_commit</literal> for the subscriber to <literal>off</literal> when the subscription is used for synchronous replication might increase the latency for <command>COMMIT</command> on the publisher. In this scenario, it can be advantageous to set <literal>synchronous_commit</literal> to <literal>local</literal> or higher.
ru: При выполнении синхронной логической репликации может быть уместно другое значение. Рабочие процессы логической репликации передают позиции записанных и сохранённых на диске данных публикующему серверу, так что при синхронной репликации он будет ждать завершения сохранения. Это значит, что значение <literal>off</literal> параметра <literal>synchronous_commit</literal> на подписчике может увеличить задержку при выполнении <command>COMMIT</command> на сервере публикации. При таком сценарии может быть выгоднее задать для <literal>synchronous_commit</literal> значение <literal>local</literal> или выше.

source: Specifies whether the <command>CREATE SUBSCRIPTION</command> should connect to the publisher at all. Setting this to <literal>false</literal> will change default values of <literal>enabled</literal>, <literal>create_slot</literal> and <literal>copy_data</literal> to <literal>false</literal>.
ru: Определяет, нужно ли при выполнении <command>CREATE SUBSCRIPTION</command> подключаться к публикующему серверу. Если равняется <literal>false</literal>, значениями по умолчанию параметров <literal>enabled</literal>, <literal>create_slot</literal> и <literal>copy_data</literal> тоже будет <literal>false</literal>.

source: It is not allowed to combine <literal>connect</literal> set to <literal>false</literal> and <literal>enabled</literal>, <literal>create_slot</literal>, or <literal>copy_data</literal> set to <literal>true</literal>.
ru: Значение <literal>false</literal> параметра <literal>connect</literal> несовместимо со значением <literal>true</literal> параметров <literal>enabled</literal>, <literal>create_slot</literal> и <literal>copy_data</literal>.

source: Since no connection is made when this option is set to <literal>false</literal>, the tables are not subscribed, and so after you enable the subscription nothing will be replicated. It is required to run <literal>ALTER SUBSCRIPTION ... REFRESH PUBLICATION</literal> in order for tables to be subscribed.
ru: Так как со значением <literal>false</literal> соединение не устанавливается, подписка на таблицы не оформляется, так что после включения подписки ничего не будет реплицироваться. Чтобы таблицы вошли в подписку, потребуется позже выполнить <literal>ALTER SUBSCRIPTION ... REFRESH PUBLICATION</literal>.

source: This clause specifies optional parameters for a subscription. The following parameters are supported: <placeholder-1/>
ru: В этом предложении могут задаваться следующие необязательные параметры подписки: <placeholder-1/>

source: Notes
ru: Замечания

source: See <xref linkend="logical-replication-security"/> for details on how to configure access control between the subscription and the publication instance.
ru: Подробнее о том, как организовать управление доступом подписчиков к публикующему серверу, рассказывается в <xref remap="6" linkend="logical-replication-security"/>.

source: When creating a replication slot (the default behavior), <command>CREATE SUBSCRIPTION</command> cannot be executed inside a transaction block.
ru: При создании слота репликации (поведение по умолчанию) <command>CREATE SUBSCRIPTION</command> нельзя выполнять внутри блока транзакции.

source: Creating a subscription that connects to the same database cluster (for example, to replicate between databases in the same cluster or to replicate within the same database) will only succeed if the replication slot is not created as part of the same command. Otherwise, the <command>CREATE SUBSCRIPTION</command> call will hang. To make this work, create the replication slot separately (using the function <function>pg_create_logical_replication_slot</function> with the plugin name <literal>pgoutput</literal>) and create the subscription using the parameter <literal>create_slot = false</literal>. This is an implementation restriction that might be lifted in a future release.
ru: Создание подписки с подключением к тому же кластеру баз данных (например, для организации репликации между базами данных в одном кластере или в одной базе данных) будет успешным, только если слот репликации не создаётся той же командой. В противном случае команда <command>CREATE SUBSCRIPTION</command> зависнет. Чтобы оформить такую подписку, слот репликации нужно создать отдельно (воспользовавшись функцией <function>pg_create_logical_replication_slot</function> и передав ей имя модуля <literal>pgoutput</literal>) и создать подписку с параметром <literal>create_slot = false</literal>. Это ограничение реализации, которое может быть устранено в будущем выпуске.

source: Examples
ru: Примеры

source: Create a subscription to a remote server that replicates tables in the publications <literal>mypublication</literal> and <literal>insert_only</literal> and starts replicating immediately on commit: <placeholder-1/>
ru: Создание подписки на репликации <literal>mypublication</literal> и <literal>insert_only</literal> на удалённом сервере с немедленным запуском репликации при фиксировании транзакции: <placeholder-1/>

source: Create a subscription to a remote server that replicates tables in the <literal>insert_only</literal> publication and does not start replicating until enabled at a later time. <placeholder-1/>
ru: Создание подписки на публикацию <literal>insert_only</literal> на удалённом сервере с отключением репликации для запуска в будущем. <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>CREATE SUBSCRIPTION</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>CREATE SUBSCRIPTION</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
