Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/create_index.po
Languages: ru

source: If a problem arises while scanning the table, such as a deadlock or a uniqueness violation in a unique index, the <command>CREATE INDEX</command> command will fail but leave behind an <quote>invalid</quote> index. This index will be ignored for querying purposes because it might be incomplete; however it will still consume update overhead. The <application>psql</application> <command>\d</command> command will report such an index as <literal>INVALID</literal>: <placeholder-1/> The recommended recovery method in such cases is to drop the index and try again to perform <command>CREATE INDEX CONCURRENTLY</command>. (Another possibility is to rebuild the index with <command>REINDEX</command>. However, since <command>REINDEX</command> does not support concurrent builds, this option is unlikely to seem attractive.)
ru: Если при сканировании таблицы возникает проблема, например взаимоблокировка или нарушение уникальности в уникальном индексе, команда <command>CREATE INDEX</command> завершится ошибкой, но оставит после себя <quote>нерабочий</quote> индекс. Этот индекс будет игнорироваться при чтении данных, так как он может быть неполным; однако с ним могут быть связаны дополнительные операции при изменениях. В <application>psql</application> встроенная команда <command>\d</command> помечает такой индекс как <literal>INVALID</literal>: <placeholder-1/> Рекомендуемый в таких случаях способ исправления ситуации — удалить индекс и затем попытаться снова выполнить <command>CREATE INDEX CONCURRENTLY</command>. (Кроме того, можно перестроить его с помощью команды <command>REINDEX</command>. Но так как <command>REINDEX</command> не поддерживает параллельный режим, вряд ли этот вариант будет желательным.)

source: Another caveat when building a unique index concurrently is that the uniqueness constraint is already being enforced against other transactions when the second table scan begins. This means that constraint violations could be reported in other queries prior to the index becoming available for use, or even in cases where the index build eventually fails. Also, if a failure does occur in the second scan, the <quote>invalid</quote> index continues to enforce its uniqueness constraint afterwards.
ru: Ещё одна сложность, с которой можно столкнуться при параллельном построении уникального индекса, заключается в том, что ограничение уникальности уже влияет на другие транзакции, когда второе сканирование таблицы только начинается. Это значит, что нарушения ограничения могут проявляться в других запросах до того, как индекс становится доступным для использования и даже тогда, когда создать индекс в итоге не удаётся. Кроме того, если при втором сканировании происходит ошибка, <quote>нерабочий</quote> индекс оставляет в силе своё ограничение уникальности и дальше.

source: Concurrent builds of expression indexes and partial indexes are supported. Errors occurring in the evaluation of these expressions could cause behavior similar to that described above for unique constraint violations.
ru: Метод параллельного построения поддерживает также индексы выражений и частичные индексы. Ошибки, произошедшие при вычислении этих выражений, могут привести к такому же поведению, как в вышеописанных случаях с нарушением ограничений уникальности.

source: Regular index builds permit other regular index builds on the same table to occur in parallel, but only one concurrent index build can occur on a table at a time. In both cases, no other types of schema modification on the table are allowed meanwhile. Another difference is that a regular <command>CREATE INDEX</command> command can be performed within a transaction block, but <command>CREATE INDEX CONCURRENTLY</command> cannot.
ru: Обычное построение индекса допускает одновременное построение других индексов обычным методом, но параллельное построение в один момент времени допускается только одно. В обоих случаях, никакие изменения типов в схеме таблицы в это время не разрешаются. Другое отличие состоит в том, что в блоке транзакции может быть выполнена обычная команда <command>CREATE INDEX</command>, но не <command>CREATE INDEX CONCURRENTLY</command>.

source: Notes
ru: Замечания

source: See <xref linkend="indexes"/> for information about when indexes can be used, when they are not used, and in which particular situations they can be useful.
ru: Информацию о том, когда могут применяться, и когда не применяются индексы, и в каких конкретных ситуациях они могут быть полезны, можно найти в <xref remap="6" linkend="indexes"/>.

source: Currently, only the B-tree, GiST, GIN, and BRIN index methods support multicolumn indexes. Up to 32 fields can be specified by default. (This limit can be altered when building <productname>PostgreSQL</productname>.) Only B-tree currently supports unique indexes.
ru: В настоящее время составные индексы поддерживаются только методами B-дерево, GiST, GIN и BRIN. По умолчанию такой индекс может включать до 32 полей. (Этот предел можно изменить, пересобрав <productname>PostgreSQL</productname>.) Уникальные индексы поддерживает только B-дерево.

source: An <firstterm>operator class</firstterm> can be specified for each column of an index. The operator class identifies the operators to be used by the index for that column. For example, a B-tree index on four-byte integers would use the <literal>int4_ops</literal> class; this operator class includes comparison functions for four-byte integers. In practice the default operator class for the column's data type is usually sufficient. The main point of having operator classes is that for some data types, there could be more than one meaningful ordering. For example, we might want to sort a complex-number data type either by absolute value or by real part. We could do this by defining two operator classes for the data type and then selecting the proper class when making an index. More information about operator classes is in <xref linkend="indexes-opclass"/> and in <xref linkend="xindex"/>.
ru: Для каждого столбца индекса можно задать <firstterm>класс операторов</firstterm>. Этот класс определяет, какие операторы будут использоваться индексом для этого столбца. Например, индекс-B-дерево по четырёхбайтовым целым будет использовать класс <literal>int4_ops</literal>; этот класс операторов включает функции сравнения для таких значений. На практике обычно достаточно использовать класс операторов по умолчанию для типа данных столбца. Существование классов операторов объясняется в первую очередь тем, что для некоторых типов данных можно предложить более одного осмысленного порядка сортировки. Например, может возникнуть желание отсортировать комплексные числа как по абсолютному значению, так и по вещественной части. Это можно сделать, определив два класса операторов для типа данных и выбрав подходящий класс при создании индекса. За дополнительными сведениями о классах операторов обратитесь к <xref remap="3" linkend="indexes-opclass"/> и <xref remap="3" linkend="xindex"/>.

source: For index methods that support ordered scans (currently, only B-tree), the optional clauses <literal>ASC</literal>, <literal>DESC</literal>, <literal>NULLS FIRST</literal>, and/or <literal>NULLS LAST</literal> can be specified to modify the sort ordering of the index. Since an ordered index can be scanned either forward or backward, it is not normally useful to create a single-column <literal>DESC</literal> index &mdash; that sort ordering is already available with a regular index. The value of these options is that multicolumn indexes can be created that match the sort ordering requested by a mixed-ordering query, such as <literal>SELECT ... ORDER BY x ASC, y DESC</literal>. The <literal>NULLS</literal> options are useful if you need to support <quote>nulls sort low</quote> behavior, rather than the default <quote>nulls sort high</quote>, in queries that depend on indexes to avoid sorting steps.
ru: Для методов индекса, поддерживающих сканирование по порядку (в настоящее время это поддерживает только B-дерево), можно изменить порядок сортировки индекса, добавив необязательные предложения <literal>ASC</literal>, <literal>DESC</literal>, <literal>NULLS FIRST</literal> или <literal>NULLS LAST</literal>. Так как упорядоченный индекс можно сканировать вперёд или назад, обычно не имеет смысла создавать индекс по убыванию (<literal>DESC</literal>) для одного столбца &mdash; этот порядок сортировки можно получить и с обычным индексом. Эти параметры имеют смысл при создании составных индексов так, что они будут соответствовать порядку сортировки, указанному в запросе со смешанным порядком, например <literal>SELECT ... ORDER BY x ASC, y DESC</literal>. Параметры <literal>NULLS</literal> полезны, когда требуется реализовать поведение <quote>NULL внизу</quote>, изменив стандартное <quote>NULL вверху</quote>, в запросах, зависящих от индексов, чтобы избежать дополнительной сортировки.

source: For most index methods, the speed of creating an index is dependent on the setting of <xref linkend="guc-maintenance-work-mem"/>. Larger values will reduce the time needed for index creation, so long as you don't make it larger than the amount of memory really available, which would drive the machine into swapping.
ru: Для большинства методов индексов скорость создания индекса зависит от значения <xref linkend="guc-maintenance-work-mem"/>. Чем больше это значение, тем меньше времени требуется для создания индекса (если только заданное значение не превышает объём действительно доступной памяти, что влечёт за собой использование подкачки).

source: Use <xref linkend="sql-dropindex"/> to remove an index.
ru: Для удаления индекса применяется <xref linkend="sql-dropindex"/>.

source: Prior releases of <productname>PostgreSQL</productname> also had an R-tree index method. This method has been removed because it had no significant advantages over the GiST method. If <literal>USING rtree</literal> is specified, <command>CREATE INDEX</command> will interpret it as <literal>USING gist</literal>, to simplify conversion of old databases to GiST.
ru: В предыдущих выпусках <productname>PostgreSQL</productname> также поддерживался метод индекса R-дерево. Сейчас он отсутствует, так как он не даёт значительных преимуществ по сравнению с GiST. Указание <literal>USING rtree</literal> команда <command>CREATE INDEX</command> будет интерпретировать как <literal>USING gist</literal>, для упрощения перевода старых баз на GiST.

source: Examples
ru: Примеры

source: To create a B-tree index on the column <literal>title</literal> in the table <literal>films</literal>: <placeholder-1/>
ru: Создание индекса-B-дерева по столбцу <literal>title</literal> в таблице <literal>films</literal>: <placeholder-1/>

source: To create an index on the expression <literal>lower(title)</literal>, allowing efficient case-insensitive searches: <placeholder-1/> (In this example we have chosen to omit the index name, so the system will choose a name, typically <literal>films_lower_idx</literal>.)
ru: Создание индекса по выражению <literal>lower(title)</literal>, позволяющего эффективно выполнять регистронезависимый поиск: <placeholder-1/> (В этом примере мы решили опустить имя индекса, чтобы имя выбрала система, например <literal>films_lower_idx</literal>.)

source: To create an index with non-default collation: <placeholder-1/>
ru: Создание индекса с нестандартным правилом сортировки: <placeholder-1/>

source: To create an index with non-default sort ordering of nulls: <placeholder-1/>
ru: Создание индекса с нестандартным порядком значений NULL: <placeholder-1/>

source: To create an index with non-default fill factor: <placeholder-1/>
ru: Создание индекса с нестандартным фактором заполнения: <placeholder-1/>

source: To create a <acronym>GIN</acronym> index with fast updates disabled: <placeholder-1/>
ru: Создание индекса <acronym>GIN</acronym> с отключённым механизмом быстрого обновления: <placeholder-1/>

source: To create an index on the column <literal>code</literal> in the table <literal>films</literal> and have the index reside in the tablespace <literal>indexspace</literal>: <placeholder-1/>
ru: Создание индекса по столбцу <literal>code</literal> в таблице <literal>films</literal> и размещение его в табличном пространстве <literal>indexspace</literal>: <placeholder-1/>

source: To create a GiST index on a point attribute so that we can efficiently use box operators on the result of the conversion function: <placeholder-1/>
ru: Создание индекса GiST по координатам точек, позволяющего эффективно использовать операторы box с результатом функции преобразования: <placeholder-1/>

source: To create an index without locking out writes to the table: <placeholder-1/>
ru: Создание индекса без блокировки записи в таблицу: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>CREATE INDEX</command> is a <productname>PostgreSQL</productname> language extension. There are no provisions for indexes in the SQL standard.
ru: <command>CREATE INDEX</command> является языковым расширением <productname>PostgreSQL</productname>. Средства обеспечения индексов в стандарте SQL не описаны.

source: See Also
ru: См. также

source: Hash index operations are not presently WAL-logged, so hash indexes might need to be rebuilt with <command>REINDEX</command> after a database crash if there were unwritten changes. Also, changes to hash indexes are not replicated over streaming or file-based replication after the initial base backup, so they give wrong answers to queries that subsequently use them. Hash indexes are also not properly restored during point-in-time recovery. For these reasons, hash index use is presently discouraged.
ru: Операции с хеш-индексами в настоящее время не проходят через WAL, так что после аварийной остановки базы данных может потребоваться перестроить хеш-индексы командой <command>REINDEX</command>. Кроме того, изменения в хеш-индексах после начальной копии не переносятся при потоковой или файловой репликации, так что в последующих запросах они будут давать неправильные ответы. Также хеш-индексы не приходят в должное состояние при восстановлении на момент времени. По этим причинам настоятельно рекомендуется не использовать их.
