Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/create_function.po
Languages: ru

source: For parameter defaults, the SQL standard specifies only the syntax with the <literal>DEFAULT</literal> key word. The syntax with <literal>=</literal> is used in T-SQL and Firebird.
ru: Для определения значений по умолчанию для параметров стандарт SQL поддерживает только синтаксис с ключевым словом <literal>DEFAULT</literal>. Синтаксис со знаком <literal>=</literal> используется в T-SQL и Firebird.

source: See Also
ru: См. также
