Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/create_function.po
Languages: ru

source: <literal>PARALLEL UNSAFE</literal> indicates that the function can't be executed in parallel mode and the presence of such a function in an SQL statement forces a serial execution plan. This is the default. <literal>PARALLEL RESTRICTED</literal> indicates that the function can be executed in parallel mode, but the execution is restricted to parallel group leader. <literal>PARALLEL SAFE</literal> indicates that the function is safe to run in parallel mode without restriction.
ru: Указание <literal>PARALLEL UNSAFE</literal> означает, что эту функцию нельзя выполнять в параллельном режиме и присутствие такой функции в операторе SQL приводит к выбору последовательного плана выполнения. Это характеристика функции по умолчанию. Указание <literal>PARALLEL RESTRICTED</literal> означает, что функцию можно выполнять в параллельном режиме, но только в ведущем процессе группы. <literal>PARALLEL SAFE</literal> показывает, что функция безопасна для выполнения в параллельном режиме без ограничений.

source: Functions should be labeled parallel unsafe if they modify any database state, or if they make changes to the transaction such as using sub-transactions, or if they access sequences or attempt to make persistent changes to settings (e.g. <literal>setval</literal>). They should be labeled as parallel restricted if they access temporary tables, client connection state, cursors, prepared statements, or miscellaneous backend-local state which the system cannot synchronize in parallel mode (e.g. <literal>setseed</literal> cannot be executed other than by the group leader because a change made by another process would not be reflected in the leader). In general, if a function is labeled as being safe when it is restricted or unsafe, or if it is labeled as being restricted when it is in fact unsafe, it may throw errors or produce wrong answers when used in a parallel query. C-language functions could in theory exhibit totally undefined behavior if mislabeled, since there is no way for the system to protect itself against arbitrary C code, but in most likely cases the result will be no worse than for any other function. If in doubt, functions should be labeled as <literal>UNSAFE</literal>, which is the default.
ru: Функции должны помечаться как небезопасные для параллельного выполнения, если они изменяют состояние базы данных, вносят изменения в транзакции, например, используя подтранзакции, обращаются к последовательностям или пытаются сохранять параметры (например, используя <literal>setval</literal>). Ограниченно параллельными должны помечаться функции, которые обращаются к временным таблицам, состоянию клиентского подключения, курсорам, подготовленным операторам или разнообразному состоянию обслуживающего процесса, которое система не может синхронизировать в параллельном режиме (например, <literal>setseed</literal> может выполнять только ведущий процесс группы, так как изменения, внесённые другим процессом, не передаются ведущему). Вообще, если функция помечена как безопасная, тогда как она является ограниченной или небезопасной, либо если она помечена как ограниченно безопасная, не являясь безопасной, при попытке вызвать её в параллельном запросе она может выдавать ошибки или неверные результаты. Функции на языке C при неправильной пометке теоретически могут проявлять полностью неопределённое поведение, так как система никак не может защититься от произвольного кода на C, но чаще все они будут вести себя не хуже, чем любая другая функция. В случае сомнений функцию следует помечать как небезопасную (<literal>UNSAFE</literal>), что и имеет место по умолчанию.

source: A positive number giving the estimated execution cost for the function, in units of <xref linkend="guc-cpu-operator-cost"/>. If the function returns a set, this is the cost per returned row. If the cost is not specified, 1 unit is assumed for C-language and internal functions, and 100 units for functions in all other languages. Larger values cause the planner to try to avoid evaluating the function more often than necessary.
ru: Положительное число, задающее примерную стоимость выполнения функции, в единицах <xref linkend="guc-cpu-operator-cost"/>. Если функция возвращает множество, это число задаёт стоимость для одной строки. Если стоимость не указана, для функций на C и внутренних функций она считается равной 1 единице, а для функций на всех других языках — 100 единицам. При больших значениях планировщик будет стараться не вызывать эту функцию чаще, чем это необходимо.

source: A positive number giving the estimated number of rows that the planner should expect the function to return. This is only allowed when the function is declared to return a set. The default assumption is 1000 rows.
ru: Положительное число, задающее примерное число строк, которое будет ожидать планировщик на выходе этой функции. Это указание допустимо, только если функция объявлена как возвращающая множество. Предполагаемое по умолчанию значение — 1000 строк.

source: The <literal>SET</literal> clause causes the specified configuration parameter to be set to the specified value when the function is entered, and then restored to its prior value when the function exits. <literal>SET FROM CURRENT</literal> saves the value of the parameter that is current when <command>CREATE FUNCTION</command> is executed as the value to be applied when the function is entered.
ru: Предложение <literal>SET</literal> определяет, что при вызове функции указанный параметр конфигурации должен принять заданное значение, а затем восстановить своё предыдущее значение при завершении функции. Предложение <literal>SET FROM CURRENT</literal> сохраняет в качестве значения, которое будет применено при входе в функцию, значение, действующее в момент выполнения <command>CREATE FUNCTION</command>.

source: If a <literal>SET</literal> clause is attached to a function, then the effects of a <command>SET LOCAL</command> command executed inside the function for the same variable are restricted to the function: the configuration parameter's prior value is still restored at function exit. However, an ordinary <command>SET</command> command (without <literal>LOCAL</literal>) overrides the <literal>SET</literal> clause, much as it would do for a previous <command>SET LOCAL</command> command: the effects of such a command will persist after function exit, unless the current transaction is rolled back.
ru: Если в определение функции добавлено <literal>SET</literal>, то действие команды <command>SET LOCAL</command>, выполняемой внутри функции для того же параметра, ограничивается телом функции: предыдущее значение параметра неизменно будет восстановлено при завершении функции. Однако обычная команда <command>SET</command> (без <literal>LOCAL</literal>) переопределяет предложение <literal>SET</literal>, как и предыдущую команду <command>SET LOCAL</command>: действие такой команды будет сохранено и после завершения функции, если только не произойдёт откат транзакции.

source: See <xref linkend="sql-set"/> and <xref linkend="runtime-config"/> for more information about allowed parameter names and values.
ru: За подробными сведениями об именах и значениях параметров обратитесь к <xref remap="3" linkend="sql-set"/> и <xref remap="3" linkend="runtime-config"/>.

source: A string constant defining the function; the meaning depends on the language. It can be an internal function name, the path to an object file, an SQL command, or text in a procedural language.
ru: Строковая константа, определяющая реализацию функции; её значение зависит от языка. Это может быть имя внутренней функции, путь к объектному файлу, команда SQL или код функции на процедурном языке.

source: It is often helpful to use dollar quoting (see <xref linkend="sql-syntax-dollar-quoting"/>) to write the function definition string, rather than the normal single quote syntax. Without dollar quoting, any single quotes or backslashes in the function definition must be escaped by doubling them.
ru: Часто бывает полезно заключать определение функции в доллары (см. <xref remap="4" linkend="sql-syntax-dollar-quoting"/>), а не в традиционные апострофы. Если не использовать доллары, все апострофы и обратные косые черты в определении функции придётся экранировать, дублируя их.

source: This form of the <literal>AS</literal> clause is used for dynamically loadable C language functions when the function name in the C language source code is not the same as the name of the SQL function. The string <replaceable class="parameter">obj_file</replaceable> is the name of the file containing the dynamically loadable object, and <replaceable class="parameter">link_symbol</replaceable> is the function's link symbol, that is, the name of the function in the C language source code. If the link symbol is omitted, it is assumed to be the same as the name of the SQL function being defined.
ru: Эта форма предложения <literal>AS</literal> применяется для динамически загружаемых функций на языке C, когда имя функции в коде C не совпадает с именем функции в SQL. Строка <replaceable class="parameter">объектный_файл</replaceable> задаёт имя файла, содержащего динамически загружаемый объект, а <replaceable class="parameter">объектный_символ</replaceable> — символ скомпонованной функций, то есть имя функции в исходном коде на языке C. Если объектный символ опущен, предполагается, что он совпадает с именем определяемой SQL-функции.

source: When repeated <command>CREATE FUNCTION</command> calls refer to the same object file, the file is only loaded once per session. To unload and reload the file (perhaps during development), start a new session.
ru: Если повторные вызовы <command>CREATE FUNCTION</command> ссылаются на один и тот же объектный файл, файл загружается в рамках сеанса только один раз. Чтобы выгрузить и загрузить файл снова (например, в процессе разработки), начните новый сеанс.

source: Equivalent to <literal>STRICT</literal> or <literal>RETURNS NULL ON NULL INPUT</literal>.
ru: Равнозначно указанию <literal>STRICT</literal> или <literal>RETURNS NULL ON NULL INPUT</literal>.

source: <literal>isCachable</literal> is an obsolete equivalent of <literal>IMMUTABLE</literal>; it's still accepted for backwards-compatibility reasons.
ru: Свойство <literal>isCachable</literal> — устаревший эквивалент <literal>IMMUTABLE</literal>; оно всё ещё поддерживается ради обратной совместимости.

source: The historical way to specify optional pieces of information about the function. The following attributes can appear here: <placeholder-1/> Attribute names are not case-sensitive.
ru: Исторически сложившийся способ передавать дополнительную информацию о функции. В этой записи могут присутствовать следующие атрибуты: <placeholder-1/> Имена атрибутов являются регистронезависимыми.

source: Refer to <xref linkend="xfunc"/> for further information on writing functions.
ru: За дополнительной информацией о разработке функций обратитесь к <xref remap="3" linkend="xfunc"/>.

source: Overloading
ru: Перегрузка

source: <productname>PostgreSQL</productname> allows function <firstterm>overloading</firstterm>; that is, the same name can be used for several different functions so long as they have distinct input argument types. However, the C names of all functions must be different, so you must give overloaded C functions different C names (for example, use the argument types as part of the C names).
ru: <productname>PostgreSQL</productname> допускает <firstterm>перегрузку</firstterm> функций; то есть, позволяет использовать одно имя для нескольких различных функций, если у них различаются типы входных аргументов. Однако имена функций в коде C должны различаться, так что перегружаемым функциям C нужно давать различные имена в C (например, включить в имя функции на C типы аргументов).

source: Two functions are considered the same if they have the same names and <emphasis>input</emphasis> argument types, ignoring any <literal>OUT</literal> parameters. Thus for example these declarations conflict: <placeholder-1/>
ru: Две функции считаются совпадающими, если они имеют одинаковые имена и типы <emphasis>входных</emphasis> аргументов, параметры <literal>OUT</literal> игнорируются. Таким образом, например, эти объявления вызовут конфликт: <placeholder-1/>

source: Functions that have different argument type lists will not be considered to conflict at creation time, but if defaults are provided they might conflict in use. For example, consider <placeholder-1/> A call <literal>foo(10)</literal> will fail due to the ambiguity about which function should be called.
ru: Функции, имеющие разные типы аргументов, не будут считаться конфликтующими в момент создания, но предоставленные для них значения по умолчанию могут вызвать конфликт в момент использования. Например, рассмотрите следующие определения: <placeholder-1/> Вызов <literal>foo(10)</literal> завершится ошибкой из-за неоднозначности в выборе вызываемой функции.

source: Notes
ru: Замечания

source: The full <acronym>SQL</acronym> type syntax is allowed for declaring a function's arguments and return value. However, parenthesized type modifiers (e.g., the precision field for type <type>numeric</type>) are discarded by <command>CREATE FUNCTION</command>. Thus for example <literal>CREATE FUNCTION foo (varchar(10)) ...</literal> is exactly the same as <literal>CREATE FUNCTION foo (varchar) ...</literal>.
ru: В объявлении аргументов функции и возвращаемого значения допускается полный синтаксис описания типа <acronym>SQL</acronym>. Однако модификаторы типа в скобках (например, поле точности для типа <type>numeric</type>) команда <command>CREATE FUNCTION</command> не учитывает. Так что, например, <literal>CREATE FUNCTION foo (varchar(10)) ...</literal> создаст такую же функцию, что и <literal>CREATE FUNCTION foo (varchar) ...</literal>.

source: When replacing an existing function with <command>CREATE OR REPLACE FUNCTION</command>, there are restrictions on changing parameter names. You cannot change the name already assigned to any input parameter (although you can add names to parameters that had none before). If there is more than one output parameter, you cannot change the names of the output parameters, because that would change the column names of the anonymous composite type that describes the function's result. These restrictions are made to ensure that existing calls of the function do not stop working when it is replaced.
ru: При замене существующей функции с помощью <command>CREATE OR REPLACE FUNCTION</command> есть ограничения на изменения имён параметров. В частности, нельзя изменить имя, уже назначенное любому входному параметру (хотя можно добавить имена ранее безымянным параметрам). Также, если у функции более одного выходного параметра, нельзя изменять имена выходных параметров, так как это приведёт к изменению имён столбцов анонимного составного типа, описывающего результат функции. Эти ограничения позволяют гарантировать, что существующие вызовы функции не перестанут работать после её замены.

source: If a function is declared <literal>STRICT</literal> with a <literal>VARIADIC</literal> argument, the strictness check tests that the variadic array <emphasis>as a whole</emphasis> is non-null. The function will still be called if the array has null elements.
ru: Если функция объявлена как <literal>STRICT</literal> с аргументом <literal>VARIADIC</literal>, при оценивании строгости проверяется, что весь переменный массив <emphasis>в целом</emphasis> не NULL. Если же в этом массиве содержатся элементы NULL, функция будет вызываться.

source: Examples
ru: Примеры

source: Here are some trivial examples to help you get started. For more information and examples, see <xref linkend="xfunc"/>. <placeholder-1/>
ru: Ниже приведено несколько простых вводных примеров. За дополнительными сведениями и примерами обратитесь к <xref remap="3" linkend="xfunc"/>. <placeholder-1/>

source: Increment an integer, making use of an argument name, in <application>PL/pgSQL</application>: <placeholder-1/>
ru: Функция увеличения целого числа на 1, использующая именованный аргумент, на языке <application>PL/pgSQL</application>: <placeholder-1/>

source: Return a record containing multiple output parameters: <placeholder-1/> You can do the same thing more verbosely with an explicitly named composite type: <placeholder-2/> Another way to return multiple columns is to use a <literal>TABLE</literal> function: <placeholder-3/> However, a <literal>TABLE</literal> function is different from the preceding examples, because it actually returns a <emphasis>set</emphasis> of records, not just one record.
ru: Функция, возвращающая запись с несколькими выходными параметрами: <placeholder-1/> То же самое можно сделать более развёрнуто, явно объявив составной тип: <placeholder-2/> Ещё один способ вернуть несколько столбцов — применить функцию <literal>TABLE</literal>: <placeholder-3/> Однако пример с <literal>TABLE</literal> отличается от предыдущих, так как в нём функция на самом деле возвращает не одну, а <emphasis>набор</emphasis> записей.

source: Writing <literal>SECURITY DEFINER</literal> Functions Safely
ru: Разработка защищённых функций <literal>SECURITY DEFINER</literal>

source: <primary><varname>search_path</varname> configuration parameter</primary> <secondary>use in securing functions</secondary>
ru: <primary><varname>путь_поиска</varname> параметр конфигурации</primary> <secondary>использование в защищённых функциях</secondary>

source: <primary>pg_temp</primary><secondary>securing functions</secondary>
ru: <primary>pg_temp</primary> <secondary>защищённые функции</secondary>

source: CREATE FUNCTION check_password(uname TEXT, pass TEXT) RETURNS BOOLEAN AS $$ DECLARE passed BOOLEAN; BEGIN SELECT (pwd = $2) INTO passed FROM pwds WHERE username = $1; RETURN passed; END; $$ LANGUAGE plpgsql SECURITY DEFINER -- Set a secure search_path: trusted schema(s), then 'pg_temp'. SET search_path = admin, pg_temp;
ru: CREATE FUNCTION check_password(uname TEXT, pass TEXT) RETURNS BOOLEAN AS $$ DECLARE passed BOOLEAN; BEGIN SELECT (pwd = $2) INTO passed FROM pwds WHERE username = $1; RETURN passed; END; $$ LANGUAGE plpgsql SECURITY DEFINER -- Установить безопасный путь поиска: сначала доверенная схема(ы), затем 'pg_temp'. SET search_path = admin, pg_temp;

source: Because a <literal>SECURITY DEFINER</literal> function is executed with the privileges of the user that created it, care is needed to ensure that the function cannot be misused. For security, <xref linkend="guc-search-path"/> should be set to exclude any schemas writable by untrusted users. This prevents malicious users from creating objects (e.g., tables, functions, and operators) that mask objects intended to be used by the function. Particularly important in this regard is the temporary-table schema, which is searched first by default, and is normally writable by anyone. A secure arrangement can be obtained by forcing the temporary schema to be searched last. To do this, write <literal>pg_temp</literal><placeholder-1/> as the last entry in <varname>search_path</varname>. This function illustrates safe usage: <placeholder-2/> This function's intention is to access a table <literal>admin.pwds</literal>. But without the <literal>SET</literal> clause, or with a <literal>SET</literal> clause mentioning only <literal>admin</literal>, the function could be subverted by creating a temporary table named <literal>pwds</literal>.
ru: Так как функция <literal>SECURITY DEFINER</literal> выполняется с правами пользователя, создавшего её, необходимо позаботиться о том, чтобы её нельзя было использовать не по назначению. В целях безопасности, в пути <xref linkend="guc-search-path"/> следует исключить любые схемы, доступные на запись недоверенным пользователям. Это не позволит злонамеренным пользователям создать свои объекты (например, таблицы, функции и операторы), которые замаскируют объекты, используемые функцией. Особенно важно в этом отношении исключить схему временных таблиц, которая по умолчанию просматривается первой, а право записи в неё по умолчанию имеют все. Соответствующую защиту можно организовать, поместив временную схему в конец списка поиска. Для этого следует сделать <literal>pg_temp</literal><placeholder-1/> последней записью в <varname>search_path</varname>. Безопасное использование демонстрирует следующая функция: <placeholder-2/> Эта функция должна обращаться к таблице <literal>admin.pwds</literal>, но без предложения <literal>SET</literal> или с предложением <literal>SET</literal>, включающим только <literal>admin</literal>, её можно &laquo;обмануть&raquo;, создав временную таблицу <literal>pwds</literal>.

source: Before <productname>PostgreSQL</productname> version 8.3, the <literal>SET</literal> clause was not available, and so older functions may contain rather complicated logic to save, set, and restore <varname>search_path</varname>. The <literal>SET</literal> clause is far easier to use for this purpose.
ru: До <productname>PostgreSQL</productname> 8.3 предложение <literal>SET</literal> отсутствовало, так что старые функции могут содержать довольно сложную логику для сохранения, изменения и восстановления переменной <varname>search_path</varname>. Существующее теперь предложение <literal>SET</literal> позволяет сделать это намного проще.

source: Another point to keep in mind is that by default, execute privilege is granted to <literal>PUBLIC</literal> for newly created functions (see <xref linkend="sql-grant"/> for more information). Frequently you will wish to restrict use of a security definer function to only some users. To do that, you must revoke the default <literal>PUBLIC</literal> privileges and then grant execute privilege selectively. To avoid having a window where the new function is accessible to all, create it and set the privileges within a single transaction. For example:
ru: Также следует помнить о том, что по умолчанию право выполнения для создаваемых функций имеет роль <literal>PUBLIC</literal> (за подробностями обратитесь к <xref remap="3" linkend="sql-grant"/>). Однако часто требуется разрешить доступ к функциям, работающим в контексте определившего, только некоторым пользователям. Для этого необходимо отозвать стандартные права <literal>PUBLIC</literal> и затем дать права на выполнение индивидуально. Чтобы не образовалось окно, в котором новая функция будет недоступна совсем, создайте её и назначьте права в одной транзакции. Например, так:

source: Compatibility
ru: Совместимость

source: A <command>CREATE FUNCTION</command> command is defined in SQL:1999 and later. The <productname>PostgreSQL</productname> version is similar but not fully compatible. The attributes are not portable, neither are the different available languages.
ru: Команда <command>CREATE FUNCTION</command> определена в SQL:1999 и более поздних стандартах. Версия, реализованная в <productname>PostgreSQL</productname>, близка к стандартизированной, но соответствует ей не полностью. В частности, непереносимы атрибуты, а также различные языки реализаций.

source: For compatibility with some other database systems, <replaceable class="parameter">argmode</replaceable> can be written either before or after <replaceable class="parameter">argname</replaceable>. But only the first way is standard-compliant.
ru: Для совместимости с другими СУБД <replaceable class="parameter">режим_аргумента</replaceable> можно записать после <replaceable class="parameter">имя_аргумента</replaceable> или перед ним, но стандарту соответствует только первый вариант.
