Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/create_statistics.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define extended statistics
ru: создать расширенную статистику

source: statistics_name
ru: имя_статистики

source: statistics_kind
ru: вид_статистики

source: column_name
ru: имя_столбца

source: table_name
ru: имя_таблицы

source: Description
ru: Описание

source: <command>CREATE STATISTICS</command> will create a new extended statistics object tracking data about the specified table, foreign table or materialized view. The statistics object will be created in the current database and will be owned by the user issuing the command.
ru: Команда <command>CREATE STATISTICS</command> создаст новый объект расширенной статистики, отслеживающий данные определённой таблицы, сторонней таблицы или материализованного представления. Объект статистики будет создан в текущей базе данных, и его владельцем станет пользователь, выполняющий команду.

source: If a schema name is given (for example, <literal>CREATE STATISTICS myschema.mystat ...</literal>) then the statistics object is created in the specified schema. Otherwise it is created in the current schema. The name of the statistics object must be distinct from the name of any other statistics object in the same schema.
ru: Если задано имя схемы (например, <literal>CREATE STATISTICS myschema.mystat ...</literal>), объект статистики создаётся в указанной схеме, в противном случае — в текущей. Имя объекта статистики должно отличаться от имён других объектов статистики в этой схеме.

source: Parameters
ru: Параметры

source: Do not throw an error if a statistics object with the same name already exists. A notice is issued in this case. Note that only the name of the statistics object is considered here, not the details of its definition.
ru: Не считать ошибкой, если объект статистики с таким именем уже существует. В этом случае будет выдано замечание. Заметьте, что при этом проверяется только имя объекта, а не характеристики его определения.

source: The name (optionally schema-qualified) of the statistics object to be created.
ru: Имя (возможно, дополненное схемой) создаваемого объекта статистики.

source: A statistics kind to be computed in this statistics object. Currently supported kinds are <literal>ndistinct</literal>, which enables n-distinct statistics, and <literal>dependencies</literal>, which enables functional dependency statistics. If this clause is omitted, all supported statistics kinds are included in the statistics object. For more information, see <xref linkend="planner-stats-extended"/> and <xref linkend="multivariate-statistics-examples"/>.
ru: Вид статистики, которая будет вычисляться в этом объекте. В настоящее время поддерживается статистика <literal>ndistinct</literal>, подсчёт числа различных значений, и <literal>dependencies</literal>, определение функциональных зависимостей. Если это предложение опущено, в объект статистики включаются все поддерживаемые виды статистики. За дополнительными сведениями обратитесь к <xref remap="3" linkend="planner-stats-extended"/> и <xref remap="3" linkend="multivariate-statistics-examples"/>.

source: The name of a table column to be covered by the computed statistics. At least two column names must be given.
ru: Имя столбца таблицы, который будет покрываться вычисляемой статистикой. Необходимо указать имена минимум двух столбцов.

source: The name (optionally schema-qualified) of the table containing the column(s) the statistics are computed on.
ru: Имя (возможно, дополненное схемой) таблицы, содержащей столбцы, по которым создаётся статистика.

source: Notes
ru: Замечания

source: You must be the owner of a table to create a statistics object reading it. Once created, however, the ownership of the statistics object is independent of the underlying table(s).
ru: Чтобы создать объект статистики, читающий таблицу, необходимо быть владельцем этой таблицы. После создания объекта статистики его владелец может определяться независимо от нижележащей таблицы.

source: Examples
ru: Примеры

source: CREATE TABLE t1 ( a int, b int ); INSERT INTO t1 SELECT i/100, i/500 FROM generate_series(1,1000000) s(i); ANALYZE t1; -- the number of matching rows will be drastically underestimated: EXPLAIN ANALYZE SELECT * FROM t1 WHERE (a = 1) AND (b = 0); CREATE STATISTICS s1 (dependencies) ON a, b FROM t1; ANALYZE t1; -- now the row count estimate is more accurate: EXPLAIN ANALYZE SELECT * FROM t1 WHERE (a = 1) AND (b = 0);
ru: CREATE TABLE t1 ( a int, b int ); INSERT INTO t1 SELECT i/100, i/500 FROM generate_series(1,1000000) s(i); ANALYZE t1; -- число совпадающих строк будет катастрофически недооценено: EXPLAIN ANALYZE SELECT * FROM t1 WHERE (a = 1) AND (b = 0); CREATE STATISTICS s1 (dependencies) ON a, b FROM t1; ANALYZE t1; -- теперь оценка числа строк стала точнее: EXPLAIN ANALYZE SELECT * FROM t1 WHERE (a = 1) AND (b = 0);

source: Create table <structname>t1</structname> with two functionally dependent columns, i.e. knowledge of a value in the first column is sufficient for determining the value in the other column. Then functional dependency statistics are built on those columns: <placeholder-1/> Without functional-dependency statistics, the planner would assume that the two <literal>WHERE</literal> conditions are independent, and would multiply their selectivities together to arrive at a much-too-small row count estimate. With such statistics, the planner recognizes that the <literal>WHERE</literal> conditions are redundant and does not underestimate the rowcount.
ru: В данном примере создаётся таблица <structname>t1</structname> с двумя функционально зависимыми столбцами; то есть знания значения одного столбца достаточно, чтобы определить значение другого. Затем для этих столбцов строится статистика функциональной зависимости: <placeholder-1/> Без статистики функциональной зависимости планировщик предположил бы, что два условия <literal>WHERE</literal> независимы друг от друга, и перемножил бы их оценки избирательности, что дало бы слишком заниженную оценку числа строк. Однако с созданной статистикой планировщик понимает, что условия <literal>WHERE</literal> избыточны и не ошибается с этой оценкой.

source: Compatibility
ru: Совместимость

source: There is no <command>CREATE STATISTICS</command> command in the SQL standard.
ru: Команда <command>CREATE STATISTICS</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
