Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/create_index.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new index
ru: создать индекс

source: name
ru: имя

source: table_name
ru: имя_таблицы

source: method
ru: метод

source: column_name
ru: имя_столбца

source: expression
ru: выражение

source: collation
ru: правило_сортировки

source: opclass
ru: класс_операторов

source: storage_parameter
ru: параметр_хранения

source: value
ru: значение

source: tablespace_name
ru: табл_пространство

source: predicate
ru: предикат

source: Description
ru: Описание

source: <command>CREATE INDEX</command> constructs an index on the specified column(s) of the specified relation, which can be a table or a materialized view. Indexes are primarily used to enhance database performance (though inappropriate use can result in slower performance).
ru: <command>CREATE INDEX</command> создаёт индексы по указанному столбцу(ам) заданного отношения, которым может быть таблица или материализованное представление. Индексы применяются в первую очередь для оптимизации производительности базы данных (хотя при неправильном использовании возможен и противоположный эффект).

source: The key field(s) for the index are specified as column names, or alternatively as expressions written in parentheses. Multiple fields can be specified if the index method supports multicolumn indexes.
ru: Ключевое поле для индекса задаётся как имя столбца или выражение, заключённое в скобки. Если метод индекса поддерживает составные индексы, допускается указание нескольких полей.

source: An index field can be an expression computed from the values of one or more columns of the table row. This feature can be used to obtain fast access to data based on some transformation of the basic data. For example, an index computed on <literal>upper(col)</literal> would allow the clause <literal>WHERE upper(col) = 'JIM'</literal> to use an index.
ru: Поле индекса может быть выражением, вычисляемым из значений одного или нескольких столбцов в строке таблицы. Это может быть полезно для получения быстрого доступа к данным по некоторому преобразованию исходных значений. Например, индекс, построенный по выражению <literal>upper(col)</literal>, позволит использовать поиск по индексу в предложении <literal>WHERE upper(col) = 'JIM'</literal>.

source: <productname>PostgreSQL</productname> provides the index methods B-tree, hash, GiST, SP-GiST, GIN, and BRIN. Users can also define their own index methods, but that is fairly complicated.
ru: <productname>PostgreSQL</productname> предоставляет следующие методы индексов: B-дерево, хеш, GiST, SP-GiST, GIN и BRIN. Пользователи могут определить и собственные методы индексов, но это довольно сложная задача.

source: When the <literal>WHERE</literal> clause is present, a <firstterm>partial index</firstterm> is created. A partial index is an index that contains entries for only a portion of a table, usually a portion that is more useful for indexing than the rest of the table. For example, if you have a table that contains both billed and unbilled orders where the unbilled orders take up a small fraction of the total table and yet that is an often used section, you can improve performance by creating an index on just that portion. Another possible application is to use <literal>WHERE</literal> with <literal>UNIQUE</literal> to enforce uniqueness over a subset of a table. See <xref linkend="indexes-partial"/> for more discussion.
ru: Если в команде присутствует предложение <literal>WHERE</literal>, она создаёт <firstterm>частичный индекс</firstterm>. Такой индекс содержит записи только для части таблицы, обычно более полезной для индексации, чем остальная таблица. Например, если таблица содержит информацию об оплаченных и неоплаченных счетах, при этом последних сравнительно немного, но именно эта часть таблицы наиболее востребована, то увеличить быстродействие можно, создав индекс только по этой части. Ещё одно возможное применение <literal>WHERE</literal> — добавив <literal>UNIQUE</literal>, обеспечить уникальность в подмножестве таблицы. Подробнее это рассматривается в <xref remap="6" linkend="indexes-partial"/>.

source: The expression used in the <literal>WHERE</literal> clause can refer only to columns of the underlying table, but it can use all columns, not just the ones being indexed. Presently, subqueries and aggregate expressions are also forbidden in <literal>WHERE</literal>. The same restrictions apply to index fields that are expressions.
ru: Выражение в предложении <literal>WHERE</literal> может ссылаться только на столбцы нижележащей таблицы, но не обязательно ограничиваться теми, по которым строится индекс. В настоящее время в <literal>WHERE</literal> также нельзя использовать подзапросы и агрегатные выражения. Это же ограничение распространяется и на выражения в полях индексов.

source: All functions and operators used in an index definition must be <quote>immutable</quote>, that is, their results must depend only on their arguments and never on any outside influence (such as the contents of another table or the current time). This restriction ensures that the behavior of the index is well-defined. To use a user-defined function in an index expression or <literal>WHERE</literal> clause, remember to mark the function immutable when you create it.
ru: Все функции и операторы, используемые в определении индекса, должны быть <quote>постоянными</quote>, то есть, их результаты должны зависеть только от аргументов, но не от внешних факторов (например, содержимого другой таблицы или текущего времени). Это ограничение обеспечивает определённость поведения индекса. Чтобы использовать в выражении индекса или в предложении <literal>WHERE</literal> собственную функцию, не забудьте пометить её при создании как постоянную (IMMUTABLE).

source: Parameters
ru: Параметры

source: Causes the system to check for duplicate values in the table when the index is created (if data already exist) and each time data is added. Attempts to insert or update data which would result in duplicate entries will generate an error.
ru: Указывает, что система должна контролировать повторяющиеся значения в таблице при создании индекса (если в таблице уже есть данные) и при каждом добавлении данных. Попытки вставить или изменить данные, при которых будет нарушена уникальность индекса, будут завершаться ошибкой.

source: When this option is used, <productname>PostgreSQL</productname> will build the index without taking any locks that prevent concurrent inserts, updates, or deletes on the table; whereas a standard index build locks out writes (but not reads) on the table until it's done. There are several caveats to be aware of when using this option &mdash; see <xref linkend="sql-createindex-concurrently" endterm="sql-createindex-concurrently-title"/>.
ru: С этим указанием <productname>PostgreSQL</productname> построит индекс, не устанавливая никаких блокировок, которые бы предотвращали добавление, изменение или удаление записей в таблице; тогда как по умолчанию операция построения индекса блокирует запись (но не чтение) в таблице до своего завершения. При создании индекса в параллельном режиме есть ряд особенностей, о которых следует знать &mdash; см. <xref remap="4" linkend="sql-createindex-concurrently" endterm="sql-createindex-concurrently-title"/>.

source: Do not throw an error if a relation with the same name already exists. A notice is issued in this case. Note that there is no guarantee that the existing index is anything like the one that would have been created. Index name is required when <literal>IF NOT EXISTS</literal> is specified.
ru: Не считать ошибкой, если индекс с таким именем уже существует. В этом случае будет выдано замечание. Заметьте, что нет никакой гарантии, что существующий индекс как-то соотносится с тем, который мог бы быть создан. Имя индекса является обязательным, когда указывается <literal>IF NOT EXISTS</literal>.

source: The name of the index to be created. No schema name can be included here; the index is always created in the same schema as its parent table. If the name is omitted, <productname>PostgreSQL</productname> chooses a suitable name based on the parent table's name and the indexed column name(s).
ru: Имя создаваемого индекса. Указание схемы при этом не допускается; индекс всегда относится к той же схеме, что и родительская таблица. Если имя опущено, <productname>PostgreSQL</productname> формирует подходящее имя по имени родительской таблицы и именам индексируемых столбцов.

source: The name (possibly schema-qualified) of the table to be indexed.
ru: Имя (возможно, дополненное схемой) индексируемой таблицы.

source: The name of the index method to be used. Choices are <literal>btree</literal>, <literal>hash</literal>, <literal>gist</literal>, <literal>spgist</literal>, <literal>gin</literal>, and <literal>brin</literal>. The default method is <literal>btree</literal>.
ru: Имя применяемого метода индекса. Возможные варианты: <literal>btree</literal>, <literal>hash</literal>, <literal>gist</literal>, <literal>spgist</literal>, <literal>gin</literal> и <literal>brin</literal>. По умолчанию подразумевается метод <literal>btree</literal>.

source: The name of a column of the table.
ru: Имя столбца таблицы.

source: An expression based on one or more columns of the table. The expression usually must be written with surrounding parentheses, as shown in the syntax. However, the parentheses can be omitted if the expression has the form of a function call.
ru: Выражение с одним или несколькими столбцами таблицы. Обычно выражение должно записываться в скобках, как показано в синтаксисе команды. Однако скобки можно опустить, если выражение записано в виде вызова функции.

source: The name of the collation to use for the index. By default, the index uses the collation declared for the column to be indexed or the result collation of the expression to be indexed. Indexes with non-default collations can be useful for queries that involve expressions using non-default collations.
ru: Имя правила сортировки, применяемого для индекса. По умолчанию используется правило сортировки, заданное для индексируемого столбца, либо полученное для результата выражения индекса. Индексы с нестандартными правилами сортировки могут быть полезны для запросов, включающих выражения с такими правилами.

source: The name of an operator class. See below for details.
ru: Имя класса операторов. Подробнее об этом ниже.

source: Specifies ascending sort order (which is the default).
ru: Указывает порядок сортировки по возрастанию (подразумевается по умолчанию).

source: Specifies descending sort order.
ru: Указывает порядок сортировки по убыванию.

source: Specifies that nulls sort before non-nulls. This is the default when <literal>DESC</literal> is specified.
ru: Указывает, что значения NULL после сортировки оказываются перед остальными. Это поведение по умолчанию с порядком сортировки <literal>DESC</literal>.

source: Specifies that nulls sort after non-nulls. This is the default when <literal>DESC</literal> is not specified.
ru: Указывает, что значения NULL после сортировки оказываются после остальных. Это поведение по умолчанию с порядком сортировки <literal>ASC</literal>.

source: The name of an index-method-specific storage parameter. See <xref linkend="sql-createindex-storage-parameters" endterm="sql-createindex-storage-parameters-title"/> for details.
ru: Имя специфичного для индекса параметра хранения. За подробностями обратитесь к <xref remap="3" linkend="sql-createindex-storage-parameters" endterm="sql-createindex-storage-parameters-title"/>.

source: The tablespace in which to create the index. If not specified, <xref linkend="guc-default-tablespace"/> is consulted, or <xref linkend="guc-temp-tablespaces"/> for indexes on temporary tables.
ru: Табличное пространство, в котором будет создан индекс. Если не определено, выбирается <xref linkend="guc-default-tablespace"/>, либо <xref linkend="guc-temp-tablespaces"/>, при создании индекса временной таблицы.

source: The constraint expression for a partial index.
ru: Выражение ограничения для частичного индекса.

source: Index Storage Parameters
ru: Параметры хранения индекса

source: The optional <literal>WITH</literal> clause specifies <firstterm>storage parameters</firstterm> for the index. Each index method has its own set of allowed storage parameters. The B-tree, hash, GiST and SP-GiST index methods all accept this parameter:
ru: Необязательное предложение <literal>WITH</literal> определяет <firstterm>параметры хранения</firstterm> для индекса. У каждого метода индекса есть свой набор допустимых параметров хранения. Следующий параметр принимают методы B-дерево, хеш, GiST и SP-GiST:

source: The fillfactor for an index is a percentage that determines how full the index method will try to pack index pages. For B-trees, leaf pages are filled to this percentage during initial index build, and also when extending the index at the right (adding new largest key values). If pages subsequently become completely full, they will be split, leading to gradual degradation in the index's efficiency. B-trees use a default fillfactor of 90, but any integer value from 10 to 100 can be selected. If the table is static then fillfactor 100 is best to minimize the index's physical size, but for heavily updated tables a smaller fillfactor is better to minimize the need for page splits. The other index methods use fillfactor in different but roughly analogous ways; the default fillfactor varies between methods.
ru: Фактор заполнения для индекса определяет в процентном отношении, насколько плотно метод индекса будет заполнять страницы индекса. Для B-деревьев концевые страницы заполняются до этого процента при начальном построении индекса и позже, при расширении индекса вправо (добавлении новых наибольших значений ключа). Если страницы впоследствии оказываются заполненными полностью, они будут разделены, что приводит к постепенному снижению эффективности индекса. Для B-деревьев по умолчанию используется фактор заполнения 90, но его можно поменять на любое целое значение от 10 до 100. Фактор заполнения, равный 100, полезен для статических таблиц и помогает уменьшить физический размер таблицы, но для интенсивно изменяемых таблиц лучше использовать меньшее значение, чтобы разделять страницы приходилось реже. С другими методами индекса фактор заполнения действует по-другому, но примерно в том же ключе; значение фактора заполнения по умолчанию для разных методов разное.

source: GiST indexes additionally accept this parameter:
ru: Индексы GiST дополнительно принимают этот параметр:

source: Determines whether the buffering build technique described in <xref linkend="gist-buffering-build"/> is used to build the index. With <literal>OFF</literal> it is disabled, with <literal>ON</literal> it is enabled, and with <literal>AUTO</literal> it is initially disabled, but turned on on-the-fly once the index size reaches <xref linkend="guc-effective-cache-size"/>. The default is <literal>AUTO</literal>.
ru: Определяет, будет ли при построении индекса использоваться буферизация, описанная в <xref remap="6" linkend="gist-buffering-build"/>. Со значением <literal>OFF</literal> она отключена, с <literal>ON</literal> — включена, а с <literal>AUTO</literal> — отключена вначале, но может затем включиться на ходу, как только размер индекса достигнет значения <xref linkend="guc-effective-cache-size"/>. По умолчанию подразумевается <literal>AUTO</literal>.

source: GIN indexes accept different parameters:
ru: Индексы GIN принимают другие параметры:

source: This setting controls usage of the fast update technique described in <xref linkend="gin-fast-update"/>. It is a Boolean parameter: <literal>ON</literal> enables fast update, <literal>OFF</literal> disables it. (Alternative spellings of <literal>ON</literal> and <literal>OFF</literal> are allowed as described in <xref linkend="config-setting"/>.) The default is <literal>ON</literal>.
ru: Этот параметр управляет механизмом быстрого обновления, описанным в <xref remap="6" linkend="gin-fast-update"/>. Он имеет логическое значение: <literal>ON</literal> включает быстрое обновление, <literal>OFF</literal> отключает его. (Другие возможные написания <literal>ON</literal> и <literal>OFF</literal> перечислены в <xref remap="6" linkend="config-setting"/>.) Значение по умолчанию — <literal>ON</literal>.

source: Turning <literal>fastupdate</literal> off via <command>ALTER INDEX</command> prevents future insertions from going into the list of pending index entries, but does not in itself flush previous entries. You might want to <command>VACUUM</command> the table or call <function>gin_clean_pending_list</function> function afterward to ensure the pending list is emptied.
ru: Выключение <literal>fastupdate</literal> в <command>ALTER INDEX</command> предотвращает помещение добавляемых в дальнейшем строк в список записей, ожидающих индексации, но записи, добавленные в этот список ранее, в нём остаются. Чтобы очистить очередь операций, надо затем выполнить <command>VACUUM</command> для этой таблицы или вызвать функцию <function>gin_clean_pending_list</function>.

source: Custom <xref linkend="guc-gin-pending-list-limit"/> parameter. This value is specified in kilobytes.
ru: Пользовательский параметр <xref linkend="guc-gin-pending-list-limit"/>. Его значение задаётся в килобайтах.

source: <acronym>BRIN</acronym> indexes accept different parameters:
ru: Индексы <acronym>BRIN</acronym> принимают другие параметры:

source: <acronym>BRIN</acronym> indexes accept a different parameter:
ru: Индексы <acronym>BRIN</acronym> принимают другой параметр:

source: Defines the number of table blocks that make up one block range for each entry of a <acronym>BRIN</acronym> index (see <xref linkend="brin-intro"/> for more details). The default is <literal>128</literal>.
ru: Определяет, сколько блоков таблицы образуют зону блоков для каждой записи в индексе <acronym>BRIN</acronym> (за подробностями обратитесь к <xref remap="3" linkend="brin-intro"/>). Значение по умолчанию — <literal>128</literal>.

source: Defines whether a summarization run is invoked for the previous page range whenever an insertion is detected on the next one.
ru: Определяет, нужно ли вычислять сводное значение для зоны предыдущей страницы, когда происходит добавление на следующей странице.

source: Building Indexes Concurrently
ru: Параллельное построение индексов

source: <primary>index</primary> <secondary>building concurrently</secondary>
ru: <primary>индекс</primary> <secondary>параллельное построение</secondary>

source: Creating an index can interfere with regular operation of a database. Normally <productname>PostgreSQL</productname> locks the table to be indexed against writes and performs the entire index build with a single scan of the table. Other transactions can still read the table, but if they try to insert, update, or delete rows in the table they will block until the index build is finished. This could have a severe effect if the system is a live production database. Very large tables can take many hours to be indexed, and even for smaller tables, an index build can lock out writers for periods that are unacceptably long for a production system.
ru: Создание индекса может мешать обычной работе с базой данных. Обычно <productname>PostgreSQL</productname> блокирует индексируемую таблицу от записи и выполняет всю операцию построения индекса за одно сканирование таблицы. Другие транзакции могут продолжать читать таблицу, но при попытке вставить, изменить или удалить строки в таблице они будут заблокированы до завершения построения индекса. Это может оказать нежелательное влияние на работу производственной базы данных. Индексация очень больших таблиц может занимать много часов, и даже для маленьких таблиц построение индекса может заблокировать записывающие процессы на время, неприемлемое для производственной системы.

source: <productname>PostgreSQL</productname> supports building indexes without locking out writes. This method is invoked by specifying the <literal>CONCURRENTLY</literal> option of <command>CREATE INDEX</command>. When this option is used, <productname>PostgreSQL</productname> must perform two scans of the table, and in addition it must wait for all existing transactions that could potentially modify or use the index to terminate. Thus this method requires more total work than a standard index build and takes significantly longer to complete. However, since it allows normal operations to continue while the index is built, this method is useful for adding new indexes in a production environment. Of course, the extra CPU and I/O load imposed by the index creation might slow other operations.
ru: <productname>PostgreSQL</productname> поддерживает построение индексов без блокировки записи. Этот метод выбирается указанием <literal>CONCURRENTLY</literal> команды <command>CREATE INDEX</command>. Когда он используется, <productname>PostgreSQL</productname> должен выполнить два сканирования таблицы, а кроме того, должен дождаться завершения всех существующих транзакций, которые потенциально могут модифицировать и использовать этот индекс. Таким образом, эта процедура требует проделать в сумме больше действий и выполняется значительно дольше, чем обычное построение индекса. Однако благодаря тому, что этот метод позволяет продолжать обычную работу с базой во время построения индекса, он оказывается полезным в производственной среде. Хотя разумеется, дополнительная нагрузка на процессор и подсистему ввода/вывода, создаваемая при построении индекса, может привести к замедлению других операций.

source: In a concurrent index build, the index is actually entered into the system catalogs in one transaction, then two table scans occur in two more transactions. Before each table scan, the index build must wait for existing transactions that have modified the table to terminate. After the second scan, the index build must wait for any transactions that have a snapshot (see <xref linkend="mvcc"/>) predating the second scan to terminate. Then finally the index can be marked ready for use, and the <command>CREATE INDEX</command> command terminates. Even then, however, the index may not be immediately usable for queries: in the worst case, it cannot be used as long as transactions exist that predate the start of the index build.
ru: При параллельном построении индекса он попадает в системный каталог в одной транзакции, затем ещё два сканирования таблицы выполняются в двух других транзакциях. Перед каждым сканированием таблицы процедура построения индекса должна ждать завершения текущих транзакций, модифицировавших эту таблицу. После второго сканирования также необходимо дожидаться завершения всех транзакций, получивших снимок (см. <xref remap="4" linkend="mvcc"/>) перед вторым сканированием. Наконец индекс может быть помечен как готовый к использованию, после чего команда <command>CREATE INDEX</command> завершается. Однако даже тогда индекс может быть не готов немедленно к применению в запросах: в худшем случае он не будет использоваться, пока существуют транзакции, начатые до начала построения индекса.
