Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/create_function.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new function
ru: создать функцию

source: name
ru: имя

source: argmode
ru: режим_аргумента

source: argname
ru: имя_аргумента

source: argtype
ru: тип_аргумента

source: default_expr
ru: выражение_по_умолчанию

source: rettype
ru: тип_результата

source: column_name
ru: имя_столбца

source: column_type
ru: тип_столбца

source: lang_name
ru: имя_языка

source: type_name
ru: имя_типа

source: execution_cost
ru: стоимость_выполнения

source: result_rows
ru: строк_в_результате

source: configuration_parameter
ru: параметр_конфигурации

source: value
ru: значение

source: definition
ru: определение

source: obj_file
ru: объектный_файл

source: link_symbol
ru: объектный_символ

source: attribute
ru: атрибут

source: Description
ru: Описание

source: <command>CREATE FUNCTION</command> defines a new function. <command>CREATE OR REPLACE FUNCTION</command> will either create a new function, or replace an existing definition. To be able to define a function, the user must have the <literal>USAGE</literal> privilege on the language.
ru: Команда <command>CREATE FUNCTION</command> определяет новую функцию. <command>CREATE OR REPLACE FUNCTION</command> создаёт новую функцию, либо заменяет определение уже существующей. Чтобы определить функцию, необходимо иметь право <literal>USAGE</literal> для соответствующего языка.

source: If a schema name is included, then the function is created in the specified schema. Otherwise it is created in the current schema. The name of the new function must not match any existing function with the same input argument types in the same schema. However, functions of different argument types can share a name (this is called <firstterm>overloading</firstterm>).
ru: Если указано имя схемы, функция создаётся в заданной схеме, в противном случае — в текущей. Имя новой функции должно отличаться от имён существующих функций с такими же типами аргументов в этой схеме. Однако, функции с аргументами разных типов могут иметь одно имя (это называется <firstterm>перегрузкой</firstterm>).

source: To replace the current definition of an existing function, use <command>CREATE OR REPLACE FUNCTION</command>. It is not possible to change the name or argument types of a function this way (if you tried, you would actually be creating a new, distinct function). Also, <command>CREATE OR REPLACE FUNCTION</command> will not let you change the return type of an existing function. To do that, you must drop and recreate the function. (When using <literal>OUT</literal> parameters, that means you cannot change the types of any <literal>OUT</literal> parameters except by dropping the function.)
ru: Чтобы заменить текущее определение существующей функции, используйте команду <command>CREATE OR REPLACE FUNCTION</command>. Но учтите, что она не позволяет изменить имя или аргументы функции (если попытаться сделать это, на самом деле будет создана новая, независимая функция). Кроме того, <command>CREATE OR REPLACE FUNCTION</command> не позволит изменить тип результата существующей функции. Чтобы сделать это, придётся удалить функцию и создать её заново. (Это означает, что если функция имеет выходные параметры (<literal>OUT</literal>), то изменить типы параметров <literal>OUT</literal> можно, только удалив функцию.)

source: When <command>CREATE OR REPLACE FUNCTION</command> is used to replace an existing function, the ownership and permissions of the function do not change. All other function properties are assigned the values specified or implied in the command. You must own the function to replace it (this includes being a member of the owning role).
ru: Когда команда <command>CREATE OR REPLACE FUNCTION</command> заменяет существующую функцию, владелец и права доступа к этой функции не меняются. Все другие свойства функции получают значения, задаваемые командой явно или по умолчанию. Чтобы заменить функцию, необходимо быть её владельцем (или быть членом роли-владельца).

source: If you drop and then recreate a function, the new function is not the same entity as the old; you will have to drop existing rules, views, triggers, etc. that refer to the old function. Use <command>CREATE OR REPLACE FUNCTION</command> to change a function definition without breaking objects that refer to the function. Also, <command>ALTER FUNCTION</command> can be used to change most of the auxiliary properties of an existing function.
ru: Если вы удалите и затем вновь создадите функцию, новая функция станет другой сущностью, отличной от старой; вам потребуется так же удалить существующие правила, представления, триггеры и т. п., ссылающиеся на старую функцию. Поэтому, чтобы изменить определение функции, сохраняя ссылающиеся на неё объекты, следует использовать <command>CREATE OR REPLACE FUNCTION</command>. Кроме того, многие дополнительные свойства существующей функции можно изменить с помощью <command>ALTER FUNCTION</command>.

source: The user that creates the function becomes the owner of the function.
ru: Владельцем функции становится пользователь её создавший.

source: To be able to create a function, you must have <literal>USAGE</literal> privilege on the argument types and the return type.
ru: Чтобы создать функцию, необходимо иметь право <literal>USAGE</literal> для типов её аргументов и возвращаемого типа.

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of the function to create.
ru: Имя (возможно, дополненное схемой) создаваемой функции.

source: The mode of an argument: <literal>IN</literal>, <literal>OUT</literal>, <literal>INOUT</literal>, or <literal>VARIADIC</literal>. If omitted, the default is <literal>IN</literal>. Only <literal>OUT</literal> arguments can follow a <literal>VARIADIC</literal> one. Also, <literal>OUT</literal> and <literal>INOUT</literal> arguments cannot be used together with the <literal>RETURNS TABLE</literal> notation.
ru: Режим аргумента: <literal>IN</literal> (входной), <literal>OUT</literal> (выходной), <literal>INOUT</literal> (входной и выходной) или <literal>VARIADIC</literal> (переменный). По умолчанию подразумевается <literal>IN</literal>. За единственным аргументом <literal>VARIADIC</literal> могут следовать только аргументы <literal>OUT</literal>. Кроме того, аргументы <literal>OUT</literal> и <literal>INOUT</literal> нельзя использовать с предложением <literal>RETURNS TABLE</literal>.

source: The name of an argument. Some languages (including SQL and PL/pgSQL) let you use the name in the function body. For other languages the name of an input argument is just extra documentation, so far as the function itself is concerned; but you can use input argument names when calling a function to improve readability (see <xref linkend="sql-syntax-calling-funcs"/>). In any case, the name of an output argument is significant, because it defines the column name in the result row type. (If you omit the name for an output argument, the system will choose a default column name.)
ru: Имя аргумента. Некоторые языки (включая SQL и PL/pgSQL) позволяют использовать это имя в теле функции. Для других языков это имя служит просто дополнительным описанием, если говорить о самой функции; однако вы можете указывать имена аргументов при вызове функции для улучшения читаемости (см. <xref remap="4" linkend="sql-syntax-calling-funcs"/>). Имя выходного аргумента в любом случае имеет значение, так как оно определяет имя столбца в типе результата. (Если вы опустите имя выходного аргумента, система выберет для него имя по умолчанию.)

source: The data type(s) of the function's arguments (optionally schema-qualified), if any. The argument types can be base, composite, or domain types, or can reference the type of a table column.
ru: Тип(ы) данных аргументов функции (возможно, дополненный схемой), при наличии аргументов. Тип аргументов может быть базовым, составным или доменным, либо это может быть ссылка на столбец таблицы.

source: Depending on the implementation language it might also be allowed to specify <quote>pseudotypes</quote> such as <type>cstring</type>. Pseudotypes indicate that the actual argument type is either incompletely specified, or outside the set of ordinary SQL data types.
ru: В зависимости от языка реализации также может допускаться указание <quote>псевдотипов</quote>, например, <type>cstring</type>. Псевдотипы показывают, что фактический тип аргумента либо определён не полностью, либо существует вне множества обычных типов SQL.

source: The type of a column is referenced by writing <literal><replaceable class="parameter">table_name</replaceable>.<replaceable class="parameter">column_name</replaceable>%TYPE</literal>. Using this feature can sometimes help make a function independent of changes to the definition of a table.
ru: Ссылка на тип столбца записывается в виде <literal><replaceable class="parameter">имя_таблицы</replaceable>.<replaceable class="parameter">имя_столбца</replaceable>%TYPE</literal>. Иногда такое указание бывает полезно, так как позволяет создать функцию, независящую от изменений в определении таблицы.

source: An expression to be used as default value if the parameter is not specified. The expression has to be coercible to the argument type of the parameter. Only input (including <literal>INOUT</literal>) parameters can have a default value. All input parameters following a parameter with a default value must have default values as well.
ru: Выражение, используемое для вычисления значения по умолчанию, если параметр не задан явно. Результат выражения должен сводиться к типу соответствующего параметра. Значения по умолчанию могут иметь только входные параметры (включая <literal>INOUT</literal>). Для всех входных параметров, следующих за параметром с определённым значением по умолчанию, также должны быть определены значения по умолчанию.

source: The return data type (optionally schema-qualified). The return type can be a base, composite, or domain type, or can reference the type of a table column. Depending on the implementation language it might also be allowed to specify <quote>pseudotypes</quote> such as <type>cstring</type>. If the function is not supposed to return a value, specify <type>void</type> as the return type.
ru: Тип возвращаемых данных (возможно, дополненный схемой). Это может быть базовый, составной или доменный тип, либо ссылка на тип столбца таблицы. В зависимости от языка реализации здесь также могут допускаться <quote>псевдотипы</quote>, например <type>cstring</type>. Если функция не должна возвращать значение, в качестве типа результата указывается <type>void</type>.

source: When there are <literal>OUT</literal> or <literal>INOUT</literal> parameters, the <literal>RETURNS</literal> clause can be omitted. If present, it must agree with the result type implied by the output parameters: <literal>RECORD</literal> if there are multiple output parameters, or the same type as the single output parameter.
ru: В случае наличия параметров <literal>OUT</literal> или <literal>INOUT</literal>, предложение <literal>RETURNS</literal> можно опустить. Если оно присутствует, оно должно согласовываться с типом результата, выводимым из выходных параметров: в качестве возвращаемого типа указывается <literal>RECORD</literal>, если выходных параметров несколько, либо тип единственного выходного параметра.

source: The <literal>SETOF</literal> modifier indicates that the function will return a set of items, rather than a single item.
ru: Указание <literal>SETOF</literal> показывает, что функция возвращает множество, а не единственный элемент.

source: The type of a column is referenced by writing <literal><replaceable class="parameter">table_name</replaceable>.<replaceable class="parameter">column_name</replaceable>%TYPE</literal>.
ru: Ссылка на тип столбца записывается в виде <literal><replaceable class="parameter">имя_таблицы</replaceable>.<replaceable class="parameter">имя_столбца</replaceable>%TYPE</literal>.

source: The name of an output column in the <literal>RETURNS TABLE</literal> syntax. This is effectively another way of declaring a named <literal>OUT</literal> parameter, except that <literal>RETURNS TABLE</literal> also implies <literal>RETURNS SETOF</literal>.
ru: Имя выходного столбца в записи <literal>RETURNS TABLE</literal>. По сути это ещё один способ объявить именованный выходной параметр (<literal>OUT</literal>), но <literal>RETURNS TABLE</literal> также подразумевает и <literal>RETURNS SETOF</literal>.

source: The data type of an output column in the <literal>RETURNS TABLE</literal> syntax.
ru: Тип данных выходного столбца в записи <literal>RETURNS TABLE</literal>.

source: The name of the language that the function is implemented in. It can be <literal>sql</literal>, <literal>c</literal>, <literal>internal</literal>, or the name of a user-defined procedural language, e.g. <literal>plpgsql</literal>. Enclosing the name in single quotes is deprecated and requires matching case.
ru: Имя языка, на котором реализована функция. Это может быть <literal>sql</literal>, <literal>c</literal>, <literal>internal</literal>, либо имя процедурного языка, определённого пользователем, например, <literal>plpgsql</literal>. Стиль написания этого имени в апострофах считается устаревшим и требует точного совпадения регистра.

source: Lists which transforms a call to the function should apply. Transforms convert between SQL types and language-specific data types; see <xref linkend="sql-createtransform"/>. Procedural language implementations usually have hardcoded knowledge of the built-in types, so those don't need to be listed here. If a procedural language implementation does not know how to handle a type and no transform is supplied, it will fall back to a default behavior for converting data types, but this depends on the implementation.
ru: Устанавливает список трансформаций, которые должны применяться при вызове функций. Трансформации выполняют преобразования между типами SQL и типами данных, специфичными для языков; см. <xref remap="4" linkend="sql-createtransform"/>. Преобразования встроенных типов обычно жёстко предопределены в реализациях процедурных языков, так что их здесь указывать не нужно. Если реализация процедурного языка не знает, как обработать тип и трансформация для него отсутствует, будет выполнено преобразование типов по умолчанию, но это зависит от реализации.

source: <literal>WINDOW</literal> indicates that the function is a <firstterm>window function</firstterm> rather than a plain function. This is currently only useful for functions written in C. The <literal>WINDOW</literal> attribute cannot be changed when replacing an existing function definition.
ru: Указание <literal>WINDOW</literal> показывает, что создаётся не простая, а <firstterm>оконная функция</firstterm>. В настоящее время это имеет смысл только для функций, написанных на C. Атрибут <literal>WINDOW</literal> нельзя изменить, модифицируя впоследствии определение функции.

source: These attributes inform the query optimizer about the behavior of the function. At most one choice can be specified. If none of these appear, <literal>VOLATILE</literal> is the default assumption.
ru: Эти атрибуты информируют оптимизатор запросов о поведении функции. Одновременно можно указать не более одного атрибута. Если никакой атрибут не задан, по умолчанию подразумевается <literal>VOLATILE</literal>.

source: <literal>IMMUTABLE</literal> indicates that the function cannot modify the database and always returns the same result when given the same argument values; that is, it does not do database lookups or otherwise use information not directly present in its argument list. If this option is given, any call of the function with all-constant arguments can be immediately replaced with the function value.
ru: Характеристика <literal>IMMUTABLE</literal> (постоянная) показывает, что функция не может модифицировать базу данных и всегда возвращает один и тот же результат при определённых значениях аргументов; то есть, она не обращается к базе данных и не использует информацию, не переданную ей явно в списке аргументов. Если функция имеет такую характеристику, любой её вызов с аргументами-константами можно немедленно заменить значением функции.

source: <literal>STABLE</literal> indicates that the function cannot modify the database, and that within a single table scan it will consistently return the same result for the same argument values, but that its result could change across SQL statements. This is the appropriate selection for functions whose results depend on database lookups, parameter variables (such as the current time zone), etc. (It is inappropriate for <literal>AFTER</literal> triggers that wish to query rows modified by the current command.) Also note that the <function>current_timestamp</function> family of functions qualify as stable, since their values do not change within a transaction.
ru: Характеристика <literal>STABLE</literal> (стабильная) показывает, что функция не может модифицировать базу данных и в рамках одного сканирования таблицы она всегда возвращает один и тот же результат для определённых значений аргументов, но этот результат может быть разным в разных операторах SQL. Это подходящий выбор для функций, результаты которых зависят от содержимого базы данных и настраиваемых параметров (например, текущего часового пояса). (Но этот вариант не подходит для триггеров <literal>AFTER</literal>, желающих прочитать строки, изменённые текущей командой.) Также заметьте, что функции семейства <function>current_timestamp</function> также считаются стабильными, так как их результаты не меняются внутри транзакции.

source: <literal>VOLATILE</literal> indicates that the function value can change even within a single table scan, so no optimizations can be made. Relatively few database functions are volatile in this sense; some examples are <literal>random()</literal>, <literal>currval()</literal>, <literal>timeofday()</literal>. But note that any function that has side-effects must be classified volatile, even if its result is quite predictable, to prevent calls from being optimized away; an example is <literal>setval()</literal>.
ru: Характеристика <literal>VOLATILE</literal> (изменчивая) показывает, что результат функции может меняться даже в рамках одного сканирования таблицы, так что её вызовы нельзя оптимизировать. Изменчивы в этом смысле относительно немногие функции баз данных, например: <literal>random()</literal>, <literal>currval()</literal> и <literal>timeofday()</literal>. Но заметьте, что любая функция с побочными эффектами должна быть классифицирована как изменчивая, даже если её результат вполне предсказуем, чтобы её вызовы не были соптимизированы; пример такой функции: <literal>setval()</literal>.

source: For additional details see <xref linkend="xfunc-volatility"/>.
ru: За дополнительными подробностями обратитесь к <xref remap="3" linkend="xfunc-volatility"/>.

source: <literal>LEAKPROOF</literal> indicates that the function has no side effects. It reveals no information about its arguments other than by its return value. For example, a function which throws an error message for some argument values but not others, or which includes the argument values in any error message, is not leakproof. This affects how the system executes queries against views created with the <literal>security_barrier</literal> option or tables with row level security enabled. The system will enforce conditions from security policies and security barrier views before any user-supplied conditions from the query itself that contain non-leakproof functions, in order to prevent the inadvertent exposure of data. Functions and operators marked as leakproof are assumed to be trustworthy, and may be executed before conditions from security policies and security barrier views. In addition, functions which do not take arguments or which are not passed any arguments from the security barrier view or table do not have to be marked as leakproof to be executed before security conditions. See <xref linkend="sql-createview"/> and <xref linkend="rules-privileges"/>. This option can only be set by the superuser.
ru: Характеристика <literal>LEAKPROOF</literal> (герметичная) показывает, что функция не имеет побочных эффектов. Она не раскрывает информацию о своих аргументах, кроме как возвращая результат. Например, функция, которая выдаёт сообщение об ошибке с некоторыми, но не всеми значениями аргументов, либо выводит значения аргументов в сообщении об ошибке, не является герметичной. Это влияет на то, как система выполняет запросы к представлениям, созданным с барьером безопасности (с указанием <literal>security_barrier</literal>), или к таблицам с включённой защитой строк. Во избежание неконтролируемой утечки данных система будет проверять условия из политик защиты и определений представлений с барьерами безопасности перед любыми условиями, которые задаёт пользователь в самом запросе и в которых задействуются негерметичные функции. Функции и операторы, помеченные как герметичные, считаются доверенными и могут выполняться перед условиями из политик защиты и представлений с барьерами безопасности. При этом функции, которые не имеют аргументов или которым не передаются никакие аргументы из представления с барьером безопасности или таблицы, не требуется помечать как герметичные, чтобы они выполнялись до условий, связанных с безопасностью. См. <xref remap="4" linkend="sql-createview"/> и <xref remap="4" linkend="rules-privileges"/>. Это свойство может установить только суперпользователь.

source: <literal>CALLED ON NULL INPUT</literal> (the default) indicates that the function will be called normally when some of its arguments are null. It is then the function author's responsibility to check for null values if necessary and respond appropriately.
ru: <literal>CALLED ON NULL INPUT</literal> (по умолчанию) показывает, что функция будет вызвана как обычно, если среди её аргументов оказываются значения NULL. В этом случае ответственность за проверку значений NULL и соответствующую их обработку ложится на разработчика функции.

source: <literal>RETURNS NULL ON NULL INPUT</literal> or <literal>STRICT</literal> indicates that the function always returns null whenever any of its arguments are null. If this parameter is specified, the function is not executed when there are null arguments; instead a null result is assumed automatically.
ru: Указание <literal>RETURNS NULL ON NULL INPUT</literal> или <literal>STRICT</literal> показывает, что функция всегда возвращает NULL, получив NULL в одном из аргументов. Такая функция не будет вызываться с аргументами NULL, вместо этого автоматически будет полагаться результат NULL.

source: <literal>SECURITY INVOKER</literal> indicates that the function is to be executed with the privileges of the user that calls it. That is the default. <literal>SECURITY DEFINER</literal> specifies that the function is to be executed with the privileges of the user that created it.
ru: Характеристика <literal>SECURITY INVOKER</literal> (безопасность вызывающего) показывает, что функция будет выполняться с правами пользователя, вызвавшего её. Этот вариант подразумевается по умолчанию. Вариант <literal>SECURITY DEFINER</literal> (безопасность определившего) определяет, что функция выполняется с правами пользователя, создавшего её.

source: The key word <literal>EXTERNAL</literal> is allowed for SQL conformance, but it is optional since, unlike in SQL, this feature applies to all functions not only external ones.
ru: Ключевое слово <literal>EXTERNAL</literal> (внешняя) допускается для соответствия стандарту SQL, но является необязательным, так как, в отличие от SQL, эта характеристика распространяется на все функции, а не только внешние.
