Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/create_publication.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new publication
ru: создать публикацию

source: name
ru: имя

source: table_name
ru: имя_таблицы

source: publication_parameter
ru: параметр_публикации

source: value
ru: значение

source: Description
ru: Описание

source: <command>CREATE PUBLICATION</command> adds a new publication into the current database. The publication name must be distinct from the name of any existing publication in the current database.
ru: <command>CREATE PUBLICATION</command> создаёт новую публикацию в текущей базе данных. Имя публикации должно отличаться от имён других существующих публикаций в текущей базе.

source: A publication is essentially a group of tables whose data changes are intended to be replicated through logical replication. See <xref linkend="logical-replication-publication"/> for details about how publications fit into the logical replication setup.
ru: Публикация по сути является группой таблиц, изменения в данных которых должны реплицироваться с использованием логической репликации. Подробнее о том, как публикации вписываются в схему логической репликации, рассказывается в <xref remap="6" linkend="logical-replication-publication"/>.

source: Parameters
ru: Параметры

source: The name of the new publication.
ru: Имя новой публикации.

source: Specifies a list of tables to add to the publication. If <literal>ONLY</literal> is specified before the table name, only that table is added to the publication. If <literal>ONLY</literal> is not specified, the table and all its descendant tables (if any) are added. Optionally, <literal>*</literal> can be specified after the table name to explicitly indicate that descendant tables are included.
ru: Задаёт список таблиц, добавляемых в публикацию. Если перед именем таблицы указано <literal>ONLY</literal>, в публикацию добавляется только заданная таблица. Без <literal>ONLY</literal> добавляется и заданная таблица, и все её потомки (если таковые есть). После имени таблицы можно добавить необязательное указание <literal>*</literal>, чтобы явно обозначить, что должны включаться и все дочерние таблицы.

source: Only persistent base tables can be part of a publication. Temporary tables, unlogged tables, foreign tables, materialized views, regular views, and partitioned tables cannot be part of a publication. To replicate a partitioned table, add the individual partitions to the publication.
ru: В публикацию могут включаться только постоянные базовые таблицы. Временные, нежурналируемые, сторонние и секционированные таблицы, а также материализованные и обычные представления не могут входить в публикацию. Для реплицирования секционированной таблицы в публикацию нужно добавить её отдельные секции.

source: Marks the publication as one that replicates changes for all tables in the database, including tables created in the future.
ru: Устанавливает, что данная публикация охватывает изменения во всех таблиц в базе данных, включая таблицы, которые будут созданы позже.

source: This parameter determines which DML operations will be published by the new publication to the subscribers. The value is comma-separated list of operations. The allowed operations are <literal>insert</literal>, <literal>update</literal>, and <literal>delete</literal>. The default is to publish all actions, and so the default value for this option is <literal>'insert, update, delete'</literal>.
ru: Этот параметр определяет, какие операции DML будет передавать новая публикация её подписчикам. В качестве его значения через запятую задаётся список операций из следующих: <literal>insert</literal>, <literal>update</literal> и <literal>delete</literal>. По умолчанию публикуются все действия, так что этот параметр имеет значение по умолчанию <literal>'insert, update, delete'</literal>.

source: This clause specifies optional parameters for a publication. The following parameters are supported: <placeholder-1/>
ru: В этом предложении могут задаваться следующие необязательные параметры публикации: <placeholder-1/>

source: Notes
ru: Замечания

source: If neither <literal>FOR TABLE</literal> nor <literal>FOR ALL TABLES</literal> is specified, then the publication starts out with an empty set of tables. That is useful if tables are to be added later.
ru: Если не задано ни <literal>FOR TABLE</literal>, ни <literal>FOR ALL TABLES</literal>, публикация создаётся с пустым набором таблиц. Это полезно, если таблицы будут добавляться позднее.

source: The creation of a publication does not start replication. It only defines a grouping and filtering logic for future subscribers.
ru: Создание публикации не влечёт немедленный запуск репликации. Эта операция только определяет логику группирования и фильтрации для будущих подписчиков.

source: To create a publication, the invoking user must have the <literal>CREATE</literal> privilege for the current database. (Of course, superusers bypass this check.)
ru: Чтобы создать публикацию, пользователь должен иметь право <literal>CREATE</literal> в текущей базе данных. (Разумеется, на суперпользователей это условие не распространяется.)

source: To add a table to a publication, the invoking user must have ownership rights on the table. The <command>FOR ALL TABLES</command> clause requires the invoking user to be a superuser.
ru: Чтобы добавить таблицу в публикацию, пользователь должен иметь права владельца этой таблицы. Для использования предложения <command>FOR ALL TABLES</command> пользователь должен быть суперпользователем.

source: The tables added to a publication that publishes <command>UPDATE</command> and/or <command>DELETE</command> operations must have <literal>REPLICA IDENTITY</literal> defined. Otherwise those operations will be disallowed on those tables.
ru: Таблицы, добавляемые в публикацию, которая охватывает операции <command>UPDATE</command> и/или <command>DELETE</command>, должны иметь свойство <literal>REPLICA IDENTITY</literal>. В противном случае отслеживание этих операций для таблиц будет запрещено.

source: For an <command>INSERT ... ON CONFLICT</command> command, the publication will publish the operation that actually results from the command. So depending of the outcome, it may be published as either <command>INSERT</command> or <command>UPDATE</command>, or it may not be published at all.
ru: Для команды <command>INSERT ... ON CONFLICT</command> публикация будет выдавать операцию, к которой фактически сводится команда. Поэтому в зависимости от исхода команды, она может быть опубликована либо как <command>INSERT</command>, либо как <command>UPDATE</command>, либо не будет опубликована вовсе.

source: <command>COPY ... FROM</command> commands are published as <command>INSERT</command> operations.
ru: Команды <command>COPY ... FROM</command> публикуются в виде операций <command>INSERT</command>.

source: <command>TRUNCATE</command> and <acronym>DDL</acronym> operations are not published.
ru: Команда <command>TRUNCATE</command> и операции <acronym>DDL</acronym> не публикуются.

source: Examples
ru: Примеры

source: Create a publication that publishes all changes in two tables: <placeholder-1/>
ru: Создание публикации, охватывающей изменения в двух таблицах: <placeholder-1/>

source: Create a publication that publishes all changes in all tables: <placeholder-1/>
ru: Создание публикации, охватывающей все изменения во всех таблицах: <placeholder-1/>

source: Create a publication that only publishes <command>INSERT</command> operations in one table: <placeholder-1/>
ru: Создание публикации, охватывающей только операции <command>INSERT</command> в одной таблице: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>CREATE PUBLICATION</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>CREATE PUBLICATION</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
