Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/create_database.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: create a new database
ru: создать базу данных

source: name
ru: имя

source: user_name
ru: имя_пользователя

source: template
ru: шаблон

source: encoding
ru: кодировка

source: lc_collate
ru: категория_сортировки

source: lc_ctype
ru: категория_типов_символов

source: tablespace_name
ru: табл_пространство

source: allowconn
ru: разр_подключения

source: connlimit
ru: предел_подключений

source: istemplate
ru: это_шаблон

source: Description
ru: Описание

source: <command>CREATE DATABASE</command> creates a new <productname>PostgreSQL</productname> database.
ru: Команда <command>CREATE DATABASE</command> создаёт базу данных <productname>PostgreSQL</productname>.

source: To create a database, you must be a superuser or have the special <literal>CREATEDB</literal> privilege. See <xref linkend="sql-createuser"/>.
ru: Чтобы создать базу данных, необходимо быть суперпользователем или иметь специальное право <literal>CREATEDB</literal>. См. <xref remap="4" linkend="sql-createuser"/>.

source: By default, the new database will be created by cloning the standard system database <literal>template1</literal>. A different template can be specified by writing <literal>TEMPLATE <replaceable class="parameter">name</replaceable></literal>. In particular, by writing <literal>TEMPLATE template0</literal>, you can create a virgin database containing only the standard objects predefined by your version of <productname>PostgreSQL</productname>. This is useful if you wish to avoid copying any installation-local objects that might have been added to <literal>template1</literal>.
ru: По умолчанию новая база данных создаётся копированием стандартной системной базы данных <literal>template1</literal>. Задать другой шаблон можно, добавив указание <literal>TEMPLATE <replaceable class="parameter">имя</replaceable></literal>. В частности, написав <literal>TEMPLATE template0</literal>, можно создать девственно чистую базу данных, содержащую только стандартные объекты, предопределённые установленной версией <productname>PostgreSQL</productname>. Это бывает полезно, когда копировать в новую базу любые дополнительные объекты, добавленные локально в <literal>template1</literal>, нежелательно.

source: Parameters
ru: Параметры

source: The name of a database to create.
ru: Имя создаваемой базы данных.

source: The role name of the user who will own the new database, or <literal>DEFAULT</literal> to use the default (namely, the user executing the command). To create a database owned by another role, you must be a direct or indirect member of that role, or be a superuser.
ru: Имя пользователя (роли), назначаемого владельцем новой базы данных, либо <literal>DEFAULT</literal>, чтобы владельцем стал пользователь по умолчанию (а именно, пользователь, выполняющий команду). Чтобы создать базу данных и сделать её владельцем другую роль, необходимо быть непосредственным или опосредованным членом этой роли, либо суперпользователем.

source: The name of the template from which to create the new database, or <literal>DEFAULT</literal> to use the default template (<literal>template1</literal>).
ru: Имя шаблона, из которого будет создаваться новая база данных, либо <literal>DEFAULT</literal>, чтобы выбрать шаблон по умолчанию (<literal>template1</literal>).

source: Character set encoding to use in the new database. Specify a string constant (e.g., <literal>'SQL_ASCII'</literal>), or an integer encoding number, or <literal>DEFAULT</literal> to use the default encoding (namely, the encoding of the template database). The character sets supported by the <productname>PostgreSQL</productname> server are described in <xref linkend="multibyte-charset-supported"/>. See below for additional restrictions.
ru: Кодировка символов в новой базе данных. Укажите строковую константу (например, <literal>'SQL_ASCII'</literal>) или целочисленный номер кодировки, либо <literal>DEFAULT</literal>, чтобы выбрать кодировку по умолчанию (а именно, кодировку шаблона). Наборы символов, которые поддерживает <productname>PostgreSQL</productname>, перечислены в <xref remap="6" linkend="multibyte-charset-supported"/>. Дополнительные ограничения описаны ниже.

source: Collation order (<literal>LC_COLLATE</literal>) to use in the new database. This affects the sort order applied to strings, e.g. in queries with ORDER BY, as well as the order used in indexes on text columns. The default is to use the collation order of the template database. See below for additional restrictions.
ru: Порядок сортировки (<literal>LC_COLLATE</literal>), который будет использоваться в новой базе данных. Этот параметр определяет порядок сортировки строк, например, в запросах с ORDER BY, а также порядок индексов по текстовым столбцам. По умолчанию используется порядок сортировки, установленный в шаблоне. Дополнительные ограничения описаны ниже.

source: Character classification (<literal>LC_CTYPE</literal>) to use in the new database. This affects the categorization of characters, e.g. lower, upper and digit. The default is to use the character classification of the template database. See below for additional restrictions.
ru: Классификация символов (<literal>LC_CTYPE</literal>), которая будет применяться в новой базе данных. Этот параметр определяет принадлежность символов категориям, например: строчные, заглавные, цифры и т. п. По умолчанию используется классификация символов, установленная в шаблоне. Дополнительные ограничения описаны ниже.

source: The name of the tablespace that will be associated with the new database, or <literal>DEFAULT</literal> to use the template database's tablespace. This tablespace will be the default tablespace used for objects created in this database. See <xref linkend="sql-createtablespace"/> for more information.
ru: Имя табличного пространства, связываемого с новой базой данных, или <literal>DEFAULT</literal> для использования табличного пространства шаблона. Это табличное пространство будет использоваться по умолчанию для объектов, создаваемых в этой базе. За подробностями обратитесь к <xref remap="3" linkend="sql-createtablespace"/>.

source: If false then no one can connect to this database. The default is true, allowing connections (except as restricted by other mechanisms, such as <literal>GRANT</literal>/<literal>REVOKE CONNECT</literal>).
ru: Если false, никто не сможет подключаться к этой базе данных. По умолчанию имеет значение true, то есть подключения принимаются (если не ограничиваются другими механизмами, например, <literal>GRANT</literal>/<literal>REVOKE CONNECT</literal>).

source: How many concurrent connections can be made to this database. -1 (the default) means no limit.
ru: Максимальное количество одновременных подключений к этой базе данных. Значение -1 (по умолчанию) снимает ограничение.

source: If true, then this database can be cloned by any user with <literal>CREATEDB</literal> privileges; if false (the default), then only superusers or the owner of the database can clone it.
ru: Если true, базу данных сможет клонировать любой пользователь с правами <literal>CREATEDB</literal>; в противном случае (по умолчанию), клонировать эту базу смогут только суперпользователи и её владелец.

source: Optional parameters can be written in any order, not only the order illustrated above.
ru: Дополнительные параметры могут записываться в любом порядке, не обязательно так, как показано выше.

source: Notes
ru: Замечания

source: <command>CREATE DATABASE</command> cannot be executed inside a transaction block.
ru: <command>CREATE DATABASE</command> нельзя выполнять внутри блока транзакции.

source: Errors along the line of <quote>could not initialize database directory</quote> are most likely related to insufficient permissions on the data directory, a full disk, or other file system problems.
ru: Ошибки, содержащие сообщение <quote>не удалось инициализировать каталог базы данных</quote>, чаще всего связаны с нехваткой прав в каталоге данных, заполнением диска или другими проблемами в файловой системе.

source: Use <xref linkend="sql-dropdatabase"/> to remove a database.
ru: Для удаления базы данных применяется <xref linkend="sql-dropdatabase"/>.

source: The program <xref linkend="app-createdb"/> is a wrapper program around this command, provided for convenience.
ru: Программа <xref linkend="app-createdb"/> представляет собой оболочку этой команды, созданную ради удобства.

source: Database-level configuration parameters (set via <xref linkend="sql-alterdatabase"/>) are not copied from the template database.
ru: Конфигурационные параметры уровня базы данных (устанавливаемые командой <xref linkend="sql-alterdatabase"/>) из шаблона в новую базу данных не копируются.

source: Although it is possible to copy a database other than <literal>template1</literal> by specifying its name as the template, this is not (yet) intended as a general-purpose <quote><command>COPY DATABASE</command></quote> facility. The principal limitation is that no other sessions can be connected to the template database while it is being copied. <command>CREATE DATABASE</command> will fail if any other connection exists when it starts; otherwise, new connections to the template database are locked out until <command>CREATE DATABASE</command> completes. See <xref linkend="manage-ag-templatedbs"/> for more information.
ru: Хотя с помощью этой команды можно скопировать любую базу данных, а не только <literal>template1</literal>, указав её имя в качестве имени шаблона, она не предназначена (пока) для использования в качестве универсального средства вроде <quote><command>COPY DATABASE</command></quote>. Принципиальным ограничением является невозможность копирования базы данных шаблона, если установлены другие подключения к ней. <command>CREATE DATABASE</command> выдаёт ошибку, если при запуске команды есть другие подключения к этой базе; в противном случае новые подключения к базе блокируются до завершения команды <command>CREATE DATABASE</command>. За дополнительными сведениями обратитесь к <xref remap="3" linkend="manage-ag-templatedbs"/>.

source: The character set encoding specified for the new database must be compatible with the chosen locale settings (<literal>LC_COLLATE</literal> and <literal>LC_CTYPE</literal>). If the locale is <literal>C</literal> (or equivalently <literal>POSIX</literal>), then all encodings are allowed, but for other locale settings there is only one encoding that will work properly. (On Windows, however, UTF-8 encoding can be used with any locale.) <command>CREATE DATABASE</command> will allow superusers to specify <literal>SQL_ASCII</literal> encoding regardless of the locale settings, but this choice is deprecated and may result in misbehavior of character-string functions if data that is not encoding-compatible with the locale is stored in the database.
ru: Кодировка символов, указанная для новой базы данных, должна быть совместима с выбранными параметрами локали (<literal>LC_COLLATE</literal> и <literal>LC_CTYPE</literal>). Если выбрана локаль <literal>C</literal> (или равнозначная ей <literal>POSIX</literal>), допускаются все кодировки, но для других локалей правильно будет работать только одна кодировка. (В Windows, однако, кодировку UTF-8 можно использовать с любой локалью.) <command>CREATE DATABASE</command> позволяет суперпользователям указать кодировку <literal>SQL_ASCII</literal> вне зависимости от локали, но этот вариант считается устаревшим и может привести к ошибочному поведению строковых функций, если в базе хранятся данные в кодировке, несовместимой с заданной локалью.

source: The encoding and locale settings must match those of the template database, except when <literal>template0</literal> is used as template. This is because other databases might contain data that does not match the specified encoding, or might contain indexes whose sort ordering is affected by <literal>LC_COLLATE</literal> and <literal>LC_CTYPE</literal>. Copying such data would result in a database that is corrupt according to the new settings. <literal>template0</literal>, however, is known to not contain any data or indexes that would be affected.
ru: Параметры локали и кодировка должны соответствовать тем, что установлены в шаблоне, если только это не <literal>template0</literal>. Это ограничение объясняется тем, что другие базы данных могут содержать данные в кодировке, отличной от заданной, или индексы, порядок сортировки которых определяются параметрами <literal>LC_COLLATE</literal> и <literal>LC_CTYPE</literal>. При копировании таких данных получится база, которая будет испорченной согласно новым параметрам локали. Однако <literal>template0</literal> определённо не содержит какие-либо данные или индексы, зависящие от кодировки или локали.

source: The <literal>CONNECTION LIMIT</literal> option is only enforced approximately; if two new sessions start at about the same time when just one connection <quote>slot</quote> remains for the database, it is possible that both will fail. Also, the limit is not enforced against superusers or background worker processes.
ru: Ограничение <literal>CONNECTION LIMIT</literal> действует только приблизительно; если одновременно запускаются два сеанса, тогда как в базе остаётся только одно <quote>свободное место</quote>, может так случиться, что будут отклонены оба подключения. Кроме того, это ограничение не распространяется на суперпользователей и фоновые рабочие процессы.

source: Examples
ru: Примеры

source: To create a new database: <placeholder-1/>
ru: Создание базы данных: <placeholder-1/>

source: To create a database <literal>sales</literal> owned by user <literal>salesapp</literal> with a default tablespace of <literal>salesspace</literal>: <placeholder-1/>
ru: Создание базы данных <literal>sales</literal>, принадлежащей пользователю <literal>salesapp</literal>, с табличным пространством по умолчанию <literal>salesspace</literal>: <placeholder-1/>

source: To create a database <literal>music</literal> which supports the ISO-8859-1 character set: <placeholder-1/> In this example, the <literal>TEMPLATE template0</literal> clause would only be required if <literal>template1</literal>'s encoding is not ISO-8859-1. Note that changing encoding might require selecting new <literal>LC_COLLATE</literal> and <literal>LC_CTYPE</literal> settings as well.
ru: Создание базы данных <literal>music</literal> с кодировкой ISO-8859-1: <placeholder-1/> В этом примере предложение <literal>TEMPLATE template0</literal> будет необходимым, только если кодировка <literal>template1</literal> отличается от ISO-8859-1. Заметьте, что при смене кодировки может потребоваться также выбрать другие параметры <literal>LC_COLLATE</literal> и <literal>LC_CTYPE</literal>.

source: Compatibility
ru: Совместимость

source: There is no <command>CREATE DATABASE</command> statement in the SQL standard. Databases are equivalent to catalogs, whose creation is implementation-defined.
ru: Оператор <command>CREATE DATABASE</command> отсутствует в стандарте SQL. Базы данных равнозначны каталогам, а их создание в стандарте определяется реализацией.

source: See Also
ru: См. также
