Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/deallocate.po
Languages: ru

source: <primary>prepared statements</primary> <secondary>removing</secondary>
ru: <primary>подготовленные операторы</primary> <secondary>освобождение</secondary>

source: SQL - Language Statements
ru: Операторы языка SQL

source: deallocate a prepared statement
ru: освободить подготовленный оператор

source: name
ru: имя

source: Description
ru: Описание

source: <command>DEALLOCATE</command> is used to deallocate a previously prepared SQL statement. If you do not explicitly deallocate a prepared statement, it is deallocated when the session ends.
ru: <command>DEALLOCATE</command> применяется для освобождения ранее подготовленного оператора SQL. Если не освободить подготовленный оператор явно, он будет освобождён при завершении сеанса.

source: For more information on prepared statements, see <xref linkend="sql-prepare"/>.
ru: За дополнительными сведениями о подготовленных операторах обратитесь к <xref remap="3" linkend="sql-prepare"/>.

source: Parameters
ru: Параметры

source: This key word is ignored.
ru: Это ключевое слово игнорируется.

source: The name of the prepared statement to deallocate.
ru: Имя подготовленного оператора, подлежащего освобождению.

source: Deallocate all prepared statements.
ru: Освобождает все подготовленные операторы.

source: Compatibility
ru: Совместимость

source: The SQL standard includes a <command>DEALLOCATE</command> statement, but it is only for use in embedded SQL.
ru: В стандарте SQL есть оператор <command>DEALLOCATE</command>, но он предназначен только для применения во встраиваемом SQL.

source: See Also
ru: См. также
