Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/drop_language.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a procedural language
ru: удалить процедурный язык

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP LANGUAGE</command> removes the definition of a previously registered procedural language. You must be a superuser or the owner of the language to use <command>DROP LANGUAGE</command>.
ru: <command>DROP LANGUAGE</command> удаляет определение ранее зарегистрированного процедурного языка. Выполнить <command>DROP LANGUAGE</command> может только владелец языка или суперпользователь.

source: As of <productname>PostgreSQL</productname> 9.1, most procedural languages have been made into <quote>extensions</quote>, and should therefore be removed with <xref linkend="sql-dropextension"/> not <command>DROP LANGUAGE</command>.
ru: Начиная с <productname>PostgreSQL</productname> 9.1, большинство процедурных языков были преобразованы в <quote>расширения</quote>, так что теперь их следует удалять командами <xref linkend="sql-dropextension"/>, а не <command>DROP LANGUAGE</command>.

source: Parameters
ru: Параметры

source: Do not throw an error if the language does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если язык не существует. В этом случае будет выдано замечание.

source: The name of an existing procedural language. For backward compatibility, the name can be enclosed by single quotes.
ru: Имя существующего процедурного языка. В целях обратной совместимости имя можно заключить в апострофы.

source: Automatically drop objects that depend on the language (such as functions in the language), and in turn all objects that depend on those objects (see <xref linkend="ddl-depend"/>).
ru: Автоматически удалять объекты, зависящие от данного языка (например, функции на этом языке), и, в свою очередь, все зависящие от них объекты (см. <xref remap="4" linkend="ddl-depend"/>).

source: Refuse to drop the language if any objects depend on it. This is the default.
ru: Отказать в удалении языка, если от него зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: This command removes the procedural language <literal>plsample</literal>: <placeholder-1/>
ru: Эта команда удаляет процедурный язык <literal>plsample</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: There is no <command>DROP LANGUAGE</command> statement in the SQL standard.
ru: Оператор <command>DROP LANGUAGE</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
