Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/drop_subscription.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a subscription
ru: удалить подписку

source: name
ru: имя

source: DROP SUBSCRIPTION [ IF EXISTS ] <placeholder-1/> [ CASCADE | RESTRICT ]
ru: DROP VIEW [ IF EXISTS ] <placeholder-1/> [, ] [ CASCADE | RESTRICT ]

source: Description
ru: Описание

source: <command>DROP SUBSCRIPTION</command> removes a subscription from the database cluster.
ru: <command>DROP SUBSCRIPTION</command> удаляет подписку из кластера баз данных.

source: A subscription can only be dropped by a superuser.
ru: Удалить подписку может только суперпользователь.

source: <command>DROP SUBSCRIPTION</command> cannot be executed inside a transaction block if the subscription is associated with a replication slot. (You can use <command>ALTER SUBSCRIPTION</command> to unset the slot.)
ru: Команду <command>DROP SUBSCRIPTION</command> нельзя выполнять в блоке транзакции, если подписка связана со слотом репликации. (Для освобождения слота можно использовать <command>ALTER SUBSCRIPTION</command>.)

source: Parameters
ru: Параметры

source: The name of a subscription to be dropped.
ru: Имя подписки, подлежащей удалению.

source: These key words do not have any effect, since there are no dependencies on subscriptions.
ru: Эти ключевые слова игнорируются, так как от подписок не зависят никакие объекты.

source: Notes
ru: Замечания

source: When dropping a subscription that is associated with a replication slot on the remote host (the normal state), <command>DROP SUBSCRIPTION</command> will connect to the remote host and try to drop the replication slot as part of its operation. This is necessary so that the resources allocated for the subscription on the remote host are released. If this fails, either because the remote host is not reachable or because the remote replication slot cannot be dropped or does not exist or never existed, the <command>DROP SUBSCRIPTION</command> command will fail. To proceed in this situation, disassociate the subscription from the replication slot by executing <literal>ALTER SUBSCRIPTION ... SET (slot_name = NONE)</literal>. After that, <command>DROP SUBSCRIPTION</command> will no longer attempt any actions on a remote host. Note that if the remote replication slot still exists, it should then be dropped manually; otherwise it will continue to reserve WAL and might eventually cause the disk to fill up. See also <xref linkend="logical-replication-subscription-slot"/>.
ru: При удалении подписки, связанной со слотом репликации на удалённом узле (это типичная ситуация), команда <command>DROP SUBSCRIPTION</command> подключится к удалённому узлу и попытается удалить слот репликации в ходе этой операции. Это необходимо для освобождения ресурсов, выделенных для подписки на удалённом узле. Если при этом происходит сбой, либо из-за недоступности удалённого узла, либо из-за ошибки при удалении слота репликации, либо вообще из-за его отсутствия, команда <command>DROP SUBSCRIPTION</command> прерывается. Для разрешения этой ситуации разорвите связь подписки с этим слотом репликации, выполнив команду <literal>ALTER SUBSCRIPTION ... SET (slot_name = NONE)</literal>. После этого команда <command>DROP SUBSCRIPTION</command> не будет пытаться выполнять какие-либо действия на удалённом узле. Заметьте, что если удалённый слот репликации фактически продолжает существовать, его нужно будет удалить вручную; в противном случае для него будет по-прежнему сохраняться WAL, что в конце концов может привести к переполнению диска. См. также <xref remap="4" linkend="logical-replication-subscription-slot"/>.

source: If a subscription is associated with a replication slot, then <command>DROP SUBSCRIPTION</command> cannot be executed inside a transaction block.
ru: Если подписка связана со слотом репликации, команду <command>DROP SUBSCRIPTION</command> нельзя выполнять внутри блока транзакции.

source: Examples
ru: Примеры

source: Drop a subscription: <placeholder-1/>
ru: Удаление подписки: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>DROP SUBSCRIPTION</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>DROP SUBSCRIPTION</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
