Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/drop_operator.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove an operator
ru: удалить оператор

source: name
ru: имя

source: left_type
ru: тип_слева

source: right_type
ru: тип_справа

source: Description
ru: Описание

source: <command>DROP OPERATOR</command> drops an existing operator from the database system. To execute this command you must be the owner of the operator.
ru: <command>DROP OPERATOR</command> удаляет существующий оператор из базы данных. Выполнить эту команду может только владелец оператора.

source: Parameters
ru: Параметры

source: Do not throw an error if the operator does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если оператор не существует. В этом случае будет выдано замечание.

source: The name (optionally schema-qualified) of an existing operator.
ru: Имя (возможно, дополненное схемой) существующего оператора.

source: The data type of the operator's left operand; write <literal>NONE</literal> if the operator has no left operand.
ru: Тип данных левого операнда оператора; если у оператора нет левого операнда, укажите <literal>NONE</literal>.

source: The data type of the operator's right operand; write <literal>NONE</literal> if the operator has no right operand.
ru: Тип данных правого операнда оператора; если у оператора нет правого операнда, укажите <literal>NONE</literal>.

source: Automatically drop objects that depend on the operator (such as views using it), and in turn all objects that depend on those objects (see <xref linkend="ddl-depend"/>).
ru: Автоматически удалять объекты, зависящие от данного оператора (например, использующие его представления), и, в свою очередь, все зависящие от них объекты (см. <xref remap="4" linkend="ddl-depend"/>).

source: Refuse to drop the operator if any objects depend on it. This is the default.
ru: Отказать в удалении оператора, если от него зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: Remove the power operator <literal>a^b</literal> for type <type>integer</type>: <placeholder-1/>
ru: Удаление оператора возведения в степень <literal>a^b</literal> для типа <type>integer</type>: <placeholder-1/>

source: Remove the left unary bitwise complement operator <literal>~b</literal> for type <type>bit</type>: <placeholder-1/>
ru: Удаление левого унарного оператора двоичного дополнения <literal>~b</literal> для типа <type>bit</type>: <placeholder-1/>

source: Remove the right unary factorial operator <literal>x!</literal> for type <type>bigint</type>: <placeholder-1/>
ru: Удаление правого унарного оператора вычисления факториала <literal>x!</literal> для типа <type>bigint</type>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: There is no <command>DROP OPERATOR</command> statement in the SQL standard.
ru: Команда <command>DROP OPERATOR</command> отсутствует в стандарте SQL.

source: See Also
ru: См. также
