Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/drop_schema.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a schema
ru: удалить схему

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP SCHEMA</command> removes schemas from the database.
ru: <command>DROP SCHEMA</command> удаляет схемы из базы данных.

source: A schema can only be dropped by its owner or a superuser. Note that the owner can drop the schema (and thereby all contained objects) even if they do not own some of the objects within the schema.
ru: Схему может удалить только её владелец или суперпользователь. Заметьте, что владелец может удалить схему (вместе со всеми содержащимися в ней объектами), даже если он не владеет некоторыми объектами в своей схеме.

source: Parameters
ru: Параметры

source: Do not throw an error if the schema does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если схема не существует. В этом случае будет выдано замечание.

source: The name of a schema.
ru: Имя схемы.

source: Automatically drop objects (tables, functions, etc.) that are contained in the schema, and in turn all objects that depend on those objects (see <xref linkend="ddl-depend"/>).
ru: Автоматически удалять объекты, содержащиеся в этой схеме (таблицы, функции и т. д.), и, в свою очередь, все зависящие от них объекты (см. <xref remap="4" linkend="ddl-depend"/>).

source: Refuse to drop the schema if it contains any objects. This is the default.
ru: Отказать в удалении схемы, если она содержит какие-либо объекты. Это поведение по умолчанию.

source: Notes
ru: Замечания

source: Using the <literal>CASCADE</literal> option might make the command remove objects in other schemas besides the one(s) named.
ru: С указанием <literal>CASCADE</literal> эта команда может удалить объекты не только в данной схеме, но и в других.

source: Examples
ru: Примеры

source: To remove schema <literal>mystuff</literal> from the database, along with everything it contains: <placeholder-1/>
ru: Удаление схемы <literal>mystuff</literal> из базы данных вместе со всем, что в ней содержится: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>DROP SCHEMA</command> is fully conforming with the SQL standard, except that the standard only allows one schema to be dropped per command, and apart from the <literal>IF EXISTS</literal> option, which is a <productname>PostgreSQL</productname> extension.
ru: Команда <command>DROP SCHEMA</command> полностью соответствует стандарту SQL, но возможность удалять в одной команде несколько схем и указание <literal>IF EXISTS</literal> являются расширениями <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
