Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/drop_function.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a function
ru: удалить функцию

source: name
ru: имя

source: argmode
ru: режим_аргумента

source: argname
ru: имя_аргумента

source: argtype
ru: тип_аргумента

source: Description
ru: Описание

source: <command>DROP FUNCTION</command> removes the definition of an existing function. To execute this command the user must be the owner of the function. The argument types to the function must be specified, since several different functions can exist with the same name and different argument lists.
ru: <command>DROP FUNCTION</command> удаляет определение существующей функции. Пользователь, выполняющий эту команду, должен быть владельцем функции. Помимо имени функции требуется указать типы её аргументов, так как в базе данных могут существовать несколько функций с одним именем, но с разными списками аргументов.

source: Parameters
ru: Параметры

source: Do not throw an error if the function does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если функция не существует. В этом случае будет выдано замечание.

source: The name (optionally schema-qualified) of an existing function. If no argument list is specified, the name must be unique in its schema.
ru: Имя (возможно, дополненное схемой) существующей функции. Если список аргументов не указан, имя функции должно быть уникальным в её схеме.

source: The name (optionally schema-qualified) of an existing function.
ru: Имя (возможно, дополненное схемой) существующей функции.

source: The mode of an argument: <literal>IN</literal>, <literal>OUT</literal>, <literal>INOUT</literal>, or <literal>VARIADIC</literal>. If omitted, the default is <literal>IN</literal>. Note that <command>DROP FUNCTION</command> does not actually pay any attention to <literal>OUT</literal> arguments, since only the input arguments are needed to determine the function's identity. So it is sufficient to list the <literal>IN</literal>, <literal>INOUT</literal>, and <literal>VARIADIC</literal> arguments.
ru: Режим аргумента: <literal>IN</literal>, <literal>OUT</literal>, <literal>INOUT</literal> или <literal>VARIADIC</literal>. По умолчанию подразумевается <literal>IN</literal>. Заметьте, что <command>DROP FUNCTION</command> на самом деле не учитывает аргументы <literal>OUT</literal>, так как для идентификации функции нужны только типы входных аргументов. Поэтому достаточно перечислить только аргументы <literal>IN</literal>, <literal>INOUT</literal> и <literal>VARIADIC</literal>.

source: The name of an argument. Note that <command>DROP FUNCTION</command> does not actually pay any attention to argument names, since only the argument data types are needed to determine the function's identity.
ru: Имя аргумента. Заметьте, что на самом деле <command>DROP FUNCTION</command> не обращает внимание на имена аргументов, так как для однозначной идентификации функции достаточно только типов аргументов.

source: The data type(s) of the function's arguments (optionally schema-qualified), if any.
ru: Тип данных аргументов функции (возможно, дополненный именем схемы), если таковые имеются.

source: Automatically drop objects that depend on the function (such as operators or triggers), and in turn all objects that depend on those objects (see <xref linkend="ddl-depend"/>).
ru: Автоматически удалять объекты, зависящие от данной функции (например, операторы или триггеры), и, в свою очередь, все зависящие от них объекты (см. <xref remap="4" linkend="ddl-depend"/>).

source: Refuse to drop the function if any objects depend on it. This is the default.
ru: Отказать в удалении функции, если от неё зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: This command removes the square root function: <placeholder-1/>
ru: Эта команда удаляет функцию, вычисляющую квадратный корень: <placeholder-1/>

source: Drop multiple functions in one command: <placeholder-1/>
ru: Удаление нескольких функций одной командой: <placeholder-1/>

source: If the function name is unique in its schema, it can be referred to without an argument list: <placeholder-1/> Note that this is different from <placeholder-2/> which refers to a function with zero arguments, whereas the first variant can refer to a function with any number of arguments, including zero, as long as the name is unique.
ru: Если имя функции уникально в её схеме, на неё можно сослаться без списка аргументов: <placeholder-1/> Заметьте, что это отличается от <placeholder-2/> Данная форма ссылается на функцию с нулём аргументов, тогда как первый вариант подходит для функции с любым числом аргументов, в том числе и с нулём, если имя функции уникально.

source: Compatibility
ru: Совместимость

source: The standard only allows one function to be dropped per command.
ru: Стандарт допускает удаление в одной команде только одной функции.

source: The <literal>IF EXISTS</literal> option
ru: Указание <literal>IF EXISTS</literal>

source: The ability to specify argument modes and names
ru: Возможность указывать режимы и имена аргументов

source: This command conforms to the SQL standard, with these <productname>PostgreSQL</productname> extensions: <placeholder-1/>
ru: Эта команда соответствует стандарту SQL, но дополнена следующими расширениями <productname>PostgreSQL</productname>: <placeholder-1/>

source: See Also
ru: См. также

source: A <command>DROP FUNCTION</command> statement is defined in the SQL standard, but it is not compatible with this command.
ru: Оператор <command>DROP FUNCTION</command> определён в стандарте SQL, но с данным оператором он несовместим.
