Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/drop_trigger.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a trigger
ru: удалить триггер

source: name
ru: имя

source: table_name
ru: имя_таблицы

source: Description
ru: Описание

source: <command>DROP TRIGGER</command> removes an existing trigger definition. To execute this command, the current user must be the owner of the table for which the trigger is defined.
ru: <command>DROP TRIGGER</command> удаляет существующее определение триггера. Пользователь, выполняющий эту команду, должен быть владельцем таблицы, для которой определён данный триггер.

source: Parameters
ru: Параметры

source: Do not throw an error if the trigger does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если триггер не существует. В этом случае будет выдано замечание.

source: The name of the trigger to remove.
ru: Имя триггера, подлежащего удалению.

source: The name (optionally schema-qualified) of the table for which the trigger is defined.
ru: Имя (возможно, дополненное схемой) таблицы, для которой определён триггер.

source: Automatically drop objects that depend on the trigger, and in turn all objects that depend on those objects (see <xref linkend="ddl-depend"/>).
ru: Автоматически удалять объекты, зависящие от данного триггера, и, в свою очередь, все зависящие от них объекты (см. <xref remap="4" linkend="ddl-depend"/>).

source: Refuse to drop the trigger if any objects depend on it. This is the default.
ru: Отказать в удалении триггера, если от него зависят какие-либо объекты. Это поведение по умолчанию.

source: Examples
ru: Примеры

source: Destroy the trigger <literal>if_dist_exists</literal> on the table <literal>films</literal>: <placeholder-1/>
ru: Удаление триггера <literal>if_dist_exists</literal> в таблице <literal>films</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: The <command>DROP TRIGGER</command> statement in <productname>PostgreSQL</productname> is incompatible with the SQL standard. In the SQL standard, trigger names are not local to tables, so the command is simply <literal>DROP TRIGGER <replaceable>name</replaceable></literal>.
ru: Оператор <command>DROP TRIGGER</command> в <productname>PostgreSQL</productname> несовместим со стандартом SQL. В стандарте имена триггеров не считаются локальными по отношению к таблицам, так что синтаксис команды проще: <literal>DROP TRIGGER <replaceable>имя</replaceable></literal>.

source: See Also
ru: См. также
