Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/drop_publication.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove a publication
ru: удалить публикацию

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP PUBLICATION</command> removes an existing publication from the database.
ru: <command>DROP PUBLICATION</command> удаляет существующую публикацию из базы данных.

source: A publication can only be dropped by its owner or a superuser.
ru: Удалить публикацию может только её владелец или суперпользователь.

source: Parameters
ru: Параметры

source: Do not throw an error if the publication does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если публикация не существует. В этом случае будет выдано замечание.

source: The name of an existing publication.
ru: Имя существующей публикации.

source: These key words do not have any effect, since there are no dependencies on publications.
ru: Эти ключевые слова игнорируются, так как от публикаций не зависят никакие объекты.

source: Examples
ru: Примеры

source: Drop a publication: <placeholder-1/>
ru: Удаление публикации: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: <command>DROP PUBLICATION</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>DROP PUBLICATION</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
