Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/drop_extension.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove an extension
ru: удалить расширение

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP EXTENSION</command> removes extensions from the database. Dropping an extension causes its component objects to be dropped as well.
ru: <command>DROP EXTENSION</command> удаляет расширения из базы данных. При удалении расширения также удаляются все составляющие его объекты.

source: You must own the extension to use <command>DROP EXTENSION</command>.
ru: Чтобы выполнить <command>DROP EXTENSION</command>, необходимо быть владельцем расширения.

source: Parameters
ru: Параметры

source: Do not throw an error if the extension does not exist. A notice is issued in this case.
ru: Не считать ошибкой, если расширение не существует. В этом случае будет выдано замечание.

source: The name of an installed extension.
ru: Имя установленного расширения.

source: Automatically drop objects that depend on the extension, and in turn all objects that depend on those objects (see <xref linkend="ddl-depend"/>).
ru: Автоматически удалять объекты, зависящие от данного расширения, и, в свою очередь, все зависящие от них объекты (см. <xref remap="4" linkend="ddl-depend"/>).

source: Refuse to drop the extension if any objects depend on it (other than its own member objects and other extensions listed in the same <command>DROP</command> command). This is the default.
ru: Отказать в удалении расширения, если от него зависят какие-либо объекты (кроме объектов, составляющих его, и других расширений, перечисленных в той же команде <command>DROP</command>). Это поведение по умолчанию.

source: Examples
ru: Примеры

source: To remove the extension <literal>hstore</literal> from the current database: <placeholder-1/> This command will fail if any of <literal>hstore</literal>'s objects are in use in the database, for example if any tables have columns of the <type>hstore</type> type. Add the <literal>CASCADE</literal> option to forcibly remove those dependent objects as well.
ru: Удаление расширения <literal>hstore</literal> из текущей базы данных. <placeholder-1/> Эта команда не будет выполнена, если какие-либо объекты из <literal>hstore</literal> будут задействованы, например, если в какой-либо таблице окажется столбец типа <type>hstore</type>. Чтобы принудительно удалить и эти зависимые объекты, необходимо добавить параметр <literal>CASCADE</literal>.

source: Compatibility
ru: Совместимость

source: <command>DROP EXTENSION</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>DROP EXTENSION</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
