Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/drop_owned.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: remove database objects owned by a database role
ru: удалить объекты базы данных, принадлежащие роли

source: name
ru: имя

source: Description
ru: Описание

source: <command>DROP OWNED</command> drops all the objects within the current database that are owned by one of the specified roles. Any privileges granted to the given roles on objects in the current database and on shared objects (databases, tablespaces) will also be revoked.
ru: <command>DROP OWNED</command> удаляет в текущей базе данных все объекты, принадлежащие любой из указанных ролей. Кроме того, эти роли лишаются всех прав, которые они имели для объектов текущей базы данных и общих объектов (баз данных, табличных пространств).

source: Parameters
ru: Параметры

source: The name of a role whose objects will be dropped, and whose privileges will be revoked.
ru: Имя роли, все объекты которой будут уничтожены, а права отозваны.

source: Automatically drop objects that depend on the affected objects, and in turn all objects that depend on those objects (see <xref linkend="ddl-depend"/>).
ru: Автоматически удалять объекты, зависящие от каждого затрагиваемого объекта, и, в свою очередь, все зависящие от них объекты (см. <xref remap="4" linkend="ddl-depend"/>).

source: Refuse to drop the objects owned by a role if any other database objects depend on one of the affected objects. This is the default.
ru: Отказать в удалении объектов, принадлежащих роли, если от каких-либо из них зависят другие объекты в базе данных. Это поведение по умолчанию.

source: Notes
ru: Замечания

source: <command>DROP OWNED</command> is often used to prepare for the removal of one or more roles. Because <command>DROP OWNED</command> only affects the objects in the current database, it is usually necessary to execute this command in each database that contains objects owned by a role that is to be removed.
ru: <command>DROP OWNED</command> часто применяется при подготовке к удалению одной или нескольких ролей. Так как команда <command>DROP OWNED</command> затрагивает объекты только в текущей базе данных, обычно её нужно выполнять в каждой базе данных, которая содержит объекты, принадлежащие удаляемой роли.

source: Using the <literal>CASCADE</literal> option might make the command recurse to objects owned by other users.
ru: С указанием <literal>CASCADE</literal> эта команда может рекурсивно удалить объекты, принадлежащие и другим пользователям.

source: The <xref linkend="sql-reassign-owned"/> command is an alternative that reassigns the ownership of all the database objects owned by one or more roles. However, <command>REASSIGN OWNED</command> does not deal with privileges for other objects.
ru: Команда <xref linkend="sql-drop-owned"/> даёт альтернативную возможность — удалить все объекты базы данных, принадлежащие одной или нескольким ролям. Однако <command>DROP OWNED</command> не затрагивает права, назначенные для других объектов.

source: Databases and tablespaces owned by the role(s) will not be removed.
ru: Базы данных и табличные пространства, принадлежащие указанным ролям, эта команда не удаляет.

source: See <xref linkend="role-removal"/> for more discussion.
ru: За подробностями обратитесь к <xref remap="3" linkend="role-removal"/>.

source: Compatibility
ru: Совместимость

source: The <command>DROP OWNED</command> command is a <productname>PostgreSQL</productname> extension.
ru: Команда <command>DROP OWNED</command> — расширение <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
