Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/ecpg-ref.po
Languages: ru

source: Application
ru: Приложение

source: embedded SQL C preprocessor
ru: встроенный C-препроцессор SQL

source: option
ru: параметр

source: file
ru: файл

source: Description
ru: Описание

source: <command>ecpg</command> is the embedded SQL preprocessor for C programs. It converts C programs with embedded SQL statements to normal C code by replacing the SQL invocations with special function calls. The output files can then be processed with any C compiler tool chain.
ru: <command>ecpg</command> это встроенный SQL препроцессор для программ, написанных на языке C. Он преобразует программы на C, содержащие SQL-выражения, заменяя их вызовами встроенных функций. Получаемые на выходе файлы можно затем скомпилировать и скомпоновать.

source: <command>ecpg</command> will convert each input file given on the command line to the corresponding C output file. Input files preferably have the extension <filename>.pgc</filename>. The extension will be replaced by <filename>.c</filename> to determine the output file name. The output file name can also be overridden using the <option>-o</option> option.
ru: <command>ecpg</command> преобразует каждый файл, переданный в параметрах, в соответствующий файл на C. Входным файлам лучше давать расширения <filename>.pgc</filename>. Это расширение будет автоматически заменяться на <filename>.c</filename>. Имя выходного файла также можно задать в параметре <option>-o</option>.

source: This reference page does not describe the embedded SQL language. See <xref linkend="ecpg"/> for more information on that topic.
ru: Данный раздел не содержит описания встроенного SQL-языка. Для более подробной информации см. <xref remap="4" linkend="ecpg"/>.

source: Options
ru: Параметры

source: Automatically generate certain C code from SQL code. Currently, this works for <literal>EXEC SQL TYPE</literal>.
ru: Автоматически генерировать код, написанный на языке C, из кода SQL. Сейчас это справедливо для <literal>EXEC SQL TYPE</literal>.

source: mode
ru: режим

source: Set a compatibility mode. <replaceable>mode</replaceable> can be <literal>INFORMIX</literal> or <literal>INFORMIX_SE</literal>.
ru: Установить режим совместимости. <replaceable>режим</replaceable> может принимать значение <literal>INFORMIX</literal> или <literal>INFORMIX_SE</literal>.

source: symbol
ru: символ

source: Define a C preprocessor symbol.
ru: Определить символ начала команд C-препроцессора.

source: Parse system include files as well.
ru: Также разбирать и системные включения.

source: directory
ru: каталог

source: Specify an additional include path, used to find files included via <literal>EXEC SQL INCLUDE</literal>. Defaults are <filename>.</filename> (current directory), <filename>/usr/local/include</filename>, the <productname>PostgreSQL</productname> include directory which is defined at compile time (default: <filename>/usr/local/pgsql/include</filename>), and <filename>/usr/include</filename>, in that order.
ru: Указать дополнительный путь включаемых файлов, используемый при выполнении <literal>EXEC SQL INCLUDE</literal>. По умолчанию используются <filename>.</filename> (текущий каталог), <filename>/usr/local/include</filename>, каталог, задаваемый при компиляции <productname>PostgreSQL</productname> (обычно — <filename>/usr/local/pgsql/include</filename>), и <filename>/usr/include</filename>, в порядке, как это перечислено.

source: filename
ru: имя_файла

source: Specifies that <command>ecpg</command> should write all its output to the given <replaceable>filename</replaceable>.
ru: Указывает <command>ecpg</command> <replaceable>имя файла</replaceable>, в который будет осуществлен вывод.

source: Do not use indicators but instead use special values to represent null values. Historically there have been databases using this approach.
ru: Использовать специальные символы для представления значений null. Исторически некоторые базы данных используют такой подход.

source: Prepare all statements before using them. Libecpg will keep a cache of prepared statements and reuse a statement if it gets executed again. If the cache runs full, libecpg will free the least used statement.
ru: Сформировать подготовленные выражения. libecpg сформирует кеш подготовленных выражений и будет использовать их при необходимости повторно. В случае переполнения кеша, libecpg освободит память за счёт вытеснения наименее используемых выражений.

source: Allow question mark as placeholder for compatibility reasons. This used to be the default long ago.
ru: Разрешает использовать знак вопроса в качестве аргумента подстановки в целях совместимости. Ранее это было поведением по умолчанию.

source: Selects run-time behavior. <replaceable>Option</replaceable> can be one of the following: <placeholder-1/>
ru: Определяет поведение времени исполнения. <replaceable>Флаг</replaceable> может принимать следующие значения: <placeholder-1/>

source: Turn on autocommit of transactions. In this mode, each SQL command is automatically committed unless it is inside an explicit transaction block. In the default mode, commands are committed only when <command>EXEC SQL COMMIT</command> is issued.
ru: Включить автоматическую фиксацию транзакций. В этом режиме каждая SQL-команда будет автоматически фиксироваться, пока не будет явно включена в блок транзакции. В режиме по умолчанию команды фиксируются лишь при явном вызове <command>EXEC SQL COMMIT</command>.

source: Print additional information including the version and the "include" path.
ru: Вывести информацию о версии, а также путях поиска включаемых файлов.

source: Print the <application>ecpg</application> version and exit.
ru: Вывести версию <application>ecpg</application>.

source: Show help about <application>ecpg</application> command line arguments, and exit.
ru: Вывести справку по команде <application>ecpg</application>.

source: <command>ecpg</command> accepts the following command-line arguments: <placeholder-1/>
ru: <command>ecpg</command> принимает в качестве аргументов: <placeholder-1/>

source: Notes
ru: Замечания

source: When compiling the preprocessed C code files, the compiler needs to be able to find the <application>ECPG</application> header files in the <productname>PostgreSQL</productname> include directory. Therefore, you might have to use the <option>-I</option> option when invoking the compiler (e.g., <literal>-I/usr/local/pgsql/include</literal>).
ru: При компиляции полученных файлов, компилятор должен иметь возможность найти заголовочные файлы <application>ECPG</application> в каталоге включений <productname>PostgreSQL</productname>. Для этого можно использовать флаг <option>-I</option> во время компиляции, например, <literal>-I/usr/local/pgsql/include</literal>.

source: Programs using C code with embedded SQL have to be linked against the <filename>libecpg</filename> library, for example using the linker options <literal>-L/usr/local/pgsql/lib -lecpg</literal>.
ru: Программы на C со встроенным SQL необходимо скомпоновать с библиотекой <filename>libecpg</filename>, например, используя флаг компоновщика <literal>-L/usr/local/pgsql/lib -lecpg</literal>.

source: The value of either of these directories that is appropriate for the installation can be found out using <xref linkend="app-pgconfig"/>.
ru: Имена каталогов, подходящих для установки, можно найти в разделе <xref linkend="app-pgconfig"/>.

source: Examples
ru: Примеры

source: If you have an embedded SQL C source file named <filename>prog1.pgc</filename>, you can create an executable program using the following sequence of commands: <placeholder-1/>
ru: Если имеется исходный файл на C <filename>prog1.pgc</filename> со встроенным SQL, можно создать исполняемую программу, используя следующую последовательность команд: <placeholder-1/>
