Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/pg_basebackup.po
Languages: ru

source: Sets the label for the backup. If none is specified, a default value of <quote><literal>pg_basebackup base backup</literal></quote> will be used.
ru: Устанавливает метку для созданной резервной копии. Если не указана, то по умолчанию будет использовано значение <quote><literal>pg_basebackup base backup</literal></quote>.

source: By default, when <command>pg_basebackup</command> aborts with an error, it removes any directories it might have created before discovering that it cannot finish the job (for example, data directory and write-ahead log directory). This option inhibits tidying-up and is thus useful for debugging.
ru: По умолчанию, когда программа <command>pg_basebackup</command> прерывается с ошибкой, она удаляет все каталоги, которые она могла создать, прежде чем обнаружила, что не может завершить задание (например, каталог данных и каталог журнала предзаписи). Данный ключ отключает эту очистку и тем самым полезен для отладки.

source: Note that tablespace directories are not cleaned up either way.
ru: Заметьте, что каталоги табличных пространств не очищаются в любом случае.

source: Enables progress reporting. Turning this on will deliver an approximate progress report during the backup. Since the database may change during the backup, this is only an approximation and may not end at exactly <literal>100%</literal>. In particular, when WAL log is included in the backup, the total amount of data cannot be estimated in advance, and in this case the estimated target size will increase once it passes the total estimate without WAL.
ru: Включает отчёт о прогрессе. Если этот режим включён, то во время создания копии будет передаваться примерный процент выполнения. Так как данные в базе могут меняться во время копирования, это значение будет лишь приближённым и может достигать не точно <literal>100%</literal>. В частности, когда в копию включается журнал WAL, конечный размер невозможно предсказать заранее, и в этом случае ожидаемый конечный размер будет увеличиваться, превысив ориентировочный полный размер без WAL.

source: When this is enabled, the backup will start by enumerating the size of the entire database, and then go back and send the actual contents. This may make the backup take slightly longer, and in particular it will take longer before the first data is sent.
ru: Если режим включён, то процесс копирования начнется с перечисления размеров всей базы, а затем продолжится отправкой непосредственно данных. Это может немного увеличить время операции, в частности, пройдёт больше времени до начала передачи данных.

source: By default, <command>pg_basebackup</command> will wait for all files to be written safely to disk. This option causes <command>pg_basebackup</command> to return without waiting, which is faster, but means that a subsequent operating system crash can leave the base backup corrupt. Generally, this option is useful for testing but should not be used when creating a production installation.
ru: По умолчанию <command>pg_basebackup</command> ждёт, пока все файлы не будут надёжно записаны на диск. С данным параметром <command>pg_basebackup</command> завершается немедленно, то есть выполняется быстрее, но в случае неожиданного сбоя операционной системы резервная копия может оказаться испорченной. Вообще этот параметр предназначен прежде всего для тестирования, для производственной среды он не подходит.

source: Enables verbose mode. Will output some extra steps during startup and shutdown, as well as show the exact file name that is currently being processed if progress reporting is also enabled.
ru: Включает режим подробного вывода. Будет выводится некоторая дополнительная информация при начале и завершении, а также имена обрабатываемых файлов, если включён отчёт о прогрессе.

source: The following command-line options control the generation of the backup and the running of the program. <placeholder-1/>
ru: Описанные далее аргументы командной строки влияют на генерацию резервной копии и ход выполнения приложения. <placeholder-1/>

source: connstr
ru: строка_подключения

source: Specifies parameters used to connect to the server, as a connection string. See <xref linkend="libpq-connstring"/> for more information.
ru: Указывает параметры подключения к серверу в формате строки подключения. См. <xref remap="4" linkend="libpq-connstring"/> для более подробной информации.

source: The option is called <literal>--dbname</literal> for consistency with other client applications, but because <application>pg_basebackup</application> doesn't connect to any particular database in the cluster, database name in the connection string will be ignored.
ru: Параметр называется <literal>--dbname</literal> для согласованности с другими клиентскими приложениями, но так как <application>pg_basebackup</application> не подключается к какой-либо конкретной базе, это имя в строке подключения игнорируется.

source: host
ru: сервер

source: Specifies the host name of the machine on which the server is running. If the value begins with a slash, it is used as the directory for the Unix domain socket. The default is taken from the <envar>PGHOST</envar> environment variable, if set, else a Unix domain socket connection is attempted.
ru: Указывает имя компьютера, на котором запущен сервер. Если значение начинается с косой черты, оно интерпретируется как имя каталога с доменным сокетом Unix. Значение по умолчанию берётся из переменной окружения <envar>PGHOST</envar>, если она установлена. В противном случае выполняется подключение к доменному сокету.

source: port
ru: порт

source: Specifies the TCP port or local Unix domain socket file extension on which the server is listening for connections. Defaults to the <envar>PGPORT</envar> environment variable, if set, or a compiled-in default.
ru: Указывает TCP-порт или расширение локального файла Unix-сокета, на котором сервер слушает подключения. По умолчанию берётся значение переменной окружения <envar>PGPORT</envar>, если оно установлено, либо значение времени компиляции.

source: Specifies the number of seconds between status packets sent back to the server. This allows for easier monitoring of the progress from server. A value of zero disables the periodic status updates completely, although an update will still be sent when requested by the server, to avoid timeout disconnect. The default value is 10 seconds.
ru: Указывает интервал в секундах между отправкой пакетов статуса, отправляемых на сервер. Это позволяет упростить мониторинг прогресса. Чтобы выключить периодическое обновление статуса, необходимо установить значение в ноль. При этом обновление будет отправляться по запросу сервера для избежания отсоединения по истечению времени. Значение по умолчанию составляет 10 секунд.

source: username
ru: имя_пользователя

source: User name to connect as.
ru: Имя пользователя, под которым производится подключение.

source: Never issue a password prompt. If the server requires password authentication and a password is not available by other means such as a <filename>.pgpass</filename> file, the connection attempt will fail. This option can be useful in batch jobs and scripts where no user is present to enter a password.
ru: Не выдавать запрос на ввод пароля. Если сервер требует аутентификацию по паролю и пароль не доступен с помощью других средств, таких как файл <filename>.pgpass</filename>, попытка соединения не удастся. Этот параметр может быть полезен в пакетных заданиях и скриптах, где нет пользователя, который вводит пароль.

source: Force <application>pg_basebackup</application> to prompt for a password before connecting to a database.
ru: Принудительно запрашивать пароль перед подключением к базе данных.

source: This option is never essential, since <application>pg_basebackup</application> will automatically prompt for a password if the server demands password authentication. However, <application>pg_basebackup</application> will waste a connection attempt finding out that the server wants a password. In some cases it is worth typing <option>-W</option> to avoid the extra connection attempt.
ru: Это несущественный параметр, так как <application>pg_basebackup</application> запрашивает пароль автоматически, если сервер проверяет подлинность по паролю. Однако, чтобы понять это, <application>pg_basebackup</application> лишний раз подключается к серверу. Поэтому иногда имеет смысл ввести <option>-W</option>, чтобы исключить эту ненужную попытку подключения.

source: The following command-line options control the database connection parameters. <placeholder-1/>
ru: Далее описаны параметры управления подключением. <placeholder-1/>

source: Print the <application>pg_basebackup</application> version and exit.
ru: Вывести версию <application>pg_basebackup</application>.

source: Show help about <application>pg_basebackup</application> command line arguments, and exit.
ru: Вывести справку по команде <application>pg_basebackup</application>.

source: Other options are also available: <placeholder-1/>
ru: Другие флаги: <placeholder-1/>

source: Environment
ru: Переменные окружения

source: This utility, like most other <productname>PostgreSQL</productname> utilities, uses the environment variables supported by <application>libpq</application> (see <xref linkend="libpq-envars"/>).
ru: Как и большинство других утилит <productname>PostgreSQL</productname>, приложение также использует переменные окружения, поддерживаемые <application>libpq</application> (см. <xref remap="4" linkend="libpq-envars"/>).

source: Notes
ru: Замечания

source: At the beginning of the backup, a checkpoint needs to be written on the server the backup is taken from. Especially if the option <literal>--checkpoint=fast</literal> is not used, this can take some time during which <application>pg_basebackup</application> will be appear to be idle.
ru: Прежде чем начнётся копирование, на сервере с копируемой базой необходимо выполнить контрольную точку. И если копирование запускается без ключа <literal>--checkpoint=fast</literal>, это может занять некоторое время, в течение которого <application>pg_basebackup</application> не будет проявлять никакой активности.

source: The backup will include all files in the data directory and tablespaces, including the configuration files and any additional files placed in the directory by third parties, except certain temporary files managed by PostgreSQL. But only regular files and directories are copied, except that symbolic links used for tablespaces are preserved. Symbolic links pointing to certain directories known to PostgreSQL are copied as empty directories. Other symbolic links and special device files are skipped. See <xref linkend="protocol-replication"/> for the precise details.
ru: Резервная копия будет включать в себя все файлы каталога хранения данных и табличных пространств, а также конфигурационные файлы и прочие файлы, размещённые в каталоге данных, за исключением определённых временных файлов, принадлежащих PostgreSQL. Однако копируются лишь простые файлы и каталоги, кроме них, сохраняются только символические ссылки на табличные пространства. Символические ссылки, указывающие на определённые каталоги, известные PostgreSQL, копируются как пустые каталоги. Другие символические ссылки и файлы спецустройств игнорируются. За дополнительными подробностями обратитесь к <xref remap="3" linkend="protocol-replication"/>.

source: Tablespaces will in plain format by default be backed up to the same path they have on the server, unless the option <literal>--tablespace-mapping</literal> is used. Without this option, running a plain format base backup on the same host as the server will not work if tablespaces are in use, because the backup would have to be written to the same directory locations as the original tablespaces.
ru: Если не указан параметр <literal>--tablespace-mapping</literal>, табличные пространства в простом формате будут копироваться в тот же путь, который они имеют на сервере. Поэтому при наличии табличных пространств создать базовую копию в простом формате на том же сервере не удастся, так как копия будет направлена в те же каталоги, где располагаются исходные табличные пространства.

source: When tar format mode is used, it is the user's responsibility to unpack each tar file before starting the PostgreSQL server. If there are additional tablespaces, the tar files for them need to be unpacked in the correct locations. In this case the symbolic links for those tablespaces will be created by the server according to the contents of the <filename>tablespace_map</filename> file that is included in the <filename>base.tar</filename> file.
ru: Когда применяется режим формата tar, пользователь должен позаботиться о том, чтобы все архивы tar были распакованы до запуска сервера PostgreSQL. Если имеются дополнительные табличные пространства, архивы tar для них должны быть распакованы в правильные каталоги. В таком случае для этих табличных пространств сервером будут созданы символические ссылки, согласно содержимому файла <filename>tablespace_map</filename>, включённого в архив <filename>base.tar</filename>.

source: <application>pg_basebackup</application> works with servers of the same or an older major version, down to 9.1. However, WAL streaming mode (<literal>-X stream</literal>) only works with server version 9.3 and later, and tar format mode (<literal>--format=tar</literal>) of the current version only works with server version 9.5 or later.
ru: <application>pg_basebackup</application> совместим с серверами той же или более младших версий, но не ниже 9.1. Однако режим трансляции WAL (<literal>-X stream</literal>) поддерживается с версиями сервера не ниже 9.3, а режим формата tar (<literal>--format=tar</literal>) текущей версии совместим только с версиями сервера не ниже 9.5.

source: Examples
ru: Примеры

source: To create a base backup of the server at <literal>mydbserver</literal> and store it in the local directory <filename>/usr/local/pgsql/data</filename>: <screen> <prompt>$</prompt> <userinput>pg_basebackup -h mydbserver -D /usr/local/pgsql/data</userinput> </screen>
ru: Создание резервной копии сервера <literal>mydbserver</literal> и сохранение её в локальном каталоге <filename>/usr/local/pgsql/data</filename>: <screen> <prompt>$</prompt> <userinput>pg_basebackup -h mydbserver -D /usr/local/pgsql/data</userinput> </screen>

source: To create a backup of the local server with one compressed tar file for each tablespace, and store it in the directory <filename>backup</filename>, showing a progress report while running: <screen> <prompt>$</prompt> <userinput>pg_basebackup -D backup -Ft -z -P</userinput> </screen>
ru: Создание резервной копии локального сервера в отдельных сжатых файлах tar для каждого табличного пространства и сохранение их в каталоге <filename>backup</filename> с индикатором прогресса в процессе выполнения: <screen> <prompt>$</prompt> <userinput>pg_basebackup -D backup -Ft -z -P</userinput> </screen>

source: To create a backup of a single-tablespace local database and compress this with <productname>bzip2</productname>: <screen> <prompt>$</prompt> <userinput>pg_basebackup -D - -Ft -X fetch | bzip2 &gt; backup.tar.bz2</userinput> </screen> (This command will fail if there are multiple tablespaces in the database.)
ru: Создание резервной копии локальной базы данных с одним табличным пространством и сжатие её с помощью <productname>bzip2</productname>: <screen> <prompt>$</prompt> <userinput>pg_basebackup -D - -Ft -X fetch | bzip2 &gt; backup.tar.bz2</userinput> </screen> (Эта команда прервётся с ошибкой, если в базе данных будет несколько табличных пространств.)

source: To create a backup of a local database where the tablespace in <filename>/opt/ts</filename> is relocated to <filename>./backup/ts</filename>: <screen> <prompt>$</prompt> <userinput>pg_basebackup -D backup/data -T /opt/ts=$(pwd)/backup/ts</userinput> </screen>
ru: Создание резервной копии локальной базы данных с перемещением табличного пространства <filename>/opt/ts</filename> в <filename>./backup/ts</filename>: <screen> <prompt>$</prompt> <userinput>pg_basebackup -D backup/data -T /opt/ts=$(pwd)/backup/ts</userinput> </screen>

source: See Also
ru: См. также

source: If the value <literal>-</literal> (dash) is specified as target directory, the tar contents will be written to standard output, suitable for piping to for example <productname>gzip</productname>. This is only possible if the cluster has no additional tablespaces.
ru: Если имя целевого каталога задано как <literal>-</literal> (тире), то данные будут писаться в стандартный вывод, что позволяет, например, использовать <productname>gzip</productname>. Это возможно лишь в случае без использования дополнительных табличных пространств.

source: xlogdir
ru: каталог_xlog

source: Specifies the location for the transaction log directory. <replaceable>xlogdir</replaceable> must be an absolute path. The transaction log directory can only be specified when the backup is in plain mode.
ru: Указывает размещение каталога хранения журналов транзакций. Задаваемый в параметре <replaceable>каталог_xlog</replaceable> путь должен быть абсолютным. Каталог с журналом транзакций можно задать только при создании копии в простом режиме.

source: Using this option is equivalent of using <literal>-X</literal> with method <literal>fetch</literal>.
ru: Использование параметра эквивалентно <literal>-X</literal> в режиме <literal>fetch</literal>.

source: The transaction log files are collected at the end of the backup. Therefore, it is necessary for the <xref linkend="guc-wal-keep-segments"/> parameter to be set high enough that the log is not removed before the end of the backup. If the log has been rotated when it's time to transfer it, the backup will fail and be unusable.
ru: Файлы журналов транзакций собираются в конце процесса копирования. Таким образом необходимо установить достаточно большое значение параметра <xref linkend="guc-wal-keep-segments"/>, чтобы избежать преждевременного удаления файлов журнала. В случае удаления файлов до завершения процесса копирования возникнет ошибка, а копия будет непригодной к использованию.

source: Stream the transaction log while the backup is created. This will open a second connection to the server and start streaming the transaction log in parallel while running the backup. Therefore, it will use up two connections configured by the <xref linkend="guc-max-wal-senders"/> parameter. As long as the client can keep up with transaction log received, using this mode requires no extra transaction logs to be saved on the master.
ru: Передавать журнал транзакций в процессе создания резервной копии. При этом открывается второе соединение к серверу, по которому будет передаваться журнал транзакций, одновременно с созданием резервной копии. Таким образом будут использоваться два подключения из разрешённых параметром <xref linkend="guc-max-wal-senders"/>. И если клиент будет успевать получать журнал транзакций, ведущему серверу не потребуется хранить дополнительные журналы транзакций.

source: The following methods for collecting the transaction logs are supported: <placeholder-1/>
ru: Для сбора журналов транзакций поддерживаются следующие методы: <placeholder-1/>

source: Enables gzip compression of tar file output, with the default compression level. Compression is only available when using the tar format.
ru: Включает gzip-сжатие для выводимого tar-файла с уровнем компрессии по умолчанию. Сжатие поддерживается лишь в режиме упаковки.

source: Enables gzip compression of tar file output, and specifies the compression level (0 through 9, 0 being no compression and 9 being best compression). Compression is only available when using the tar format.
ru: Включает gzip-сжатие для выводимого tar-файла и задаёт уровень сжатия от 0 (без сжатия) до 9 (максимальное сжатие). Сжатие поддерживается только с форматом tar.

source: The backup will include all files in the data directory and tablespaces, including the configuration files and any additional files placed in the directory by third parties. But only regular files and directories are copied. Symbolic links (other than those used for tablespaces) and special device files are skipped. (See <xref linkend="protocol-replication"/> for the precise details.)
ru: Резервная копия будет включать в себя все файлы каталога хранения данных и табличных пространств, а также конфигурационные файлы и прочие файлы, размещённые в каталоге данных. Однако копируются лишь простые файлы и каталоги. Символьные ссылки (кроме тех, что указывают на табличные пространства) и файлы спецустройств игнорируются. Более подробно см. <xref remap="4" linkend="protocol-replication"/>.

source: To create a backup of a single-tablespace local database and compress this with <productname>bzip2</productname>: <screen> <prompt>$</prompt> <userinput>pg_basebackup -D - -Ft | bzip2 &gt; backup.tar.bz2</userinput> </screen> (This command will fail if there are multiple tablespaces in the database.)
ru: Чтобы создать резервную копию локальной базы с единым табличным пространством и сжатием через <productname>bzip2</productname>: <screen> <prompt>$</prompt> <userinput>pg_basebackup -D - -Ft | bzip2 &gt; backup.tar.bz2</userinput> </screen> Команда завершится ошибкой, если в базе будет более одного табличного пространства.
