Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/pg_basebackup.po
Languages: ru

source: Application
ru: Приложение

source: take a base backup of a <placeholder-1/> cluster
ru: создать резервную копию кластера <placeholder-1/>

source: option
ru: параметр

source: Description
ru: Описание

source: <application>pg_basebackup</application> is used to take base backups of a running <productname>PostgreSQL</productname> database cluster. These are taken without affecting other clients to the database, and can be used both for point-in-time recovery (see <xref linkend="continuous-archiving"/>) and as the starting point for a log shipping or streaming replication standby servers (see <xref linkend="warm-standby"/>).
ru: <application>pg_basebackup</application> предназначен для создания резервных копий работающего кластера баз данных <productname>PostgreSQL</productname>. Процедура создания копии не влияет на работу других клиентов. Полученные копии могут использоваться для обеих стратегий восстановления — на заданный момент в прошлом (см. <xref remap="4" linkend="continuous-archiving"/>) и в качестве отправной точки для ведомого сервера при реализации трансляции файлов или потоковой репликации (см. <xref remap="4" linkend="warm-standby"/>).

source: <application>pg_basebackup</application> makes a binary copy of the database cluster files, while making sure the system is put in and out of backup mode automatically. Backups are always taken of the entire database cluster; it is not possible to back up individual databases or database objects. For individual database backups, a tool such as <xref linkend="app-pgdump"/> must be used.
ru: <application>pg_basebackup</application> создаёт бинарную копию файлов кластера, контролируя режим создания копии автоматически. Резервные копии всегда создаются для кластера целиком и невозможно создать копию для какой-либо сущности базы отдельно. Для этой цели можно использовать, например, утилиту <xref linkend="app-pgdump"/>.

source: The backup is made over a regular <productname>PostgreSQL</productname> connection, and uses the replication protocol. The connection must be made with a superuser or a user having <literal>REPLICATION</literal> permissions (see <xref linkend="role-attributes"/>), and <filename>pg_hba.conf</filename> must explicitly permit the replication connection. The server must also be configured with <xref linkend="guc-max-wal-senders"/> set high enough to leave at least one session available for the backup and one for WAL streaming (if used).
ru: Копия создаётся через обычное подключение к <productname>PostgreSQL</productname>, и при этом используется протокол репликации. Подключение должно осуществляться от лица суперпользователя или пользователя с правом <literal>REPLICATION</literal> (см. <xref remap="4" linkend="role-attributes"/>), а в <filename>pg_hba.conf</filename> должно быть прописано подключение для репликации. Значение <xref linkend="guc-max-wal-senders"/> на сервере должно быть достаточно большим, чтобы допускать минимум ещё одно подключение для копирования и одно для трансляции WAL (если она используется).

source: The backup is made over a regular <productname>PostgreSQL</productname> connection, and uses the replication protocol. The connection must be made with a superuser or a user having <literal>REPLICATION</literal> permissions (see <xref linkend="role-attributes"/>), and <filename>pg_hba.conf</filename> must explicitly permit the replication connection. The server must also be configured with <xref linkend="guc-max-wal-senders"/> set high enough to leave at least one session available for the backup.
ru: Копия создаётся через обычное подключение к <productname>PostgreSQL</productname>, и при этом используется протокол репликации. Подключение должно осуществляться от лица суперпользователя или пользователя с правом <literal>REPLICATION</literal> (см. <xref remap="4" linkend="role-attributes"/>), а в <filename>pg_hba.conf</filename> должно быть прописано подключение для репликации. Значение <xref linkend="guc-max-wal-senders"/> на сервере должно быть достаточно большим, чтобы допускать минимум ещё одно подключение для копирования.

source: There can be multiple <command>pg_basebackup</command>s running at the same time, but it is better from a performance point of view to take only one backup, and copy the result.
ru: Можно запустить одновременно несколько команд <command>pg_basebackup</command>, но с точки зрения производительности лучше делать всего одну копию одновременно, а затем копировать получаемый результат.

source: <application>pg_basebackup</application> can make a base backup from not only the master but also the standby. To take a backup from the standby, set up the standby so that it can accept replication connections (that is, set <varname>max_wal_senders</varname> and <xref linkend="guc-hot-standby"/>, and configure <link linkend="auth-pg-hba-conf">host-based authentication</link>). You will also need to enable <xref linkend="guc-full-page-writes"/> on the master.
ru: С помощью <application>pg_basebackup</application> можно получить базовую копию не только на ведущем, но и на ведомом сервере. Для этого на ведомом сервере необходимо разрешить подключения репликации (параметры <varname>max_wal_senders</varname> и <xref linkend="guc-hot-standby"/>, а также настроить <link linkend="auth-pg-hba-conf">аутентификацию компьютера</link>). При этом на ведущем необходимо включить <xref linkend="guc-full-page-writes"/>.

source: The backup history file is not created in the database cluster backed up.
ru: Файл истории резервного копирования в целевом кластере баз данных не создаётся.

source: If you are using <literal>-X none</literal>, there is no guarantee that all WAL files required for the backup are archived at the end of backup.
ru: При использовании ключа <literal>-X none</literal> нет гарантии, что все файлы WAL, требуемые для резервной копии, будут заархивированы в конце копирования.

source: There is no guarantee that all WAL files required for the backup are archived at the end of backup. If you are planning to use the backup for an archive recovery and want to ensure that all required files are available at that moment, you need to include them into the backup by using the <literal>-x</literal> option.
ru: Нет гарантии, что все необходимые файлы журналов WAL будут доступны на момент завершения создания резервной копии. Если планируется использовать резервную копию для восстановления из журнала, то для обеспечения целостности необходимо самостоятельно добавлять их с помощью параметра <literal>-x</literal>.

source: If the standby is promoted to the master during online backup, the backup fails.
ru: Если ведомый сервер переключается в роль ведущего в процессе копирования, копирование прерывается.

source: All WAL records required for the backup must contain sufficient full-page writes, which requires you to enable <varname>full_page_writes</varname> on the master and not to use a tool like <application>pg_compresslog</application> as <varname>archive_command</varname> to remove full-page writes from WAL files.
ru: Все необходимые для резервной копии WAL-записи должны содержать полные страницы, для чего нужно включить режим <varname>full_page_writes</varname> на ведущем и не использовать в <varname>archive_command</varname> такие утилиты, как <application>pg_compresslog</application>, которые могут удалить записанные полные страницы из WAL.

source: Note that there are some limitations in an online backup from the standby: <placeholder-1/>
ru: Заметьте, что при копировании с ведомого сервера есть некоторые ограничения: <placeholder-1/>

source: Options
ru: Параметры

source: directory
ru: каталог

source: Directory to write the output to. <application>pg_basebackup</application> will create the directory and any parent directories if necessary. The directory may already exist, but it is an error if the directory already exists and is not empty.
ru: Целевой каталог для записи данных. <application>pg_basebackup</application> создаст его и родительские, если необходимо. Каталог может быть создан заранее, но должен быть пустым, иначе возникнет ошибка.

source: When the backup is in tar mode, and the directory is specified as <literal>-</literal> (dash), the tar file will be written to <literal>stdout</literal>.
ru: Если резервирование работает в режиме <literal>tar</literal>, а имя каталога имеет значение <literal>-</literal> (тире), то tar-файл будет писаться в <literal>stdout</literal>.

source: This option is required.
ru: Этот флаг является обязательным.

source: format
ru: формат

source: Write the output as plain files, with the same layout as the current data directory and tablespaces. When the cluster has no additional tablespaces, the whole database will be placed in the target directory. If the cluster contains additional tablespaces, the main data directory will be placed in the target directory, but all other tablespaces will be placed in the same absolute path as they have on the server.
ru: Записывает выводимые данные в обычные файлы, сохраняя текущую схему размещения каталогов данных и табличных пространств. Если кластер не имеет дополнительных табличных пространств, то вся база будет помещена в заданный каталог. Иначе основной каталог хранения данных будет помещён в целевой каталог, а все остальные табличные пространства — в те же абсолютные пути, в которых они находятся на сервере.

source: This is the default format.
ru: Это формат по умолчанию.

source: Write the output as tar files in the target directory. The main data directory will be written to a file named <filename>base.tar</filename>, and all other tablespaces will be named after the tablespace OID.
ru: Записывает в целевой каталог файлы в формате tar. Основной каталог хранения данных будет писаться в файл <filename>base.tar</filename>, а табличные пространства — в файлы, именованные в соответствии с их OID.

source: If the value <literal>-</literal> (dash) is specified as target directory, the tar contents will be written to standard output, suitable for piping to for example <productname>gzip</productname>. This is only possible if the cluster has no additional tablespaces and WAL streaming is not used.
ru: Если имя целевого каталога задано как <literal>-</literal> (тире), то данные будут писаться в стандартный вывод, что позволяет, например, использовать <productname>gzip</productname>. Это возможно лишь когда не применяются дополнительные табличные пространства и не используется трансляция WAL.

source: Selects the format for the output. <replaceable>format</replaceable> can be one of the following: <placeholder-1/>
ru: Устанавливает формат вывода. <replaceable>формат</replaceable> может принимать следующие значения: <placeholder-1/>

source: rate
ru: скорость_передачи

source: The maximum transfer rate of data transferred from the server. Values are in kilobytes per second. Use a suffix of <literal>M</literal> to indicate megabytes per second. A suffix of <literal>k</literal> is also accepted, and has no effect. Valid values are between 32 kilobytes per second and 1024 megabytes per second.
ru: Максимальная скорость передачи данных с сервера. Значение задаётся в Кб/с. Для установки значения в мегабайтах, можно использовать суффикс <literal>M</literal>. Также допустим суффикс <literal>k</literal>, но он не принципиален. Допустимые значения лежат в рамках между 32 Кб/с и 1024 Мб/с.

source: The purpose is to limit the impact of <application>pg_basebackup</application> on the running server.
ru: Служит для снижения влияния на производительность сервера со стороны работающего <application>pg_basebackup</application>.

source: This option always affects transfer of the data directory. Transfer of WAL files is only affected if the collection method is <literal>fetch</literal>.
ru: Параметр всегда влияет на передачу данных каталога хранения. На передачу данных файлов WAL влияние оказывается лишь при методе сбора <literal>fetch</literal>.

source: Write a minimal <filename>recovery.conf</filename> in the output directory (or into the base archive file when using tar format) to ease setting up a standby server. The <filename>recovery.conf</filename> file will record the connection settings and, if specified, the replication slot that <application>pg_basebackup</application> is using, so that the streaming replication will use the same settings later on.
ru: Записать минимальный файл <filename>recovery.conf</filename> в каталог вывода (или базовый архивный файл при использовании формата tar) для упрощения настройки ведомого сервера. В файл <filename>recovery.conf</filename> будут записаны параметры соединения и, если указан, слот репликации, который использует <application>pg_basebackup</application>, так что впоследствии при потоковой репликации будут использоваться те же параметры.

source: slotname
ru: имя_слота

source: This option can only be used together with <literal>-X stream</literal>. It causes the WAL streaming to use the specified replication slot. If the base backup is intended to be used as a streaming replication standby using replication slots, it should then use the same replication slot name in <filename>recovery.conf</filename>. That way, it is ensured that the server does not remove any necessary WAL data in the time between the end of the base backup and the start of streaming replication.
ru: Этот параметр может применяться только вместе с <literal>-X stream</literal>. Он устанавливает использование заданного слота репликации при потоковой передаче WAL. Если базовая копия предназначена для использования на ведомом сервере с потоковой репликацией, затем должен использоваться слот с тем же именем в <filename>recovery.conf</filename>. Тем самым гарантируется, что сервер не удалит никакие необходимые данные WAL после того, как базовая копия будет получена, и до того, как начнётся потоковая репликация.

source: If this option is not specified and the server supports temporary replication slots (version 10 and later), then a temporary replication slot is automatically used for WAL streaming.
ru: Если этот ключ не указан и сервер поддерживает временные слоты репликации (они появились в версии 10), для трансляции WAL автоматически используется временный слот репликации.

source: This option prevents the creation of a temporary replication slot during the backup even if it's supported by the server.
ru: Этот ключ предотвращает создание временного слота репликации во время резервного копирования, даже если это поддерживается сервером.

source: Temporary replication slots are created by default if no slot name is given with the option <option>-S</option> when using log streaming.
ru: Временные слоты репликации создаются по умолчанию, если при трансляции журнала имя слота не задаётся в параметре <option>-S</option>.

source: The main purpose of this option is to allow taking a base backup when the server is out of free replication slots. Using replication slots is almost always preferred, because it prevents needed WAL from being removed by the server during the backup.
ru: Основное предназначение этого ключа в том, чтобы можно было сделать базовую резервную копию, когда на сервере не хватает свободных слотов репликации. Использование слотов репликации почти всегда предпочтительнее, так как при этом предотвращается удаление во время резервного копирования необходимых файлов WAL с сервера.

source: olddir
ru: старый_каталог

source: newdir
ru: новый_каталог

source: Relocate the tablespace in directory <replaceable>olddir</replaceable> to <replaceable>newdir</replaceable> during the backup. To be effective, <replaceable>olddir</replaceable> must exactly match the path specification of the tablespace as it is currently defined. (But it is not an error if there is no tablespace in <replaceable>olddir</replaceable> contained in the backup.) Both <replaceable>olddir</replaceable> and <replaceable>newdir</replaceable> must be absolute paths. If a path happens to contain a <literal>=</literal> sign, escape it with a backslash. This option can be specified multiple times for multiple tablespaces. See examples below.
ru: Переместить табличное пространство из <replaceable>старого_каталога</replaceable> в <replaceable>новый_каталог</replaceable> в процессе копирования. Чтобы перемещение произошло, в параметре <replaceable>старый_каталог</replaceable> должен задаваться в точности путь табличного пространства, как он определён. (Но не будет ошибкой, если табличного пространства, на которое указывает <replaceable>старый_каталог</replaceable>, в архиве не окажется.) И <replaceable>старый_каталог</replaceable>, и <replaceable>новый_каталог</replaceable> должны задаваться абсолютными путями. Если в пути встречается символ <literal>=</literal>, его необходимо экранировать обратной косой чертой. Этот параметр можно добавить несколько раз для нескольких табличных пространств. См. примеры ниже.

source: If a tablespace is relocated in this way, the symbolic links inside the main data directory are updated to point to the new location. So the new data directory is ready to be used for a new server instance with all tablespaces in the updated locations.
ru: Если табличное пространство перемещается таким способом, символьные ссылки внутри основного каталога хранения данных также приводятся в соответствие с новым местоположением. Таким образом, для экземпляра сервера подготавливается новый каталог данных, в котором все табличные пространства оказываются в новом расположении.

source: waldir
ru: каталог_wal

source: Specifies the location for the write-ahead log directory. <replaceable>waldir</replaceable> must be an absolute path. The write-ahead log directory can only be specified when the backup is in plain mode.
ru: Указывает размещение каталога хранения журнала предзаписи. Задаваемый в параметре <replaceable>каталог_wal</replaceable> путь должен быть абсолютным. Каталог с журналом предзаписи можно задать только при создании копии в простом режиме.

source: Includes the required transaction log files (WAL files) in the backup. This will include all transaction logs generated during the backup. If this option is specified, it is possible to start a postmaster directly in the extracted directory without the need to consult the log archive, thus making this a completely standalone backup.
ru: Включает все необходимые файлы журналов транзакций (файлы WAL) в резервную копию. В том числе включаются все журналы транзакций, сгенерированные в процессе создания резервной копии. Если параметр указан, то главный процесс БД может быть запущен непосредственно с восстановленным каталогом, без дополнительного архива журналов; таким образом полученная резервная копия будет вполне самодостаточной.

source: method
ru: метод

source: Includes the required write-ahead log files (WAL files) in the backup. This will include all write-ahead logs generated during the backup. Unless the method <literal>none</literal> is specified, it is possible to start a postmaster directly in the extracted directory without the need to consult the log archive, thus making this a completely standalone backup.
ru: Включает все необходимые файлы журналов предзаписи (файлы WAL) в резервную копию. В том числе включаются все журналы предзаписи, сгенерированные в процессе создания резервной копии. Если только не выбран метод <literal>none</literal>, главный процесс БД может быть запущен непосредственно с восстановленным каталогом, без обращения к дополнительному архиву журналов; таким образом будет получена полностью самодостаточная резервная копия.

source: Don't include write-ahead log in the backup.
ru: Не включать журнал предзаписи в резервную копию.

source: The write-ahead log files are collected at the end of the backup. Therefore, it is necessary for the <xref linkend="guc-wal-keep-segments"/> parameter to be set high enough that the log is not removed before the end of the backup. If the log has been rotated when it's time to transfer it, the backup will fail and be unusable.
ru: Файлы журнала предзаписи собираются в конце процесса копирования. Таким образом необходимо установить достаточно большое значение параметра <xref linkend="guc-wal-keep-segments"/>, чтобы избежать преждевременного удаления файлов журнала. В случае удаления файлов до завершения процесса копирования возникнет ошибка, а копия будет непригодной к использованию.

source: The write-ahead log files will be written to the <filename>base.tar</filename> file.
ru: Файлы журнала предзаписи будут записаны в файл <filename>base.tar</filename>.

source: Stream the write-ahead log while the backup is created. This will open a second connection to the server and start streaming the write-ahead log in parallel while running the backup. Therefore, it will use up two connections configured by the <xref linkend="guc-max-wal-senders"/> parameter. As long as the client can keep up with write-ahead log received, using this mode requires no extra write-ahead logs to be saved on the master.
ru: Передавать журнал предзаписи в процессе создания резервной копии. При этом открывается второе соединение к серверу, по которому будет передаваться журнал предзаписи, одновременно с созданием резервной копии. Таким образом будут использоваться два подключения из разрешённых параметром <xref linkend="guc-max-wal-senders"/>. И если клиент будет успевать получать журнал предзаписи, ведущему серверу не потребуется хранить дополнительные файлы журнала.

source: The write-ahead log files are written to a separate file named <filename>pg_wal.tar</filename> (if the server is a version earlier than 10, the file will be named <filename>pg_xlog.tar</filename>).
ru: Файлы журнала предзаписи сохраняются в отдельном файле с именем <filename>pg_wal.tar</filename> (с сервером старее 10 версии файл будет называться <filename>pg_xlog.tar</filename>).

source: This value is the default.
ru: Это значение по умолчанию.

source: The following methods for collecting the write-ahead logs are supported: <placeholder-1/>
ru: Для сбора журналов предзаписи поддерживаются следующие методы: <placeholder-1/>

source: Enables gzip compression of tar file output, with the default compression level. Compression is only available when using the tar format, and the suffix <filename>.gz</filename> will automatically be added to all tar filenames.
ru: Включает gzip-сжатие выводимого tar-файла с уровнем компрессии по умолчанию. Сжатие поддерживается только для формата tar, при этом ко всем именам файлов tar добавляется суффикс <filename>.gz</filename>.

source: level
ru: уровень

source: Enables gzip compression of tar file output, and specifies the compression level (0 through 9, 0 being no compression and 9 being best compression). Compression is only available when using the tar format, and the suffix <filename>.gz</filename> will automatically be added to all tar filenames.
ru: Включает gzip-сжатие выводимого tar-файла и задаёт уровень сжатия от 0 (без сжатия) до 9 (максимальное сжатие). Сжатие поддерживается только для формата tar, при этом ко всем именам файлов tar добавляется суффикс <filename>.gz</filename>.

source: The following command-line options control the location and format of the output. <placeholder-1/>
ru: Описанные далее аргументы командной строки влияют на размещение и формат вывода. <placeholder-1/>

source: Sets checkpoint mode to fast (immediate) or spread (default) (see <xref linkend="backup-lowlevel-base-backup"/>).
ru: Устанавливает режим контрольных точек: fast (быстрый) или spread (протяжённый, по умолчанию). Подробнее см. <xref remap="4" linkend="backup-lowlevel-base-backup"/>.

source: label
ru: метка
