Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/pg_ctl-ref.po
Languages: ru

source: If this file exists in the data directory, <application>pg_ctl</application> (in <option>restart</option> mode) will pass the contents of the file as options to <application>postgres</application>, unless overridden by the <option>-o</option> option. The contents of this file are also displayed in <option>status</option> mode.
ru: Если файл существует в каталоге хранения данных, то <application>pg_ctl</application> (при <option>restart</option>) передаст его содержимое в качестве аргументов <application>postgres</application>, если не указаны иные значения в <option>-o</option>. Содержимое файла также отображается при вызове в режиме <option>status</option>.

source: Examples
ru: Примеры

source: Starting the Server
ru: Запуск сервера

source: To start the server, waiting until the server is accepting connections: <screen> <prompt>$</prompt> <userinput>pg_ctl start</userinput> </screen>
ru: Запуск сервера и ожидание момента, когда он начнёт принимать подключения: <screen> <prompt>$</prompt> <userinput>pg_ctl start</userinput> </screen>

source: To start the server using port 5433, and running without <function>fsync</function>, use: <screen> <prompt>$</prompt> <userinput>pg_ctl -o "-F -p 5433" start</userinput> </screen>
ru: Чтобы запустить сервер с использованием порта 5433 и без <function>fsync</function>, выполните: <screen> <prompt>$</prompt> <userinput>pg_ctl -o "-F -p 5433" start</userinput> </screen>

source: Stopping the Server
ru: Остановка сервера

source: To stop the server, use: <screen> <prompt>$</prompt> <userinput>pg_ctl stop</userinput> </screen> The <option>-m</option> option allows control over <emphasis>how</emphasis> the server shuts down: <screen> <prompt>$</prompt> <userinput>pg_ctl stop -m smart</userinput> </screen>
ru: Чтобы остановить сервер, выполните: <screen> <prompt>$</prompt> <userinput>pg_ctl stop</userinput> </screen> Ключ <option>-m</option> позволяет управлять тем, <emphasis>как</emphasis> сервер будет остановлен: <screen> <prompt>$</prompt> <userinput>pg_ctl stop -m smart</userinput> </screen>

source: Restarting the Server
ru: Повторный запуск сервера

source: Restarting the server is almost equivalent to stopping the server and starting it again, except that by default, <command>pg_ctl</command> saves and reuses the command line options that were passed to the previously-running instance. To restart the server using the same options as before, use: <screen> <prompt>$</prompt> <userinput>pg_ctl restart</userinput> </screen>
ru: Перезапуск сервера почти равнозначен остановке и запуску сервера за исключением того, что по умолчанию <command>pg_ctl</command> сохраняет параметры командной строки, которые были переданы ранее запущенному экземпляру. Таким образом, чтобы перезапустить сервер с теми же параметрами, с какими он был запущен, выполните: <screen> <prompt>$</prompt> <userinput>pg_ctl restart</userinput> </screen>

source: But if <option>-o</option> is specified, that replaces any previous options. To restart using port 5433, disabling <function>fsync</function> upon restart: <screen> <prompt>$</prompt> <userinput>pg_ctl -o "-F -p 5433" restart</userinput> </screen>
ru: Но если добавляется ключ <option>-o</option>, он заменяет все предыдущие параметры. Эта команда осуществит перезапуск с использованием порта 5433 и без <function>fsync</function>: <screen> <prompt>$</prompt> <userinput>pg_ctl -o "-F -p 5433" restart</userinput> </screen>

source: Showing the Server Status
ru: Вывод состояния сервера

source: Here is sample status output from <application>pg_ctl</application>: <screen> <prompt>$</prompt> <userinput>pg_ctl status</userinput> <computeroutput> pg_ctl: server is running (PID: 13718) /usr/local/pgsql/bin/postgres "-D" "/usr/local/pgsql/data" "-p" "5433" "-B" "128" </computeroutput> </screen> The second line is the command that would be invoked in restart mode.
ru: Ниже представлен примерный вывод <application>pg_ctl</application>: <screen> <prompt>$</prompt> <userinput>pg_ctl status</userinput> <computeroutput> pg_ctl: server is running (PID: 13718) /usr/local/pgsql/bin/postgres "-D" "/usr/local/pgsql/data" "-p" "5433" "-B" "128" </computeroutput> </screen> Во второй строке показывается команда, которая будет выполнена в режиме перезапуска.

source: See Also
ru: См. также

source: The <option>init</option> or <option>initdb</option> mode creates a new <productname>PostgreSQL</productname> database cluster. A database cluster is a collection of databases that are managed by a single server instance. This mode invokes the <command>initdb</command> command. See <xref linkend="app-initdb"/> for details.
ru: Для инициализации нового кластера <productname>PostgreSQL</productname> используются режимы <option>init</option> или <option>initdb</option>. Кластер — это коллекция баз данных под управлением единого сервера. По факту вызывается команда <command>initdb</command>. За подробностями обратитесь к <xref remap="3" linkend="app-initdb"/>.

source: In <option>start</option> mode, a new server is launched. The server is started in the background, and its standard input is attached to <filename>/dev/null</filename> (or <literal>nul</literal> on Windows). On Unix-like systems, by default, the server's standard output and standard error are sent to <application>pg_ctl</application>'s standard output (not standard error). The standard output of <application>pg_ctl</application> should then be redirected to a file or piped to another process such as a log rotating program like <application>rotatelogs</application>; otherwise <command>postgres</command> will write its output to the controlling terminal (from the background) and will not leave the shell's process group. On Windows, by default the server's standard output and standard error are sent to the terminal. These default behaviors can be changed by using <option>-l</option> to append the server's output to a log file. Use of either <option>-l</option> or output redirection is recommended.
ru: Сервер запускается в режиме <option>start</option>. Процесс работает в фоновом режиме, а стандартный ввод связывается с <filename>/dev/null</filename> (или <literal>nul</literal> под управлением Windows). По умолчанию в Unix-подобных системах вывод и ошибки сервера пишутся в устройство стандартного вывода (не ошибок) <application>pg_ctl</application>. Вывод <application>pg_ctl</application> следует перенаправить в файл или процесс, например, приложение ротации журналов <application>rotatelogs</application>; в ином случае, <command>postgres</command> будет писать вывод в управляющий терминал (в фоновом режиме) и останется в группе процессов оболочки. В Windows вывод и ошибки сервера по умолчанию перенаправляются в терминал. Это поведение можно изменить и направить вывод сервера в файл, добавив ключ <option>-l</option>. Мы рекомендуем использовать ключ <option>-l</option> или перенаправлять вывод.

source: In <option>stop</option> mode, the server that is running in the specified data directory is shut down. Three different shutdown methods can be selected with the <option>-m</option> option. <quote>Smart</quote> mode waits for all active clients to disconnect and any online backup to finish. If the server is in hot standby, recovery and streaming replication will be terminated once all clients have disconnected. <quote>Fast</quote> mode (the default) does not wait for clients to disconnect and will terminate an online backup in progress. All active transactions are rolled back and clients are forcibly disconnected, then the server is shut down. <quote>Immediate</quote> mode will abort all server processes immediately, without a clean shutdown. This will lead to a crash-recovery run on the next restart.
ru: В режиме <option>stop</option> сервер, работающий в указанном каталоге данных, останавливается. Параметр <option>-m</option> позволяет выбрать три различных режима остановки. Режим <quote>Smart</quote> ожидает отключения всех активных клиентов и завершения всех текущих процессов резервного копирования. Если сервер работает в режиме горячего резерва, восстановление и потоковая репликация будут прерваны, как только отключатся все клиенты. Режим <quote>Fast</quote> (выбираемый по умолчанию) не ожидает отключения клиентов и завершает все текущие процессы резервного копирования. Все активные транзакции откатываются, а клиенты принудительно отключаются, после чего сервер останавливается. Режим <quote>Immediate</quote> незамедлительно прерывает все серверные процессы, не выполняя процедуру штатной остановки. В результате при следующем запуске будет запущено восстановление после сбоя.

source: <option>restart</option> mode effectively executes a stop followed by a start. This allows changing the <command>postgres</command> command-line options. <option>restart</option> might fail if relative paths specified were specified on the command-line during server start.
ru: В режиме <option>restart</option> по сути выполняется остановка и последующий запуск сервера. Это позволяет изменить параметры командной строки <command>postgres</command>. Режим <option>restart</option> может не отработать, если при запуске сервера в командной строке задавались относительные пути.

source: <option>reload</option> mode simply sends the <command>postgres</command> process a <systemitem>SIGHUP</systemitem> signal, causing it to reread its configuration files (<filename>postgresql.conf</filename>, <filename>pg_hba.conf</filename>, etc.). This allows changing of configuration-file options that do not require a complete restart to take effect.
ru: Чтобы перечитать конфигурацию (<filename>postgresql.conf</filename>, <filename>pg_hba.conf</filename> и т. д.), используется <option>reload</option>, при этом процесс <command>postgres</command> получает системный сигнал <systemitem>SIGHUP</systemitem>. Это позволяет применить изменения без полного рестарта сервера.

source: <option>status</option> mode checks whether a server is running in the specified data directory. If it is, the <acronym>PID</acronym> and the command line options that were used to invoke it are displayed. If the server is not running, the process returns an exit status of 3. If an accessible data directory is not specified, the process returns an exit status of 4.
ru: Чтобы проверить статус кластера, используется <option>status</option>. Если кластер запущен, то будет выведен <acronym>PID</acronym> процесса, а также команда с использованными при запуске аргументами. Если кластер остановлен, то процесс вернёт статус завершения 3. Если не указан каталог хранения данных, то процесс вернёт статус завершения 4.

source: In <option>promote</option> mode, the standby server that is running in the specified data directory is commanded to exit recovery and begin read-write operations.
ru: Чтобы перевести резервный сервер в режим главного, используется <option>promote</option>. При этом сервер прекращает работу в режиме восстановления и начинает работать в режиме чтения-записи.

source: <option>kill</option> mode allows you to send a signal to a specified process. This is particularly valuable for <productname>Microsoft Windows</productname> which does not have a <application>kill</application> command. Use <literal>--help</literal> to see a list of supported signal names.
ru: Чтобы послать сигнал процессу, используется <option>kill</option>. Это особенно применимо в среде <productname>Microsoft Windows</productname>, которая не имеет в оснастке команды <application>kill</application>. Чтобы посмотреть список доступных сигналов, обратитесь к справке <literal>--help</literal>.

source: <option>register</option> mode allows you to register a system service on <productname>Microsoft Windows</productname>. The <option>-S</option> option allows selection of service start type, either <quote>auto</quote> (start service automatically on system startup) or <quote>demand</quote> (start service on demand).
ru: Режим <option>register</option> предназначен для регистрации системной службы в <productname>Microsoft Windows</productname>. Параметр <option>-S</option> позволяет выбрать тип запуска службы, <quote>auto</quote> (запускать службу автоматически при загрузке системы) или <quote>demand</quote> (запускать службу по требованию).

source: Specifies the file system location of the database configuration files. If this is omitted, the environment variable <envar>PGDATA</envar> is used.
ru: Указывает размещение конфигурационных файлов кластера. Если не указано, используется значение переменной окружения <envar>PGDATA</envar>.

source: Specifies the shutdown mode. <replaceable>mode</replaceable> can be <literal>smart</literal>, <literal>fast</literal>, or <literal>immediate</literal>, or the first letter of one of these three. If this is omitted, <literal>fast</literal> is used.
ru: Задаёт режим остановки кластера. Значением <replaceable>режим</replaceable> может быть <literal>smart</literal>, <literal>fast</literal> или <literal>immediate</literal>, либо первая буква этих вариантов. По умолчанию выбирается режим <literal>fast</literal>.

source: Specifies options to be passed directly to the <command>postgres</command> command; multiple option invocations are appended.
ru: Указывает флаги, которые будут переданы непосредственно программе <command>postgres</command>; несколько параметров складываются вместе.

source: The options should usually be surrounded by single or double quotes to ensure that they are passed through as a group.
ru: Эти параметры обычно следует обрамлять одинарными или двойными кавычками, чтобы они передавались вместе как одна группа.

source: Specifies options to be passed directly to the <command>initdb</command> command.
ru: Указывает флаги, которые будут переданы в <command>initdb</command>.

source: The maximum number of seconds to wait when waiting for startup or shutdown to complete. Defaults to the value of the <envar>PGCTLTIMEOUT</envar> environment variable or, if not set, to 60 seconds.
ru: Максимальное время (в секундах) ожидания запуска или остановки сервера. По умолчанию принимается значение переменной среды <envar>PGCTLTIMEOUT</envar> или, если оно не задано, 60 секунд.

source: Wait for the startup or shutdown to complete. Waiting is the default option for shutdowns, but not startups. When waiting for startup, <command>pg_ctl</command> repeatedly attempts to connect to the server. When waiting for shutdown, <command>pg_ctl</command> waits for the server to remove its <acronym>PID</acronym> file. This option allows the entry of an <acronym>SSL</acronym> passphrase on startup. <command>pg_ctl</command> returns an exit code based on the success of the startup or shutdown.
ru: Ждать завершения запуска или остановки. Это вариант по умолчанию при остановке, но не при запуске. Ожидая запуска, <command>pg_ctl</command> постоянно пытается подключиться к серверу. Ожидая остановки, <command>pg_ctl</command> ждёт, пока сервер не удалит свой файл <acronym>PID</acronym>. Этот параметр позволяет ввести парольную фразу <acronym>SSL</acronym> при запуске. <command>pg_ctl</command> возвращает код завершения, сообщающий об успехе запуска или остановки.

source: Do not wait for startup or shutdown to complete. This is the default for start and restart modes.
ru: Не ждать завершения запуска или остановки. Это вариант по умолчанию для режимов запуска и перезапуска.

source: Name of the event source for <application>pg_ctl</application> to use for logging to the event log when running as a Windows service. The default is <literal>PostgreSQL</literal>. Note that this only controls the logging from <application>pg_ctl</application> itself; once started, the server will use the event source specified by <xref linkend="guc-event-source"/>. Should the server fail during early startup, it might also log using the default event source <literal>PostgreSQL</literal>.
ru: Имя источника событий, с которым <application>pg_ctl</application> будет записывать в системный журнал события при запуске в виде службы Windows. Имя по умолчанию — <literal>PostgreSQL</literal>. Заметьте, что это влияет только на сообщения, которые выдаёт сам <application>pg_ctl</application>; как только сервер запустится, он будет использовать источник событий, заданный в <xref linkend="guc-event-source"/>. Если произойдёт ошибка при запуске сервера на ранней стадии, он также выдаст сообщение с источником по умолчанию <literal>PostgreSQL</literal>.

source: Name of the system service to register. The name will be used as both the service name and the display name.
ru: Имя регистрируемой системной службы. Оно станет и собственно именем службы, и отображаемым именем.

source: Password for the user to start the service.
ru: Пароль для пользователя, запускающего службу.

source: Start type of the system service to register. start-type can be <literal>auto</literal>, or <literal>demand</literal>, or the first letter of one of these two. If this is omitted, <literal>auto</literal> is used.
ru: Тип запуска системной службы. Может принимать значения: <literal>auto</literal>, или <literal>demand</literal>, либо быть представлен первой буквой названия каждого приведённого значения. По умолчанию используется <literal>auto</literal>.

source: User name for the user to start the service. For domain users, use the format <literal>DOMAIN\username</literal>.
ru: Имя пользователя, от имени которого будут запущена служба. Для доменных пользователей необходимо использовать нотацию <literal>DOMAIN\username</literal>.

source: <command>pg_ctl</command>, like most other <productname>PostgreSQL</productname> utilities, also uses the environment variables supported by <application>libpq</application> (see <xref linkend="libpq-envars"/>). For additional server variables, see <xref linkend="app-postgres"/>.
ru: <command>pg_ctl</command>, как и большинство других утилит <productname>PostgreSQL</productname>, также использует переменные окружения, поддерживаемые <application>libpq</application> (см. <xref remap="4" linkend="libpq-envars"/>). Другие переменные сервера описаны в <xref remap="6" linkend="app-postgres"/>.

source: The existence of this file in the data directory is used to help <application>pg_ctl</application> determine if the server is currently running.
ru: Наличие файла в каталоге хранения данных помогает <application>pg_ctl</application> определить, работает ли сервер в настоящий момент.

source: To start the server: <screen> <prompt>$</prompt> <userinput>pg_ctl start</userinput> </screen>
ru: Для запуска сервера: <screen> <prompt>$</prompt> <userinput>pg_ctl start</userinput> </screen>

source: To start the server, waiting until the server is accepting connections: <screen> <prompt>$</prompt> <userinput>pg_ctl -w start</userinput> </screen>
ru: Для запуска сервера с ожиданием готовности к приему подключений: <screen> <prompt>$</prompt> <userinput>pg_ctl -w start</userinput> </screen>

source: To stop the server, use: <screen> <prompt>$</prompt> <userinput>pg_ctl stop</userinput> </screen> The <option>-m</option> option allows control over <emphasis>how</emphasis> the server shuts down: <screen> <prompt>$</prompt> <userinput>pg_ctl stop -m fast</userinput> </screen>
ru: Для остановки сервера: <screen> <prompt>$</prompt> <userinput>pg_ctl stop</userinput> </screen> Параметр <option>-m</option> указывает <emphasis>режим</emphasis> остановки: <screen> <prompt>$</prompt> <userinput>pg_ctl stop -m fast</userinput> </screen>

source: Restarting the server is almost equivalent to stopping the server and starting it again, except that <command>pg_ctl</command> saves and reuses the command line options that were passed to the previously running instance. To restart the server in the simplest form, use: <screen> <prompt>$</prompt> <userinput>pg_ctl restart</userinput> </screen>
ru: Повторный запуск сервера производится аналогично остановке с дальнейшим его запуском, за исключением того, что <command>pg_ctl</command> использует аргументы, которые были переданы при предыдущем запуске кластера. В простейшем случае повторный запуск выглядит так: <screen> <prompt>$</prompt> <userinput>pg_ctl restart</userinput> </screen>

source: To restart the server, waiting for it to shut down and restart: <screen> <prompt>$</prompt> <userinput>pg_ctl -w restart</userinput> </screen>
ru: Для повторного запуска сервера с ожиданием полной остановки и последующего запуска: <screen> <prompt>$</prompt> <userinput>pg_ctl -w restart</userinput> </screen>

source: To restart using port 5433, disabling <function>fsync</function> upon restart: <screen> <prompt>$</prompt> <userinput>pg_ctl -o "-F -p 5433" restart</userinput> </screen>
ru: Для повторного запуска на порту 5433 с выключенным <function>fsync</function> после старта: <screen> <prompt>$</prompt> <userinput>pg_ctl -o "-F -p 5433" restart</userinput> </screen>

source: Here is sample status output from <application>pg_ctl</application>: <screen> <prompt>$</prompt> <userinput>pg_ctl status</userinput> <computeroutput> pg_ctl: server is running (PID: 13718) /usr/local/pgsql/bin/postgres "-D" "/usr/local/pgsql/data" "-p" "5433" "-B" "128" </computeroutput> </screen> This is the command line that would be invoked in restart mode.
ru: Ниже представлен примерный вывод <application>pg_ctl</application>: <screen> <prompt>$</prompt> <userinput>pg_ctl status</userinput> <computeroutput> pg_ctl: server is running (PID: 13718) /usr/local/pgsql/bin/postgres "-D" "/usr/local/pgsql/data" "-p" "5433" "-B" "128" </computeroutput> </screen> Показанная командная строка будет использоваться в режиме перезапуска.
