Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/pg_ctl-ref.po
Languages: ru

source: Application
ru: Приложение

source: initialize, start, stop, or control a <placeholder-1/> server
ru: инициализировать, запустить, остановить или управлять сервером <placeholder-1/>

source: datadir
ru: каталог_данных

source: initdb-options
ru: параметры-initdb

source: filename
ru: имя_файла

source: seconds
ru: секунды

source: options
ru: параметры

source: path
ru: путь

source: signal_name
ru: имя_сигнала

source: process_id
ru: ид_процесса

source: On Microsoft Windows, also:
ru: В системах Microsoft Windows также:

source: servicename
ru: имя_службы

source: username
ru: имя_пользователя

source: password
ru: пароль

source: Description
ru: Описание

source: <application>pg_ctl</application> is a utility for initializing a <productname>PostgreSQL</productname> database cluster, starting, stopping, or restarting the <productname>PostgreSQL</productname> database server (<xref linkend="app-postgres"/>), or displaying the status of a running server. Although the server can be started manually, <application>pg_ctl</application> encapsulates tasks such as redirecting log output and properly detaching from the terminal and process group. It also provides convenient options for controlled shutdown.
ru: <application>pg_ctl</application> — это утилита для начальной инициализации, запуска, остановки, повторного запуска и управления кластером баз данных <productname>PostgreSQL</productname> (<xref linkend="app-postgres"/>). Сервер можно стартовать в ручном режиме, но <application>pg_ctl</application> реализует задачи направления вывода в журнал и отсоединения от терминала и группы процессов, а также предоставляет удобный интерфейс остановки кластера.

source: The <option>init</option> or <option>initdb</option> mode creates a new <productname>PostgreSQL</productname> database cluster, that is, a collection of databases that will be managed by a single server instance. This mode invokes the <command>initdb</command> command. See <xref linkend="app-initdb"/> for details.
ru: Команда <option>init</option> (<option>initdb</option>) создаёт кластер баз данных <productname>PostgreSQL</productname>, то есть коллекцию баз данных, которой будет управлять один экземпляр сервера. Эта команда вызывает программу <command>initdb</command>. За подробностями обратитесь к <xref remap="3" linkend="app-initdb"/>.

source: <option>start</option> mode launches a new server. The server is started in the background, and its standard input is attached to <filename>/dev/null</filename> (or <literal>nul</literal> on Windows). On Unix-like systems, by default, the server's standard output and standard error are sent to <application>pg_ctl</application>'s standard output (not standard error). The standard output of <application>pg_ctl</application> should then be redirected to a file or piped to another process such as a log rotating program like <application>rotatelogs</application>; otherwise <command>postgres</command> will write its output to the controlling terminal (from the background) and will not leave the shell's process group. On Windows, by default the server's standard output and standard error are sent to the terminal. These default behaviors can be changed by using <option>-l</option> to append the server's output to a log file. Use of either <option>-l</option> or output redirection is recommended.
ru: Команда <option>start</option> запускает сервер. Процесс запускается в фоне, а стандартный ввод связывается с <filename>/dev/null</filename> (или <literal>nul</literal> в Windows). По умолчанию в Unix-подобных системах вывод и ошибки сервера пишутся в устройство стандартного вывода (не ошибок) <application>pg_ctl</application>. Вывод <application>pg_ctl</application> следует перенаправить в файл или процесс, например, приложение ротации журналов <application>rotatelogs</application>; иначе <command>postgres</command> будет писать вывод в управляющий терминал (в фоновом режиме) и останется в группе процессов оболочки. В Windows вывод и ошибки сервера по умолчанию перенаправляются в терминал. Это поведение по умолчанию можно изменить и направить вывод сервера в файл, добавив ключ <option>-l</option>. Предпочтительными вариантами является использование <option>-l</option> или перенаправление вывода.

source: <option>stop</option> mode shuts down the server that is running in the specified data directory. Three different shutdown methods can be selected with the <option>-m</option> option. <quote>Smart</quote> mode waits for all active clients to disconnect and any online backup to finish. If the server is in hot standby, recovery and streaming replication will be terminated once all clients have disconnected. <quote>Fast</quote> mode (the default) does not wait for clients to disconnect and will terminate an online backup in progress. All active transactions are rolled back and clients are forcibly disconnected, then the server is shut down. <quote>Immediate</quote> mode will abort all server processes immediately, without a clean shutdown. This choice will lead to a crash-recovery cycle during the next server start.
ru: Команда <option>stop</option> останавливает сервер, работающий с указанным каталогом данных. Параметр <option>-m</option> позволяет выбрать один из трёх режимов остановки. Режим <quote>Smart</quote> ожидает отключения всех активных клиентов и завершения всех текущих процессов резервного копирования. Если сервер работает в режиме горячего резерва, восстановление и потоковая репликация будут прерваны, как только отключатся все клиенты. Режим <quote>Fast</quote> (выбираемый по умолчанию) не ожидает отключения клиентов и завершает все текущие процессы резервного копирования. Все активные транзакции откатываются, а клиенты принудительно отключаются, после чего сервер останавливается. Режим <quote>Immediate</quote> незамедлительно прерывает все серверные процессы, не выполняя процедуру штатной остановки. Этот вариант влечёт необходимость выполнить восстановление после сбоя при следующем запуске сервера.

source: <option>restart</option> mode effectively executes a stop followed by a start. This allows changing the <command>postgres</command> command-line options, or changing configuration-file options that cannot be changed without restarting the server. If relative paths were used on the command line during server start, <option>restart</option> might fail unless <application>pg_ctl</application> is executed in the same current directory as it was during server start.
ru: Команда <option>restart</option> по сути производит остановку и последующий запуск сервера. Это позволяет изменить параметры командной строки <command>postgres</command> либо применить изменения в файле конфигурации, не вступающие в силу без перезапуска сервера. Если в командной строке при запуске сервера указывались относительные пути, команда <option>restart</option> может не выполниться, если вызвать <application>pg_ctl</application> не в том каталоге, где производился предыдущий запуск.

source: <option>reload</option> mode simply sends the <command>postgres</command> server process a <systemitem>SIGHUP</systemitem> signal, causing it to reread its configuration files (<filename>postgresql.conf</filename>, <filename>pg_hba.conf</filename>, etc.). This allows changing configuration-file options that do not require a full server restart to take effect.
ru: Команда <option>reload</option> просто посылает процессу сервера <command>postgres</command> сигнал <systemitem>SIGHUP</systemitem>, получив который он перечитывает свои файлы конфигурации (<filename>postgresql.conf</filename>, <filename>pg_hba.conf</filename> и т. д.). Это позволяет применить изменения параметров в файле конфигурации, не требующие полного перезапуска сервера.

source: <option>status</option> mode checks whether a server is running in the specified data directory. If it is, the server's <acronym>PID</acronym> and the command line options that were used to invoke it are displayed. If the server is not running, <application>pg_ctl</application> returns an exit status of 3. If an accessible data directory is not specified, <application>pg_ctl</application> returns an exit status of 4.
ru: Команда <option>status</option> проверяет, работает ли сервер в указанном каталоге данных. Если да, она выдаёт <acronym>PID</acronym> сервера и параметры командной строки, с которыми он был запущен. Если сервер не работает, <application>pg_ctl</application> возвращает код выхода 3. Если в параметрах не указан доступный каталог данных, <application>pg_ctl</application> возвращает код выхода 4.

source: <option>promote</option> mode commands the standby server that is running in the specified data directory to end standby mode and begin read-write operations.
ru: Команда <option>promote</option> указывает серверу, работающему в режиме резерва с указанным каталогом данных, выйти из этого режима и начать операции чтения/записи.

source: <option>kill</option> mode sends a signal to a specified process. This is primarily valuable on <productname>Microsoft Windows</productname> which does not have a built-in <application>kill</application> command. Use <literal>--help</literal> to see a list of supported signal names.
ru: Команда <option>kill</option> передаёт сигнал заданному процессу. Прежде все это полезно в <productname>Microsoft Windows</productname>, где отсутствует встроенная команда <application>kill</application>. Для получения списка имён поддерживаемых сигналов воспользуйтесь ключом <literal>--help</literal>.

source: <option>register</option> mode registers the <productname>PostgreSQL</productname> server as a system service on <productname>Microsoft Windows</productname>. The <option>-S</option> option allows selection of service start type, either <quote>auto</quote> (start service automatically on system startup) or <quote>demand</quote> (start service on demand).
ru: Команда <option>register</option> регистрирует сервер <productname>PostgreSQL</productname> в качестве системной службы в <productname>Microsoft Windows</productname>. Параметр <option>-S</option> позволяет выбрать тип запуска службы: <quote>auto</quote> (запускать службу автоматически при загрузке системы) или <quote>demand</quote> (запускать службу по требованию).

source: <option>unregister</option> mode allows you to unregister a system service on <productname>Microsoft Windows</productname>. This undoes the effects of the <option>register</option> command.
ru: Чтобы удалить зарегистрированную службу в <productname>Microsoft Windows</productname>, используется <option>unregister</option>. Эта операция отменяет действие команды <option>register</option>.

source: <option>unregister</option> mode unregisters a system service on <productname>Microsoft Windows</productname>. This undoes the effects of the <option>register</option> command.
ru: Режим <option>unregister</option> разрегистрирует системную службу в <productname>Microsoft Windows</productname>. Эта операция отменяет действие команды <option>register</option>.

source: Options
ru: Параметры

source: Attempt to allow server crashes to produce core files, on platforms where this is possible, by lifting any soft resource limit placed on core files. This is useful in debugging or diagnosing problems by allowing a stack trace to be obtained from a failed server process.
ru: Способствует сбросу дампа памяти процесса при крахе сервера на платформах, где это возможно, поднимая мягкие ограничения, задаваемые для файлов дампа. Это полезно при отладке и диагностике проблем, так как позволяет получить трассировку стека отказавшего процесса сервера.

source: Specifies the file system location of the database configuration files. If this option is omitted, the environment variable <envar>PGDATA</envar> is used.
ru: Указывает размещение конфигурационных файлов кластера. Если этот ключ опущен, используется значение переменной окружения <envar>PGDATA</envar>.

source: Append the server log output to <replaceable>filename</replaceable>. If the file does not exist, it is created. The <systemitem>umask</systemitem> is set to 077, so access to the log file is disallowed to other users by default.
ru: Направляет вывод сообщений сервера в файл <replaceable>имя_файла</replaceable>. Файл создаётся, если он ещё не существует. При этом устанавливается <systemitem>umask</systemitem> 077, что предотвращает доступ других пользователей к этому файлу.

source: mode
ru: режим

source: Specifies the shutdown mode. <replaceable>mode</replaceable> can be <literal>smart</literal>, <literal>fast</literal>, or <literal>immediate</literal>, or the first letter of one of these three. If this option is omitted, <literal>fast</literal> is the default.
ru: Задаёт режим остановки кластера. Значением <replaceable>режим</replaceable> может быть <literal>smart</literal>, <literal>fast</literal> или <literal>immediate</literal>, либо первая буква этих вариантов. Если этот ключ опущен, по умолчанию выбирается режим <literal>fast</literal>.

source: Specifies options to be passed directly to the <command>postgres</command> command. <option>-o</option> can be specified multiple times, with all the given options being passed through.
ru: Указывает параметры, которые будут передаваться непосредственно программе <command>postgres</command>. Ключ <option>-o</option> можно указывать несколько раз, при этом ей будут переданы параметры из всех ключей.

source: The <replaceable>options</replaceable> should usually be surrounded by single or double quotes to ensure that they are passed through as a group.
ru: Задаваемые <replaceable>параметры</replaceable> обычно следует обрамлять одинарными или двойными кавычками, чтобы они передавались вместе одной группой.

source: Specifies options to be passed directly to the <command>initdb</command> command. <option>-o</option> can be specified multiple times, with all the given options being passed through.
ru: Указывает параметры, которые будут передаваться непосредственно программе <command>initdb</command>. Ключ <option>-o</option> можно указывать несколько раз, при этом ей будут переданы параметры из всех ключей.

source: Specifies the location of the <filename>postgres</filename> executable. By default the <filename>postgres</filename> executable is taken from the same directory as <command>pg_ctl</command>, or failing that, the hard-wired installation directory. It is not necessary to use this option unless you are doing something unusual and get errors that the <filename>postgres</filename> executable was not found.
ru: Указывает размещение исполняемого файла <filename>postgres</filename>. По умолчанию задействуется исполняемый файл <filename>postgres</filename> из того же каталога, из которого запускался <command>pg_ctl</command>, а если это невозможно, из жёстко заданного каталога инсталляции. Применять этот параметр может понадобиться, только если вы делаете что-то необычное или получаете сообщения, что найти исполняемый файл <filename>postgres</filename> не удаётся.

source: In <literal>init</literal> mode, this option analogously specifies the location of the <filename>initdb</filename> executable.
ru: В режиме <literal>init</literal> этот параметр аналогичным образом задаёт размещение исполняемого файла <filename>initdb</filename>.

source: Print only errors, no informational messages.
ru: Выводить лишь ошибки, без сообщений информационного характера.

source: Specifies the maximum number of seconds to wait when waiting for an operation to complete (see option <option>-w</option>). Defaults to the value of the <envar>PGCTLTIMEOUT</envar> environment variable or, if not set, to 60 seconds.
ru: Задаёт максимальное время (в секундах) ожидания завершения операции (см. параметр <option>-w</option>). По умолчанию действует значение переменной среды <envar>PGCTLTIMEOUT</envar> или, если оно не задано, 60 секунд.

source: Print the <application>pg_ctl</application> version and exit.
ru: Выводит версию <application>pg_ctl</application> и прерывает выполнение.

source: Wait for the operation to complete. This is supported for the modes <literal>start</literal>, <literal>stop</literal>, <literal>restart</literal>, <literal>promote</literal>, and <literal>register</literal>, and is the default for those modes.
ru: Ждать завершения операции. Этот режим поддерживается для команд <literal>start</literal>, <literal>stop</literal>, <literal>restart</literal>, <literal>promote</literal> и <literal>register</literal>.

source: When waiting for startup, <command>pg_ctl</command> repeatedly attempts to connect to the server. When waiting for shutdown, <command>pg_ctl</command> waits for the server to remove its <acronym>PID</acronym> file. <command>pg_ctl</command> returns an exit code based on the success of the startup or shutdown.
ru: Ожидая запуска, <command>pg_ctl</command> постоянно пытается подключиться к серверу. Ожидая остановки, <command>pg_ctl</command> ждёт, пока сервер не удалит свой файл <acronym>PID</acronym>. <command>pg_ctl</command> возвращает код завершения, сообщающий о результате запуска или остановки.

source: If the operation does not complete within the timeout (see option <option>-t</option>), then <command>pg_ctl</command> exits with a nonzero exit status. But note that the operation might continue in the background and eventually succeed.
ru: Если операция не заканчивается за отведённое время (см. параметр <option>-t</option>), программа <command>pg_ctl</command> завершается с ненулевым кодом выхода. Но заметьте, что при этом выполнение операции может продолжиться и в конце концов увенчаться успехом.

source: Do not wait for the operation to complete. This is the opposite of the option <option>-w</option>.
ru: Не ждать завершения операции. Этот режим противоположен режиму <option>-w</option>.

source: If waiting is disabled, the requested action is triggered, but there is no feedback about its success. In that case, the server log file or an external monitoring system would have to be used to check the progress and success of the operation.
ru: Если ожидание отключено, запрошенное действие вызывается, но о его результате ничего не известно. В этом случае для проверки текущего состояния и результата операции потребуется обратиться к файлу журнала сервера или воспользоваться внешней системой мониторинга.

source: In prior releases of PostgreSQL, this was the default except for the <literal>stop</literal> mode.
ru: В предыдущих выпусках PostgreSQL этот режим действовал по умолчанию (кроме команды <literal>stop</literal>).

source: Show help about <application>pg_ctl</application> command line arguments, and exit.
ru: Вывести справку по команде <application>pg_ctl</application> и прервать выполнение.

source: If an option is specified that is valid, but not relevant to the selected operating mode, <application>pg_ctl</application> ignores it.
ru: Если некоторый параметр является допустимым, но не применим к выбранному режиму работы, <application>pg_ctl</application> игнорирует его.

source: Options for Windows
ru: Параметры, специфичные для Windows

source: Name of the event source for <application>pg_ctl</application> to use for logging to the event log when running as a Windows service. The default is <literal>PostgreSQL</literal>. Note that this only controls messages sent from <application>pg_ctl</application> itself; once started, the server will use the event source specified by its <xref linkend="guc-event-source"/> parameter. Should the server fail very early in startup, before that parameter has been set, it might also log using the default event source name <literal>PostgreSQL</literal>.
ru: Имя источника событий, с которым <application>pg_ctl</application> будет записывать в системный журнал события при запуске в виде службы Windows. Имя по умолчанию — <literal>PostgreSQL</literal>. Заметьте, что это влияет только на сообщения, которые выдаёт сам <application>pg_ctl</application>; как только сервер запустится, он будет использовать источник событий, заданный в <xref linkend="guc-event-source"/>. Если произойдёт ошибка при запуске сервера на ранней стадии, прежде чем будет считан этот параметр, он может также выдавать сообщения с источником по умолчанию <literal>PostgreSQL</literal>.

source: Name of the system service to register. This name will be used as both the service name and the display name. The default is <literal>PostgreSQL</literal>.
ru: Имя регистрируемой системной службы. Оно станет и собственно именем службы, и отображаемым именем. По умолчанию — <literal>PostgreSQL</literal>.

source: Password for the user to run the service as.
ru: Пароль для пользователя, запускающего службу.

source: start-type
ru: тип-запуска

source: Start type of the system service. <replaceable>start-type</replaceable> can be <literal>auto</literal>, or <literal>demand</literal>, or the first letter of one of these two. If this option is omitted, <literal>auto</literal> is the default.
ru: Тип запуска системной службы. В качестве значения <replaceable>тип-запуска</replaceable> можно задать <literal>auto</literal>, <literal>demand</literal> или первую букву этих слов. По умолчанию выбирается тип <literal>auto</literal>.

source: User name for the user to run the service as. For domain users, use the format <literal>DOMAIN\username</literal>.
ru: Имя пользователя, от имени которого будут запущена служба. Для доменных пользователей используйте формат <literal>DOMAIN\username</literal>.

source: Environment
ru: Переменные окружения

source: Default limit on the number of seconds to wait when waiting for startup or shutdown to complete. If not set, the default is 60 seconds.
ru: Значение по умолчанию для максимального времени ожидания запуска или остановки сервера (в секундах). По умолчанию это время составляет 60 секунд.

source: Default data directory location.
ru: Размещение каталога хранения данных по умолчанию.

source: Most <command>pg_ctl</command> modes require knowing the data directory location; therefore, the <option>-D</option> option is required unless <envar>PGDATA</envar> is set.
ru: Для большинства режимов <command>pg_ctl</command> требуется знать расположение каталога данных; поэтому если не задана переменная <envar>PGDATA</envar>, параметр <option>-D</option> является обязательным.

source: <command>pg_ctl</command>, like most other <productname>PostgreSQL</productname> utilities, also uses the environment variables supported by <application>libpq</application> (see <xref linkend="libpq-envars"/>).
ru: <command>pg_ctl</command>, как и большинство других утилит <productname>PostgreSQL</productname>, также использует переменные окружения, поддерживаемые <application>libpq</application> (см. <xref remap="4" linkend="libpq-envars"/>).

source: For additional variables that affect the server, see <xref linkend="app-postgres"/>.
ru: Список дополнительных переменных, влияющих на работу сервера, можно найти в <xref remap="6" linkend="app-postgres"/>.

source: Files
ru: Файлы

source: <application>pg_ctl</application> examines this file in the data directory to determine whether the server is currently running.
ru: Проверяя этот файл в каталоге данных, <application>pg_ctl</application> определяет, работает ли сервер в настоящий момент.
