Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/postgres-ref.po
Languages: ru

source: Print timing statistics for each query relating to each of the major system modules. This option cannot be used together with the <option>-s</option> option.
ru: Выводит статистику по времени исполнения каждого запроса в контексте каждого системного модуля. Использование флага совместно с <option>-s</option> невозможно.

source: This option is for debugging problems that cause a server process to die abnormally. The ordinary strategy in this situation is to notify all other server processes that they must terminate and then reinitialize the shared memory and semaphores. This is because an errant server process could have corrupted some shared state before terminating. This option specifies that <command>postgres</command> will stop all other server processes by sending the signal <literal>SIGSTOP</literal>, but will not cause them to terminate. This permits system programmers to collect core dumps from all server processes by hand.
ru: Параметр предназначен для отладки сервера в случае аномального завершения процесса. Обычная практика в таком случае — завершение порождённых процессов с дальнейшей инициализацией разделяемой памяти и семафоров. Это связано с тем, что потерянный процесс мог повредить область разделяемой памяти. Параметр указывает <command>postgres</command> на необходимость остановки порождённых процессов сигналом <literal>SIGSTOP</literal>, но не завершит их, что позволяет разработчикам сделать снимки памяти процессов.

source: protocol
ru: протокол

source: Specifies the version number of the frontend/backend protocol to be used for a particular session. This option is for internal use only.
ru: Указывает для данного сеанса версию протокола взаимодействия сервера с клиентом. Флаг используется лишь для внутренних целей.

source: seconds
ru: секунды

source: A delay of this many seconds occurs when a new server process is started, after it conducts the authentication procedure. This is intended to give an opportunity to attach to the server process with a debugger.
ru: При старте сервера производится задержка на указанное количество секунд, после чего производится процедура аутентификации, что позволяет подключить отладчик к процессу.

source: Options for Single-User Mode
ru: Параметры для однопользовательского режима

source: The following options only apply to the single-user mode (see <xref linkend="app-postgres-single-user" endterm="app-postgres-single-user-title"/>).
ru: Следующие параметры применимы только для однопользовательского режима (см. <xref remap="4" linkend="app-postgres-single-user" endterm="app-postgres-single-user-title"/>).

source: Selects the single-user mode. This must be the first argument on the command line.
ru: Устанавливает однопользовательский режим. Параметр должен идти первым в командной строке.

source: database
ru: база_данных

source: Specifies the name of the database to be accessed. This must be the last argument on the command line. If it is omitted it defaults to the user name.
ru: Указывает имя базы данных, к которой производится подключение. Параметр должен идти последним в командной строке. Если не указан, то используется имя текущего системного пользователя.

source: Echo all commands to standard output before executing them.
ru: Выводить все команды в устройство стандартного вывода прежде чем выполнять их.

source: Use semicolon followed by two newlines, rather than just newline, as the command entry terminator.
ru: Считать признаком окончания ввода команды точку с запятой с двумя переводами строки, а не один перевод строки.

source: filename
ru: имя_файла

source: Send all server log output to <replaceable class="parameter">filename</replaceable>. This option is only honored when supplied as a command-line option.
ru: Отправляет вывод журнала сервера в файл <replaceable class="parameter">filename</replaceable>. Этот параметр применяется лишь при запуске из командной строки.

source: Environment
ru: Переменные окружения

source: Default character encoding used by clients. (The clients can override this individually.) This value can also be set in the configuration file.
ru: Кодировка, используемая клиентом по умолчанию. Может переопределяться на стороне клиента, а также устанавливаться в конфигурационном файле сервера.

source: Default data directory location
ru: Каталог размещения данных кластера по умолчанию

source: Default value of the <xref linkend="guc-datestyle"/> run-time parameter. (The use of this environment variable is deprecated.)
ru: Значение по умолчанию для параметра времени исполнения <xref linkend="guc-datestyle"/>. Применение этой переменной является устаревшим.

source: Default port number (preferably set in the configuration file)
ru: Порт по умолчанию, лучше устанавливать в конфигурационном файле.

source: Diagnostics
ru: Диагностика

source: A failure message mentioning <literal>semget</literal> or <literal>shmget</literal> probably indicates you need to configure your kernel to provide adequate shared memory and semaphores. For more discussion see <xref linkend="kernel-resources"/>. You might be able to postpone reconfiguring your kernel by decreasing <xref linkend="guc-shared-buffers"/> to reduce the shared memory consumption of <productname>PostgreSQL</productname>, and/or by reducing <xref linkend="guc-max-connections"/> to reduce the semaphore consumption.
ru: Ошибки с упоминанием о <literal>semget</literal> или <literal>shmget</literal> говорят о возможной необходимости проведения более оптимального конфигурирования ядра. Подробнее это обсуждается в <xref remap="6" linkend="kernel-resources"/>. Отложить переконфигурирование можно, уменьшив <xref linkend="guc-shared-buffers"/> для снижения общего потребления разделяемой памяти <productname>PostgreSQL</productname> и/или уменьшив <xref linkend="guc-max-connections"/> для снижения затрат на использование семафоров.

source: A failure message suggesting that another server is already running should be checked carefully, for example by using the command <screen> <prompt>$</prompt> <userinput>ps ax | grep postgres</userinput> </screen> or <screen> <prompt>$</prompt> <userinput>ps -ef | grep postgres</userinput> </screen> depending on your system. If you are certain that no conflicting server is running, you can remove the lock file mentioned in the message and try again.
ru: Необходимо внимательно проверять сообщения об ошибке с упоминанием о другом запущенном экземпляре, например, с использованием команды <screen> <prompt>$</prompt> <userinput>ps ax | grep postgres</userinput> </screen> или <screen> <prompt>$</prompt> <userinput>ps -ef | grep postgres</userinput> </screen> в зависимости от ОС. Если есть полная уверенность, что противоречий нет, необходимо самостоятельно удалить упомянутый в сообщении запирающий файл и повторить попытку.

source: A failure message indicating inability to bind to a port might indicate that that port is already in use by some non-<productname>PostgreSQL</productname> process. You might also get this error if you terminate <command>postgres</command> and immediately restart it using the same port; in this case, you must simply wait a few seconds until the operating system closes the port before trying again. Finally, you might get this error if you specify a port number that your operating system considers to be reserved. For example, many versions of Unix consider port numbers under 1024 to be <quote>trusted</quote> and only permit the Unix superuser to access them.
ru: Упоминание о невозможности привязки к порту в сообщениях об ошибках может указывать на то, что он уже занят другим процессом помимо <productname>PostgreSQL</productname>. Также сообщение может возникнуть при мгновенном рестарте <command>postgres</command> на том же порту. В этом случае нужно немного подождать, пока ОС не закроет порт, и повторить попытку. Ещё возможна ситуация, в которой используется резервный системный порт. Например, многие Unix-подобные ОС резервируют <quote>доверительные</quote> порты от 1024 и ниже, и лишь суперпользователь имеет к ним доступ.

source: Notes
ru: Замечания

source: The utility command <xref linkend="app-pg-ctl"/> can be used to start and shut down the <command>postgres</command> server safely and comfortably.
ru: Для комфортного запуска и остановки сервера можно использовать утилиту <xref linkend="app-pg-ctl"/>.

source: If at all possible, <emphasis>do not</emphasis> use <literal>SIGKILL</literal> to kill the main <command>postgres</command> server. Doing so will prevent <command>postgres</command> from freeing the system resources (e.g., shared memory and semaphores) that it holds before terminating. This might cause problems for starting a fresh <command>postgres</command> run.
ru: Если возможно, <emphasis>не используйте</emphasis> сигнал <literal>SIGKILL</literal> для головного процесса <command>postgres</command>. В этом случае <command>postgres</command> не освободит системные ресурсы, например, разделяемую память и семафоры. Это может привести к проблемам при повторном запуске <command>postgres</command>.

source: To terminate the <command>postgres</command> server normally, the signals <literal>SIGTERM</literal>, <literal>SIGINT</literal>, or <literal>SIGQUIT</literal> can be used. The first will wait for all clients to terminate before quitting, the second will forcefully disconnect all clients, and the third will quit immediately without proper shutdown, resulting in a recovery run during restart.
ru: Для корректного завершения <command>postgres</command> используются сигналы <literal>SIGTERM</literal>, <literal>SIGINT</literal> или <literal>SIGQUIT</literal>. При первом будут ожидаться все дочерние процессы до их завершения, второй приведёт к принудительному закрытию соединений, а третий — к незамедлительному выходу без корректного завершения, приводящему к необходимости выполнения процедуры восстановления на следующем старте.

source: The <literal>SIGHUP</literal> signal will reload the server configuration files. It is also possible to send <literal>SIGHUP</literal> to an individual server process, but that is usually not sensible.
ru: Получая сигнал <literal>SIGHUP</literal>, сервер перечитывает свои файлы конфигурации. Также возможно отправить <literal>SIGHUP</literal> отдельному процессу, но это чаще всего бессмысленно.

source: To cancel a running query, send the <literal>SIGINT</literal> signal to the process running that command. To terminate a backend process cleanly, send <literal>SIGTERM</literal> to that process. See also <function>pg_cancel_backend</function> and <function>pg_terminate_backend</function> in <xref linkend="functions-admin-signal"/> for the SQL-callable equivalents of these two actions.
ru: Для отмены исполняющегося запроса, отправьте <literal>SIGINT</literal> обслуживающему его процессу. Для чистого завершения серверного процесса отправьте ему <literal>SIGTERM</literal>. Также см. <function>pg_cancel_backend</function> и <function>pg_terminate_backend</function> в <xref remap="6" linkend="functions-admin-signal"/>, которые являются аналогами в форме SQL-инструкций.

source: The <command>postgres</command> server uses <literal>SIGQUIT</literal> to tell subordinate server processes to terminate without normal cleanup. This signal <emphasis>should not</emphasis> be used by users. It is also unwise to send <literal>SIGKILL</literal> to a server process &mdash; the main <command>postgres</command> process will interpret this as a crash and will force all the sibling processes to quit as part of its standard crash-recovery procedure.
ru: Сервер <command>postgres</command> обрабатывает <literal>SIGQUIT</literal> для завершения дочерних процессов в грязную, и сигнал <emphasis>не должен</emphasis> отправляться пользователем. Также не стоит посылать <literal>SIGKILL</literal> серверному процессу &mdash; головной <command>postgres</command> процесс расценит это как аварию и принудительно завершит остальные порождённые, как это было бы сделано при процедуре восстановления после сбоя.

source: Bugs
ru: Ошибки

source: The <option>--</option> options will not work on <systemitem class="osname">FreeBSD</systemitem> or <systemitem class="osname">OpenBSD</systemitem>. Use <option>-c</option> instead. This is a bug in the affected operating systems; a future release of <productname>PostgreSQL</productname> will provide a workaround if this is not fixed.
ru: Флаги, начинающиеся с <option>--</option> не работают в ОС <systemitem class="osname">FreeBSD</systemitem> или <systemitem class="osname">OpenBSD</systemitem>. Чтобы обойти это, используйте <option>-c</option>. Это ошибка ОС. В будущих релизах <productname>PostgreSQL</productname> будет предоставлен обходной путь, если ошибка так и не будет устранена.

source: Single-User Mode
ru: Однопользовательский режим

source: To start a single-user mode server, use a command like <screen> <userinput>postgres --single -D /usr/local/pgsql/data <replaceable>other-options</replaceable> my_database</userinput> </screen> Provide the correct path to the database directory with <option>-D</option>, or make sure that the environment variable <envar>PGDATA</envar> is set. Also specify the name of the particular database you want to work in.
ru: Для запуска сервера в однопользовательском режиме используется, например, команда <screen> <userinput>postgres --single -D /usr/local/pgsql/data <replaceable>другие параметры</replaceable> my_database</userinput> </screen> Необходимо указать корректный путь к каталогу хранения данных в параметре <option>-D</option>, или установить переменную окружения <envar>PGDATA</envar>. Также замените имя базы данных на необходимое.

source: Normally, the single-user mode server treats newline as the command entry terminator; there is no intelligence about semicolons, as there is in <application>psql</application>. To continue a command across multiple lines, you must type backslash just before each newline except the last one. The backslash and adjacent newline are both dropped from the input command. Note that this will happen even when within a string literal or comment.
ru: Обычно перевод строки в однопользовательском режиме сервер воспринимает как завершение ввода команды; точка с запятой не имеет для него такого значения, как для <application>psql</application>. Поэтому, чтобы ввести команду, занимающую несколько строк, необходимо добавлять в конце каждой строки, кроме последней, обратную косую черту. Обратная косая черта и следующий за ней символ перевода строки автоматически убираются из вводимой команды. Заметьте, что это происходит даже внутри строковой константы или комментария.

source: But if you use the <option>-j</option> command line switch, a single newline does not terminate command entry; instead, the sequence semicolon-newline-newline does. That is, type a semicolon immediately followed by a completely empty line. Backslash-newline is not treated specially in this mode. Again, there is no intelligence about such a sequence appearing within a string literal or comment.
ru: Но если применить аргумент командной строки <option>-j</option>, одиночный символ перевода строки не будет завершать ввод команды; это будет делать последовательность &laquo;точка с запятой, перевод строки, перевод строки&raquo;. То есть для завершения команды нужно ввести точку с запятой, и сразу за ней пустую строку. Просто точка с запятой, дополненная переводом строки, в этом режиме не имеет специального значения. Внутри строковых констант и комментариев такая завершающая последовательность воспринимается в том же ключе.

source: In either input mode, if you type a semicolon that is not just before or part of a command entry terminator, it is considered a command separator. When you do type a command entry terminator, the multiple statements you've entered will be executed as a single transaction.
ru: Вне зависимости от режима ввода, символ точки с запятой, введённый не прямо перед или в составе последовательности завершения команды, воспринимается как разделитель команд. После ввода завершающей последовательности введённые с разделителями несколько операторов будут выполняться в одной транзакции.

source: To quit the session, type <acronym>EOF</acronym> (<keycombo action="simul"><keycap>Control</keycap><keycap>D</keycap></keycombo>, usually). If you've entered any text since the last command entry terminator, then <acronym>EOF</acronym> will be taken as a command entry terminator, and another <acronym>EOF</acronym> will be needed to exit.
ru: Для завершения сеанса введите символ конца файла (<acronym>EOF</acronym>, обычно это сочетание <keycombo action="simul"><keycap>Control</keycap><keycap>D</keycap></keycombo>). Если вы вводили текст после окончания ввода последней команды, символ <acronym>EOF</acronym> будет воспринят как символ завершения команды, и для выхода потребуется ещё один <acronym>EOF</acronym>.

source: Note that the single-user mode server does not provide sophisticated line-editing features (no command history, for example). Single-user mode also does not do any background processing, such as automatic checkpoints or replication.
ru: Заметьте, что однопользовательский режим не предоставляет особых возможностей для редактирования команд (например, нет истории команд). Также в однопользовательском режиме не производятся никакие фоновые действия, например, не выполняются автоматические контрольные точки или репликация.

source: Examples
ru: Примеры

source: To start <command>postgres</command> in the background using default values, type: <screen> <prompt>$</prompt> <userinput>nohup postgres &gt;logfile 2&gt;&amp;1 &lt;/dev/null &amp;</userinput> </screen>
ru: Для запуска <command>postgres</command> в фоновом режиме с параметрами по умолчанию: <screen> <prompt>$</prompt> <userinput>nohup postgres &gt;logfile 2&gt;&amp;1 &lt;/dev/null &amp;</userinput> </screen>

source: To start <command>postgres</command> with a specific port, e.g. 1234: <screen> <prompt>$</prompt> <userinput>postgres -p 1234</userinput> </screen> To connect to this server using <application>psql</application>, specify this port with the -p option: <screen> <prompt>$</prompt> <userinput>psql -p 1234</userinput> </screen> or set the environment variable <envar>PGPORT</envar>: <screen> <prompt>$</prompt> <userinput>export PGPORT=1234</userinput> <prompt>$</prompt> <userinput>psql</userinput> </screen>
ru: Для запуска <command>postgres</command> с определённым портом, например, 1234: <screen> <prompt>$</prompt> <userinput>postgres -p 1234</userinput> </screen> Для соединения с помощью <application>psql</application> укажите этот порт в параметре -p: <screen> <prompt>$</prompt> <userinput>psql -p 1234</userinput> </screen> или в переменной окружения <envar>PGPORT</envar>: <screen> <prompt>$</prompt> <userinput>export PGPORT=1234</userinput> <prompt>$</prompt> <userinput>psql</userinput> </screen>

source: Named run-time parameters can be set in either of these styles: <screen> <prompt>$</prompt> <userinput>postgres -c work_mem=1234</userinput> <prompt>$</prompt> <userinput>postgres --work-mem=1234</userinput> </screen> Either form overrides whatever setting might exist for <varname>work_mem</varname> in <filename>postgresql.conf</filename>. Notice that underscores in parameter names can be written as either underscore or dash on the command line. Except for short-term experiments, it's probably better practice to edit the setting in <filename>postgresql.conf</filename> than to rely on a command-line switch to set a parameter.
ru: Именованный параметр времени исполнения можно указать одним из приведённых способом: <screen> <prompt>$</prompt> <userinput>postgres -c work_mem=1234</userinput> <prompt>$</prompt> <userinput>postgres --work-mem=1234</userinput> </screen> Любой из методов переопределяет значение <varname>work_mem</varname> конфигурации <filename>postgresql.conf</filename>. Символ подчёркивания в именах можно указать и в виде тире. Задавать параметры обычно (не считая кратковременных экспериментов) лучше в <filename>postgresql.conf</filename>, а не в аргументах командной строки.

source: See Also
ru: См. также
