Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/postgres-ref.po
Languages: ru

source: Application
ru: Приложение

source: <placeholder-1/> database server
ru: Сервер баз данных <placeholder-1/>

source: option
ru: параметр

source: Description
ru: Описание

source: <command>postgres</command> is the <productname>PostgreSQL</productname> database server. In order for a client application to access a database it connects (over a network or locally) to a running <command>postgres</command> instance. The <command>postgres</command> instance then starts a separate server process to handle the connection.
ru: <command>postgres</command> это сервер баз данных <productname>PostgreSQL</productname>. Для получения доступа к базе данных клиент устанавливает соединение (локально или по сети) с сервером <command>postgres</command>. После установки соединения сервер <command>postgres</command> поднимает выделенный процесс для его обслуживания.

source: One <command>postgres</command> instance always manages the data of exactly one database cluster. A database cluster is a collection of databases that is stored at a common file system location (the <quote>data area</quote>). More than one <command>postgres</command> instance can run on a system at one time, so long as they use different data areas and different communication ports (see below). When <command>postgres</command> starts it needs to know the location of the data area. The location must be specified by the <option>-D</option> option or the <envar>PGDATA</envar> environment variable; there is no default. Typically, <option>-D</option> or <envar>PGDATA</envar> points directly to the data area directory created by <xref linkend="app-initdb"/>. Other possible file layouts are discussed in <xref linkend="runtime-config-file-locations"/>.
ru: Один экземпляр <command>postgres</command> всегда управляет данными ровно одного кластера баз данных. Кластер — это коллекция баз данных, хранящихся в файловой системе в определённом размещении (<quote>области данных</quote>). На одном физическом сервере можно запустить несколько экземпляров <command>postgres</command> одновременно, при условии, что они используют различные области данных и порты. При запуске <command>postgres</command> необходимо указать размещение данных, которое задаётся в параметре <option>-D</option> или переменной окружения <envar>PGDATA</envar>, значение по умолчанию отсутствует. Обычно <option>-D</option> или <envar>PGDATA</envar> указывает на каталог, созданный во время развёртывания кластера с помощью <xref linkend="app-initdb"/>. Иные варианты рассмотрены в <xref remap="6" linkend="runtime-config-file-locations"/>.

source: By default <command>postgres</command> starts in the foreground and prints log messages to the standard error stream. In practical applications <command>postgres</command> should be started as a background process, perhaps at boot time.
ru: По умолчанию <command>postgres</command> запускается не в фоновом режиме, а вывод журнала осуществляет в стандартный поток ошибок. На практике <command>postgres</command> должен запускаться в фоновом режиме, возможно, при старте системы.

source: The <command>postgres</command> command can also be called in single-user mode. The primary use for this mode is during bootstrapping by <xref linkend="app-initdb"/>. Sometimes it is used for debugging or disaster recovery; note that running a single-user server is not truly suitable for debugging the server, since no realistic interprocess communication and locking will happen. When invoked in single-user mode from the shell, the user can enter queries and the results will be printed to the screen, but in a form that is more useful for developers than end users. In the single-user mode, the session user will be set to the user with ID 1, and implicit superuser powers are granted to this user. This user does not actually have to exist, so the single-user mode can be used to manually recover from certain kinds of accidental damage to the system catalogs.
ru: Команду <command>postgres</command> также возможно использовать в однопользовательском режиме. В основном этот режим используется на этапе начальной загрузки при выполнении <xref linkend="app-initdb"/>. Иногда также применяется в целях отладки или после аварийного сбоя. Стоит обратить внимание, что одно-пользовательский режим не совсем корректно использовать для отладки, так как условия далеки от реальных боевых. При запуске из командной строки в однопользовательском режиме можно вводить запросы и видеть результаты их выполнения на экране в форме пригодной для разработки, нежели конечных пользователей. Также в этом режиме ID сессионного пользователя выставляется в единицу, а пользователь неявно наделяется правами суперпользователя. Существование пользователя необязательно, поэтому режим можно использовать в некоторых ситуациях при повреждениях системных каталогов.

source: Options
ru: Параметры

source: <command>postgres</command> accepts the following command-line arguments. For a detailed discussion of the options consult <xref linkend="runtime-config"/>. You can save typing most of these options by setting up a configuration file. Some (safe) options can also be set from the connecting client in an application-dependent way to apply only for that session. For example, if the environment variable <envar>PGOPTIONS</envar> is set, then <application>libpq</application>-based clients will pass that string to the server, which will interpret it as <command>postgres</command> command-line options.
ru: Программа <command>postgres</command> принимает следующие аргументы командной строки. За подробным описанием параметров обратитесь к <xref remap="3" linkend="runtime-config"/>. От необходимости вводить большинство этих параметров можно избавиться, записав их в файл конфигурации. Некоторые (безопасные) параметры можно также задать со стороны подключающегося клиента (в зависимости от приложения), чтобы они применялись только к одному сеансу. Например, если установлена переменная окружения <envar>PGOPTIONS</envar>, клиенты на базе <application>libpq</application> передадут эту строку серверу, который воспримет её как параметры, передаваемые в командной строке <command>postgres</command>.

source: General Purpose
ru: Параметры общего назначения

source: nbuffers
ru: количество-буферов

source: Sets the number of shared buffers for use by the server processes. The default value of this parameter is chosen automatically by <application>initdb</application>. Specifying this option is equivalent to setting the <xref linkend="guc-shared-buffers"/> configuration parameter.
ru: Устанавливает количество разделяемых между процессами буферов. Значение по умолчанию выбирается автоматически при развёртывании кластера с помощью <application>initdb</application>. Установка флага аналогична конфигурации параметра <xref linkend="guc-shared-buffers"/>.

source: name
ru: имя

source: value
ru: значение

source: Sets a named run-time parameter. The configuration parameters supported by <productname>PostgreSQL</productname> are described in <xref linkend="runtime-config"/>. Most of the other command line options are in fact short forms of such a parameter assignment. <option>-c</option> can appear multiple times to set multiple parameters.
ru: Устанавливает заданный параметр времени исполнения. Конфигурационные параметры, поддерживаемые <productname>PostgreSQL</productname>, описаны в <xref remap="6" linkend="runtime-config"/>. Большинство других параметров командной строки на самом деле представляют собой краткие формы такого присвоения значений параметрам. Для установления нескольких параметров <option>-c</option> можно указывать многократно.

source: Prints the value of the named run-time parameter, and exits. (See the <option>-c</option> option above for details.) This can be used on a running server, and returns values from <filename>postgresql.conf</filename>, modified by any parameters supplied in this invocation. It does not reflect parameters supplied when the cluster was started.
ru: Отображает значение заданного параметра времени исполнения и прерывает дальнейшее выполнение (подробнее см. выше). Можно применять на работающем сервере, при этом будут возвращены значения <filename>postgresql.conf</filename> с учётом проведённых в рамках вызова изменений. Значения, переданные при старте кластера, не отображаются.

source: This option is meant for other programs that interact with a server instance, such as <xref linkend="app-pg-ctl"/>, to query configuration parameter values. User-facing applications should instead use <xref linkend="sql-show"/> or the <structname>pg_settings</structname> view.
ru: Параметр предназначен для приложений, взаимодействующих с сервером, например, <xref linkend="app-pg-ctl"/>, и запрашивающих параметры конфигурации. Пользовательские приложения должны использовать команду <xref linkend="sql-show"/> или представление <structname>pg_settings</structname>.

source: debug-level
ru: уровень-отладки

source: Sets the debug level. The higher this value is set, the more debugging output is written to the server log. Values are from 1 to 5. It is also possible to pass <literal>-d 0</literal> for a specific session, which will prevent the server log level of the parent <command>postgres</command> process from being propagated to this session.
ru: Устанавливает уровень отладки (от 1 до 5). Чем выше значение, тем подробнее осуществляется вывод в журнал сервера. Также возможно передать <literal>-d 0</literal> для отдельной сессии, что предотвратит в её рамках влияние выставленного для <command>postgres</command> значения.

source: Specifies the file system location of the database configuration files. See <xref linkend="runtime-config-file-locations"/> for details.
ru: Указывает размещение конфигурационных файлов базы в пределах файловой системы. За подробностями обратитесь к <xref remap="3" linkend="runtime-config-file-locations"/>.

source: Sets the default date style to <quote>European</quote>, that is <literal>DMY</literal> ordering of input date fields. This also causes the day to be printed before the month in certain date output formats. See <xref linkend="datatype-datetime"/> for more information.
ru: Устанавливает формат вводимых дат по умолчанию в <quote>European</quote> с последовательностью значений <literal>DMY</literal>. Также влияет на вывод дня, идущего перед значением месяца, более подробно см. <xref remap="4" linkend="datatype-datetime"/>.

source: Disables <function>fsync</function> calls for improved performance, at the risk of data corruption in the event of a system crash. Specifying this option is equivalent to disabling the <xref linkend="guc-fsync"/> configuration parameter. Read the detailed documentation before using this!
ru: Отключает вызовы <function>fsync</function> для увеличения производительности, но с увеличением рисков потери данных в случае краха системы. Этот параметр работает аналогично параметру конфигурации <xref linkend="guc-fsync"/>. Внимательно прочтите документацию перед использованием данного параметра!

source: hostname
ru: компьютер

source: Specifies the IP host name or address on which <command>postgres</command> is to listen for TCP/IP connections from client applications. The value can also be a comma-separated list of addresses, or <literal>*</literal> to specify listening on all available interfaces. An empty value specifies not listening on any IP addresses, in which case only Unix-domain sockets can be used to connect to the server. Defaults to listening only on <systemitem class="systemname">localhost</systemitem>. Specifying this option is equivalent to setting the <xref linkend="guc-listen-addresses"/> configuration parameter.
ru: Указывает IP-адрес или имя компьютера, на котором сервер <command>postgres</command> принимает клиентские подключения по TCP/IP. Значением может быть список адресов, разделённых запятыми, либо символ <literal>*</literal>, обозначающий все доступные интерфейсы. Если значение опущено, то подключения принимаются только через доменные сокеты Unix. По умолчанию принимаются подключения только к <systemitem class="systemname">localhost</systemitem>. Флаг работает аналогично конфигурационному параметру <xref linkend="guc-listen-addresses"/>.

source: Allows remote clients to connect via TCP/IP (Internet domain) connections. Without this option, only local connections are accepted. This option is equivalent to setting <varname>listen_addresses</varname> to <literal>*</literal> in <filename>postgresql.conf</filename> or via <option>-h</option>.
ru: Позволяет клиентам подключаться по TCP/IP. Без этого параметра допускаются лишь локальные подключения. Действие этого параметра аналогично действию параметра конфигурации <varname>listen_addresses</varname> со значением <literal>*</literal> в <filename>postgresql.conf</filename> или ключа <option>-h</option>.

source: This option is deprecated since it does not allow access to the full functionality of <xref linkend="guc-listen-addresses"/>. It's usually better to set <varname>listen_addresses</varname> directly.
ru: Параметр устарел, так как не даёт полной функциональности <xref linkend="guc-listen-addresses"/>. Лучше устанавливать значение <varname>listen_addresses</varname> напрямую.

source: directory
ru: каталог

source: Specifies the directory of the Unix-domain socket on which <command>postgres</command> is to listen for connections from client applications. The value can also be a comma-separated list of directories. An empty value specifies not listening on any Unix-domain sockets, in which case only TCP/IP sockets can be used to connect to the server. The default value is normally <filename>/tmp</filename>, but that can be changed at build time. Specifying this option is equivalent to setting the <xref linkend="guc-unix-socket-directories"/> configuration parameter.
ru: Указывает каталог нахождения доменного сокета Unix, через который <command>postgres</command> принимает соединения. Значением параметра может быть список каталогов через запятую. Если это значение пустое, использование сокетов Unix запрещается, разрешаются только подключения по TCP/IP. По умолчанию выбирается каталог <filename>/tmp</filename>, но его можно сменить на этапе компиляции. Этот параметр действует аналогично параметру конфигурации <xref linkend="guc-unix-socket-directories"/>.

source: Enables secure connections using <acronym>SSL</acronym>. <productname>PostgreSQL</productname> must have been compiled with support for <acronym>SSL</acronym> for this option to be available. For more information on using <acronym>SSL</acronym>, refer to <xref linkend="ssl-tcp"/>.
ru: Включает поддержку безопасных соединений с использованием <acronym>SSL</acronym> шифрования. <productname>PostgreSQL</productname> необходимо скомпилировать с поддержкой <acronym>SSL</acronym> для использования этого флага. Подробнее использование <acronym>SSL</acronym> описано в <xref linkend="ssl-tcp"/>.

source: max-connections
ru: максимальное количество соединений

source: Sets the maximum number of client connections that this server will accept. The default value of this parameter is chosen automatically by <application>initdb</application>. Specifying this option is equivalent to setting the <xref linkend="guc-max-connections"/> configuration parameter.
ru: Устанавливает максимально возможное количество одновременных клиентских соединений. Значение по умолчанию устанавливается автоматически на этапе развёртывания с помощью <application>initdb</application>. Флаг работает аналогично конфигурационному параметру <xref linkend="guc-max-connections"/>.

source: extra-options
ru: дополнительные-параметры

source: The command-line-style arguments specified in <replaceable class="parameter">extra-options</replaceable> are passed to all server processes started by this <command>postgres</command> process.
ru: Аргументы командной строки, поступившие через <replaceable class="parameter">дополнительные-параметры</replaceable>, передаются всем обслуживающим процессам, запускаемым этим процессом <command>postgres</command>.

source: Spaces within <replaceable class="parameter">extra-options</replaceable> are considered to separate arguments, unless escaped with a backslash (<literal>\</literal>); write <literal>\\</literal> to represent a literal backslash. Multiple arguments can also be specified via multiple uses of <option>-o</option>.
ru: Пробелы в строке <replaceable class="parameter">дополнительные-параметры</replaceable> воспринимаются как разделяющие аргументы, если перед ними нет обратной косой черты (<literal>\</literal>); чтобы представить обратную косую черту буквально, продублируйте её (<literal>\\</literal>). Также можно задать несколько аргументов, используя <option>-o</option> несколько раз.

source: The use of this option is obsolete; all command-line options for server processes can be specified directly on the <command>postgres</command> command line.
ru: Использование этого параметра считается устаревшим, так как на данный момент все параметры <command>postgres</command> можно задать в командной строке.

source: port
ru: порт

source: Specifies the TCP/IP port or local Unix domain socket file extension on which <command>postgres</command> is to listen for connections from client applications. Defaults to the value of the <envar>PGPORT</envar> environment variable, or if <envar>PGPORT</envar> is not set, then defaults to the value established during compilation (normally 5432). If you specify a port other than the default port, then all client applications must specify the same port using either command-line options or <envar>PGPORT</envar>.
ru: Указывает порт TCP/IP или расширение файла Unix-сокета, на котором <command>postgres</command> слушает клиентские соединения. По умолчанию принимает значение переменной окружения <envar>PGPORT</envar>, или, если значение <envar>PGPORT</envar> не установлено, то используется значение, установленное на этапе компиляции (обычно это 5432). Если значение порта меняется, то на стороне клиентов это необходимо учитывать, установив, либо <envar>PGPORT</envar>, либо флаг командной строки.

source: Print time information and other statistics at the end of each command. This is useful for benchmarking or for use in tuning the number of buffers.
ru: Отображает информацию о времени и другую статистику после каждой выполненной команды, что полезно для оценки производительности во время настройки количества буферов.

source: work-mem
ru: рабочая-память

source: Specifies the amount of memory to be used by internal sorts and hashes before resorting to temporary disk files. See the description of the <varname>work_mem</varname> configuration parameter in <xref linkend="runtime-config-resource-memory"/>.
ru: Указывает объём рабочей памяти для внутренних сортировок и хешированных строк во избежание использования временных файлов. Обратитесь к описанию параметра <varname>work_mem</varname>, приведённому в <xref remap="6" linkend="runtime-config-resource-memory"/>.

source: Print the <application>postgres</application> version and exit.
ru: Отображает версию <application>postgres</application> и прерывает дальнейшее выполнение.

source: Sets a named run-time parameter; a shorter form of <option>-c</option>.
ru: Устанавливает заданный параметр времени исполнения. Является короткой формой ключа <option>-c</option>.

source: This option dumps out the server's internal configuration variables, descriptions, and defaults in tab-delimited <command>COPY</command> format. It is designed primarily for use by administration tools.
ru: Выводит значения конфигурационных переменных сервера, их описаний и значений по умолчанию в формате команды <command>COPY</command> со знаком табуляции в качестве разделителя. В основном это предназначено для средств администрирования.

source: Show help about <application>postgres</application> command line arguments, and exit.
ru: Выводит помощь по аргументам команды <application>postgres</application>.

source: Semi-internal Options
ru: Параметры для внутреннего использования

source: The options described here are used mainly for debugging purposes, and in some cases to assist with recovery of severely damaged databases. There should be no reason to use them in a production database setup. They are listed here only for use by <productname>PostgreSQL</productname> system developers. Furthermore, these options might change or be removed in a future release without notice.
ru: Далее описанные параметры, в основном, применяются в целях отладки, а в некоторых случаях при восстановлении сильно повреждённых баз данных. Их описание приведено для системных разработчиков <productname>PostgreSQL</productname>, поэтому они могут быть изменены без уведомления.

source: Forbids the use of particular scan and join methods: <literal>s</literal> and <literal>i</literal> disable sequential and index scans respectively, <literal>o</literal>, <literal>b</literal> and <literal>t</literal> disable index-only scans, bitmap index scans, and TID scans respectively, while <literal>n</literal>, <literal>m</literal>, and <literal>h</literal> disable nested-loop, merge and hash joins respectively.
ru: Запрещает использование специфических методов сканирования и объединения: <literal>s</literal> и <literal>i</literal> выключают последовательное сканирование и по индексу соответственно, а <literal>o</literal>, <literal>b</literal> и <literal>t</literal> выключает сканирование только по индексу, сканирование по битовым векторам, и сканирование по ID кортежей соответственно, в то время как <literal>n</literal>, <literal>m</literal> и <literal>h</literal> выключает вложенные циклы, слияния и хеширование соответственно.

source: Neither sequential scans nor nested-loop joins can be disabled completely; the <literal>-fs</literal> and <literal>-fn</literal> options simply discourage the optimizer from using those plan types if it has any other alternative.
ru: Ни последовательное сканирование, ни вложенные циклы невозможно выключить полностью. Флаги <literal>-fs</literal> и <literal>-fn</literal> просто указывают планировщику избегать выполнения этих операций при наличии других альтернатив.

source: This option is for debugging problems that cause a server process to die abnormally. The ordinary strategy in this situation is to notify all other server processes that they must terminate and then reinitialize the shared memory and semaphores. This is because an errant server process could have corrupted some shared state before terminating. This option specifies that <command>postgres</command> will not reinitialize shared data structures. A knowledgeable system programmer can then use a debugger to examine shared memory and semaphore state.
ru: Параметр предназначен для отладки сервера в случае аномального завершения процесса. Обычная практика в таком случае — завершение порождённых процессов с дальнейшей инициализацией разделяемой памяти и семафоров. Это связано с тем, что потерянный процесс мог повредить область разделяемой памяти. Параметр указывает <command>postgres</command> не производить повторной инициализации общих структур данных, что позволяет произвести дальнейшую отладку текущего состояния памяти и семафоров.

source: Allows the structure of system tables to be modified. This is used by <command>initdb</command>.
ru: Разрешает модифицировать структуру системных таблиц. Используется командой <command>initdb</command>.

source: Ignore system indexes when reading system tables, but still update the indexes when modifying the tables. This is useful when recovering from damaged system indexes.
ru: Игнорировать системные индексы при чтении, но продолжать обновлять их при изменениях системных таблиц. Это используется при их восстановлении после повреждения.
