Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/psql-ref.po
Languages: ru

source: Since colons can legally appear in SQL commands, an apparent attempt at interpolation (that is, <literal>:name</literal>, <literal>:'name'</literal>, or <literal>:"name"</literal>) is not replaced unless the named variable is currently set. In any case, you can escape a colon with a backslash to protect it from substitution.
ru: Так как двоеточие может легально присутствовать в SQL-командах, попытка подстановки (например для <literal>:name</literal>, <literal>:'name'</literal> или <literal>:"name"</literal>) не выполняется, если переменная не установлена. В любом случае, можно экранировать двоеточие с помощью обратной косой черты, чтобы предотвратить подстановку.

source: The colon syntax for variables is standard <acronym>SQL</acronym> for embedded query languages, such as <application>ECPG</application>. The colon syntaxes for array slices and type casts are <productname>PostgreSQL</productname> extensions, which can sometimes conflict with the standard usage. The colon-quote syntax for escaping a variable's value as an SQL literal or identifier is a <application>psql</application> extension.
ru: Использование двоеточия для переменных является стандартом <acronym>SQL</acronym> для встраиваемых языков запросов, таких как <application>ECPG</application>. Использование двоеточия для срезов массивов и приведения типов является расширениями <productname>PostgreSQL</productname>, что иногда может конфликтовать со стандартным использованием. Использование двоеточия и кавычек для экранирования значения переменной при подстановке в качестве SQL литерала или идентификатора — это расширение <application>psql</application>.

source: Prompting
ru: Настройка приглашений

source: The prompts <application>psql</application> issues can be customized to your preference. The three variables <varname>PROMPT1</varname>, <varname>PROMPT2</varname>, and <varname>PROMPT3</varname> contain strings and special escape sequences that describe the appearance of the prompt. Prompt 1 is the normal prompt that is issued when <application>psql</application> requests a new command. Prompt 2 is issued when more input is expected during command entry, for example because the command was not terminated with a semicolon or a quote was not closed. Prompt 3 is issued when you are running an <acronym>SQL</acronym> <command>COPY FROM STDIN</command> command and you need to type in a row value on the terminal.
ru: Приглашения, выдаваемые <application>psql</application>, можно настроить по своему вкусу. Три переменные <varname>PROMPT1</varname>, <varname>PROMPT2</varname> и <varname>PROMPT3</varname> содержат строки и спецпоследовательности, задающие внешний вид приглашения. Приглашение 1 (<varname>PROMPT1</varname>) — это обычное приглашение, которое выдаётся, когда <application>psql</application> ожидает ввода новой команды. Приглашение 2 (<varname>PROMPT2</varname>) выдаётся, когда при вводе команды ожидается дополнительные строки, например потому что команда не была завершена точкой с запятой или не закрыты кавычки. Приглашение 3 (<varname>PROMPT3</varname>) выдаётся при выполнении <acronym>SQL</acronym>-команды <command>COPY FROM STDIN</command>, когда в терминале нужно ввести значение новой строки.

source: The full host name (with domain name) of the database server, or <literal>[local]</literal> if the connection is over a Unix domain socket, or <literal>[local:<replaceable>/dir/name</replaceable>]</literal>, if the Unix domain socket is not at the compiled in default location.
ru: Полное имя компьютера (с именем домена) сервера базы данных или <literal>[local]</literal>, если подключение выполнено через доменный сокет Unix, либо <literal>[local:<replaceable>/dir/name</replaceable>]</literal>, если при компиляции был изменён путь доменного сокета Unix по умолчанию.

source: The host name of the database server, truncated at the first dot, or <literal>[local]</literal> if the connection is over a Unix domain socket.
ru: Имя компьютера, где работает сервер баз данных, усечённое до первой точки или <literal>[local]</literal>, если подключение выполнено через доменный сокет Unix.

source: The port number at which the database server is listening.
ru: Номер порта, который прослушивает сервер базы данных.

source: The database session user name. (The expansion of this value might change during a database session as the result of the command <command>SET SESSION AUTHORIZATION</command>.)
ru: Имя пользователя базы данных для текущей сессии. (Это значение может меняться в течение сессии в результате выполнения команды <command>SET SESSION AUTHORIZATION</command>.)

source: The name of the current database.
ru: Имя текущей базы данных.

source: Like <literal>%/</literal>, but the output is <literal>~</literal> (tilde) if the database is your default database.
ru: Похоже на <literal>%/</literal>, но выводит тильду <literal>~</literal>, если текущая база данных совпадает с базой данных по умолчанию.

source: If the session user is a database superuser, then a <literal>#</literal>, otherwise a <literal>&gt;</literal>. (The expansion of this value might change during a database session as the result of the command <command>SET SESSION AUTHORIZATION</command>.)
ru: Если пользователь текущей сессии является суперпользователем базы данных, то выводит <literal>#</literal>, иначе <literal>&gt;</literal>. (Это значение может меняться в течение сессии в результате выполнения команды <command>SET SESSION AUTHORIZATION</command>.)

source: The process ID of the backend currently connected to.
ru: PID обслуживающего процесса для текущего подключения.

source: In prompt 1 normally <literal>=</literal>, but <literal>@</literal> if the session is in an inactive branch of a conditional block, or <literal>^</literal> if in single-line mode, or <literal>!</literal> if the session is disconnected from the database (which can happen if <command>\connect</command> fails). In prompt 2 <literal>%R</literal> is replaced by a character that depends on why <application>psql</application> expects more input: <literal>-</literal> if the command simply wasn't terminated yet, but <literal>*</literal> if there is an unfinished <literal>/* ... */</literal> comment, a single quote if there is an unfinished quoted string, a double quote if there is an unfinished quoted identifier, a dollar sign if there is an unfinished dollar-quoted string, or <literal>(</literal> if there is an unmatched left parenthesis. In prompt 3 <literal>%R</literal> doesn't produce anything.
ru: В приглашении 1 это обычно символ <literal>=</literal>, но <literal>@</literal>, если сеанс находится в неактивной ветви блока условия, либо <literal>^</literal> в однострочном режиме либо <literal>!</literal>, если сеанс не подключён к базе данных (что возможно при ошибке <command>\connect</command>). В приглашении 2 <literal>%R</literal> заменяется символом, показывающим, почему <application>psql</application> ожидает дополнительный ввод: <literal>-</literal>, если команда просто ещё не была завершена, но <literal>*</literal>, если не завершён комментарий <literal>/* ... */</literal>; апостроф, если не завершена строка в апострофах; кавычки, если не завершён идентификатор в кавычках; знак доллара, если не завершена строка в долларах; либо <literal>(</literal>, если после открывающей скобки не хватает закрывающей. В приглашении 3 <literal>%R</literal> не выдаёт ничего.

source: Transaction status: an empty string when not in a transaction block, or <literal>*</literal> when in a transaction block, or <literal>!</literal> when in a failed transaction block, or <literal>?</literal> when the transaction state is indeterminate (for example, because there is no connection).
ru: Состояние транзакции: пустая строка, если не в транзакционном блоке; <literal>*</literal>, когда в транзакционном блоке; <literal>!</literal>, когда в транзакционном блоке, в котором произошла ошибка и <literal>?</literal>, когда состояние транзакции не определено (например, нет подключения к базе данных).

source: The line number inside the current statement, starting from <literal>1</literal>.
ru: Номер строки в текущем операторе, начиная с <literal>1</literal>.

source: digits
ru: цифры

source: The character with the indicated octal code is substituted.
ru: Подставляется символ с указанным восьмеричным кодом.

source: The value of the <application>psql</application> variable <replaceable class="parameter">name</replaceable>. See the section <xref linkend="app-psql-variables" endterm="app-psql-variables-title"/> for details.
ru: Значение переменной <application>psql</application> <replaceable class="parameter">имя</replaceable>. За подробностями обратитесь к разделу <xref linkend="app-psql-variables" endterm="app-psql-variables-title"/>.

source: The output of <replaceable class="parameter">command</replaceable>, similar to ordinary <quote>back-tick</quote> substitution.
ru: Подставляется вывод команды <replaceable class="parameter">command</replaceable>, как и в обычной подстановке с обратными апострофами.

source: Prompts can contain terminal control characters which, for example, change the color, background, or style of the prompt text, or change the title of the terminal window. In order for the line editing features of <application>Readline</application> to work properly, these non-printing control characters must be designated as invisible by surrounding them with <literal>%[</literal> and <literal>%]</literal>. Multiple pairs of these can occur within the prompt. For example: <placeholder-1/> results in a boldfaced (<literal>1;</literal>) yellow-on-black (<literal>33;40</literal>) prompt on VT100-compatible, color-capable terminals.
ru: Приглашения могут содержать управляющие символы терминала, которые, например, изменяют цвет, фон и стиль текста приглашения или изменяют заголовок окна терминала. Для того, чтобы возможности редактирования <application>Readline</application> работали правильно, непечатаемые символы нужно расположить между <literal>%[</literal> и <literal>%]</literal>, чтобы сделать невидимыми. Можно делать несколько таких включений в приглашение. Например: <placeholder-1/> выдаст жирное (<literal>1;</literal>), желтое на черном (<literal>33;40</literal>) приглашение для VT100 совместимых цветных терминалов.

source: The value of the selected prompt variable is printed literally, except where a percent sign (<literal>%</literal>) is encountered. Depending on the next character, certain other text is substituted instead. Defined substitutions are: <placeholder-1/> To insert a percent sign into your prompt, write <literal>%%</literal>. The default prompts are <literal>'%/%R%# '</literal> for prompts 1 and 2, and <literal>'&gt;&gt; '</literal> for prompt 3.
ru: Значения этих переменных выводятся буквально, за исключением случаев, когда в них встречается знак процента (<literal>%</literal>). В зависимости от следующего символа будет подставляться определённый текст. Существуют следующие подстановки: <placeholder-1/> Чтобы вставить знак процента, нужно написать <literal>%%</literal>. По умолчанию используются значения <literal>'%/%R%# '</literal> для <varname>PROMPT1</varname> и <varname>PROMPT2</varname> и <literal>'&gt;&gt; '</literal> для <varname>PROMPT3</varname>.

source: This feature was shamelessly plagiarized from <application>tcsh</application>.
ru: Эта функциональность была бессовестно списана с <application>tcsh</application>.

source: Command-Line Editing
ru: Редактирование командной строки

source: <application>psql</application> supports the <application>Readline</application> library for convenient line editing and retrieval. The command history is automatically saved when <application>psql</application> exits and is reloaded when <application>psql</application> starts up. Tab-completion is also supported, although the completion logic makes no claim to be an <acronym>SQL</acronym> parser. The queries generated by tab-completion can also interfere with other SQL commands, e.g. <literal>SET TRANSACTION ISOLATION LEVEL</literal>. If for some reason you do not like the tab completion, you can turn it off by putting this in a file named <filename>.inputrc</filename> in your home directory: <placeholder-1/> (This is not a <application>psql</application> but a <application>Readline</application> feature. Read its documentation for further details.)
ru: <application>psql</application> поддерживает библиотеку <application>Readline</application> для удобного редактирования командной строки. История команд автоматически сохраняется при выходе из <application>psql</application> и загружается при запуске. Завершение клавишей <literal>TAB</literal> также поддерживается, хотя логика завершения не претендует на роль анализатора <acronym>SQL</acronym>. Запросы, генерируемые завершением по <literal>TAB</literal>, также могут конфликтовать с другими командами SQL, например <literal>SET TRANSACTION ISOLATION LEVEL</literal>. Если по какой-либо причине вам не нравится завершение по клавише <literal>TAB</literal>, его можно отключить в файле <filename>.inputrc</filename> в вашем домашнем каталоге: <placeholder-1/> (Это возможность не <application>psql</application>, а <application>Readline</application>. Читайте документацию к <application>Readline</application> для дополнительной информации.)

source: Environment
ru: Переменные окружения

source: If <literal>\pset columns</literal> is zero, controls the width for the <literal>wrapped</literal> format and width for determining if wide output requires the pager or should be switched to the vertical format in expanded auto mode.
ru: Если <literal>\pset columns</literal> равно нулю, управляет шириной формата вывода <literal>wrapped</literal>, а также определяет, нужно ли использовать постраничник и нужно ли переключаться в вертикальный формат в режиме <literal>expanded auto</literal>.

source: If the query results do not fit on the screen, they are piped through this command. Typical values are <literal>more</literal> or <literal>less</literal>. The default is platform-dependent. Use of the pager can be disabled by setting <envar>PAGER</envar> to empty, or by using pager-related options of the <command>\pset</command> command.
ru: Если результат запроса не помещается на экране, он пропускается через эту программу. Обычно это <literal>more</literal> или <literal>less</literal>. Значение по умолчанию зависит от платформы. От использования постраничника можно отказаться, очистив переменную <envar>PAGER</envar> или установив соответствующие параметры с помощью команды <command>\pset</command>.

source: Default connection parameters (see <xref linkend="libpq-envars"/>).
ru: Параметры подключения по умолчанию (см. <xref remap="4" linkend="libpq-envars"/>).

source: Editor used by the <command>\e</command>, <command>\ef</command>, and <command>\ev</command> commands. These variables are examined in the order listed; the first that is set is used.
ru: Редактор, используемый командами <command>\e</command>, <command>\ef</command> и <command>\ev</command>. Эти переменные рассматриваются в этом же порядке; в силу вступает значение, установленное первым.

source: The built-in default editors are <filename>vi</filename> on Unix systems and <filename>notepad.exe</filename> on Windows systems.
ru: По умолчанию в Unix-подобных системах используется <filename>vi</filename>, а в Windows — <filename>notepad.exe</filename>.

source: When <command>\e</command>, <command>\ef</command>, or <command>\ev</command> is used with a line number argument, this variable specifies the command-line argument used to pass the starting line number to the user's editor. For editors such as <productname>Emacs</productname> or <productname>vi</productname>, this is a plus sign. Include a trailing space in the value of the variable if there needs to be space between the option name and the line number. Examples: <placeholder-1/>
ru: Если в командах <command>\e</command>, <command>\ef</command> или <command>\ev</command> указан номер строки, эта переменная задаёт аргумент командной строки, с которым номер строки может быть передан в редактор. Например, для редакторов <productname>Emacs</productname> и <productname>vi</productname> это знак плюс. Добавьте в конец значения пробел, если он требуется для отделения имени аргумента от номера строки. Примеры: <placeholder-1/>

source: The default is <literal>+</literal> on Unix systems (corresponding to the default editor <filename>vi</filename>, and useful for many other common editors); but there is no default on Windows systems.
ru: Значение по умолчанию <literal>+</literal> в Unix-подобных системах (соответствует редактору по умолчанию <filename>vi</filename> и многим другим распространённым редакторам). На платформе Windows нет значения по умолчанию.

source: Alternative location for the command history file. Tilde (<literal>~</literal>) expansion is performed.
ru: Альтернативное расположение файла с историей команд. Допускается использование тильды (<literal>~</literal>).

source: Alternative location of the user's <filename>.psqlrc</filename> file. Tilde (<literal>~</literal>) expansion is performed.
ru: Альтернативное расположение пользовательского файла <filename>.psqlrc</filename>. Допускается использование тильды (<literal>~</literal>).

source: Command executed by the <command>\!</command> command.
ru: Команда операционной системы, выполняемая метакомандой <command>\!</command>.

source: Directory for storing temporary files. The default is <filename>/tmp</filename>.
ru: Каталог для хранения временных файлов. По умолчанию <filename>/tmp</filename>.

source: This utility, like most other <productname>PostgreSQL</productname> utilities, also uses the environment variables supported by <application>libpq</application> (see <xref linkend="libpq-envars"/>).
ru: Эта утилита, как и большинство других утилит <productname>PostgreSQL</productname>, также использует переменные среды, поддерживаемые <application>libpq</application> (см. <xref remap="4" linkend="libpq-envars"/>).

source: Files
ru: Файлы

source: <filename>psqlrc</filename> and <filename>~/.psqlrc</filename>
ru: <filename>psqlrc</filename> и <filename>~/.psqlrc</filename>

source: Unless it is passed an <option>-X</option> option, <application>psql</application> attempts to read and execute commands from the system-wide startup file (<filename>psqlrc</filename>) and then the user's personal startup file (<filename>~/.psqlrc</filename>), after connecting to the database but before accepting normal commands. These files can be used to set up the client and/or the server to taste, typically with <command>\set</command> and <command>SET</command> commands.
ru: При запуске без параметра <option>-X</option> программа <application>psql</application> пытается считать и выполнить команды из общесистемного стартового файла (<filename>psqlrc</filename>), а затем из персонального стартового файла пользователя (<filename>~/.psqlrc</filename>), после подключения к базе данных, но перед получением обычных команд. Этими файлами можно воспользоваться для настройки клиента и/или сервера, как правило, с помощью команд <command>\set</command> и <command>SET</command>.

source: The system-wide startup file is named <filename>psqlrc</filename> and is sought in the installation's <quote>system configuration</quote> directory, which is most reliably identified by running <literal>pg_config --sysconfdir</literal>. By default this directory will be <filename>../etc/</filename> relative to the directory containing the <productname>PostgreSQL</productname> executables. The name of this directory can be set explicitly via the <envar>PGSYSCONFDIR</envar> environment variable.
ru: Общесистемный стартовый файл называется <filename>psqlrc</filename>, он будет искаться в каталоге установки <quote>конфигурация системы</quote>. Для того чтобы узнать этот каталог, надёжнее всего выполнить команду <literal>pg_config --sysconfdir</literal>. По умолчанию он расположен в <filename>../etc/</filename> относительно каталога, содержащего исполняемые файлы <productname>PostgreSQL</productname>. Имя этого каталога можно задать явно через переменную окружения <envar>PGSYSCONFDIR</envar>.

source: The user's personal startup file is named <filename>.psqlrc</filename> and is sought in the invoking user's home directory. On Windows, which lacks such a concept, the personal startup file is named <filename>%APPDATA%\postgresql\psqlrc.conf</filename>. The location of the user's startup file can be set explicitly via the <envar>PSQLRC</envar> environment variable.
ru: Персональный стартовый файл пользователя называется <filename>.psqlrc</filename>, он будет искаться в домашнем каталоге вызывающего пользователя. В Windows, где отсутствует такое понятие, персональный стартовый файл называется <filename>%APPDATA%\postgresql\psqlrc.conf</filename>. Расположение персонального стартового файла пользователя можно задать явно через переменную окружения <envar>PSQLRC</envar>.

source: Both the system-wide startup file and the user's personal startup file can be made <application>psql</application>-version-specific by appending a dash and the <productname>PostgreSQL</productname> major or minor release number to the file name, for example <filename>~/.psqlrc-9.2</filename> or <filename>~/.psqlrc-9.2.5</filename>. The most specific version-matching file will be read in preference to a non-version-specific file.
ru: Оба стартовых файла, общесистемный и персональный, можно привязать к конкретной версии <application>psql</application>. Для этого в конце имени файла нужно добавить номер основного или корректирующего релиза <productname>PostgreSQL</productname>, например <filename>~/.psqlrc-9.2</filename> или <filename>~/.psqlrc-9.2.5</filename>. При наличии нескольких файлов, файл с более детальным номером версии будет иметь предпочтение.

source: The command-line history is stored in the file <filename>~/.psql_history</filename>, or <filename>%APPDATA%\postgresql\psql_history</filename> on Windows.
ru: История командной строки хранится в файле <filename>~/.psql_history</filename> или <filename>%APPDATA%\postgresql\psql_history</filename> на Windows.

source: The location of the history file can be set explicitly via the <varname>HISTFILE</varname> <application>psql</application> variable or the <envar>PSQL_HISTORY</envar> environment variable.
ru: Расположение файла истории можно задать явно через переменную <application>psql</application> <varname>HISTFILE</varname> или через переменную окружения <envar>PSQL_HISTORY</envar>.

source: Notes
ru: Замечания

source: <application>psql</application> works best with servers of the same or an older major version. Backslash commands are particularly likely to fail if the server is of a newer version than <application>psql</application> itself. However, backslash commands of the <literal>\d</literal> family should work with servers of versions back to 7.4, though not necessarily with servers newer than <application>psql</application> itself. The general functionality of running SQL commands and displaying query results should also work with servers of a newer major version, but this cannot be guaranteed in all cases.
ru: <application>psql</application> лучше всего работает с серверами той же или более старой основной версии. Сбой метакоманды наиболее вероятен, если версия сервера новее, чем версия <application>psql</application>. Однако, команды семейства <literal>\d</literal> должны работать с версиями сервера до 7.4, хотя и необязательно с серверами новее, чем сам <application>psql</application>. Общая функциональность запуска SQL-команд и отображения результатов запросов также должна работать на серверах с более новой основной версией, но это не гарантируется во всех случаях.
