Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/psql-ref.po
Languages: ru

source: Application
ru: Приложение

source: <placeholder-1/> interactive terminal
ru: интерактивный терминал <placeholder-1/>

source: option
ru: параметр

source: dbname
ru: имя_бд

source: username
ru: имя_пользователя

source: Description
ru: Описание

source: <application>psql</application> is a terminal-based front-end to <productname>PostgreSQL</productname>. It enables you to type in queries interactively, issue them to <productname>PostgreSQL</productname>, and see the query results. Alternatively, input can be from a file or from command line arguments. In addition, <application>psql</application> provides a number of meta-commands and various shell-like features to facilitate writing scripts and automating a wide variety of tasks.
ru: Программа <application>psql</application> — это терминальный клиент для работы с <productname>PostgreSQL</productname>. Она позволяет интерактивно вводить запросы, передавать их в <productname>PostgreSQL</productname> и видеть результаты. Также запросы могут быть получены из файла или из аргументов командной строки. Кроме того, <application>psql</application> предоставляет ряд метакоманд и различные возможности, подобные тем, что имеются у командных оболочек, для облегчения написания скриптов и автоматизации широкого спектра задач.

source: Options
ru: Параметры

source: Print all nonempty input lines to standard output as they are read. (This does not apply to lines read interactively.) This is equivalent to setting the variable <varname>ECHO</varname> to <literal>all</literal>.
ru: Отправляет на стандартный вывод все непустые входные строки по мере их чтения. (Это не относится к строкам, считанным в интерактивном режиме.) Эквивалентно установке переменной <varname>ECHO</varname> в значение <literal>all</literal>.

source: Switches to unaligned output mode. (The default output mode is otherwise aligned.) This is equivalent to <command>\pset format unaligned</command>.
ru: Переключение на невыровненный режим вывода. (По умолчанию, наоборот, используется выровненный режим вывода.) Равнозначно команде <command>\pset format unaligned</command>.

source: Switches to unaligned output mode. (The default output mode is otherwise aligned.)
ru: Переключение на невыровненный режим вывода. (По умолчанию, наоборот, используется выровненный режим вывода.)

source: Print failed SQL commands to standard error output. This is equivalent to setting the variable <varname>ECHO</varname> to <literal>errors</literal>.
ru: Посылает все команды SQL с ошибками на стандартный вывод. Равнозначно присвоению переменной <varname>ECHO</varname> значения <literal>errors</literal>.

source: command
ru: команда

source: Specifies that <application>psql</application> is to execute the given command string, <replaceable class="parameter">command</replaceable>. This option can be repeated and combined in any order with the <option>-f</option> option. When either <option>-c</option> or <option>-f</option> is specified, <application>psql</application> does not read commands from standard input; instead it terminates after processing all the <option>-c</option> and <option>-f</option> options in sequence.
ru: Передаёт <application>psql</application> <replaceable class="parameter">команду</replaceable> для выполнения. Этот ключ можно повторять и комбинировать в любом порядке с ключом <option>-f</option>. Когда указывается <option>-c</option> или <option>-f</option>, <application>psql</application> не читает команды со стандартного ввода; вместо этого она завершается сразу после обработки всех ключей <option>-c</option> и <option>-f</option> по порядку.

source: <replaceable class="parameter">command</replaceable> must be either a command string that is completely parsable by the server (i.e., it contains no <application>psql</application>-specific features), or a single backslash command. Thus you cannot mix <acronym>SQL</acronym> and <application>psql</application> meta-commands within a <option>-c</option> option. To achieve that, you could use repeated <option>-c</option> options or pipe the string into <application>psql</application>, for example: <placeholder-1/> or <placeholder-2/> (<literal>\\</literal> is the separator meta-command.)
ru: Заданная <replaceable class="parameter">команда</replaceable> должна быть либо командной строкой, которая полностью интерпретируется сервером (т. е. не использует специфические функции <application>psql</application>), либо одиночной командой с обратной косой чертой. Таким образом, используя <option>-c</option>, нельзя смешивать метакоманды <acronym>SQL</acronym> и <application>psql</application>. Но это можно сделать, передав несколько ключей <option>-c</option> или передав строку в <application>psql</application> через канал: <placeholder-1/> или <placeholder-2/> (<literal>\\</literal> — разделитель метакоманд.)

source: Each <acronym>SQL</acronym> command string passed to <option>-c</option> is sent to the server as a single query. Because of this, the server executes it as a single transaction even if the string contains multiple <acronym>SQL</acronym> commands, unless there are explicit <command>BEGIN</command>/<command>COMMIT</command> commands included in the string to divide it into multiple transactions. Also, <application>psql</application> only prints the result of the last <acronym>SQL</acronym> command in the string. This is different from the behavior when the same string is read from a file or fed to <application>psql</application>'s standard input, because then <application>psql</application> sends each <acronym>SQL</acronym> command separately.
ru: Каждая строка <acronym>SQL</acronym>-команд, заданная ключом <option>-c</option>, передаётся на сервер как один запрос. Поэтому сервер выполняет её в одной транзакции, даже когда эта строка содержит несколько команд <acronym>SQL</acronym>, если только в ней не содержатся явные команды <command>BEGIN</command>/<command>COMMIT</command>, разделяющие её на несколько транзакций. Кроме того, <application>psql</application> печатает результат только последней <acronym>SQL</acronym>-команды в строке. Это отличается от того поведения, когда та же строка считывается из файла или подаётся на стандартный ввод <application>psql</application>, так как в последнем случае <application>psql</application> передаёт каждую команду <acronym>SQL</acronym> отдельно.

source: Because of this behavior, putting more than one command in a single <option>-c</option> string often has unexpected results. It's better to use repeated <option>-c</option> commands or feed multiple commands to <application>psql</application>'s standard input, either using <application>echo</application> as illustrated above, or via a shell here-document, for example: <placeholder-1/>
ru: Из-за такого поведения указание нескольких команд в одной строке <option>-c</option> часто приводит к неожиданным результатам. Поэтому лучше использовать несколько ключей <option>-c</option> или подавать команды на стандартный ввод <application>psql</application>, применяя либо <application>echo</application>, как показано выше, либо создаваемый прямо в оболочке документ, например: <placeholder-1/>

source: Specifies the name of the database to connect to. This is equivalent to specifying <replaceable class="parameter">dbname</replaceable> as the first non-option argument on the command line.
ru: Указывает имя базы данных для подключения. Эквивалентно указанию <replaceable class="parameter">dbname</replaceable> в качестве первого аргумента, не являющегося параметром в командной строке.

source: If this parameter contains an <symbol>=</symbol> sign or starts with a valid <acronym>URI</acronym> prefix (<literal>postgresql://</literal> or <literal>postgres://</literal>), it is treated as a <parameter>conninfo</parameter> string. See <xref linkend="libpq-connstring"/> for more information.
ru: Если этот параметр содержит знак <symbol>=</symbol> или начинается с допустимого префикса <acronym>URI</acronym> (<literal>postgresql://</literal> или <literal>postgres://</literal>), он воспринимается как строка <parameter>conninfo</parameter>. За дополнительными сведениями обратитесь к <xref remap="3" linkend="libpq-connstring"/>.

source: Copy all SQL commands sent to the server to standard output as well. This is equivalent to setting the variable <varname>ECHO</varname> to <literal>queries</literal>.
ru: Посылает все команды SQL, отправленные на сервер, ещё и на стандартный вывод. Эквивалентно установке переменной <varname>ECHO</varname> в значение <literal>queries</literal>.

source: Echo the actual queries generated by <command>\d</command> and other backslash commands. You can use this to study <application>psql</application>'s internal operations. This is equivalent to setting the variable <varname>ECHO_HIDDEN</varname> to <literal>on</literal>.
ru: Отображает фактические запросы, генерируемые <command>\d</command> и другими командами, начинающимися с \. Это можно использовать для изучения внутренних операций в <application>psql</application>. Эквивалентно установке переменной <varname>ECHO_HIDDEN</varname> значения <literal>on</literal>.

source: filename
ru: имя_файла

source: Read commands from the file <replaceable class="parameter">filename</replaceable>, rather than standard input. This option can be repeated and combined in any order with the <option>-c</option> option. When either <option>-c</option> or <option>-f</option> is specified, <application>psql</application> does not read commands from standard input; instead it terminates after processing all the <option>-c</option> and <option>-f</option> options in sequence. Except for that, this option is largely equivalent to the meta-command <command>\i</command>.
ru: Читает команды из файла <replaceable class="parameter">имя_файла</replaceable>, а не из стандартного ввода. Этот ключ можно повторять и комбинировать в любом порядке с ключом <option>-c</option>. Если указан ключ <option>-c</option> или <option>-f</option>, программа <application>psql</application> не читает команды со стандартного ввода; вместо этого она завершается после обработки всех ключей <option>-c</option> и <option>-f</option> по очереди. Не считая этого, данный ключ по большому счёту равнозначен метакоманде <command>\i</command>.

source: If <replaceable>filename</replaceable> is <literal>-</literal> (hyphen), then standard input is read until an EOF indication or <command>\q</command> meta-command. This can be used to intersperse interactive input with input from files. Note however that Readline is not used in this case (much as if <option>-n</option> had been specified).
ru: Если <replaceable>имя_файла</replaceable> задано символом <literal>-</literal> (минус), считывается стандартный ввод до признака конца файла или до метакоманды <command>\q</command>. Это позволяет перемежать интерактивный ввод с вводом из файлов. Однако заметьте, что Readline в этом случае не применяется (так же, как и с ключом <option>-n</option>).

source: Using this option is subtly different from writing <literal>psql &lt; <replaceable class="parameter">filename</replaceable></literal>. In general, both will do what you expect, but using <literal>-f</literal> enables some nice features such as error messages with line numbers. There is also a slight chance that using this option will reduce the start-up overhead. On the other hand, the variant using the shell's input redirection is (in theory) guaranteed to yield exactly the same output you would have received had you entered everything by hand.
ru: Использование этого параметра немного отличается от <literal>psql &lt; <replaceable class="parameter">filename</replaceable></literal>. В основном, оба варианта будут делать то, что вы ожидаете, но с <literal>-f</literal> доступны некоторые полезные свойства, такие как сообщения об ошибках с номерами строк. Также есть небольшая вероятность, что запуск в таком режиме будет быстрее. С другой стороны, вариант с перенаправлением ввода из командного интерпретатора (в теории) гарантирует получение точно такого же вывода, какой вы получили бы, если бы ввели всё вручную.

source: Use <replaceable class="parameter">separator</replaceable> as the field separator for unaligned output. This is equivalent to <command>\pset fieldsep</command> or <command>\f</command>.
ru: Использование <replaceable class="parameter">separator</replaceable> в качестве разделителя полей при невыровненном режиме вывода. Эквивалентно <command>\pset fieldsep</command> или <command>\f</command>.

source: hostname
ru: компьютер

source: Specifies the host name of the machine on which the server is running. If the value begins with a slash, it is used as the directory for the Unix-domain socket.
ru: Указывает имя компьютера, на котором запущен сервер. Если значение начинается с косой черты, оно интерпретируется как имя каталога с доменным сокетом Unix.

source: Turn on <acronym>HTML</acronym> tabular output. This is equivalent to <literal>\pset format html</literal> or the <command>\H</command> command.
ru: Включает табличный вывод в формате <acronym>HTML</acronym>. Эквивалентно <literal>\pset format html</literal> или команде <command>\H</command>.

source: List all available databases, then exit. Other non-connection options are ignored. This is similar to the meta-command <command>\list</command>.
ru: Выводит список всех доступных баз данных и завершает работу. Другие параметры, не связанные с соединением, игнорируются. Это похоже на метакоманду <command>\list</command>.

source: Write all query output into file <replaceable class="parameter">filename</replaceable>, in addition to the normal output destination.
ru: В дополнение к обычному выводу, записывает вывод результатов всех запросов в файл <replaceable class="parameter">filename</replaceable>.

source: Do not use <application>Readline</application> for line editing and do not use the command history. This can be useful to turn off tab expansion when cutting and pasting.
ru: Отключает использование <application>Readline</application> для редактирования командной строки и использования истории команд. Может быть полезно для выключения расширенных действий клавиши табуляции при вырезании и вставке.

source: Put all query output into file <replaceable class="parameter">filename</replaceable>. This is equivalent to the command <command>\o</command>.
ru: Записывает вывод результатов всех запросов в файл <replaceable class="parameter">filename</replaceable>. Эквивалентно команде <command>\o</command>.

source: port
ru: порт

source: Specifies the TCP port or the local Unix-domain socket file extension on which the server is listening for connections. Defaults to the value of the <envar>PGPORT</envar> environment variable or, if not set, to the port specified at compile time, usually 5432.
ru: Задаёт TCP-порт или файл локального доменного сокета Unix, через который сервер принимает подключения. Значение по умолчанию определяется переменной среды <envar>PGPORT</envar>, а если она не установлена, выбирается порт, указанный при компиляции, обычно 5432.

source: Specifies printing options, in the style of <command>\pset</command>. Note that here you have to separate name and value with an equal sign instead of a space. For example, to set the output format to <application>LaTeX</application>, you could write <literal>-P format=latex</literal>.
ru: Задаёт параметры печати, в стиле команды <command>\pset</command>. Обратите внимание, что имя параметра и значение разделяются знаком равенства, а не пробела. Например, чтобы установить формат вывода в <application>LaTeX</application>, нужно написать <literal>-P format=latex</literal>.

source: Specifies that <application>psql</application> should do its work quietly. By default, it prints welcome messages and various informational output. If this option is used, none of this happens. This is useful with the <option>-c</option> option. This is equivalent to setting the variable <varname>QUIET</varname> to <literal>on</literal>.
ru: Указывает, что <application>psql</application> должен работать без вывода дополнительных сообщений. По умолчанию, выводятся приветствия и различные информационные сообщения. Этого не произойдёт с использованием данного параметра. Полезно вместе с параметром <option>-c</option>. Этот же эффект можно получить, установив для переменной <varname>QUIET</varname> значение <literal>on</literal>.

source: Use <replaceable class="parameter">separator</replaceable> as the record separator for unaligned output. This is equivalent to <command>\pset recordsep</command>.
ru: Использовать <replaceable class="parameter">разделитель</replaceable> как разделитель записей при невыровненном режиме вывода. Равнозначно команде <command>\pset recordsep</command>.

source: Run in single-step mode. That means the user is prompted before each command is sent to the server, with the option to cancel execution as well. Use this to debug scripts.
ru: Запуск в пошаговом режиме. Это означает, что пользователь будет подтверждать выполнение каждой команды, отправляемой на сервер, с возможностью отменить выполнение. Используется для отладки скриптов.

source: Runs in single-line mode where a newline terminates an SQL command, as a semicolon does.
ru: Запуск в однострочном режиме, при котором символ новой строки завершает SQL-команды, также как это делает точка с запятой.

source: This mode is provided for those who insist on it, but you are not necessarily encouraged to use it. In particular, if you mix <acronym>SQL</acronym> and meta-commands on a line the order of execution might not always be clear to the inexperienced user.
ru: Этот режим реализован для тех, кому он нужен, но это не обязательно означает, что и вам нужно его использовать. В частности, если смешивать в одной строке команды <acronym>SQL</acronym> и метакоманды, порядок их выполнения может быть не всегда понятен для неопытного пользователя.

source: Turn off printing of column names and result row count footers, etc. This is equivalent to <command>\t</command> or <command>\pset tuples_only</command>.
ru: Отключает вывод имён столбцов и результирующей строки с количеством выбранных записей. Равнозначно команде <command>\t</command> или <command>\pset tuples_only</command>.

source: Specifies options to be placed within the <acronym>HTML</acronym> <sgmltag>table</sgmltag> tag. See <command>\pset tableattr</command> for details.
ru: Задаёт атрибуты, которые будут вставлены в тег <acronym>HTML</acronym> <sgmltag>table</sgmltag>. За подробностями обратитесь к описанию <command>\pset tableattr</command>.

source: Connect to the database as the user <replaceable class="parameter">username</replaceable> instead of the default. (You must have permission to do so, of course.)
ru: Подключение к базе данных под пользователем <replaceable class="parameter">username</replaceable> вместо используемого по умолчанию. (Разумеется, при наличии прав на это.)

source: Perform a variable assignment, like the <command>\set</command> meta-command. Note that you must separate name and value, if any, by an equal sign on the command line. To unset a variable, leave off the equal sign. To set a variable with an empty value, use the equal sign but leave off the value. These assignments are done during command line processing, so variables that reflect connection state will get overwritten later.
ru: Выполняет присвоение значения переменной, как метакоманда <command>\set</command>. Обратите внимание, что необходимо разделить имя переменной и значение (при наличии) знаком равенства в командной строке. Чтобы сбросить переменную, оставьте имя переменной без знака равенства. Чтобы установить пустое значение, добавьте знак равенства, но опустите значение. Эти присваивания выполняются во время обработки командной строки, так что переменные, отражающие состояние соединения, будут перезаписаны позже.

source: Print the <application>psql</application> version and exit.
ru: Выводит версию <application>psql</application> и завершает работу.

source: Never issue a password prompt. If the server requires password authentication and a password is not available by other means such as a <filename>.pgpass</filename> file, the connection attempt will fail. This option can be useful in batch jobs and scripts where no user is present to enter a password.
ru: Не выдавать запрос на ввод пароля. Если сервер требует аутентификацию по паролю и пароль не доступен с помощью других средств, таких как файл <filename>.pgpass</filename>, попытка соединения не удастся. Этот параметр может быть полезен в пакетных заданиях и скриптах, где нет пользователя, который вводит пароль.

source: Note that this option will remain set for the entire session, and so it affects uses of the meta-command <command>\connect</command> as well as the initial connection attempt.
ru: Обратите внимание, что этот параметр действует на протяжении всей сессии и, таким образом, влияет на метакоманду <command>\connect</command>, также как и на первую попытку соединения.

source: Force <application>psql</application> to prompt for a password before connecting to a database.
ru: Принудительно запрашивать пароль перед подключением к базе данных.

source: This option is never essential, since <application>psql</application> will automatically prompt for a password if the server demands password authentication. However, <application>psql</application> will waste a connection attempt finding out that the server wants a password. In some cases it is worth typing <option>-W</option> to avoid the extra connection attempt.
ru: Это несущественный параметр, так как <application>psql</application> запрашивает пароль автоматически, если сервер проверяет подлинность по паролю. Однако, чтобы понять это, <application>psql</application> лишний раз подключается к серверу. Поэтому иногда имеет смысл ввести <option>-W</option>, чтобы исключить эту ненужную попытку подключения.

source: Turn on the expanded table formatting mode. This is equivalent to <command>\x</command> or <command>\pset expanded</command>.
ru: Включает режим развёрнутого вывода таблицы. Равнозначно команде <command>\x</command> или <command>\pset expanded</command>.

source: Do not read the start-up file (neither the system-wide <filename>psqlrc</filename> file nor the user's <filename>~/.psqlrc</filename> file).
ru: Не читать стартовые файлы (ни общесистемный файл <filename>psqlrc</filename>, ни пользовательский файл <filename>~/.psqlrc</filename>).

source: Set the field separator for unaligned output to a zero byte. This is equvalent to <command>\pset fieldsep_zero</command>.
ru: Установить нулевой байт в качестве разделителя полей для невыровненного режима вывода. Равнозначно команде <command>\pset fieldsep_zero</command>.

source: Set the record separator for unaligned output to a zero byte. This is useful for interfacing, for example, with <literal>xargs -0</literal>. This is equivalent to <command>\pset recordsep_zero</command>.
ru: Установить нулевой байт в качестве разделителя записей для невыровненного режима вывода. Это полезно при взаимодействии с другими программами, например, с <literal>xargs -0</literal>. Равнозначно команде <command>\pset recordsep_zero</command>.
