Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/psql-ref.po
Languages: ru

source: Where the command omits database name, user, host, or port, the new connection can reuse values from the previous connection. By default, values from the previous connection are reused except when processing a <replaceable>conninfo</replaceable> string. Passing a first argument of <literal>-reuse-previous=on</literal> or <literal>-reuse-previous=off</literal> overrides that default. When the command neither specifies nor reuses a particular parameter, the <application>libpq</application> default is used. Specifying any of <replaceable class="parameter">dbname</replaceable>, <replaceable class="parameter">username</replaceable>, <replaceable class="parameter">host</replaceable> or <replaceable class="parameter">port</replaceable> as <literal>-</literal> is equivalent to omitting that parameter.
ru: Когда в команде опускается имя базы данных, пользователь, компьютер или порт, для нового подключения могут использоваться значения от предыдущего. По умолчанию значения от предыдущего подключения используются повторно, если только не указывается строка подключения (<replaceable>строка_подключения</replaceable>). Если передать в первом аргументе <literal>-reuse-previous=on</literal> или <literal moreinfo="none">-reuse-previous=off</literal>, это поведение переопределяется. Когда в команде не задаётся или не используется повторно некоторый параметр, применяется значение по умолчанию, принятое в <application>libpq</application>. Указание в параметре <replaceable class="parameter">имя_базы</replaceable>, <replaceable class="parameter">имя_пользователя</replaceable>, <replaceable class="parameter">компьютер</replaceable> или <replaceable class="parameter">порт</replaceable> значения <literal>-</literal> равносильно опущению этого параметра.

source: If the new connection is successfully made, the previous connection is closed. If the connection attempt failed (wrong user name, access denied, etc.), the previous connection will only be kept if <application>psql</application> is in interactive mode. When executing a non-interactive script, processing will immediately stop with an error. This distinction was chosen as a user convenience against typos on the one hand, and a safety mechanism that scripts are not accidentally acting on the wrong database on the other hand.
ru: Если новое подключение успешно установлено, предыдущее подключение закрывается. Если попытка подключения не удалась (неверное имя пользователя, доступ запрещён и т. д.), то предыдущее соединение останется активным, только если <application>psql</application> находится в интерактивном режиме. Если скрипт выполняется неинтерактивно, обработка немедленно останавливается с сообщением об ошибке. Различное поведение выбрано для удобства пользователя в качестве защиты от опечаток с одной стороны и в качестве меры безопасности, не позволяющей случайно запустить скрипты в неправильной базе, с другой.

source: Examples:
ru: Примеры:

source: title
ru: заголовок

source: Sets the title of any tables being printed as the result of a query or unset any such title. This command is equivalent to <literal>\pset title <replaceable class="parameter">title</replaceable></literal>. (The name of this command derives from <quote>caption</quote>, as it was previously only used to set the caption in an <acronym>HTML</acronym> table.)
ru: Задаёт заголовок, который будет выводиться для результатов любых запросов или отменяет установленный ранее заголовок. Эта команда эквивалентна <literal>\pset title <replaceable class="parameter">title</replaceable></literal>. (Название этой команды происходит от <quote>caption</quote>, так как ранее это использовалось только для задания заголовков <acronym>HTML</acronym> таблиц.)

source: directory
ru: каталог

source: Changes the current working directory to <replaceable>directory</replaceable>. Without argument, changes to the current user's home directory.
ru: Заменяет текущий рабочий каталог на <replaceable>directory</replaceable>. Без аргумента устанавливается домашний каталог текущего пользователя.

source: To print your current working directory, use <literal>\! pwd</literal>.
ru: для печати текущего рабочего каталога используйте <literal>\! pwd</literal>.

source: Outputs information about the current database connection.
ru: Выводит информацию о текущем подключении к базе данных.

source: table
ru: таблица

source: column_list
ru: список_столбцов

source: query
ru: запрос

source: 'filename'
ru: 'имя_файла'

source: 'command'
ru: 'команда'

source: Performs a frontend (client) copy. This is an operation that runs an <acronym>SQL</acronym> <xref linkend="sql-copy"/> command, but instead of the server reading or writing the specified file, <application>psql</application> reads or writes the file and routes the data between the server and the local file system. This means that file accessibility and privileges are those of the local user, not the server, and no SQL superuser privileges are required.
ru: Производит копирование данных с участием клиента. При этом выполняется <acronym>SQL</acronym>-команда <xref linkend="sql-copy"/>, но вместо чтения или записи в файл на сервере, <application>psql</application> читает или записывает файл и пересылает данные между сервером и локальной файловой системой. Это означает, что для доступа к файлам используются привилегии локального пользователя, а не сервера, и не требуются привилегии суперпользователя SQL.

source: When <literal>program</literal> is specified, <replaceable class="parameter">command</replaceable> is executed by <application>psql</application> and the data passed from or to <replaceable class="parameter">command</replaceable> is routed between the server and the client. Again, the execution privileges are those of the local user, not the server, and no SQL superuser privileges are required.
ru: Когда указана <literal>program</literal>, <application>psql</application> выполняет <replaceable class="parameter">command</replaceable> и данные из/в <replaceable class="parameter">command</replaceable> передаются между сервером и клиентом. Это опять же означает, что для выполнения программ используются привилегии локального пользователя, а не сервера, и не требуются привилегии суперпользователя SQL.

source: For <literal>\copy ... from stdin</literal>, data rows are read from the same source that issued the command, continuing until <literal>\.</literal> is read or the stream reaches <acronym>EOF</acronym>. This option is useful for populating tables in-line within a SQL script file. For <literal>\copy ... to stdout</literal>, output is sent to the same place as <application>psql</application> command output, and the <literal>COPY <replaceable>count</replaceable></literal> command status is not printed (since it might be confused with a data row). To read/write <application>psql</application>'s standard input or output regardless of the current command source or <literal>\o</literal> option, write <literal>from pstdin</literal> or <literal>to pstdout</literal>.
ru: При выполнении <literal>\copy ... from stdin</literal> строки с данными считываются из источника, выполнившего команду, и считываются до тех пор, пока не встретится <literal>\.</literal> или не будет достигнут конец файла. Этот параметр полезен для заполнения таблиц прямо в SQL-скриптах. При выполнении <literal>\copy ... to stdout</literal> вывод направляется в то же место, что и вывод <application>psql</application> команд. Статус команды <literal>COPY <replaceable>count</replaceable></literal> не отображается, чтобы не перепутать со строкой данных. Для чтения/записи стандартного ввода/вывода <application>psql</application>, вне зависимости от источника текущей команды или параметра <literal>\o</literal>, используйте <literal>from pstdin</literal> или <literal>to pstdout</literal>.

source: The syntax of this command is similar to that of the <acronym>SQL</acronym> <xref linkend="sql-copy"/> command. All options other than the data source/destination are as specified for <xref linkend="sql-copy"/>. Because of this, special parsing rules apply to the <command>\copy</command> meta-command. Unlike most other meta-commands, the entire remainder of the line is always taken to be the arguments of <command>\copy</command>, and neither variable interpolation nor backquote expansion are performed in the arguments.
ru: Синтаксис команды похож на синтаксис <acronym>SQL</acronym>-команды <xref linkend="sql-copy"/>. Все параметры, кроме источника и получателя данных, задаются так же, как и в <xref linkend="sql-copy"/>. Поэтому при обработке метакоманды <command>\copy</command> применяются другие правила разбора. В отличие от большинства других метакоманд, для неё остаток строки всегда воспринимается как аргументы <command>\copy</command>, и в этих аргументах не выполняется ни подстановка переменных, ни раскрытие обратных кавычек.

source: This operation is not as efficient as the <acronym>SQL</acronym> <command>COPY</command> command because all data must pass through the client/server connection. For large amounts of data the <acronym>SQL</acronym> command might be preferable.
ru: Эта операция не так эффективна, как <acronym>SQL</acronym>-команда <command>COPY</command>, потому что все данные перемещаются между клиентом и сервером. Для больших объёмов данных <acronym>SQL</acronym>-команда может быть предпочтительнее.

source: Shows the copyright and distribution terms of <productname>PostgreSQL</productname>.
ru: Показывает информацию об авторских правах и условиях распространения <productname>PostgreSQL</productname>.

source: colV
ru: столбВ

source: colH
ru: столбГ

source: colD
ru: столбТ

source: sortcolH
ru: столбсортГ

source: Executes the current query buffer (like <literal>\g</literal>) and shows the results in a crosstab grid. The query must return at least three columns. The output column identified by <replaceable class="parameter">colV</replaceable> becomes a vertical header and the output column identified by <replaceable class="parameter">colH</replaceable> becomes a horizontal header. <replaceable class="parameter">colD</replaceable> identifies the output column to display within the grid. <replaceable class="parameter">sortcolH</replaceable> identifies an optional sort column for the horizontal header.
ru: Выполняет содержимое буфера текущего запроса (как <literal>\g</literal>) и показывает результат в виде перекрёстной таблицы. Заданный запрос должен возвращать минимум три столбца. Столбец результата, заданный параметром <replaceable class="parameter">столбВ</replaceable>, будет образовывать вертикальные заголовки, а столбец, заданный параметром <replaceable class="parameter">столбГ</replaceable>, — горизонтальные. Заданный параметром <replaceable class="parameter">столбТ</replaceable> столбец будет поставлять данные для отображения внутри таблицы. Столбец, выбранный параметром <replaceable class="parameter">столбсортГ</replaceable>, будет необязательным столбцом сортировки горизонтальных заголовков.

source: Each column specification can be a column number (starting at 1) or a column name. The usual SQL case folding and quoting rules apply to column names. If omitted, <replaceable class="parameter">colV</replaceable> is taken as column 1 and <replaceable class="parameter">colH</replaceable> as column 2. <replaceable class="parameter">colH</replaceable> must differ from <replaceable class="parameter">colV</replaceable>. If <replaceable class="parameter">colD</replaceable> is not specified, then there must be exactly three columns in the query result, and the column that is neither <replaceable class="parameter">colV</replaceable> nor <replaceable class="parameter">colH</replaceable> is taken to be <replaceable class="parameter">colD</replaceable>.
ru: Каждое указание столбца может представлять собой имя или номер столбца (начиная с 1). К именам применяются обычные принятые в SQL правила учёта регистра и кавычек. По умолчанию в качестве <replaceable class="parameter">столбВ</replaceable> подразумевается столбец 1, а в качестве <replaceable class="parameter">столбГ</replaceable> — столбец 2. Если <replaceable class="parameter">столбВ</replaceable> и <replaceable class="parameter">столбГ</replaceable> задаются явно, они должны различаться. Если <replaceable class="parameter">столбТ</replaceable> не задан, в результате запроса должно быть ровно три столбца, и в качестве <replaceable class="parameter">столбТ</replaceable> выбирается столбец, отличный от <replaceable class="parameter">столбВ</replaceable> и <replaceable class="parameter">столбГ</replaceable>.

source: The vertical header, displayed as the leftmost column, contains the values found in column <replaceable class="parameter">colV</replaceable>, in the same order as in the query results, but with duplicates removed.
ru: Вертикальный заголовок, выводимый в самом левом столбце, содержит значения из столбца <replaceable class="parameter">столбВ</replaceable>, в том же порядке, в каком их возвращает запрос, но без дубликатов.

source: The horizontal header, displayed as the first row, contains the values found in column <replaceable class="parameter">colH</replaceable>, with duplicates removed. By default, these appear in the same order as in the query results. But if the optional <replaceable class="parameter">sortcolH</replaceable> argument is given, it identifies a column whose values must be integer numbers, and the values from <replaceable class="parameter">colH</replaceable> will appear in the horizontal header sorted according to the corresponding <replaceable class="parameter">sortcolH</replaceable> values.
ru: Горизонтальный заголовок, выводимый в первой строке, содержит значения из столбца <replaceable class="parameter">столбГ</replaceable>, без дубликатов. По умолчанию они располагаются в том порядке, в каком их возвращает запрос. Но если задан необязательный аргумент <replaceable class="parameter">столбсортГ</replaceable>, он определяет столбец, который должен содержать целые числа, и тогда значения из <replaceable class="parameter">столбГ</replaceable> будут располагаться в горизонтальном заголовке по порядку значений в <replaceable class="parameter">столбсортГ</replaceable>.

source: Inside the crosstab grid, for each distinct value <literal>x</literal> of <replaceable class="parameter">colH</replaceable> and each distinct value <literal>y</literal> of <replaceable class="parameter">colV</replaceable>, the cell located at the intersection <literal>(x,y)</literal> contains the value of the <literal>colD</literal> column in the query result row for which the value of <replaceable class="parameter">colH</replaceable> is <literal>x</literal> and the value of <replaceable class="parameter">colV</replaceable> is <literal>y</literal>. If there is no such row, the cell is empty. If there are multiple such rows, an error is reported.
ru: Внутри перекрёстной таблицы для каждого уникального значения <literal>x</literal> в <replaceable class="parameter">столбГ</replaceable> и каждого уникального значения <literal>y</literal> в <replaceable class="parameter">столбВ</replaceable>, ячейка, размещённая на пересечении <literal>(x,y)</literal> содержит значение <literal>столбТ</literal> в строке результата запроса, в которой значение <replaceable class="parameter">столбГ</replaceable> равно <literal>x</literal>, а значение <replaceable class="parameter">столбВ</replaceable> — <literal>y</literal>. Если такой строки не находится, ячейка остаётся пустой. Если же находится несколько таких строк, выдаётся ошибка.

source: pattern
ru: шаблон

source: For each relation (table, view, materialized view, index, sequence, or foreign table) or composite type matching the <replaceable class="parameter">pattern</replaceable>, show all columns, their types, the tablespace (if not the default) and any special attributes such as <literal>NOT NULL</literal> or defaults. Associated indexes, constraints, rules, and triggers are also shown. For foreign tables, the associated foreign server is shown as well. (<quote>Matching the pattern</quote> is defined in <xref linkend="app-psql-patterns" endterm="app-psql-patterns-title"/> below.)
ru: Для каждого отношения (таблицы, представления, материализованного представления, индекса, последовательности, внешней таблицы) или составного типа, соответствующих <replaceable class="parameter">шаблону</replaceable>, показывает все столбцы, их типы, табличное пространство (если оно изменено) и любые специальные атрибуты, такие как <literal>NOT NULL</literal> или значения по умолчанию. Также показываются связанные индексы, ограничения, правила и триггеры. Для сторонних таблиц также показывается связанный сторонний сервер. (<quote>Соответствие шаблону</quote> определяется ниже в <xref remap="6" linkend="app-psql-patterns" endterm="app-psql-patterns-title"/>.)

source: For some types of relation, <literal>\d</literal> shows additional information for each column: column values for sequences, indexed expressions for indexes, and foreign data wrapper options for foreign tables.
ru: Для некоторых типов отношений <literal>\d</literal> показывает дополнительную информацию по каждому столбцу: значения столбца для последовательностей, индексируемые выражения для индексов и параметры обёртки сторонних данных для сторонних таблиц.

source: The command form <literal>\d+</literal> is identical, except that more information is displayed: any comments associated with the columns of the table are shown, as is the presence of OIDs in the table, the view definition if the relation is a view, a non-default <link linkend="sql-createtable-replica-identity">replica identity</link> setting.
ru: Вариант команды <literal>\d+</literal> похож на <literal>\d</literal>, но выводит больше информации: комментарии к столбцам таблицы, наличие в таблице OID, для представления показывается его определение, отличные от значений по умолчанию установки <link linkend="sql-createtable-replica-identity">replica identity</link>.

source: By default, only user-created objects are shown; supply a pattern or the <literal>S</literal> modifier to include system objects.
ru: По умолчанию отображаются только объекты, созданные пользователем. Для включения системных объектов нужно задать шаблон или добавить модификатор <literal>S</literal>.

source: If <command>\d</command> is used without a <replaceable class="parameter">pattern</replaceable> argument, it is equivalent to <command>\dtvmsE</command> which will show a list of all visible tables, views, materialized views, sequences and foreign tables. This is purely a convenience measure.
ru: Если <command>\d</command> используется без аргумента <replaceable class="parameter">шаблон</replaceable>, эта команда удобства ради воспринимается как <command moreinfo="none">\dtvmsE</command> и выдаёт список всех видимых таблиц, представлений, мат. представлений, последовательностей и сторонних таблиц.

source: Lists aggregate functions, together with their return type and the data types they operate on. If <replaceable class="parameter">pattern</replaceable> is specified, only aggregates whose names match the pattern are shown. By default, only user-created objects are shown; supply a pattern or the <literal>S</literal> modifier to include system objects.
ru: Выводит список агрегатных функций вместе с типом возвращаемого значения и типами данных, которыми они оперируют. Если указан <replaceable class="parameter">шаблон</replaceable>, показываются только те агрегатные функции, имена которых соответствуют ему. По умолчанию показываются только объекты, созданные пользователями. Для включения системных объектов нужно задать шаблон или добавить модификатор <literal>S</literal>.

source: Lists access methods. If <replaceable class="parameter">pattern</replaceable> is specified, only access methods whose names match the pattern are shown. If <literal>+</literal> is appended to the command name, each access method is listed with its associated handler function and description.
ru: Выводит список методов доступа. Если указан <replaceable class="parameter">шаблон</replaceable>, показываются только те методы доступа, имена которых соответствуют ему. При добавлении <literal>+</literal> к имени команды для каждого метода доступа показывается его описание и связанная функция-обработчик.

source: Lists tablespaces. If <replaceable class="parameter">pattern</replaceable> is specified, only tablespaces whose names match the pattern are shown. If <literal>+</literal> is appended to the command name, each tablespace is listed with its associated options, on-disk size, permissions and description.
ru: Выводит список табличных пространств. Если указан <replaceable class="parameter">шаблон</replaceable>, показываются только те табличные пространства, имена которых соответствуют ему. При добавлении <literal>+</literal> к имени команды для каждого объекта дополнительно выводятся параметры, объём на диске, права доступа и описание.

source: Lists conversions between character-set encodings. If <replaceable class="parameter">pattern</replaceable> is specified, only conversions whose names match the pattern are listed. By default, only user-created objects are shown; supply a pattern or the <literal>S</literal> modifier to include system objects. If <literal>+</literal> is appended to the command name, each object is listed with its associated description.
ru: Выводит список преобразований между кодировками наборов символов. Если указан <replaceable class="parameter">шаблон</replaceable>, показываются только те преобразования кодировок, имена которых соответствуют ему. По умолчанию показываются только объекты, созданные пользователями. Для включения системных объектов нужно задать шаблон или добавить модификатор <literal>S</literal>. При добавлении <literal>+</literal> к имени команды для каждого объекта дополнительно будет выводиться описание.

source: Lists type casts. If <replaceable class="parameter">pattern</replaceable> is specified, only casts whose source or target types match the pattern are listed. If <literal>+</literal> is appended to the command name, each object is listed with its associated description.
ru: Выводит список приведений типов. Если указан <replaceable class="parameter">шаблон</replaceable>, показываются только те приведения типов, имена которых соответствуют ему. При добавлении <literal>+</literal> к имени команды для каждого объекта дополнительно будет выводиться описание.

source: Shows the descriptions of objects of type <literal>constraint</literal>, <literal>operator class</literal>, <literal>operator family</literal>, <literal>rule</literal>, and <literal>trigger</literal>. All other comments may be viewed by the respective backslash commands for those object types.
ru: Показывает описания объектов следующих видов: <literal>ограничение</literal>, <literal>класс операторов</literal>, <literal>семейство операторов</literal>, <literal>правило</literal> и <literal>триггер</literal>. Описания остальных объектов можно посмотреть соответствующими метакомандами для этих типов объектов.
