Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/psql-ref.po
Languages: ru

source: With a parameter, turns displaying of how long each SQL statement takes on or off. Without a parameter, toggles the display between on and off. The display is in milliseconds; intervals longer than 1 second are also shown in minutes:seconds format, with hours and days fields added if needed.
ru: С параметром данная команда, в зависимости от него, включает/отключает отображение времени выполнения каждого SQL-оператора. Без параметра она меняет состояние отображения на противоположное. Время выводится в миллисекундах; интервалы больше 1 секунды выводятся в формате минуты:секунды, а при необходимости в вывод также добавляются часы и дни.

source: Unsets (deletes) the <application>psql</application> variable <replaceable class="parameter">name</replaceable>.
ru: Удаляет <application>psql</application> переменную <replaceable class="parameter">name</replaceable>.

source: Most variables that control <application>psql</application>'s behavior cannot be unset; instead, an <literal>\unset</literal> command is interpreted as setting them to their default values. See <xref linkend="app-psql-variables" endterm="app-psql-variables-title"/>, below.
ru: Большинство переменных, управляющих поведением <application>psql</application>, нельзя сбросить; команда <literal>\unset</literal> для них воспринимается как установка значений по умолчанию. См. <xref remap="4" linkend="app-psql-variables" endterm="app-psql-variables-title"/> ниже.

source: <literal>\w</literal> or <literal>\write</literal> <replaceable class="parameter">filename</replaceable>
ru: <literal>\w</literal> или <literal>\write</literal> <replaceable class="parameter">filename</replaceable>

source: <literal>\w</literal> or <literal>\write</literal> <literal>|</literal><replaceable class="parameter">command</replaceable>
ru: <literal>\w</literal> или <literal>\write</literal> <literal>|</literal><replaceable class="parameter">command</replaceable>

source: Writes the current query buffer to the file <replaceable class="parameter">filename</replaceable> or pipes it to the shell command <replaceable class="parameter">command</replaceable>. If the current query buffer is empty, the most recently executed query is written instead.
ru: Выводит буфер текущего запроса в файл <replaceable class="parameter">имя_файла</replaceable> или через канал в команду оболочки <replaceable class="parameter">команда</replaceable>. Если этот буфер пуст, будет выведен последний выполненный запрос.

source: seconds
ru: секунды

source: Repeatedly execute the current query buffer (as <literal>\g</literal> does) until interrupted or the query fails. Wait the specified number of seconds (default 2) between executions. Each query result is displayed with a header that includes the <literal>\pset title</literal> string (if any), the time as of query start, and the delay interval.
ru: Эта команда многократно выполняет текущий запрос в буфере (как <literal>\g</literal>), пока не будет прервана или не возникнет ошибка. Аргумент задаёт количество секунд ожидания между выполнениями запроса (по умолчанию 2). Результат каждого запроса выводится с заголовком, включающим строку <literal>\pset title</literal> (если она задана), время запуска запроса и интервал задержки.

source: Sets or toggles expanded table formatting mode. As such it is equivalent to <literal>\pset expanded</literal>.
ru: Устанавливает или переключает режим развёрнутого вывода таблицы. Это эквивалентно <literal>\pset expanded</literal>.

source: Lists tables, views and sequences with their associated access privileges. If a <replaceable class="parameter">pattern</replaceable> is specified, only tables, views and sequences whose names match the pattern are listed.
ru: Выводит список таблиц, представлений и последовательностей с их правами доступа. Если указан <replaceable class="parameter">шаблон</replaceable>, отображаются только таблицы, представления и последовательности, имена которых соответствуют ему.

source: This is an alias for <command>\dp</command> (<quote>display privileges</quote>).
ru: Это псевдоним для <command>\dp</command> (<quote>показать права доступа</quote>).

source: With no argument, escapes to a sub-shell; <application>psql</application> resumes when the sub-shell exits. With an argument, executes the shell command <replaceable class="parameter">command</replaceable>.
ru: Без аргументов запускает подчинённую оболочку; когда эта оболочка завершается, <application>psql</application> продолжает работу. Если добавлен аргумент, запускает команду оболочки <replaceable class="parameter">команда</replaceable>.

source: Unlike most other meta-commands, the entire remainder of the line is always taken to be the argument(s) of <command>\!</command>, and neither variable interpolation nor backquote expansion are performed in the arguments. The rest of the line is simply passed literally to the shell.
ru: В отличие от большинства других метакоманд весь остаток строки всегда воспринимается как аргументы <command>\!</command>, и в этих аргументах не выполняется ни подстановка переменных, ни раскрытие обратных кавычек. Этот текст просто передаётся оболочке в буквальном виде.

source: Shows help information. The optional <replaceable class="parameter">topic</replaceable> parameter (defaulting to <literal>commands</literal>) selects which part of <application>psql</application> is explained: <literal>commands</literal> describes <application>psql</application>'s backslash commands; <literal>options</literal> describes the command-line options that can be passed to <application>psql</application>; and <literal>variables</literal> shows help about <application>psql</application> configuration variables.
ru: Показывает справочную информацию. Необязательный параметр <replaceable class="parameter">тема</replaceable> (по умолчанию <literal>commands</literal>) выбирает описание интересующей части <application>psql</application>: <literal>commands</literal> описывает команды <application>psql</application> с обратной косой чертой; <literal>options</literal> описывает параметры командной строки, которые можно передать <application>psql</application>; а <literal>variables</literal> выдаёт справку по переменным конфигурации <application>psql</application>.

source: The following meta-commands are defined: <placeholder-1/>
ru: Определены следующие метакоманды: <placeholder-1/>

source: Patterns
ru: Шаблоны поиска

source: <primary>patterns</primary> <secondary>in psql and pg_dump</secondary>
ru: <primary>шаблоны</primary> <secondary>в psql и pg_dump</secondary>

source: The various <literal>\d</literal> commands accept a <replaceable class="parameter">pattern</replaceable> parameter to specify the object name(s) to be displayed. In the simplest case, a pattern is just the exact name of the object. The characters within a pattern are normally folded to lower case, just as in SQL names; for example, <literal>\dt FOO</literal> will display the table named <literal>foo</literal>. As in SQL names, placing double quotes around a pattern stops folding to lower case. Should you need to include an actual double quote character in a pattern, write it as a pair of double quotes within a double-quote sequence; again this is in accord with the rules for SQL quoted identifiers. For example, <literal>\dt "FOO""BAR"</literal> will display the table named <literal>FOO"BAR</literal> (not <literal>foo"bar</literal>). Unlike the normal rules for SQL names, you can put double quotes around just part of a pattern, for instance <literal>\dt FOO"FOO"BAR</literal> will display the table named <literal>fooFOObar</literal>.
ru: Различные <literal>\d</literal> команды принимают параметр <replaceable class="parameter">pattern</replaceable> для указания имени (имён) объектов для отображения. В простейшем случае шаблон - это точное имя объекта. Символы внутри шаблона обычно приводятся к нижнему регистру, как и для имён SQL-объектов; к примеру <literal>\dt FOO</literal> выводит таблицу с именем <literal>foo</literal>. Как и для SQL имён, двойные кавычки вокруг шаблона предотвращают перевод в нижний регистр. Для включения символа двойной кавычки в шаблон используются два символа двойных кавычек подряд внутри шаблона в двойных кавычках. Опять же, это соответствует правилам для SQL-идентификаторов. Например <literal>\dt "FOO""BAR"</literal> будет выводить таблицу с именем <literal>FOO"BAR</literal> (но не <literal>foo"bar</literal>). В отличие от обычных правил для SQL-имён, можно взять в двойные кавычки только часть шаблона, например <literal>\dt FOO"FOO"BAR</literal> будет выводить таблицу с именем <literal>fooFOObar</literal>.

source: Whenever the <replaceable class="parameter">pattern</replaceable> parameter is omitted completely, the <literal>\d</literal> commands display all objects that are visible in the current schema search path &mdash; this is equivalent to using <literal>*</literal> as the pattern. (An object is said to be <firstterm>visible</firstterm> if its containing schema is in the search path and no object of the same kind and name appears earlier in the search path. This is equivalent to the statement that the object can be referenced by name without explicit schema qualification.) To see all objects in the database regardless of visibility, use <literal>*.*</literal> as the pattern.
ru: Если <replaceable class="parameter">pattern</replaceable> вообще не указан, <literal>\d</literal> команды выводят все объекты, видимые для текущей схемы. Это эквивалентно указанию <literal>*</literal> в качестве шаблона. (Объект считается <firstterm>видимым</firstterm>, если схема, в которой он находится, лежит на пути поиска, и объект с таким типом и именем на пути поиска ещё не появлялся. Это эквивалентно утверждению, что на объект можно ссылаться по имени, без явного указания схемы.) Чтобы увидеть все объекты в базе данных, независимо от видимости, в качестве шаблона используется <literal>*.*</literal>.

source: Within a pattern, <literal>*</literal> matches any sequence of characters (including no characters) and <literal>?</literal> matches any single character. (This notation is comparable to Unix shell file name patterns.) For example, <literal>\dt int*</literal> displays tables whose names begin with <literal>int</literal>. But within double quotes, <literal>*</literal> and <literal>?</literal> lose these special meanings and are just matched literally.
ru: Внутри шаблона <literal>*</literal> обозначает любое количество символов, включая отсутствие символов. <literal>?</literal> соответствует любому одному символу. (Это соответствует шаблонам имён файлов в Unix.) Например, <literal>\dt int*</literal> отображает все таблицы, чьи имена начинаются на <literal>int</literal>. Однако внутри двойных кавычек <literal>*</literal> и <literal>?</literal> теряют своё специальное значение и становятся обычными символами.

source: If this variable is set to <literal>ignorespace</literal>, lines which begin with a space are not entered into the history list. If set to a value of <literal>ignoredups</literal>, lines matching the previous history line are not entered. A value of <literal>ignoreboth</literal> combines the two options. If unset, or if set to <literal>none</literal> (or any other value than those above), all lines read in interactive mode are saved on the history list.
ru: Если переменная имеет значение <literal>ignorespace</literal>, строки, начинающиеся с пробела, не сохраняются в истории. Если она имеет значение <literal>ignoredups</literal>, в историю не добавляются строки, которые в ней уже есть. Значение <literal>ignoreboth</literal> объединяет эти два варианта. В случае отсутствия значения и с вариантом <literal>none</literal> (либо другим вариантом, кроме перечисленных) в истории сохраняются все строки, считываемые в интерактивном режиме.

source: A pattern that contains a dot (<literal>.</literal>) is interpreted as a schema name pattern followed by an object name pattern. For example, <literal>\dt foo*.*bar*</literal> displays all tables whose table name includes <literal>bar</literal> that are in schemas whose schema name starts with <literal>foo</literal>. When no dot appears, then the pattern matches only objects that are visible in the current schema search path. Again, a dot within double quotes loses its special meaning and is matched literally.
ru: Шаблон, содержащий точку (<literal>.</literal>), интерпретируется как шаблон имени схемы, за которым следует шаблон имени объекта. Например, <literal>\dt foo*.*bar*</literal> отображает все таблицы, имена которых включают <literal>bar</literal>, и расположенные в схемах, имена которых начинаются с <literal>foo</literal>. Шаблону, не содержащему точку, могут соответствовать только объекты текущей схемы. Опять же, точка внутри двойных кавычек теряет своё специальное значение.

source: Advanced users can use regular-expression notations such as character classes, for example <literal>[0-9]</literal> to match any digit. All regular expression special characters work as specified in <xref linkend="functions-posix-regexp"/>, except for <literal>.</literal> which is taken as a separator as mentioned above, <literal>*</literal> which is translated to the regular-expression notation <literal>.*</literal>, <literal>?</literal> which is translated to <literal>.</literal>, and <literal>$</literal> which is matched literally. You can emulate these pattern characters at need by writing <literal>?</literal> for <literal>.</literal>, <literal>(<replaceable class="parameter">R</replaceable>+|)</literal> for <literal><replaceable class="parameter">R</replaceable>*</literal>, or <literal>(<replaceable class="parameter">R</replaceable>|)</literal> for <literal><replaceable class="parameter">R</replaceable>?</literal>. <literal>$</literal> is not needed as a regular-expression character since the pattern must match the whole name, unlike the usual interpretation of regular expressions (in other words, <literal>$</literal> is automatically appended to your pattern). Write <literal>*</literal> at the beginning and/or end if you don't wish the pattern to be anchored. Note that within double quotes, all regular expression special characters lose their special meanings and are matched literally. Also, the regular expression special characters are matched literally in operator name patterns (i.e., the argument of <literal>\do</literal>).
ru: Опытные пользователи могут использовать возможности регулярных выражений, такие как классы символов. Например <literal>[0-9]</literal> соответствует любой цифре. Все специальные символы регулярных выражений работают как описано в <xref remap="6" linkend="functions-posix-regexp"/>, за исключением: <literal>.</literal> используется в качестве разделителя, как говорилось выше; <literal>*</literal> соответствует регулярному выражению <literal>.*</literal>; <literal>?</literal> соответствует <literal>.</literal>, а также символ <literal>$</literal>, который не имеет специального значения. При необходимости эти символы можно эмулировать указывая <literal>?</literal> для эмуляции <literal>.</literal>, <literal>(<replaceable class="parameter">R</replaceable>+|)</literal> для <literal><replaceable class="parameter">R</replaceable>*</literal>, <literal>(<replaceable class="parameter">R</replaceable>|)</literal> для <literal><replaceable class="parameter">R</replaceable>?</literal>. <literal>$</literal> не требуется, как символ регулярного выражения, потому что шаблон должен соответствовать имени целиком, в отличие от обычной интерпретации регулярных выражений (другими словами, <literal>$</literal> автоматически добавляется в шаблон). Используйте <literal>*</literal> в начале и/или в конце, если не хотите, чтобы шаблон закреплялся. Обратите внимание, что внутри двойных кавычек, все специальные символы регулярных выражений теряют своё специальное значение и соответствуют сами себе. Также, специальные символы регулярных выражений не действуют в шаблонах для имён операторов (т. е. в аргументе команды <literal>\do</literal>).

source: Advanced Features
ru: Расширенные возможности

source: Variables
ru: Переменные

source: <application>psql</application> provides variable substitution features similar to common Unix command shells. Variables are simply name/value pairs, where the value can be any string of any length. The name must consist of letters (including non-Latin letters), digits, and underscores.
ru: <application>psql</application> предоставляет возможности подстановки переменных подобные тем, что используются в командных оболочках Unix. Переменные представляют собой пары имя/значение, где значением может быть любая строка любой длины. Имя должно состоять из букв (включая нелатинские буквы), цифр и знаков подчёркивания.

source: To set a variable, use the <application>psql</application> meta-command <command>\set</command>. For example, <placeholder-1/> sets the variable <literal>foo</literal> to the value <literal>bar</literal>. To retrieve the content of the variable, precede the name with a colon, for example: <placeholder-2/> This works in both regular SQL commands and meta-commands; there is more detail in <xref linkend="app-psql-interpolation" endterm="app-psql-interpolation-title"/>, below.
ru: Чтобы установить переменную, используется метакоманда <application>psql</application> <command>\set</command>. Например: <placeholder-1/> присваивает переменной <literal>foo</literal> значение <literal>bar</literal>. Чтобы получить значение переменной, нужно поставить двоеточие перед её именем, например: <placeholder-2/> Это работает как в обычных SQL-командах, так и в метакомандах; подробности в разделе <xref linkend="app-psql-interpolation" endterm="app-psql-interpolation-title"/> ниже.

source: If you call <command>\set</command> without a second argument, the variable is set to an empty-string value. To unset (i.e., delete) a variable, use the command <command>\unset</command>. To show the values of all variables, call <command>\set</command> without any argument.
ru: При вызове <command>\set</command> без второго аргумента переменной присваивается пустая строка. Для сброса (то есть удаления) переменной используйте команду <command>\unset</command>. Чтобы посмотреть значения всех переменных, вызовите <command>\set</command> без аргументов.

source: The arguments of <command>\set</command> are subject to the same substitution rules as with other commands. Thus you can construct interesting references such as <literal>\set :foo 'something'</literal> and get <quote>soft links</quote> or <quote>variable variables</quote> of <productname>Perl</productname> or <productname><acronym>PHP</acronym></productname> fame, respectively. Unfortunately (or fortunately?), there is no way to do anything useful with these constructs. On the other hand, <literal>\set bar :foo</literal> is a perfectly valid way to copy a variable.
ru: На аргументы <command>\set</command> распространяются те же правила подстановки, что и для других команд. Таким образом можно создавать интересные ссылки, например <literal>\set :foo 'something'</literal>, получая <quote>мягкие ссылки</quote> в <productname>Perl</productname> или <quote>переменные переменных</quote> в <productname><acronym>PHP</acronym></productname>. К сожалению (или к счастью?), с этими конструкциями нельзя сделать ничего полезного. С другой стороны, <literal>\set bar :foo</literal> является прекрасным способом копирования переменной.

source: A number of these variables are treated specially by <application>psql</application>. They represent certain option settings that can be changed at run time by altering the value of the variable, or in some cases represent changeable state of <application>psql</application>. By convention, all specially treated variables' names consist of all upper-case ASCII letters (and possibly digits and underscores). To ensure maximum compatibility in the future, avoid using such variable names for your own purposes.
ru: Некоторые переменные обрабатываются в <application>psql</application> особым образом. Они представляют собой определённые параметры, которые могут быть изменены во время выполнения путём присваивания нового значения, а в некоторых переменных содержится изменяемое состояние <application>psql</application>. По соглашению, имена специальных переменных состоят только из заглавных ASCII-букв (и, возможно, цифр и знаков подчёркивания). Для максимальной совместимости в будущем старайтесь не использовать такие имена для собственных переменных.

source: Variables that control <application>psql</application>'s behavior generally cannot be unset or set to invalid values. An <literal>\unset</literal> command is allowed but is interpreted as setting the variable to its default value. A <literal>\set</literal> command without a second argument is interpreted as setting the variable to <literal>on</literal>, for control variables that accept that value, and is rejected for others. Also, control variables that accept the values <literal>on</literal> and <literal>off</literal> will also accept other common spellings of Boolean values, such as <literal>true</literal> and <literal>false</literal>.
ru: Переменные, управляющие поведением <application>psql</application>, обычно нельзя сбросить или задать для них недопустимые значения. Команда <literal>\unset</literal> для них допускается, но воспринимается как установка значения по умолчанию. Команда <literal>\set</literal> без второго аргумента воспринимается как присвоение переменной значения <literal>on</literal>, для управляющих переменных, принимающих это значение, и не принимается для других. Также управляющие переменные, принимающие значения <literal>on</literal> и <literal>off</literal>, примут и другие общепринятые написания логических значений, например <literal>true</literal> и <literal>false</literal>.

source: The specially treated variables are:
ru: Специальные переменные:

source: When <literal>on</literal> (the default), each SQL command is automatically committed upon successful completion. To postpone commit in this mode, you must enter a <command>BEGIN</command> or <command>START TRANSACTION</command> SQL command. When <literal>off</literal> or unset, SQL commands are not committed until you explicitly issue <command>COMMIT</command> or <command>END</command>. The autocommit-off mode works by issuing an implicit <command>BEGIN</command> for you, just before any command that is not already in a transaction block and is not itself a <command>BEGIN</command> or other transaction-control command, nor a command that cannot be executed inside a transaction block (such as <command>VACUUM</command>).
ru: При значении <literal>on</literal> (по умолчанию) после каждой успешно выполненной команды выполняется фиксация изменений. Чтобы отложить фиксацию изменений в этом режиме, нужно выполнить SQL-команду <command>BEGIN</command> или <command>START TRANSACTION</command>. При значении <literal>off</literal> или если переменная не определена, фиксация изменений не происходит до тех пор, пока явно не выполнена команда <command>COMMIT</command> или <command>END</command>. При значении <literal>off</literal> неявно выполняется <command>BEGIN</command> непосредственно перед любой командой, за исключением случаев когда: команда уже в транзакционном блоке; перед самой командой <command>BEGIN</command> или другой командой управления транзакциями; перед командой, которая не может выполняться внутри транзакционного блока (например <command>VACUUM</command>).
