Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/psql-ref.po
Languages: ru

source: <literal>\dd</literal> displays descriptions for objects matching the <replaceable class="parameter">pattern</replaceable>, or of visible objects of the appropriate type if no argument is given. But in either case, only objects that have a description are listed. By default, only user-created objects are shown; supply a pattern or the <literal>S</literal> modifier to include system objects.
ru: <literal>\dd</literal> показывает описания для объектов, соответствующих <replaceable class="parameter">шаблону</replaceable>, или для доступных объектов указанных типов, если аргументы не заданы. Но в любом случае выводятся только те объекты, которые имеют описание. По умолчанию показываются только объекты, созданные пользователями. Для включения системных объектов нужно задать шаблон или добавить модификатор <literal>S</literal>.

source: Descriptions for objects can be created with the <xref linkend="sql-comment"/> <acronym>SQL</acronym> command.
ru: Описания объектов создаются <acronym>SQL</acronym>-командой <xref linkend="sql-comment"/>.

source: Lists domains. If <replaceable class="parameter">pattern</replaceable> is specified, only domains whose names match the pattern are shown. By default, only user-created objects are shown; supply a pattern or the <literal>S</literal> modifier to include system objects. If <literal>+</literal> is appended to the command name, each object is listed with its associated permissions and description.
ru: Выводит список доменов. Если указан <replaceable class="parameter">шаблон</replaceable>, показываются только те домены, имена которых соответствуют ему. По умолчанию показываются только объекты, созданные пользователями. Для включения системных объектов нужно задать шаблон или добавить модификатор <literal>S</literal>. При добавлении <literal>+</literal> к имени команды для каждого объекта дополнительно будут выводиться права доступа и описание.

source: Lists default access privilege settings. An entry is shown for each role (and schema, if applicable) for which the default privilege settings have been changed from the built-in defaults. If <replaceable class="parameter">pattern</replaceable> is specified, only entries whose role name or schema name matches the pattern are listed.
ru: Выводит список прав доступа по умолчанию. Выводится строка для каждой роли (и схемы, если применимо), для которой права доступа по умолчанию отличаются от встроенных. Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся строки только для тех ролей и схем, чьи имена соответствуют ему.

source: The <xref linkend="sql-alterdefaultprivileges"/> command is used to set default access privileges. The meaning of the privilege display is explained under <xref linkend="sql-grant"/>.
ru: Права доступа по умолчанию устанавливаются командой <xref linkend="sql-alterdefaultprivileges"/>. Смысл отображаемых привилегий объясняется в описании <xref linkend="sql-grant"/>.

source: In this group of commands, the letters <literal>E</literal>, <literal>i</literal>, <literal>m</literal>, <literal>s</literal>, <literal>t</literal>, and <literal>v</literal> stand for foreign table, index, materialized view, sequence, table, and view, respectively. You can specify any or all of these letters, in any order, to obtain a listing of objects of these types. For example, <literal>\dit</literal> lists indexes and tables. If <literal>+</literal> is appended to the command name, each object is listed with its physical size on disk and its associated description, if any. If <replaceable class="parameter">pattern</replaceable> is specified, only objects whose names match the pattern are listed. By default, only user-created objects are shown; supply a pattern or the <literal>S</literal> modifier to include system objects.
ru: В этой группе команд буквы <literal>E</literal>, <literal>i</literal>, <literal>m</literal>, <literal>s</literal>, <literal>t</literal> и <literal>v</literal> обозначают соответственно: внешнюю таблицу, индекс, материализованное представление, последовательность, таблицу и представление. Можно указывать все или часть этих букв, в произвольном порядке, чтобы получить список объектов этих типов. Например, <literal>\dit</literal> выводит список индексов и таблиц. При добавлении <literal>+</literal> к имени команды для каждого объекта дополнительно будут выводиться физический размер на диске и описание, при наличии. Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только объекты, имена которых соответствуют ему. По умолчанию показываются только объекты, созданные пользователями. Для включения системных объектов нужно задать шаблон или добавить модификатор <literal>S</literal>.

source: Lists foreign servers (mnemonic: <quote>external servers</quote>). If <replaceable class="parameter">pattern</replaceable> is specified, only those servers whose name matches the pattern are listed. If the form <literal>\des+</literal> is used, a full description of each server is shown, including the server's ACL, type, version, options, and description.
ru: Выводит список сторонних серверов (мнемоника: <quote>external servers</quote>). Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только те серверы, имена которых соответствуют ему. Если используется форма <literal>\des+</literal>, то выводится полное описание каждого сервера, включая права доступа, тип, версию, параметры и описание.

source: Lists foreign tables (mnemonic: <quote>external tables</quote>). If <replaceable class="parameter">pattern</replaceable> is specified, only entries whose table name or schema name matches the pattern are listed. If the form <literal>\det+</literal> is used, generic options and the foreign table description are also displayed.
ru: Выводит список сторонних таблиц (мнемоника: <quote>external tables</quote>). Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только те записи, имя таблицы или схемы которых соответствуют ему. Если используется форма <literal>\det+</literal>, то дополнительно выводятся общие параметры и описание сторонней таблицы.

source: Lists user mappings (mnemonic: <quote>external users</quote>). If <replaceable class="parameter">pattern</replaceable> is specified, only those mappings whose user names match the pattern are listed. If the form <literal>\deu+</literal> is used, additional information about each mapping is shown.
ru: Выводит список сопоставлений пользователей (мнемоника: <quote>external users</quote>). Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только сопоставления, в которых имена пользователей соответствуют ему. Если используется форма <literal>\deu+</literal>, то выводится дополнительная информация о каждом сопоставлении пользователей.

source: <literal>\deu+</literal> might also display the user name and password of the remote user, so care should be taken not to disclose them.
ru: <literal>\deu+</literal> также может отображать имя и пароль удалённого пользователя, поэтому следует позаботиться о том, чтобы не раскрывать их.

source: Lists foreign-data wrappers (mnemonic: <quote>external wrappers</quote>). If <replaceable class="parameter">pattern</replaceable> is specified, only those foreign-data wrappers whose name matches the pattern are listed. If the form <literal>\dew+</literal> is used, the ACL, options, and description of the foreign-data wrapper are also shown.
ru: Выводит список обёрток сторонних данных (мнемоника: <quote>external wrappers</quote>). Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только те обёртки сторонних данных, имена которых соответствуют ему. Если используется форма <literal>\dew+</literal>, то дополнительно выводятся права доступа, параметры и описание обёртки.

source: Lists functions, together with their result data types, argument data types, and function types, which are classified as <quote>agg</quote> (aggregate), <quote>normal</quote>, <quote>trigger</quote>, or <quote>window</quote>. To display only functions of specific type(s), add the corresponding letters <literal>a</literal>, <literal>n</literal>, <literal>t</literal>, or <literal>w</literal> to the command. If <replaceable class="parameter">pattern</replaceable> is specified, only functions whose names match the pattern are shown. By default, only user-created objects are shown; supply a pattern or the <literal>S</literal> modifier to include system objects. If the form <literal>\df+</literal> is used, additional information about each function is shown, including volatility, parallel safety, owner, security classification, access privileges, language, source code and description.
ru: Выводит список функций с типами данных их результатов, аргументов и классификацией: <quote>agg</quote> (агрегатная), <quote>normal</quote> (обычная), <quote>trigger</quote> (триггерная) или <quote>window</quote> (оконная). Чтобы получить функции только определённого вида (видов), добавьте в команду соответствующие буквы <literal>a</literal>, <literal>n</literal>, <literal>t</literal> или <literal>w</literal>. Если задан <replaceable class="parameter">шаблон</replaceable>, показываются только те функции, имена которых соответствуют ему. По умолчанию показываются только функции, созданные пользователями; для включения системных объектов нужно задать шаблон или добавить модификатор <literal>S</literal>. Если используется форма <literal>\df+</literal>, то дополнительно выводятся характеристики каждой функции: изменчивость, допустимость распараллеливания, владелец, классификация по безопасности, права доступа, язык, исходный код и описание.

source: To look up functions taking arguments or returning values of a specific data type, use your pager's search capability to scroll through the <literal>\df</literal> output.
ru: Чтобы найти функции с аргументами или возвращаемыми значениями определённого типа данных, воспользуйтесь имеющейся в постраничнике возможностью поиска в выводе <literal>\df</literal>.

source: Lists text search configurations. If <replaceable class="parameter">pattern</replaceable> is specified, only configurations whose names match the pattern are shown. If the form <literal>\dF+</literal> is used, a full description of each configuration is shown, including the underlying text search parser and the dictionary list for each parser token type.
ru: Выводит список конфигураций текстового поиска. Если указан <replaceable class="parameter">шаблон</replaceable>, показываются только те конфигурации, имена которых соответствуют ему. Если используется форма <literal>\dF+</literal>, то выводится полное описание для каждой конфигурации, включая базовый синтаксический анализатор и используемые словари для каждого типа фрагментов.

source: Lists text search dictionaries. If <replaceable class="parameter">pattern</replaceable> is specified, only dictionaries whose names match the pattern are shown. If the form <literal>\dFd+</literal> is used, additional information is shown about each selected dictionary, including the underlying text search template and the option values.
ru: Выводит список словарей текстового поиска. Если указан <replaceable class="parameter">шаблон</replaceable>, показываются только словари, имена которых соответствуют ему. Если используется форма <literal>\dFd+</literal>, то выводится дополнительная информация о каждом словаре, включая базовый шаблон текстового поиска и параметры инициализации.

source: Lists text search parsers. If <replaceable class="parameter">pattern</replaceable> is specified, only parsers whose names match the pattern are shown. If the form <literal>\dFp+</literal> is used, a full description of each parser is shown, including the underlying functions and the list of recognized token types.
ru: Выводит список анализаторов текстового поиска. Если указан <replaceable class="parameter">шаблон</replaceable>, показываются только те анализаторы, имена которых соответствуют ему. Если используется форма <literal>\dFp+</literal>, то выводится полное описание для каждого анализатора, включая базовые функции и список типов фрагментов.

source: Lists text search templates. If <replaceable class="parameter">pattern</replaceable> is specified, only templates whose names match the pattern are shown. If the form <literal>\dFt+</literal> is used, additional information is shown about each template, including the underlying function names.
ru: Выводит список шаблонов текстового поиска. Если указан <replaceable class="parameter">шаблон</replaceable>, показываются только шаблоны, имена которых соответствуют ему. Если используется форма <literal>\dFt+</literal>, то выводится дополнительная информация о каждом шаблоне, включая имена основных функций.

source: Lists database roles. (Since the concepts of <quote>users</quote> and <quote>groups</quote> have been unified into <quote>roles</quote>, this command is now equivalent to <literal>\du</literal>.) By default, only user-created roles are shown; supply the <literal>S</literal> modifier to include system roles. If <replaceable class="parameter">pattern</replaceable> is specified, only those roles whose names match the pattern are listed. If the form <literal>\dg+</literal> is used, additional information is shown about each role; currently this adds the comment for each role.
ru: Выводит список ролей базы данных. (Так как понятия <quote>пользователи</quote> и <quote>группы</quote> были объединены в <quote>роли</quote>, эта команда теперь эквивалентна <literal>\du</literal>.) По умолчанию выводятся только роли, созданные пользователями: чтобы увидеть и системные роли, добавьте модификатор <literal>S</literal>. Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только те роли, имена которых соответствуют ему. Если используется форма <literal>\dg+</literal>, то выводится дополнительная информация о каждой роли; в настоящее время это комментарий роли.

source: This is an alias for <command>\lo_list</command>, which shows a list of large objects.
ru: Это псевдоним для <command>\lo_list</command>, показывает список больших объектов.

source: Lists procedural languages. If <replaceable class="parameter">pattern</replaceable> is specified, only languages whose names match the pattern are listed. By default, only user-created languages are shown; supply the <literal>S</literal> modifier to include system objects. If <literal>+</literal> is appended to the command name, each language is listed with its call handler, validator, access privileges, and whether it is a system object.
ru: Выводит список процедурных языков. Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только те языки, имена которых соответствуют ему. По умолчанию показываются только языки, созданные пользователями. Для включения системных объектов нужно задать шаблон или добавить модификатор <literal>S</literal>. При добавлении <literal>+</literal> к имени команды для каждого языка дополнительно будут выводиться: обработчик вызова, функция проверки, права доступа и является ли язык системным объектом.

source: Lists schemas (namespaces). If <replaceable class="parameter">pattern</replaceable> is specified, only schemas whose names match the pattern are listed. By default, only user-created objects are shown; supply a pattern or the <literal>S</literal> modifier to include system objects. If <literal>+</literal> is appended to the command name, each object is listed with its associated permissions and description, if any.
ru: Выводит список схем (пространств имён). Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только те схемы, имена которых соответствуют ему. По умолчанию показываются только объекты, созданные пользователями. Для включения системных объектов нужно задать шаблон или добавить модификатор <literal>S</literal>. При добавлении <literal>+</literal> к имени команды для каждого объекта дополнительно будут выводиться права доступа и описание, при наличии.

source: Lists operators with their operand and result types. If <replaceable class="parameter">pattern</replaceable> is specified, only operators whose names match the pattern are listed. By default, only user-created objects are shown; supply a pattern or the <literal>S</literal> modifier to include system objects. If <literal>+</literal> is appended to the command name, additional information about each operator is shown, currently just the name of the underlying function.
ru: Выводит список операторов, их операндов и типы результата. Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только те операторы, имена которых соответствуют ему. По умолчанию показываются только объекты, созданные пользователями. Для включения системных объектов нужно задать шаблон или добавить модификатор <literal>S</literal>. При добавлении <literal>+</literal> к имени команды для каждого оператора будет выводиться дополнительная информация, сейчас это имя функции, на которой основан оператор.

source: Lists collations. If <replaceable class="parameter">pattern</replaceable> is specified, only collations whose names match the pattern are listed. By default, only user-created objects are shown; supply a pattern or the <literal>S</literal> modifier to include system objects. If <literal>+</literal> is appended to the command name, each collation is listed with its associated description, if any. Note that only collations usable with the current database's encoding are shown, so the results may vary in different databases of the same installation.
ru: Выводит список правил сортировки. Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только те правила, имена которых соответствуют ему. По умолчанию показываются только объекты, созданные пользователями. Для включения системных объектов нужно задать шаблон или добавить модификатор <literal>S</literal>. При добавлении <literal>+</literal> к имени команды для каждого объекта дополнительно будет выводиться описание, при наличии. Обратите внимание, что отображаются только правила сортировки, применимые к кодировке текущей базы данных, поэтому результат команды может отличаться для различных баз данных этой же установки <productname>PostgreSQL</productname>.

source: Lists tables, views and sequences with their associated access privileges. If <replaceable class="parameter">pattern</replaceable> is specified, only tables, views and sequences whose names match the pattern are listed.
ru: Выводит список таблиц, представлений и последовательностей с их правами доступа. Если указан <replaceable class="parameter">шаблон</replaceable>, отображаются только таблицы, представления и последовательности, имена которых соответствуют ему.

source: The <xref linkend="sql-grant"/> and <xref linkend="sql-revoke"/> commands are used to set access privileges. The meaning of the privilege display is explained under <xref linkend="sql-grant"/>.
ru: Для установки прав доступа используются команды <xref linkend="sql-grant"/> и <xref linkend="sql-revoke"/>. Смысл отображаемых привилегий объясняется в описании <xref linkend="sql-grant"/>.

source: role-pattern
ru: шаблон-ролей

source: database-pattern
ru: шаблон-баз

source: Lists defined configuration settings. These settings can be role-specific, database-specific, or both. <replaceable>role-pattern</replaceable> and <replaceable>database-pattern</replaceable> are used to select specific roles and databases to list, respectively. If omitted, or if <literal>*</literal> is specified, all settings are listed, including those not role-specific or database-specific, respectively.
ru: Выводит список специфических параметров конфигурации. Эти параметры могут быть специфическими для роли, специфическими для базы данных, или обеих. Параметры <replaceable>шаблон-ролей</replaceable> и <replaceable>шаблон-баз</replaceable> используются для отбора определённых ролей и баз данных, соответственно. Если они опущены, или указано <literal>*</literal>, выводятся все параметры конфигурации, в том числе не относящиеся к ролям или базам данных.

source: The <xref linkend="sql-alterrole"/> and <xref linkend="sql-alterdatabase"/> commands are used to define per-role and per-database configuration settings.
ru: Команды <xref linkend="sql-alterrole"/> и <xref linkend="sql-alterdatabase"/> используются для определения параметров конфигурации, специфических для роли или базы данных.

source: Lists replication publications. If <replaceable class="parameter">pattern</replaceable> is specified, only those publications whose names match the pattern are listed. If <literal>+</literal> is appended to the command name, the tables associated with each publication are shown as well.
ru: Выводит список реплицируемых публикаций. Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только те подписки, имена которых соответствуют ему. При добавлении <literal>+</literal> к имени команды для каждой публикации показываются также связанные с ней таблицы.

source: Lists replication subscriptions. If <replaceable class="parameter">pattern</replaceable> is specified, only those subscriptions whose names match the pattern are listed. If <literal>+</literal> is appended to the command name, additional properties of the subscriptions are shown.
ru: Выводит список подписок на репликацию. Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только те подписки, имена которых соответствуют ему. При добавлении <literal>+</literal> к имени команды выводятся дополнительные свойства подписок.

source: Lists data types. If <replaceable class="parameter">pattern</replaceable> is specified, only types whose names match the pattern are listed. If <literal>+</literal> is appended to the command name, each type is listed with its internal name and size, its allowed values if it is an <type>enum</type> type, and its associated permissions. By default, only user-created objects are shown; supply a pattern or the <literal>S</literal> modifier to include system objects.
ru: Выводит список типов данных. Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только те типы, имена которых соответствуют ему. При добавлении <literal>+</literal> к имени команды для каждого типа данных дополнительно будет выводиться: внутреннее имя типа, размер, допустимые значения для типа <type>enum</type> и права доступа. По умолчанию показываются только объекты, созданные пользователями. Для включения системных объектов нужно задать шаблон или добавить модификатор <literal>S</literal>.

source: Lists database roles. (Since the concepts of <quote>users</quote> and <quote>groups</quote> have been unified into <quote>roles</quote>, this command is now equivalent to <literal>\dg</literal>.) By default, only user-created roles are shown; supply the <literal>S</literal> modifier to include system roles. If <replaceable class="parameter">pattern</replaceable> is specified, only those roles whose names match the pattern are listed. If the form <literal>\du+</literal> is used, additional information is shown about each role; currently this adds the comment for each role.
ru: Выводит список ролей базы данных. (Так как понятия <quote>пользователи</quote> и <quote>группы</quote> были объединены в <quote>роли</quote>, эта команда теперь равнозначна <literal>\dg</literal>.) По умолчанию выводятся только роли, созданные пользователями: чтобы увидеть и системные роли, добавьте модификатор <literal>S</literal>. Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только те роли, имена которых соответствуют ему. Если используется форма <literal>\du+</literal>, то выводится дополнительная информация о каждой роли; в настоящее время это комментарий роли.
