Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/psql-ref.po
Languages: ru

source: If you call <command>\set</command> without a second argument, the variable is set, with an empty string as value. To unset (i.e., delete) a variable, use the command <command>\unset</command>. To show the values of all variables, call <command>\set</command> without any argument.
ru: При вызове <command>\set</command> без второго аргумента переменной присваивается пустая строка. Для удаления переменной используется команда <command>\unset</command>. Чтобы посмотреть значения всех переменных, нужно вызвать <command>\set</command> без аргументов.

source: A number of these variables are treated specially by <application>psql</application>. They represent certain option settings that can be changed at run time by altering the value of the variable, or in some cases represent changeable state of <application>psql</application>. Although you can use these variables for other purposes, this is not recommended, as the program behavior might grow really strange really quickly. By convention, all specially treated variables' names consist of all upper-case ASCII letters (and possibly digits and underscores). To ensure maximum compatibility in the future, avoid using such variable names for your own purposes. A list of all specially treated variables follows.
ru: Некоторые переменные обрабатываются в <application>psql</application> особым образом. Они представляют собой определённые параметры, которые могут быть изменены во время выполнения путём присваивания нового значения, а в некоторых переменных содержится изменяемое состояние <application>psql</application>. Хотя эти переменные можно использовать и для других целей, делать это не рекомендуется, так как поведение программы может быстро стать очень странным. По соглашению, имена специальных переменных состоят из всех заглавных ASCII букв (и, возможно, цифр и знаков подчёркивания). Для максимальной совместимости в будущем старайтесь не использовать такие имена для собственных переменных. Далее идет список переменных, обрабатываемых особым образом.

source: The name of the database you are currently connected to. This is set every time you connect to a database (including program start-up), but can be unset.
ru: Имя базы данных, к которой вы сейчас подключены. Устанавливается всякий раз при подключении к базе данных (в том числе при старте программы), но эту переменную можно удалить.

source: If set to <literal>all</literal>, all nonempty input lines are printed to standard output as they are read. (This does not apply to lines read interactively.) To select this behavior on program start-up, use the switch <option>-a</option>. If set to <literal>queries</literal>, <application>psql</application> prints each query to standard output as it is sent to the server. The switch for this is <option>-e</option>. If set to <literal>errors</literal>, then only failed queries are displayed on standard error output. The switch for this is <option>-b</option>. If unset, or if set to <literal>none</literal> (or any other value than those above) then no queries are displayed.
ru: Со значением <literal>all</literal> все непустые входящие строки выводятся на стандартный вывод по мере их чтения. (Это не относится к строкам, считываемым интерактивно.) Чтобы выбрать такое поведение при запуске программы, добавьте ключ <option>-a</option>. Со значением <literal>queries</literal>, <application>psql</application> выводит каждый запрос, отправленный серверу, на стандартный вывод. Этому значению соответствует ключ <option>-e</option>. Со значением <literal>errors</literal> в стандартный канал ошибок выдаются только запросы, вызвавшие ошибки. Ему соответствует ключ <option>-b</option>. В случае отсутствия значения и с вариантом <literal>none</literal> (либо другим вариантом, кроме перечисленных) запросы не выводятся.

source: When this variable is set to <literal>on</literal> and a backslash command queries the database, the query is first shown. This feature helps you to study <productname>PostgreSQL</productname> internals and provide similar functionality in your own programs. (To select this behavior on program start-up, use the switch <option>-E</option>.) If you set the variable to the value <literal>noexec</literal>, the queries are just shown but are not actually sent to the server and executed.
ru: Если эта переменная установлена в значение <literal>on</literal>, то при выполнении метакоманд, запрашивающих базу данных, сначала будет выводиться текст запроса. Это позволяет изучать внутреннее устройство <productname>PostgreSQL</productname> и реализовывать похожую функциональность в своих программах. (Чтобы включить такое поведение при старте <application>psql</application>, используйте параметр <option>-E</option>.) При установке переменной в значение <literal>noexec</literal> запросы просто отображаются, но не отправляются на сервер и не выполняются.

source: The current client character set encoding.
ru: Содержит текущую кодировку набора символов клиента.

source: If this variable is set to an integer value &gt; 0, the results of <command>SELECT</command> queries are fetched and displayed in groups of that many rows, rather than the default behavior of collecting the entire result set before display. Therefore only a limited amount of memory is used, regardless of the size of the result set. Settings of 100 to 1000 are commonly used when enabling this feature. Keep in mind that when using this feature, a query might fail after having already displayed some rows.
ru: Если переменная установлена в целое значение &gt; 0, результаты запросов <command>SELECT</command> извлекаются из базы данных и отображаются группами с таким количеством строк, в отличие от поведения по умолчанию, когда перед отображением результирующий набор накапливается целиком. Это позволяет использовать ограниченный размер памяти независимо от размера выборки. При включении этой функциональности обычно используются значения от 100 до 1000. Имейте в виду, что запрос может завершиться ошибкой после отображения некоторого количества строк.

source: The file name that will be used to store the history list. The default value is <filename>~/.psql_history</filename>. For example, putting: <placeholder-1/> in <filename>~/.psqlrc</filename> will cause <application>psql</application> to maintain a separate history for each database.
ru: Имя файла для хранения истории команд. Значение по умолчанию <filename>~/.psql_history</filename>. Например, установив: <placeholder-1/> в <filename>~/.psqlrc</filename>, <application>psql</application> будет поддерживать отдельную историю для каждой базы данных.

source: The number of commands to store in the command history. The default value is 500.
ru: Количество команд для хранения в истории. Значение по умолчанию 500.

source: The database server host you are currently connected to. This is set every time you connect to a database (including program start-up), but can be unset.
ru: Имя компьютера, где работает сервер базы данных, к которому вы сейчас подключены. Устанавливается всякий раз при подключении к базе данных (в том числе при старте программы), но эту переменную можно удалить.

source: If unset, sending an <acronym>EOF</acronym> character (usually <keycombo action="simul"><keycap>Control</keycap><keycap>D</keycap></keycombo>) to an interactive session of <application>psql</application> will terminate the application. If set to a numeric value, that many <acronym>EOF</acronym> characters are ignored before the application terminates. If the variable is set but has no numeric value, the default is 10.
ru: Если не установлена, символ конца файла (<acronym>EOF</acronym>, обычно <keycombo action="simul"><keycap>Control</keycap><keycap>D</keycap></keycombo>), переданный в интерактивном сеансе <application>psql</application>, завершит приложение. Если задано числовое значение, то именно такое количество символов <acronym>EOF</acronym> будет проигнорировано, прежде чем приложение завершит работу. Если переменная установлена, но имеет не числовое значение, подразумевается 10.

source: When set to <literal>on</literal>, if a statement in a transaction block generates an error, the error is ignored and the transaction continues. When set to <literal>interactive</literal>, such errors are only ignored in interactive sessions, and not when reading script files. When unset or set to <literal>off</literal>, a statement in a transaction block that generates an error aborts the entire transaction. The error rollback mode works by issuing an implicit <command>SAVEPOINT</command> for you, just before each command that is in a transaction block, and then rolling back to the savepoint if the command fails.
ru: При значении <literal>on</literal>, если команда в транзакционном блоке выдаёт ошибку, ошибка игнорируется и транзакция продолжается. При значении <literal>interactive</literal> такие ошибки игнорируются только в интерактивных сессиях, но не в скриптах. Если переменная не установлена или при значении <literal>off</literal> команда, вызвавшая ошибку в транзакционном блоке, отменяет всю транзакцию. Режим отката транзакции при возникновении ошибки обеспечивается выполнением неявных команд <command>SAVEPOINT</command> перед каждой командой в транзакционном блоке и откатом к точке сохранения в случае ошибки.

source: The database server port to which you are currently connected. This is set every time you connect to a database (including program start-up), but can be unset.
ru: Содержит порт сервера базы данных, к которому вы сейчас подключены. Устанавливается всякий раз при подключении к базе данных (в том числе при старте программы), но эту переменную можно удалить.

source: The database user you are currently connected as. This is set every time you connect to a database (including program start-up), but can be unset.
ru: Содержит имя пользователя базы данных, который сейчас подключён. Устанавливается всякий раз при подключении к базе данных (в том числе при старте программы), но эту переменную можно удалить.

source: In prompt 1 normally <literal>=</literal>, but <literal>^</literal> if in single-line mode, or <literal>!</literal> if the session is disconnected from the database (which can happen if <command>\connect</command> fails). In prompt 2 <literal>%R</literal> is replaced by a character that depends on why <application>psql</application> expects more input: <literal>-</literal> if the command simply wasn't terminated yet, but <literal>*</literal> if there is an unfinished <literal>/* ... */</literal> comment, a single quote if there is an unfinished quoted string, a double quote if there is an unfinished quoted identifier, a dollar sign if there is an unfinished dollar-quoted string, or <literal>(</literal> if there is an unmatched left parenthesis. In prompt 3 <literal>%R</literal> doesn't produce anything.
ru: В приглашении 1 это обычно символ <literal>=</literal>, но <literal>^</literal> в однострочном режиме, либо <literal>!</literal>, если сеанс не подключён к базе данных (что возможно при ошибке <command>\connect</command>). В приглашении 2 <literal>%R</literal> заменяется символом, показывающим, почему <application>psql</application> ожидает дополнительный ввод: <literal>-</literal>, если команда просто ещё не была завершена, но <literal>*</literal>, если не завершён комментарий <literal>/* ... */</literal>; апостроф, если не завершена строка в апострофах; кавычки, если не завершён идентификатор в кавычках; знак доллара, если не завершена строка в долларах; либо <literal>(</literal>, если после открывающей скобки не хватает закрывающей. В приглашении 3 <literal>%R</literal> не выдаёт ничего.

source: The location of the history file can be set explicitly via the <envar>PSQL_HISTORY</envar> environment variable.
ru: Расположение файла истории можно задать явно через переменную окружения <envar>PSQL_HISTORY</envar>.

source: testdb=&gt; <userinput>\d my_table</userinput> Table "my_table" Attribute | Type | Modifier -----------+---------+-------------------- first | integer | not null default 0 second | text |
ru: testdb=&gt; <userinput>\d my_table</userinput> Таблица "my_table" Атрибут | Тип | Модификаторы ---------+---------+-------------------- first | integer | NOT NULL DEFAULT 0 second | text |
