Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/psql-ref.po
Languages: ru

source: The <command>\if</command> and <command>\elif</command> commands read their argument(s) and evaluate them as a boolean expression. If the expression yields <literal>true</literal> then processing continues normally; otherwise, lines are skipped until a matching <command>\elif</command>, <command>\else</command>, or <command>\endif</command> is reached. Once an <command>\if</command> or <command>\elif</command> test has succeeded, the arguments of later <command>\elif</command> commands in the same block are not evaluated but are treated as false. Lines following an <command>\else</command> are processed only if no earlier matching <command>\if</command> or <command>\elif</command> succeeded.
ru: Команды <command>\if</command> и <command>\elif</command> считывают свои аргументы и вычисляют их как логические выражения. Если выражение выдаёт <literal>true</literal>, обработка продолжается как обычно; в противном случае входные строки пропускаются до достижения соответствующих команд <command>\elif</command>, <command>\else</command> или <command>\endif</command>. Как только проверка <command>\if</command> или <command>\elif</command> оказывается успешной, аргументы последующих команд <command>\elif</command> в том же блоке не вычисляются, а считаются ложными. Строки, следующие за <command>\else</command>, обрабатываются только если ни одна из предыдущих проверок <command>\if</command> или <command>\elif</command> не была успешной.

source: The <replaceable class="parameter">expression</replaceable> argument of an <command>\if</command> or <command>\elif</command> command is subject to variable interpolation and backquote expansion, just like any other backslash command argument. After that it is evaluated like the value of an on/off option variable. So a valid value is any unambiguous case-insensitive match for one of: <literal>true</literal>, <literal>false</literal>, <literal>1</literal>, <literal>0</literal>, <literal>on</literal>, <literal>off</literal>, <literal>yes</literal>, <literal>no</literal>. For example, <literal>t</literal>, <literal>T</literal>, and <literal>tR</literal> will all be considered to be <literal>true</literal>.
ru: В аргументе <replaceable class="parameter">выражение</replaceable> команд <command>\if</command> и <command>\elif</command> производится подстановка переменных и раскрытие кавычек, как и в аргументе любой другой команды с обратной косой. После этого полученное значение оценивается как значение переменной да/нет. Так что истинным значением будет любое однозначное вхождение без учёта регистра одной из строк (или подстрок): <literal>true</literal>, <literal>false</literal>, <literal>1</literal>, <literal>0</literal>, <literal>on</literal>, <literal>off</literal>, <literal>yes</literal>, <literal>no</literal>. Например, строки <literal>t</literal>, <literal>T</literal> и <literal>tR</literal> все будут восприниматься как <literal>true</literal>.

source: Expressions that do not properly evaluate to true or false will generate a warning and be treated as false.
ru: Если выражения не приводятся к значениям true или false, будет выдано предупреждение, а их результат будет считаться ложным.

source: Lines being skipped are parsed normally to identify queries and backslash commands, but queries are not sent to the server, and backslash commands other than conditionals (<command>\if</command>, <command>\elif</command>, <command>\else</command>, <command>\endif</command>) are ignored. Conditional commands are checked only for valid nesting. Variable references in skipped lines are not expanded, and backquote expansion is not performed either.
ru: Пропускаемые строки разбираются как обычно (в них выявляются запросы и команды с обратной косой), но не передаются серверу, а команды с обратной косой, отличные от условных (<command>\if</command>, <command>\elif</command>, <command>\else</command>, <command>\endif</command>), просто игнорируются. В командах условий проверяется только правильность вложенности. Ссылки на переменные в пропускаемых строках не разворачиваются, как не выполняется и раскрытие обратных кавычек.

source: All the backslash commands of a given conditional block must appear in the same source file. If EOF is reached on the main input file or an <command>\include</command>-ed file before all local <command>\if</command>-blocks have been closed, then <application>psql</application> will raise an error.
ru: Все команды с обратной косой в одном условном блоке должны содержаться в одном исходном файле. Если до того, как будут закрыты все локальные блоки <command>\if</command>, в основном файле команд будет достигнут конец файла или встретится включение другого файла (команда <command>\include</command>), <application>psql</application> выдаст ошибку.

source: Here is an example:
ru: Например:

source: -- check for the existence of two separate records in the database and store -- the results in separate psql variables SELECT EXISTS(SELECT 1 FROM customer WHERE customer_id = 123) as is_customer, EXISTS(SELECT 1 FROM employee WHERE employee_id = 456) as is_employee \gset \if :is_customer SELECT * FROM customer WHERE customer_id = 123; \elif :is_employee \echo 'is not a customer but is an employee' SELECT * FROM employee WHERE employee_id = 456; \else \if yes \echo 'not a customer or employee' \else \echo 'this will never print' \endif \endif
ru: -- проверка существования двух отдельных записей в базе данных и сохранение -- результатов в двух разных переменных psql SELECT EXISTS(SELECT 1 FROM customer WHERE customer_id = 123) as is_customer, EXISTS(SELECT 1 FROM employee WHERE employee_id = 456) as is_employee \gset \if :is_customer SELECT * FROM customer WHERE customer_id = 123; \elif :is_employee \echo 'is not a customer but is an employee' SELECT * FROM employee WHERE employee_id = 456; \else \if yes \echo 'not a customer or employee' \else \echo 'this will never print' \endif \endif

source: <literal>\ir</literal> or <literal>\include_relative</literal> <replaceable class="parameter">filename</replaceable>
ru: <literal>\ir</literal> или <literal>\include_relative</literal> <replaceable class="parameter">filename</replaceable>

source: The <literal>\ir</literal> command is similar to <literal>\i</literal>, but resolves relative file names differently. When executing in interactive mode, the two commands behave identically. However, when invoked from a script, <literal>\ir</literal> interprets file names relative to the directory in which the script is located, rather than the current working directory.
ru: Команда <literal>\ir</literal> похожа на <literal>\i</literal>, но по-разному интерпретирует относительные имена файлов. При выполнении в интерактивном режиме две команды ведут себя одинаково. Однако, при вызове из скрипта <literal>\ir</literal> интерпретирует имена файлов относительно каталога, в котором расположен скрипт, а не текущего рабочего каталога.

source: <literal>\l[+]</literal> or <literal>\list[+] [ <link linkend="app-psql-patterns"><replaceable class="parameter">pattern</replaceable></link> ]</literal>
ru: <literal>\l[+]</literal> или <literal>\list[+] [ <link linkend="app-psql-patterns"><replaceable class="parameter">шаблон</replaceable></link> ]</literal>

source: List the databases in the server and show their names, owners, character set encodings, and access privileges. If <replaceable class="parameter">pattern</replaceable> is specified, only databases whose names match the pattern are listed. If <literal>+</literal> is appended to the command name, database sizes, default tablespaces, and descriptions are also displayed. (Size information is only available for databases that the current user can connect to.)
ru: Выводит список баз данных на сервере и показывает их имена, владельцев, кодировку набора символов и права доступа. Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только базы данных, имена которых соответствуют ему. При добавлении <literal>+</literal> к имени команды также отображаются: размер базы данных, табличное пространство по умолчанию и описание. (Информация о размере доступна только для баз данных, к которым текущий пользователь может подключиться.)

source: loid
ru: oid_БО

source: Reads the large object with <acronym>OID</acronym> <replaceable class="parameter">loid</replaceable> from the database and writes it to <replaceable class="parameter">filename</replaceable>. Note that this is subtly different from the server function <function>lo_export</function>, which acts with the permissions of the user that the database server runs as and on the server's file system.
ru: Читает большой объект с <acronym>OID</acronym> <replaceable class="parameter">loid</replaceable> из базы данных и записывает его в файл <replaceable class="parameter">имя_файла</replaceable>. Обратите внимание, что это несколько отличается от функции сервера <function>lo_export</function>, которая действует с правами пользователя, от имени которого работает сервер базы данных, и в файловой системе сервера.

source: Use <command>\lo_list</command> to find out the large object's <acronym>OID</acronym>.
ru: Используйте <command>\lo_list</command> для получения <acronym>OID</acronym> больших объектов.

source: comment
ru: комментарий

source: Stores the file into a <productname>PostgreSQL</productname> large object. Optionally, it associates the given comment with the object. Example: <placeholder-1/> The response indicates that the large object received object ID 152801, which can be used to access the newly-created large object in the future. For the sake of readability, it is recommended to always associate a human-readable comment with every object. Both OIDs and comments can be viewed with the <command>\lo_list</command> command.
ru: Сохраняет файл в большом объекте <productname>PostgreSQL</productname>. При этом с объектом может быть связан указанный комментарий. Пример: <placeholder-1/> Ответ указывает на то, что большой объект получил OID 152801, который может быть использован для доступа к вновь созданному объекту в будущем. Для удобства чтения рекомендуется всегда связывать объекты с понятными комментариями. OID и комментарии можно посмотреть с помощью команды <command>\lo_list</command>.

source: Note that this command is subtly different from the server-side <function>lo_import</function> because it acts as the local user on the local file system, rather than the server's user and file system.
ru: Обратите внимание, что это немного отличается от функции сервера <function>lo_import</function>, так как действует от имени локального пользователя в локальной файловой системе, а не пользователя сервера в файловой системе сервера.

source: Shows a list of all <productname>PostgreSQL</productname> large objects currently stored in the database, along with any comments provided for them.
ru: Показывает список всех больших объектов <productname>PostgreSQL</productname>, хранящихся в базе данных, вместе с предоставленными комментариями.

source: Deletes the large object with <acronym>OID</acronym> <replaceable class="parameter">loid</replaceable> from the database.
ru: Удаляет большой объект с <acronym>OID</acronym> <replaceable class="parameter">loid</replaceable> из базы данных.

source: <literal>\o</literal> or <literal>\out [ <replaceable class="parameter">filename</replaceable> ]</literal>
ru: <literal>\o</literal> или <literal>\out [ <replaceable class="parameter">имя_файла</replaceable> ]</literal>

source: <literal>\o</literal> or <literal>\out [ |<replaceable class="parameter">command</replaceable> ]</literal>
ru: <literal>\o</literal> или <literal>\out [ |<replaceable class="parameter">команда</replaceable> ]</literal>

source: Arranges to save future query results to the file <replaceable class="parameter">filename</replaceable> or pipe future results to the shell command <replaceable class="parameter">command</replaceable>. If no argument is specified, the query output is reset to the standard output.
ru: Результаты запросов будут сохраняться в файле <replaceable class="parameter">имя_файла</replaceable> или перенаправляться команде оболочки (заданной аргументом <replaceable class="parameter">команда</replaceable>). Если аргумент не указан, результаты запросов перенаправляются на стандартный вывод.

source: <quote>Query results</quote> includes all tables, command responses, and notices obtained from the database server, as well as output of various backslash commands that query the database (such as <command>\d</command>); but not error messages.
ru: <quote>Результаты запросов</quote> включают в себя все таблицы, ответы команд, уведомления, полученные от сервера баз данных, а также вывод от метакоманд, обращающихся к базе (таких как <command>\d</command>), но не сообщения об ошибках.

source: To intersperse text output in between query results, use <command>\qecho</command>.
ru: Чтобы вставить текст между результатами запросов, используйте <command>\qecho</command>.

source: <literal>\p</literal> or <literal>\print</literal>
ru: <literal>\p</literal> или <literal>\print</literal>

source: Print the current query buffer to the standard output. If the current query buffer is empty, the most recently executed query is printed instead.
ru: Печатает содержимое буфера текущего запроса на стандартный вывод. Если этот буфер пуст, будет напечатан последний выполненный запрос.

source: Changes the password of the specified user (by default, the current user). This command prompts for the new password, encrypts it, and sends it to the server as an <command>ALTER ROLE</command> command. This makes sure that the new password does not appear in cleartext in the command history, the server log, or elsewhere.
ru: Изменяет пароль указанного пользователя (по умолчанию, текущего пользователя). Эта команда запрашивает новый пароль, шифрует и отправляет его на сервер в виде команды <command>ALTER ROLE</command>. Это гарантирует, что новый пароль не отображается в открытом виде в истории команд, журнале сервера или в другом месте.

source: name
ru: имя

source: Prompts the user to supply text, which is assigned to the variable <replaceable class="parameter">name</replaceable>. An optional prompt string, <replaceable class="parameter">text</replaceable>, can be specified. (For multiword prompts, surround the text with single quotes.)
ru: Предлагает пользователю ввести значение, которое будет присвоено переменной <replaceable class="parameter">имя</replaceable>. Дополнительно можно указать подсказку <replaceable class="parameter">text</replaceable>. (Если подсказка состоит из нескольких слов, то её текст нужно взять в одинарные кавычки).

source: By default, <literal>\prompt</literal> uses the terminal for input and output. However, if the <option>-f</option> command line switch was used, <literal>\prompt</literal> uses standard input and standard output.
ru: По умолчанию, <literal>\prompt</literal> использует терминал для ввода и вывода. Однако, если используется параметр командной строки <option>-f</option>, <literal>\prompt</literal> использует стандартный ввод и стандартный вывод.

source: value
ru: значение

source: This command sets options affecting the output of query result tables. <replaceable class="parameter">option</replaceable> indicates which option is to be set. The semantics of <replaceable class="parameter">value</replaceable> vary depending on the selected option. For some options, omitting <replaceable class="parameter">value</replaceable> causes the option to be toggled or unset, as described under the particular option. If no such behavior is mentioned, then omitting <replaceable class="parameter">value</replaceable> just results in the current setting being displayed.
ru: Эта команда устанавливает параметры, влияющие на вывод результатов запросов. <replaceable class="parameter">option</replaceable> указывает, какой параметр необходимо установить. Семантика <replaceable class="parameter">value</replaceable> меняется в зависимости от выбранного параметра. Для некоторых параметров, отсутствие <replaceable class="parameter">value</replaceable> означает переключение значения, либо сброс значения, как описано ниже в разделе конкретного параметра. Если такое поведение не упоминается, то пропуск <replaceable class="parameter">value</replaceable> приводит к отображению текущего значения параметра.

source: <command>\pset</command> without any arguments displays the current status of all printing options.
ru: <command>\pset</command> без аргументов выводит текущий статус всех параметров команды.

source: The <replaceable class="parameter">value</replaceable> must be a number. In general, the higher the number the more borders and lines the tables will have, but details depend on the particular format. In <acronym>HTML</acronym> format, this will translate directly into the <literal>border=...</literal> attribute. In most other formats only values 0 (no border), 1 (internal dividing lines), and 2 (table frame) make sense, and values above 2 will be treated the same as <literal>border = 2</literal>. The <literal>latex</literal> and <literal>latex-longtable</literal> formats additionally allow a value of 3 to add dividing lines between data rows.
ru: Здесь <replaceable class="parameter">значение</replaceable> должно быть числом. В целом, чем больше это число, тем больше границ и линий будет в таблицах, но детали зависят от формата. В формате <acronym>HTML</acronym> заданное значение напрямую отображается в атрибут <literal>border=...</literal>. Для большинства других форматов имеют смысл только значения 0 (нет границы), 1 (внутренние разделительные линии) и 2 (граница таблицы), а значения больше 2 воспринимаются как <literal>border = 2</literal>. Форматы <literal>latex</literal> и <literal>latex-longtable</literal> дополнительно поддерживают значение 3, добавляющее разделительные линии между строками данных.

source: Sets the target width for the <literal>wrapped</literal> format, and also the width limit for determining whether output is wide enough to require the pager or switch to the vertical display in expanded auto mode. Zero (the default) causes the target width to be controlled by the environment variable <envar>COLUMNS</envar>, or the detected screen width if <envar>COLUMNS</envar> is not set. In addition, if <literal>columns</literal> is zero then the <literal>wrapped</literal> format only affects screen output. If <literal>columns</literal> is nonzero then file and pipe output is wrapped to that width as well.
ru: Устанавливает максимальную ширину для формата <literal>wrapped</literal>, а также ограничение по ширине, свыше которого будет требоваться постраничник или произойдёт переключение в вертикальное отображение при режиме <literal>expanded auto</literal>. При значении 0 (по умолчанию) максимальная ширина управляется переменной среды <envar>COLUMNS</envar> или шириной экрана, если <envar>COLUMNS</envar> не установлена. Кроме того, если <literal>columns</literal> равно нулю, то формат <literal>wrapped</literal> влияет только на вывод на экран. Если <literal>columns</literal> не равно 0, то это также влияет на вывод в файл или в другую команду через канал.

source: <literal>expanded</literal> (or <literal>x</literal>)
ru: <literal>expanded</literal> (или <literal>x</literal>)

source: If <replaceable class="parameter">value</replaceable> is specified it must be either <literal>on</literal> or <literal>off</literal>, which will enable or disable expanded mode, or <literal>auto</literal>. If <replaceable class="parameter">value</replaceable> is omitted the command toggles between the on and off settings. When expanded mode is enabled, query results are displayed in two columns, with the column name on the left and the data on the right. This mode is useful if the data wouldn't fit on the screen in the normal <quote>horizontal</quote> mode. In the auto setting, the expanded mode is used whenever the query output has more than one column and is wider than the screen; otherwise, the regular mode is used. The auto setting is only effective in the aligned and wrapped formats. In other formats, it always behaves as if the expanded mode is off.
ru: Указанное <replaceable class="parameter">значение</replaceable> допускает варианты <literal>on</literal> или <literal>off</literal>, которые включают или отключают развёрнутый режим, либо <literal>auto</literal>. Если <replaceable class="parameter">значение</replaceable> опущено, команда включает/отключает режим. Когда развёрнутый режим включён, результаты запроса выводятся в две колонки: имя столбца в левой, данные в правой. Этот режим полезен, если данные не помещаются на экране в обычном <quote>горизонтальном</quote> режиме. При выборе <literal>auto</literal> развёрнутый режим используется, когда результат запроса содержит несколько столбцов и по ширине не умещается на экране; в противном случае используется обычный режим. Режим <literal>auto</literal> распространяется только на форматы <literal>aligned</literal> и <literal>wrapped</literal>. С другими форматами он всегда равнозначен отключённому состоянию.

source: Specifies the field separator to be used in unaligned output format. That way one can create, for example, tab- or comma-separated output, which other programs might prefer. To set a tab as field separator, type <literal>\pset fieldsep '\t'</literal>. The default field separator is <literal>'|'</literal> (a vertical bar).
ru: Устанавливает разделитель полей для невыровненного режима вывода запросов. Таким образом, можно формировать вывод, в котором значения будут разделены табуляцией или запятыми. Это может быть предпочтительным для использования в других программах. Для установки символа табуляции в качестве разделителя полей, введите <literal>\pset fieldsep '\t'</literal>. По умолчанию используется вертикальная черта (<literal>'|'</literal>).

source: Sets the field separator to use in unaligned output format to a zero byte.
ru: Устанавливает разделитель полей для невыровненного режима вывода в нулевой байт.

source: If <replaceable class="parameter">value</replaceable> is specified it must be either <literal>on</literal> or <literal>off</literal> which will enable or disable display of the table footer (the <literal>(<replaceable>n</replaceable> rows)</literal> count). If <replaceable class="parameter">value</replaceable> is omitted the command toggles footer display on or off.
ru: Для <replaceable class="parameter">value</replaceable> возможны два значения: <literal>on</literal> или <literal>off</literal>, которые включают или отключают вывод результирующей строки с количеством выбранных записей <literal>(<replaceable>n</replaceable> строк)</literal>. Если <replaceable class="parameter">value</replaceable> не указано, то команда переключает текущее значение в <literal>on</literal> или <literal>off</literal>.

source: Sets the output format to one of <literal>unaligned</literal>, <literal>aligned</literal>, <literal>wrapped</literal>, <literal>html</literal>, <literal>asciidoc</literal>, <literal>latex</literal> (uses <literal>tabular</literal>), <literal>latex-longtable</literal>, or <literal>troff-ms</literal>. Unique abbreviations are allowed. (That would mean one letter is enough.)
ru: Устанавливает один из следующих форматов вывода: <literal>unaligned</literal>, <literal>aligned</literal>, <literal>wrapped</literal>, <literal>html</literal>, <literal>asciidoc</literal>, <literal>latex</literal> (использует <literal>tabular</literal>), <literal>latex-longtable</literal> или <literal>troff-ms</literal>. Допускается сокращение слова до уникального значения. (Это значит, что одной буквы будет достаточно.)
