Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/psql-ref.po
Languages: ru

source: If you want to use <application>psql</application> to connect to several servers of different major versions, it is recommended that you use the newest version of <application>psql</application>. Alternatively, you can keep around a copy of <application>psql</application> from each major version and be sure to use the version that matches the respective server. But in practice, this additional complication should not be necessary.
ru: Если вы хотите, применяя <application>psql</application>, подключаться к нескольким серверам с различными основными версиями, рекомендуется использовать последнюю версию <application>psql</application>. Также можно собрать копии <application>psql</application> от каждой основной версии и использовать ту, которая соответствует версии сервера. Но на практике в этих дополнительных сложностях нет необходимости.

source: Before <productname>PostgreSQL</productname> 9.6, the <option>-c</option> option implied <option>-X</option> (<option>--no-psqlrc</option>); this is no longer the case.
ru: В <productname>PostgreSQL</productname> до версии 9.6 параметр <option>-c</option> подразумевал <option>-X</option> (<option>--no-psqlrc</option>); теперь это не так.

source: Before <productname>PostgreSQL</productname> 8.4, <application>psql</application> allowed the first argument of a single-letter backslash command to start directly after the command, without intervening whitespace. Now, some whitespace is required.
ru: В <productname>PostgreSQL</productname> до 8.4 программа <application>psql</application> могла принять первый аргумент однобуквенной команды с обратной косой чертой сразу после команды, без промежуточного пробела. Теперь разделительный пробельный символ обязателен.

source: Notes for Windows Users
ru: Замечания для пользователей Windows

source: Set the code page by entering <userinput>cmd.exe /c chcp 1252</userinput>. (1252 is a code page that is appropriate for German; replace it with your value.) If you are using Cygwin, you can put this command in <filename>/etc/profile</filename>.
ru: Задать кодовую страницу, выполнив <userinput>cmd.exe /c chcp 1251</userinput>. (1251 это кодовая страница для России, замените на ваше значение.) При использовании Cygwin, эту команду можно записать в <filename>/etc/profile</filename>.

source: Set the console font to <literal>Lucida Console</literal>, because the raster font does not work with the ANSI code page.
ru: Установите консольный шрифт в <literal>Lucida Console</literal>, потому что растровый шрифт не работает с кодовой страницей ANSI.

source: <application>psql</application> is built as a <quote>console application</quote>. Since the Windows console windows use a different encoding than the rest of the system, you must take special care when using 8-bit characters within <application>psql</application>. If <application>psql</application> detects a problematic console code page, it will warn you at startup. To change the console code page, two things are necessary: <placeholder-1/>
ru: <application>psql</application> создан как <quote>консольное приложение</quote>. Поскольку в Windows консольные окна используют кодировку символов отличную от той, что используется для остальной системы, нужно проявить особую осторожность при использовании 8-битных символов. Если <application>psql</application> обнаружит проблемную кодовую страницу консоли, он предупредит вас при запуске. Чтобы изменить кодовую страницу консоли, необходимы две вещи: <placeholder-1/>

source: Examples
ru: Примеры

source: testdb=&gt; <userinput>\d my_table</userinput> Table "public.my_table" Column | Type | Collation | Nullable | Default --------+---------+-----------+----------+--------- first | integer | | not null | 0 second | text | | |
ru: testdb=&gt; <userinput>\d my_table</userinput> Таблица "public.my_table" Столбец | Тип | Правило сортировки | Допустимость NULL | По умолчанию first | integer | | not null | 0 second | text | | |

source: peter@localhost testdb=&gt; SELECT * FROM my_table; first | second -------+-------- 1 | one 2 | two 3 | three 4 | four (4 rows)
ru: peter@localhost testdb=&gt; SELECT * FROM my_table; first | second -------+-------- 1 | Один 2 | Два 3 | Три 4 | Четыре (4 строки)

source: peter@localhost testdb=&gt; <userinput>\pset border 2</userinput> Border style is 2. peter@localhost testdb=&gt; <userinput>SELECT * FROM my_table;</userinput> +-------+--------+ | first | second | +-------+--------+ | 1 | one | | 2 | two | | 3 | three | | 4 | four | +-------+--------+ (4 rows) peter@localhost testdb=&gt; <userinput>\pset border 0</userinput> Border style is 0. peter@localhost testdb=&gt; <userinput>SELECT * FROM my_table;</userinput> first second ----- ------ 1 one 2 two 3 three 4 four (4 rows) peter@localhost testdb=&gt; <userinput>\pset border 1</userinput> Border style is 1. peter@localhost testdb=&gt; <userinput>\pset format unaligned</userinput> Output format is unaligned. peter@localhost testdb=&gt; <userinput>\pset fieldsep ","</userinput> Field separator is ",". peter@localhost testdb=&gt; <userinput>\pset tuples_only</userinput> Showing only tuples. peter@localhost testdb=&gt; <userinput>SELECT second, first FROM my_table;</userinput> one,1 two,2 three,3 four,4
ru: peter@localhost testdb=&gt; <userinput>\pset border 2</userinput> Установлен стиль границ: 2. peter@localhost testdb=&gt; <userinput>SELECT * FROM my_table;</userinput> +-------+--------+ | first | second | +-------+--------+ | 1 | Один | | 2 | Два | | 3 | Три | | 4 | Четыре | +-------+--------+ (4 строки) peter@localhost testdb=&gt; <userinput>\pset border 0</userinput> Установлен стиль границ: 0. peter@localhost testdb=&gt; <userinput>SELECT * FROM my_table;</userinput> first second ----- ------ 1 Один 2 Два 3 Три 4 Четыре (4 строки) peter@localhost testdb=&gt; <userinput>\pset border 1</userinput> Установлен стиль границ: 1. peter@localhost testdb=&gt; <userinput>\pset format unaligned</userinput> Формат вывода: unaligned. peter@localhost testdb=&gt; <userinput>\pset fieldsep ','</userinput> Разделитель полей: ",". peter@localhost testdb=&gt; <userinput>\pset tuples_only</userinput> Выводятся только кортежи. peter@localhost testdb=&gt; <userinput>SELECT second, first FROM my_table;</userinput> Один,1 Два,2 Три,3 Четыре,4

source: peter@localhost testdb=&gt; <userinput>\a \t \x</userinput> Output format is aligned. Tuples only is off. Expanded display is on. peter@localhost testdb=&gt; <userinput>SELECT * FROM my_table;</userinput> -[ RECORD 1 ]- first | 1 second | one -[ RECORD 2 ]- first | 2 second | two -[ RECORD 3 ]- first | 3 second | three -[ RECORD 4 ]- first | 4 second | four
ru: peter@localhost testdb=&gt; <userinput>\a \t \x</userinput> Формат вывода: aligned. Режим вывода только кортежей выключен. Расширенный вывод включён. peter@localhost testdb=&gt; <userinput>SELECT * FROM my_table;</userinput> -[ RECORD 1 ]- first | 1 second | Один -[ RECORD 2 ]- first | 2 second | Два -[ RECORD 3 ]- first | 3 second | Три -[ RECORD 4 ]- first | 4 second | Четыре

source: The first example shows how to spread a command over several lines of input. Notice the changing prompt: <placeholder-1/> Now look at the table definition again: <placeholder-2/> Now we change the prompt to something more interesting: <placeholder-3/> Let's assume you have filled the table with data and want to take a look at it: <placeholder-4/> You can display tables in different ways by using the <command>\pset</command> command: <placeholder-5/> Alternatively, use the short commands: <placeholder-6/>
ru: Первый пример показывает, что для ввода одной команды может потребоваться несколько строк. Обратите внимание, как меняется приглашение: <placeholder-1/> Теперь посмотрим на определение таблицы: <placeholder-2/> Теперь изменим приглашение на что-то более интересное: <placeholder-3/> Предположим, что вы внесли данные в таблицу и хотите на них посмотреть: <placeholder-4/> Таблицу можно вывести разными способами при помощи команды <command>\pset</command>: <placeholder-5/> Также можно использовать короткие команды: <placeholder-6/>

source: When suitable, query results can be shown in a crosstab representation with the <command>\crosstabview</command> command: <placeholder-1/> This second example shows a multiplication table with rows sorted in reverse numerical order and columns with an independent, ascending numerical order. <placeholder-2/>
ru: Когда это уместно, результаты запроса можно просмотреть в виде перекрёстной таблицы с помощью команды <command>\crosstabview</command>: <placeholder-1/> Второй пример показывает таблицу умножения, строки в которой отсортированы в обратном числовом порядке, а столбцы — независимо, по возрастанию числовых значений. <placeholder-2/>

source: Use <replaceable class="parameter">separator</replaceable> as the record separator for unaligned output. This is equivalent to the <command>\pset recordsep</command> command.
ru: Использует <replaceable class="parameter">separator</replaceable> как разделитель записей при невыровненном режиме вывода. Эквивалентно команде <command>\pset recordsep</command>.

source: Turn off printing of column names and result row count footers, etc. This is equivalent to the <command>\t</command> command.
ru: Отключает вывод имён столбцов и результирующей строки с количеством выбранных записей. Эквивалентно команде <command>\t</command>.

source: Specifies options to be placed within the <acronym>HTML</acronym> <sgmltag>table</sgmltag> tag. See <command>\pset</command> for details.
ru: Задаёт атрибуты, которые будут вставлены в тег <acronym>HTML</acronym> <sgmltag>table</sgmltag>. За подробностями обратитесь к описанию <command>\pset</command>.

source: Perform a variable assignment, like the <command>\set</command> meta-command. Note that you must separate name and value, if any, by an equal sign on the command line. To unset a variable, leave off the equal sign. To set a variable with an empty value, use the equal sign but leave off the value. These assignments are done during a very early stage of start-up, so variables reserved for internal purposes might get overwritten later.
ru: Выполняет присвоение значения переменной, как метакоманда <command>\set</command>. Обратите внимание на то, что необходимо разделить имя переменной и значение (при наличии) знаком равенства в командной строке. Чтобы сбросить переменную, опустите знак равенства. Чтобы установить пустое значение, поставьте знак равенства, но опустите значение. Присваивания выполняются на очень ранней стадии запуска, поэтому если переменные зарезервированы для внутренних целей, то позже они могут быть перезаписаны.

source: Turn on the expanded table formatting mode. This is equivalent to the <command>\x</command> command.
ru: Включает режим развёрнутого вывода таблицы. Эквивалентно команде <command>\x</command>.

source: Set the field separator for unaligned output to a zero byte.
ru: Установить нулевой байт в качестве разделителя полей для невыровненного режима вывода.

source: Set the record separator for unaligned output to a zero byte. This is useful for interfacing, for example, with <literal>xargs -0</literal>.
ru: Установить нулевой байт в качестве разделителя записей для невыровненного режима вывода. Это полезно при взаимодействии с другими программами, например, с <literal>xargs -0</literal>.

source: Within an argument, text that is enclosed in backquotes (<literal>`</literal>) is taken as a command line that is passed to the shell. The output of the command (with any trailing newline removed) replaces the backquoted text.
ru: Текст аргумента, заключённый в обратные кавычки (<literal>`</literal>), считается командной строкой, которая передаётся в командную оболочку ОС. Вывод от этой команды (с удалёнными в конце символами новой строки) заменяет текст в обратных кавычках.

source: If an unquoted colon (<literal>:</literal>) followed by a <application>psql</application> variable name appears within an argument, it is replaced by the variable's value, as described in <xref linkend="app-psql-interpolation" endterm="app-psql-interpolation-title"/>.
ru: Если внутри аргумента не в кавычках встречается имя переменной <application>psql</application> с предшествующим двоеточием (<literal>:</literal>), оно заменяется значением переменной, как описано в <xref remap="6" linkend="app-psql-interpolation" endterm="app-psql-interpolation-title"/>.

source: The syntax of this command is similar to that of the <acronym>SQL</acronym> <xref linkend="sql-copy"/> command. All options other than the data source/destination are as specified for <xref linkend="sql-copy"/>. Because of this, special parsing rules apply to the <command>\copy</command> command. In particular, <application>psql</application>'s variable substitution rules and backslash escapes do not apply.
ru: Синтаксис команды похож на синтаксис <acronym>SQL</acronym>-команды <xref linkend="sql-copy"/>. Все параметры, кроме источника и получателя данных, соответствуют параметрам <xref linkend="sql-copy"/>. Поэтому к команде <command>\copy</command> применяются специальные правила разбора. В частности, не применяются правила подстановки переменных и экранирование с обратной косой чертой.

source: For each relation (table, view, index, sequence, or foreign table) or composite type matching the <replaceable class="parameter">pattern</replaceable>, show all columns, their types, the tablespace (if not the default) and any special attributes such as <literal>NOT NULL</literal> or defaults. Associated indexes, constraints, rules, and triggers are also shown. For foreign tables, the associated foreign server is shown as well. (<quote>Matching the pattern</quote> is defined in <xref linkend="app-psql-patterns" endterm="app-psql-patterns-title"/> below.)
ru: Для каждого отношения (таблицы, представления, индекса, последовательности, внешней таблицы) или составного типа, соответствующих <replaceable class="parameter">шаблону</replaceable>, показывает столбцы, их типы, табличное пространство (если оно не по умолчанию) и любые специальные атрибуты, такие как <literal>NOT NULL</literal> или значения по умолчанию. Также показываются связанные индексы, ограничения, правила и триггеры. Для сторонних таблиц показывается связанный сторонний сервер. (<quote>Соответствие шаблону</quote> определяется ниже в <xref remap="6" linkend="app-psql-patterns" endterm="app-psql-patterns-title"/>.)

source: For some types of relation, <literal>\d</literal> shows additional information for each column: column values for sequences, indexed expression for indexes and foreign data wrapper options for foreign tables.
ru: Для некоторых типов отношений <literal>\d</literal> показывает дополнительную информацию по каждому столбцу: значения столбца для последовательностей, индексное выражение для индексов и параметры обработчика внешних данных для внешних таблиц.

source: If <command>\d</command> is used without a <replaceable class="parameter">pattern</replaceable> argument, it is equivalent to <command>\dtvsE</command> which will show a list of all visible tables, views, sequences and foreign tables. This is purely a convenience measure.
ru: Если с <command>\d</command> не передаётся <replaceable class="parameter">шаблон</replaceable>, эта команда удобства ради воспринимается как <command>\dtvsE</command> и выдаёт список всех видимых таблиц, представлений, последовательностей и сторонних таблиц.

source: If <replaceable class="parameter">filename</replaceable> is specified, the file is edited; after the editor exits, its content is copied back to the query buffer. If no <replaceable class="parameter">filename</replaceable> is given, the current query buffer is copied to a temporary file which is then edited in the same fashion.
ru: Если указано имя файла <replaceable class="parameter">filename</replaceable>, файл открывается для редактирования. После выхода из редактора его содержимое копируется в буфер запроса. Если не указано имя файла, буфер текущего запроса копируется во временный файл и открывается в редакторе.

source: The new query buffer is then re-parsed according to the normal rules of <application>psql</application>, where the whole buffer is treated as a single line. (Thus you cannot make scripts this way. Use <command>\i</command> for that.) This means that if the query ends with (or contains) a semicolon, it is immediately executed. Otherwise it will merely wait in the query buffer; type semicolon or <literal>\g</literal> to send it, or <literal>\r</literal> to cancel.
ru: Затем новый буфер запроса повторно анализируется согласно обычным правилам <application>psql</application>, при этом весь буфер рассматривается как одна строка. (Таким образом, это не подходит для создания скриптов. Для скриптов используйте <command>\i</command>.) Если запрос заканчивается (или содержит) точкой с запятой, он немедленно выполняется. В противном случае он просто будет ждать в буфере запроса. Введите точку с запятой или <literal>\g</literal> для отправки на выполнение или <literal>\r</literal> для отмены.

source: Sets the field separator for unaligned query output. The default is the vertical bar (<literal>|</literal>). See also <command>\pset</command> for a generic way of setting output options.
ru: Устанавливает разделитель полей для невыровненного режима вывода запросов. По умолчанию используется вертикальная черта (<literal>|</literal>). См. также <command>\pset</command> для универсального способа настройки параметров вывода.

source: Sends the current query input buffer to the server, and optionally stores the query's output in <replaceable class="parameter">filename</replaceable> or pipes the output to the shell command <replaceable class="parameter">command</replaceable>. The file or command is written to only if the query successfully returns zero or more tuples, not if the query fails or is a non-data-returning SQL command.
ru: Отправляет содержимое буфера текущего запроса на сервер для выполнения, с возможностью сохранения результата запроса в файле <replaceable class="parameter">имя_файла</replaceable> или перенаправления вывода в команду оболочки ОС <replaceable class="parameter">команда</replaceable>. Вывод направляется в файл или команду, только если запрос успешно вернул 0 или более строк. Этого не происходит, если запрос завершился неудачно или выполнялась команда, не возвращающая данные.

source: A bare <literal>\g</literal> is essentially equivalent to a semicolon. A <literal>\g</literal> with argument is a <quote>one-shot</quote> alternative to the <command>\o</command> command.
ru: <literal>\g</literal> без аргументов, по сути, эквивалентен точке с запятой. <literal>\g</literal> с аргументом является разовой альтернативой команде <command>\o</command>.

source: Sends the current query input buffer to the server, then treats each column of each row of the query's output (if any) as a SQL statement to be executed. For example, to create an index on each column of <structname>my_table</structname>: <placeholder-1/>
ru: Отправляет буфер ввода текущего запроса на сервер, а затем обрабатывает содержимое каждого столбца каждой строки результата запроса (если он непустой) как SQL-оператор, то есть исполняет его. Например, следующая команда создаст индексы по каждому столбцу <structname>my_table</structname>: <placeholder-1/>

source: Sends the current query input buffer to the server and stores the query's output into <application>psql</application> variables (see <xref linkend="app-psql-variables" endterm="app-psql-variables-title"/>). The query to be executed must return exactly one row. Each column of the row is stored into a separate variable, named the same as the column. For example: <placeholder-1/>
ru: Отправляет буфер текущего запроса на сервер для выполнения и сохраняет результат запроса в переменных <application>psql</application> (см. <xref remap="4" linkend="app-psql-variables" endterm="app-psql-variables-title"/>). Выполняемый запрос должен возвращать ровно одну строку. Каждый столбец строки результата сохраняется в отдельной переменной, которая называется так же, как и столбец. Например: <placeholder-1/>

source: <quote>Query results</quote> includes all tables, command responses, and notices obtained from the database server, as well as output of various backslash commands that query the database (such as <command>\d</command>), but not error messages.
ru: <quote>Результаты запросов</quote> включают в себя все таблицы, ответы команд, уведомления, полученные от сервера базы данных, а также вывод от метакоманд, запрашивающих базу данных (таких как <command>\d</command>), но не сообщения об ошибках.

source: Print the current query buffer to the standard output.
ru: Печатает содержимое буфера текущего запроса на стандартный вывод.

source: There are various shortcut commands for <command>\pset</command>. See <command>\a</command>, <command>\C</command>, <command>\H</command>, <command>\t</command>, <command>\T</command>, and <command>\x</command>.
ru: Для некоторых параметров <command>\pset</command> есть короткие команды. См. <command>\a</command>, <command>\C</command>, <command>\H</command>, <command>\t</command>, <command>\T</command> и <command>\x</command>.

source: Sets the <application>psql</application> variable <replaceable class="parameter">name</replaceable> to <replaceable class="parameter">value</replaceable>, or if more than one value is given, to the concatenation of all of them. If only one argument is given, the variable is set with an empty value. To unset a variable, use the <command>\unset</command> command.
ru: Задаёт <application>psql</application> переменной <replaceable class="parameter">name</replaceable> значение <replaceable class="parameter">value</replaceable> или, если задано более одного значения, их конкатенацию. Если задан только один аргумент, то переменной с этим именем присваивается пустое значение. Для удаления переменной используйте команду <command>\unset</command>.

source: Although you are welcome to set any variable to anything you want, <application>psql</application> treats several variables as special. They are documented in the section about variables.
ru: Хотя вы можете задать любой переменной любое значение, <application>psql</application> рассматривает несколько переменных особым образом. Они документированы в разделе о переменных.

source: Without parameter, toggles a display of how long each SQL statement takes, in milliseconds. With parameter, sets same.
ru: Включает/отключает отображение времени выполнения команд SQL в миллисекундах. Без параметра переключает текущий режим отображения времени выполнения.

source: Outputs the current query buffer to the file <replaceable class="parameter">filename</replaceable> or pipes it to the shell command <replaceable class="parameter">command</replaceable>.
ru: Выводит буфер текущего запроса в файл <replaceable class="parameter">имя_файла</replaceable> или передаёт в команду ОС <replaceable class="parameter">команда</replaceable>.

source: Escapes to a separate shell or executes the shell command <replaceable class="parameter">command</replaceable>. The arguments are not further interpreted; the shell will see them as-is. In particular, the variable substitution rules and backslash escapes do not apply.
ru: Выполняет команду ОС <replaceable class="parameter">command</replaceable>. Без указания <replaceable class="parameter">command</replaceable> запускает отдельную командную оболочку ОС. Последующие аргументы не интерпретируются, командная оболочка ОС увидит их как есть. В частности, не применяются правила подстановки переменных и экранирование с обратной косой чертой.
