Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/psql-ref.po
Languages: ru

source: Lists installed extensions. If <replaceable class="parameter">pattern</replaceable> is specified, only those extensions whose names match the pattern are listed. If the form <literal>\dx+</literal> is used, all the objects belonging to each matching extension are listed.
ru: Выводит список установленных расширений. Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только расширения, имена которых соответствуют ему. Если используется форма <literal>\dx+</literal>, то для каждого расширения выводятся все принадлежащие ему объекты.

source: Lists event triggers. If <replaceable class="parameter">pattern</replaceable> is specified, only those event triggers whose names match the pattern are listed. If <literal>+</literal> is appended to the command name, each object is listed with its associated description.
ru: Выводит список событийных триггеров. Если указан <replaceable class="parameter">шаблон</replaceable>, выводятся только те событийные триггеры, имена которых соответствуют ему. При добавлении <literal>+</literal> к имени команды для каждого объекта дополнительно будет выводиться описание.

source: <literal>\e</literal> or <literal>\edit</literal> <literal><optional><replaceable class="parameter">filename</replaceable></optional> <optional><replaceable class="parameter">line_number</replaceable></optional></literal>
ru: <literal>\e</literal> или <literal>\edit</literal> <literal><optional><replaceable class="parameter">имя_файла</replaceable></optional> <optional><replaceable class="parameter">номер_строки</replaceable></optional></literal>

source: If <replaceable class="parameter">filename</replaceable> is specified, the file is edited; after the editor exits, the file's content is copied into the current query buffer. If no <replaceable class="parameter">filename</replaceable> is given, the current query buffer is copied to a temporary file which is then edited in the same fashion. Or, if the current query buffer is empty, the most recently executed query is copied to a temporary file and edited in the same fashion.
ru: Если указано <replaceable class="parameter">имя_файла</replaceable>, файл открывается для редактирования; после выхода из редактора содержимое файла копируется в буфер текущего запроса. Если <replaceable class="parameter">имя_файла</replaceable> не задано, буфер текущего запроса копируется во временный файл, который затем редактируется тем же образом. Либо, если буфер текущего запроса пуст, во временный файл копируется последний выполненный запрос, и он затем так же редактируется.

source: The new contents of the query buffer are then re-parsed according to the normal rules of <application>psql</application>, treating the whole buffer as a single line. Any complete queries are immediately executed; that is, if the query buffer contains or ends with a semicolon, everything up to that point is executed. Whatever remains will wait in the query buffer; type semicolon or <literal>\g</literal> to send it, or <literal>\r</literal> to cancel it by clearing the query buffer. Treating the buffer as a single line primarily affects meta-commands: whatever is in the buffer after a meta-command will be taken as argument(s) to the meta-command, even if it spans multiple lines. (Thus you cannot make meta-command-using scripts this way. Use <command>\i</command> for that.)
ru: Новое содержимое буфера запроса затем разбирается согласно обычным правилам <application>psql</application>, при этом весь буфер обрабатывается как одна строка. Все законченные запросы немедленно выполняются; то есть, если буфер запроса содержит точку с запятой или заканчивается ей, выполняется всё его содержимое до этого знака. Оставшийся текст будет ждать выполнения в буфере запроса; вы можете ввести точку с запятой или <literal>\g</literal>, чтобы передать его, либо <literal>\r</literal>, чтобы сбросить его, очистив буфер запроса. Прочтение буфера как одной строки в основном отражается на метакомандах: всё, что находится в буфере после метакоманды, будет воспринято как аргументы метакоманды, даже если этот текст продолжается на нескольких строках. (Поэтому таким способом нельзя выполнять скрипты с метакомандами. Для таких скриптов используйте <command>\i</command>.)

source: If a line number is specified, <application>psql</application> will position the cursor on the specified line of the file or query buffer. Note that if a single all-digits argument is given, <application>psql</application> assumes it is a line number, not a file name.
ru: Если указан номер строки, <application>psql</application> будет позиционировать курсор на указанную строку файла или буфера запроса. Обратите внимание, что если указан один аргумент и он числовой, <application>psql</application> предполагает, что это номер строки, а не имя файла.

source: See under <xref linkend="app-psql-environment" endterm="app-psql-environment-title"/> for how to configure and customize your editor.
ru: Как настроить редактор и изменить его поведение, рассказывается в разделе <xref linkend="app-psql-environment" endterm="app-psql-environment-title"/>.

source: text
ru: текст

source: Prints the arguments to the standard output, separated by one space and followed by a newline. This can be useful to intersperse information in the output of scripts. For example: <placeholder-1/> If the first argument is an unquoted <literal>-n</literal> the trailing newline is not written.
ru: Выводит аргументы на стандартный вывод, разделяя их одним пробелом, в конце следует перевод строки. Команда полезна для формирования вывода из скриптов. Например: <placeholder-1/> Если первый аргумент <literal>-n</literal> без кавычек, то перевод строки в конце не ставится.

source: If you use the <command>\o</command> command to redirect your query output you might wish to use <command>\qecho</command> instead of this command.
ru: Если используется команда <command>\o</command> для перенаправления вывода запросов, возможно, следует применять команду <command>\qecho</command> вместо этой.

source: function_description
ru: описание_функции

source: line_number
ru: номер_строки

source: This command fetches and edits the definition of the named function, in the form of a <command>CREATE OR REPLACE FUNCTION</command> command. Editing is done in the same way as for <literal>\edit</literal>. After the editor exits, the updated command waits in the query buffer; type semicolon or <literal>\g</literal> to send it, or <literal>\r</literal> to cancel.
ru: Эта команда извлекает из базы данных определение заданной функции в форме <command>CREATE OR REPLACE FUNCTION</command> и отправляет его на редактирование. Редактирование осуществляется таким же образом, как и для <literal>\edit</literal>. После выхода из редактора изменённая команда будет находиться в буфере запроса. Введите точку с запятой или <literal>\g</literal> для выполнения или <literal>\r</literal> для отмены.

source: The target function can be specified by name alone, or by name and arguments, for example <literal>foo(integer, text)</literal>. The argument types must be given if there is more than one function of the same name.
ru: Для функции может быть задано только имя или имя и аргументы, например <literal>foo(integer, text)</literal>. Типы аргументов необходимы, если существует более чем одна функция с тем же именем.

source: If no function is specified, a blank <command>CREATE FUNCTION</command> template is presented for editing.
ru: Если функция не указана, для редактирования открывается пустая заготовка <command>CREATE FUNCTION</command>.

source: If a line number is specified, <application>psql</application> will position the cursor on the specified line of the function body. (Note that the function body typically does not begin on the first line of the file.)
ru: Если указан номер строки, <application>psql</application> будет позиционировать курсор на указанную строку тела функции. (Обратите внимание, что тело функции обычно не начинается на первой строке файла).

source: Unlike most other meta-commands, the entire remainder of the line is always taken to be the argument(s) of <command>\ef</command>, and neither variable interpolation nor backquote expansion are performed in the arguments.
ru: В отличие от большинства других метакоманд весь остаток строки всегда воспринимается как аргументы <command>\ef</command>, и в этих аргументах не выполняется ни подстановка переменных, ни раскрытие обратных кавычек.

source: encoding
ru: кодировка

source: Sets the client character set encoding. Without an argument, this command shows the current encoding.
ru: Устанавливает кодировку набора символов на клиенте. Без аргумента команда показывает текущую кодировку.

source: Repeats the most recent server error message at maximum verbosity, as though <varname>VERBOSITY</varname> were set to <literal>verbose</literal> and <varname>SHOW_CONTEXT</varname> were set to <literal>always</literal>.
ru: Повторяет последнее серверное сообщение об ошибке с максимальным уровнем детализации, как если бы переменная <varname>VERBOSITY</varname> имела значение <literal>verbose</literal>, а <varname>SHOW_CONTEXT</varname> — <literal>always</literal>.

source: view_name
ru: имя_представления

source: This command fetches and edits the definition of the named view, in the form of a <command>CREATE OR REPLACE VIEW</command> command. Editing is done in the same way as for <literal>\edit</literal>. After the editor exits, the updated command waits in the query buffer; type semicolon or <literal>\g</literal> to send it, or <literal>\r</literal> to cancel.
ru: Эта команда извлекает и открывает на редактирование определение указанного представления в форме команды <command>CREATE OR REPLACE VIEW</command>. Редактирование осуществляется так же, как и с <literal>\edit</literal>. После выхода из редактора изменённая команда остаётся в буфере запроса; введите точку с запятой или <literal>\g</literal>, чтобы выполнить её, либо <literal>\r</literal>, чтобы её сбросить.

source: If no view is specified, a blank <command>CREATE VIEW</command> template is presented for editing.
ru: Если представление не указано, для редактирования открывается пустая заготовка <command>CREATE VIEW</command>.

source: If a line number is specified, <application>psql</application> will position the cursor on the specified line of the view definition.
ru: Если указан номер строки, <application>psql</application> установит курсор на заданную строку в определении представления.

source: Unlike most other meta-commands, the entire remainder of the line is always taken to be the argument(s) of <command>\ev</command>, and neither variable interpolation nor backquote expansion are performed in the arguments.
ru: В отличие от большинства других метакоманд весь остаток строки всегда воспринимается как аргументы <command>\ev</command>, и в этих аргументах не выполняется ни подстановка переменных, ни раскрытие обратных кавычек.

source: string
ru: строка

source: Sets the field separator for unaligned query output. The default is the vertical bar (<literal>|</literal>). It is equivalent to <command>\pset fieldsep</command>.
ru: Устанавливает разделитель полей для невыровненного режима вывода запросов. По умолчанию используется вертикальная черта (<literal>|</literal>). Равнозначно команде <command>\pset fieldsep</command>.

source: Sends the current query buffer to the server for execution. If an argument is given, the query's output is written to the named file or piped to the given shell command, instead of displaying it as usual. The file or command is written to only if the query successfully returns zero or more tuples, not if the query fails or is a non-data-returning SQL command.
ru: Отправляет содержимое буфера текущего запроса на сервер для выполнения. Если передаётся аргумент, вывод запроса записывается в указанный файл или передаётся через поток заданной команде оболочки, а не отображается как обычно. Вывод направляется в файл или команду, только если запрос успешно вернул 0 или более строк, но не когда запрос завершился неудачно или выполнялась команда, не возвращающая данные.

source: If the current query buffer is empty, the most recently sent query is re-executed instead. Except for that behavior, <literal>\g</literal> without an argument is essentially equivalent to a semicolon. A <literal>\g</literal> with argument is a <quote>one-shot</quote> alternative to the <command>\o</command> command.
ru: Если буфер текущего запроса пуст, вместо этого повторно выполняется предыдущий запрос. За исключением этой особенности, метакоманда <literal>\g</literal> без аргумента по сути равнозначна точке с запятой. Метакоманда <literal>\g</literal> с аргументом является <quote>одноразовой</quote> альтернативой команде <command>\o</command>.

source: If the argument begins with <literal>|</literal>, then the entire remainder of the line is taken to be the <replaceable class="parameter">command</replaceable> to execute, and neither variable interpolation nor backquote expansion are performed in it. The rest of the line is simply passed literally to the shell.
ru: Если аргумент начинается с <literal>|</literal>, весь остаток строки воспринимается как <replaceable class="parameter">команда</replaceable>, подлежащая выполнению, в которой не производится ни подстановка переменных, ни раскрытие обратных кавычек. Это продолжение строки просто передаётся оболочке в буквальном виде.

source: Sends the current query buffer to the server, then treats each column of each row of the query's output (if any) as a SQL statement to be executed. For example, to create an index on each column of <structname>my_table</structname>: <placeholder-1/>
ru: Отправляет буфер текущего запроса на сервер, а затем обрабатывает содержимое каждого столбца каждой строки результата запроса (если он непустой) как SQL-оператор, то есть исполняет его. Например, следующая команда создаст индексы по каждому столбцу <structname>my_table</structname>: <placeholder-1/>

source: The generated queries are executed in the order in which the rows are returned, and left-to-right within each row if there is more than one column. NULL fields are ignored. The generated queries are sent literally to the server for processing, so they cannot be <application>psql</application> meta-commands nor contain <application>psql</application> variable references. If any individual query fails, execution of the remaining queries continues unless <varname>ON_ERROR_STOP</varname> is set. Execution of each query is subject to <varname>ECHO</varname> processing. (Setting <varname>ECHO</varname> to <literal>all</literal> or <literal>queries</literal> is often advisable when using <command>\gexec</command>.) Query logging, single-step mode, timing, and other query execution features apply to each generated query as well.
ru: Генерируемые запросы выполняются в том порядке, в каком возвращаются строки, слева направо, если возвращается несколько столбцов. Поля NULL игнорируются. Эти запросы передаются для обработки на сервер буквально, так что это не могут быть метакоманды <application>psql</application> или запросы, использующие переменные <application>psql</application>. В случае сбоя в одном из запросов, выполнение оставшихся запросов продолжается, если только не установлена переменная <varname>ON_ERROR_STOP</varname>. На выполнение каждого запроса оказывает влияние параметр <varname>ECHO</varname>. (Применяя команду <command>\gexec</command>, рекомендуется устанавливать в <varname>ECHO</varname> режим <literal>all</literal> или <literal>queries</literal>.) Такие расширенные средства, как протоколирование запросов, пошаговый режим, замер времени и т. п., так же действуют при выполнении каждого генерируемого запроса.

source: If the current query buffer is empty, the most recently sent query is re-executed instead.
ru: Если буфер текущего запроса пуст, будет повторно выполнен последний переданный запрос.

source: prefix
ru: префикс

source: Sends the current query buffer to the server and stores the query's output into <application>psql</application> variables (see <xref linkend="app-psql-variables" endterm="app-psql-variables-title"/>). The query to be executed must return exactly one row. Each column of the row is stored into a separate variable, named the same as the column. For example: <placeholder-1/>
ru: Отправляет буфер текущего запроса на сервер для выполнения и сохраняет результат запроса в переменных <application>psql</application> (см. <xref remap="4" linkend="app-psql-variables" endterm="app-psql-variables-title"/>). Выполняемый запрос должен возвращать ровно одну строку. Каждый столбец строки результата сохраняется в отдельной переменной, которая называется так же, как и столбец. Например: <placeholder-1/>

source: If you specify a <replaceable class="parameter">prefix</replaceable>, that string is prepended to the query's column names to create the variable names to use: <placeholder-1/>
ru: Если указан <replaceable class="parameter">prefix</replaceable>, то он добавляется в начале к именам переменных: <placeholder-1/>

source: If a column result is NULL, the corresponding variable is unset rather than being set.
ru: Если значение столбца NULL, то вместо присвоения значения соответствующая переменная удаляется.

source: If the query fails or does not return one row, no variables are changed.
ru: Если запрос завершается ошибкой или не возвращает одну строку, то никакие переменные не меняются.

source: <literal>\gx</literal> is equivalent to <literal>\g</literal>, but forces expanded output mode for this query. See <literal>\x</literal>.
ru: Метакоманда <literal>\gx</literal> подобна <literal>\g</literal>, но принудительно включает расширенный режим вывода для текущего запроса. См. <literal>\x</literal>.

source: <literal>\h</literal> or <literal>\help</literal> <literal>[ <replaceable class="parameter">command</replaceable> ]</literal>
ru: <literal>\h</literal> или <literal>\help</literal> <literal>[ <replaceable class="parameter">command</replaceable> ]</literal>

source: Gives syntax help on the specified <acronym>SQL</acronym> command. If <replaceable class="parameter">command</replaceable> is not specified, then <application>psql</application> will list all the commands for which syntax help is available. If <replaceable class="parameter">command</replaceable> is an asterisk (<literal>*</literal>), then syntax help on all <acronym>SQL</acronym> commands is shown.
ru: Выводит подсказку по синтаксису указанной команды <acronym>SQL</acronym>. Если <replaceable class="parameter">command</replaceable> не указана, то <application>psql</application> выводит список всех команд, для которых доступна справка. Если в качестве command указана звёздочка (<literal>*</literal>), то выводится справка по всем командам <acronym>SQL</acronym>.

source: Unlike most other meta-commands, the entire remainder of the line is always taken to be the argument(s) of <command>\help</command>, and neither variable interpolation nor backquote expansion are performed in the arguments.
ru: В отличие от большинства других метакоманд весь остаток строки всегда воспринимается как аргументы <command>\help</command>, и в этих аргументах не выполняется ни подстановка переменных, ни раскрытие обратных кавычек.

source: To simplify typing, commands that consists of several words do not have to be quoted. Thus it is fine to type <userinput>\help alter table</userinput>.
ru: Для упрощения ввода команды, состоящие из нескольких слов, можно не заключать в кавычки. Таким образом, можно просто писать <userinput>\help alter table</userinput>.

source: <literal>\H</literal> or <literal>\html</literal>
ru: <literal>\H</literal> или <literal>\html</literal>

source: Turns on <acronym>HTML</acronym> query output format. If the <acronym>HTML</acronym> format is already on, it is switched back to the default aligned text format. This command is for compatibility and convenience, but see <command>\pset</command> about setting other output options.
ru: Включает вывод запросов в формате <acronym>HTML</acronym>. Если формат <acronym>HTML</acronym> уже включён, происходит переключение обратно на выровненный формат. Эта команда используется для совместимости и удобства, но в описании <command>\pset</command> вы можете узнать о других вариантах вывода.

source: <literal>\i</literal> or <literal>\include</literal> <replaceable class="parameter">filename</replaceable>
ru: <literal>\i</literal> или <literal>\include</literal> <replaceable class="parameter">имя_файла</replaceable>

source: Reads input from the file <replaceable class="parameter">filename</replaceable> and executes it as though it had been typed on the keyboard.
ru: Читает ввод из файла <replaceable class="parameter">имя_файла</replaceable> и выполняет его, как будто он был набран на клавиатуре.

source: If <replaceable>filename</replaceable> is <literal>-</literal> (hyphen), then standard input is read until an EOF indication or <command>\q</command> meta-command. This can be used to intersperse interactive input with input from files. Note that Readline behavior will be used only if it is active at the outermost level.
ru: Если <replaceable>имя_файла</replaceable> задано как <literal>-</literal> (минус), читается стандартный ввод до признака конца файла или до метакоманды <command>\q</command>. Это может быть полезно для совмещения интерактивного ввода со вводом команд из файлов. Заметьте, что при этом поведение Readline будет применяться, только если оно активно на внешнем уровне.

source: If you want to see the lines on the screen as they are read you must set the variable <varname>ECHO</varname> to <literal>all</literal>.
ru: Если вы хотите видеть строки файла на экране по мере их чтения, необходимо установить для переменной <varname>ECHO</varname> значение <literal>all</literal>.

source: expression
ru: выражение

source: This group of commands implements nestable conditional blocks. A conditional block must begin with an <command>\if</command> and end with an <command>\endif</command>. In between there may be any number of <command>\elif</command> clauses, which may optionally be followed by a single <command>\else</command> clause. Ordinary queries and other types of backslash commands may (and usually do) appear between the commands forming a conditional block.
ru: Эта группа команд реализует вложенные условные блоки. Условный блок должен начинаться командой <command>\if</command> и заканчиваться <command>\endif</command>. Между ними может быть любое количество предложений <command>\elif</command>, которые могут быть дополнительно завершаться одним предложением <command>\else</command>. Между командами, формирующими блок условия, могут размещаться (и обычно размещаются) обычные запросы и другие типы команд в обратных кавычках.
