Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/psql-ref.po
Languages: ru

source: In autocommit-off mode, you must explicitly abandon any failed transaction by entering <command>ABORT</command> or <command>ROLLBACK</command>. Also keep in mind that if you exit the session without committing, your work will be lost.
ru: Если режим <literal>autocommit</literal> отключён, необходимо явно откатывать изменения в неуспешных транзакциях, выполняя команду <command>ABORT</command> или <command>ROLLBACK</command>. Также имейте в виду, что при выходе из сессии без фиксации изменений несохранённые изменения будут потеряны.

source: The autocommit-on mode is <productname>PostgreSQL</productname>'s traditional behavior, but autocommit-off is closer to the SQL spec. If you prefer autocommit-off, you might wish to set it in the system-wide <filename>psqlrc</filename> file or your <filename>~/.psqlrc</filename> file.
ru: Включённый режим <literal>autocommit</literal> является традиционным для <productname>PostgreSQL</productname>, а выключенный режим ближе к спецификации SQL. Если вы предпочитаете отключить режим <literal>autocommit</literal>, это можно сделать в общесистемном файле <filename>psqlrc</filename> или в персональном файле <filename>~/.psqlrc</filename>.

source: Determines which letter case to use when completing an SQL key word. If set to <literal>lower</literal> or <literal>upper</literal>, the completed word will be in lower or upper case, respectively. If set to <literal>preserve-lower</literal> or <literal>preserve-upper</literal> (the default), the completed word will be in the case of the word already entered, but words being completed without anything entered will be in lower or upper case, respectively.
ru: Определяет, какой регистр букв будет использован при автоматическом завершении ключевых слов SQL. Если установлено в <literal>lower</literal> или <literal>upper</literal>, будет использоваться нижний или верхний регистр соответственно. Если установлено в <literal>preserve-lower</literal> или <literal>preserve-upper</literal> (по умолчанию), то завершаемое слово будет в том же регистре, что и уже введённое начало слова, но последующие слова, завершаемые полностью, будут в нижнем или верхнем регистре соответственно.

source: The name of the database you are currently connected to. This is set every time you connect to a database (including program start-up), but can be changed or unset.
ru: Имя базы данных, к которой вы сейчас подключены. Устанавливается всякий раз при подключении к базе данных (в том числе при старте программы), но эту переменную можно изменить или сбросить.

source: If set to <literal>all</literal>, all nonempty input lines are printed to standard output as they are read. (This does not apply to lines read interactively.) To select this behavior on program start-up, use the switch <option>-a</option>. If set to <literal>queries</literal>, <application>psql</application> prints each query to standard output as it is sent to the server. The switch to select this behavior is <option>-e</option>. If set to <literal>errors</literal>, then only failed queries are displayed on standard error output. The switch for this behavior is <option>-b</option>. If set to <literal>none</literal> (the default), then no queries are displayed.
ru: Со значением <literal>all</literal> все непустые входящие строки выводятся на стандартный вывод по мере их чтения. (Это не относится к строкам, считываемым интерактивно.) Чтобы выбрать такое поведение при запуске программы, добавьте ключ <option>-a</option>. Со значением <literal>queries</literal> <application>psql</application> выводит каждый запрос, отправляемый серверу, на стандартный вывод. Этому значению соответствует ключ <option>-e</option>. Со значением <literal>errors</literal> в стандартный канал ошибок выдаются только запросы, вызвавшие ошибки. Ему соответствует ключ <option>-b</option>. Со значением <literal>none</literal> (по умолчанию), никакие запросы не выводятся.

source: When this variable is set to <literal>on</literal> and a backslash command queries the database, the query is first shown. This feature helps you to study <productname>PostgreSQL</productname> internals and provide similar functionality in your own programs. (To select this behavior on program start-up, use the switch <option>-E</option>.) If you set this variable to the value <literal>noexec</literal>, the queries are just shown but are not actually sent to the server and executed. The default value is <literal>off</literal>.
ru: Если эта переменная имеет значение <literal>on</literal> и метакоманда обращается к базе данных, сначала выводится текст нижележащего запроса. Это помогает изучать внутреннее устройство <productname>PostgreSQL</productname> и реализовывать похожую функциональность в своих программах. (Чтобы включить такое поведение при запуске программы, воспользуйтесь ключом <option>-E</option>.) Если вы зададите для этой переменной значение <literal>noexec</literal>, запросы будут просто показываться, но не будут отправляться на сервер и выполняться. Значение по умолчанию — <literal>off</literal>.

source: The current client character set encoding. This is set every time you connect to a database (including program start-up), and when you change the encoding with <literal>\encoding</literal>, but it can be changed or unset.
ru: Текущая кодировка символов на стороне клиента. Устанавливается всякий раз при подключении к базе данных (в том числе при старте программы) и при смене кодировки командой <literal>\encoding</literal>, но эту переменную можно изменить или сбросить.

source: If this variable is set to an integer value greater than zero, the results of <command>SELECT</command> queries are fetched and displayed in groups of that many rows, rather than the default behavior of collecting the entire result set before display. Therefore only a limited amount of memory is used, regardless of the size of the result set. Settings of 100 to 1000 are commonly used when enabling this feature. Keep in mind that when using this feature, a query might fail after having already displayed some rows.
ru: Если значение этой переменной — целое число больше нуля, результаты запросов <command>SELECT</command> извлекаются из базы данных и отображаются группами с заданным количеством строк, в отличие от поведения по умолчанию, когда перед отображением результирующий набор накапливается целиком. Это позволяет использовать ограниченный размер памяти независимо от размера выборки. При включении этой функциональности обычно используются значения от 100 до 1000. Имейте в виду, что запрос может завершиться ошибкой после отображения некоторого количества строк.

source: Although you can use any output format with this feature, the default <literal>aligned</literal> format tends to look bad because each group of <varname>FETCH_COUNT</varname> rows will be formatted separately, leading to varying column widths across the row groups. The other output formats work better.
ru: Хотя можно использовать любой формат вывода, формат по умолчанию <literal>aligned</literal> как правило выглядит хуже, потому что каждая группа по <varname>FETCH_COUNT</varname> строк форматируется отдельно, что может привести к разной ширине столбцов в разных группах. Остальные форматы вывода работают лучше.

source: If this variable is set to <literal>ignorespace</literal>, lines which begin with a space are not entered into the history list. If set to a value of <literal>ignoredups</literal>, lines matching the previous history line are not entered. A value of <literal>ignoreboth</literal> combines the two options. If set to <literal>none</literal> (the default), all lines read in interactive mode are saved on the history list.
ru: Если переменная имеет значение <literal>ignorespace</literal>, строки, начинающиеся с пробела, не сохраняются в истории. Если она имеет значение <literal>ignoredups</literal>, в историю не добавляются строки, которые в ней уже есть. Значение <literal>ignoreboth</literal> объединяет эти два варианта. Со значением <literal>none</literal> (по умолчанию) в истории сохраняются все строки, считываемые в интерактивном режиме.

source: This feature was shamelessly plagiarized from <application>Bash</application>.
ru: Эта функциональность была бессовестно списана с <application>Bash</application>.

source: The file name that will be used to store the history list. If unset, the file name is taken from the <envar>PSQL_HISTORY</envar> environment variable. If that is not set either, the default is <filename>~/.psql_history</filename>, or <filename>%APPDATA%\postgresql\psql_history</filename> on Windows. For example, putting: <placeholder-1/> in <filename>~/.psqlrc</filename> will cause <application>psql</application> to maintain a separate history for each database.
ru: Имя файла, в котором будет сохраняться список истории команд. Если эта переменная не определена, имя файла берётся из переменной окружения <envar>PSQL_HISTORY</envar>. Если и она не задана, используется имя по умолчанию — <filename>~/.psql_history</filename> или <filename>%APPDATA%\postgresql\psql_history</filename> в Windows. Например, если установить: <placeholder-1/> в <filename>~/.psqlrc</filename>, <application>psql</application> будет вести отдельный файл истории для каждой базы данных.

source: The maximum number of commands to store in the command history (default 500). If set to a negative value, no limit is applied.
ru: Максимальное число команд, которые будут сохраняться в истории команд (по умолчанию 500). Если задано отрицательное значение, ограничение не накладывается.

source: The database server host you are currently connected to. This is set every time you connect to a database (including program start-up), but can be changed or unset.
ru: Имя компьютера, где работает сервер базы данных, к которому вы сейчас подключены. Устанавливается всякий раз при подключении к базе данных (в том числе при старте программы), но эту переменную можно изменить или сбросить.

source: If set to 1 or less, sending an <acronym>EOF</acronym> character (usually <keycombo action="simul"><keycap>Control</keycap><keycap>D</keycap></keycombo>) to an interactive session of <application>psql</application> will terminate the application. If set to a larger numeric value, that many consecutive <acronym>EOF</acronym> characters must be typed to make an interactive session terminate. If the variable is set to a non-numeric value, it is interpreted as 10. The default is 0.
ru: Если равно 1 или меньше, символ конца файла (<acronym>EOF</acronym>, обычно передаётся сочетанием клавиш <keycombo action="simul"><keycap>Control</keycap><keycap>D</keycap></keycombo>) в интерактивном сеансе <application>psql</application> завершит работу приложения. Если значение больше 1, оно определяет, сколько последовательных символов <acronym>EOF</acronym> нужно ввести, чтобы завершить интерактивный сеанс. Если значение переменной не является числовым, оно воспринимается как 10. По умолчанию — 0.

source: The value of the last affected OID, as returned from an <command>INSERT</command> or <command>\lo_import</command> command. This variable is only guaranteed to be valid until after the result of the next <acronym>SQL</acronym> command has been displayed.
ru: Содержит значение последнего OID, полученного командой <command>INSERT</command> или <command>\lo_import</command>. Корректное значение переменной гарантируется до тех пор, пока не будет отображён результат следующей <acronym>SQL</acronym>-команды.

source: When set to <literal>on</literal>, if a statement in a transaction block generates an error, the error is ignored and the transaction continues. When set to <literal>interactive</literal>, such errors are only ignored in interactive sessions, and not when reading script files. When set to <literal>off</literal> (the default), a statement in a transaction block that generates an error aborts the entire transaction. The error rollback mode works by issuing an implicit <command>SAVEPOINT</command> for you, just before each command that is in a transaction block, and then rolling back to the savepoint if the command fails.
ru: При значении <literal>on</literal>, если команда в блоке транзакции выдаёт ошибку, ошибка игнорируется и транзакция продолжается. Со значением <literal>interactive</literal> такие ошибки игнорируются только в интерактивных сеансах, но не в скриптах. Со значением <literal>off</literal> (по умолчанию) команда в блоке транзакции, выдающая ошибку, прерывает всю транзакцию. Для реализации режима отката транзакции за вас неявно выполняется команда <command>SAVEPOINT</command> непосредственно перед каждой командой в блоке транзакции, а в случае ошибки команды происходит откат к этой точке сохранения.

source: By default, command processing continues after an error. When this variable is set to <literal>on</literal>, processing will instead stop immediately. In interactive mode, <application>psql</application> will return to the command prompt; otherwise, <application>psql</application> will exit, returning error code 3 to distinguish this case from fatal error conditions, which are reported using error code 1. In either case, any currently running scripts (the top-level script, if any, and any other scripts which it may have in invoked) will be terminated immediately. If the top-level command string contained multiple SQL commands, processing will stop with the current command.
ru: По умолчанию, после возникновения ошибки обработка команд продолжается. Если эта переменная установлена в значение <literal>on</literal>, обработка команд будет немедленно прекращена. В интерактивном режиме <application>psql</application> вернётся в командную строку; иначе <application>psql</application> прекратит работу с кодом возврата 3, чтобы отличить этот случай от фатальных ошибок, для которых используется код возврата 1. В любом случае, выполнение всех запущенных скриптов (высокоуровневый скрипт и любые другие, которые он мог запустить) будет немедленно прекращено. Если высокоуровневая командная строка содержит несколько SQL-команд, выполнение завершится на текущей команде.

source: The database server port to which you are currently connected. This is set every time you connect to a database (including program start-up), but can be changed or unset.
ru: Содержит порт сервера базы данных, к которому вы сейчас подключены. Устанавливается всякий раз при подключении к базе данных (в том числе при старте программы), но эту переменную можно изменить или сбросить.

source: These specify what the prompts <application>psql</application> issues should look like. See <xref linkend="app-psql-prompting" endterm="app-psql-prompting-title"/> below.
ru: Указывают, как должны выглядеть приглашения <application>psql</application>. См. <xref remap="4" linkend="app-psql-prompting" endterm="app-psql-prompting-title"/>.

source: Setting this variable to <literal>on</literal> is equivalent to the command line option <option>-q</option>. It is probably not too useful in interactive mode.
ru: Установка значения <literal>on</literal> эквивалента параметру командной строки <option>-q</option>. Это, вероятно, не слишком полезно в интерактивном режиме.

source: The server's version number as a string, for example <literal>9.6.2</literal>, <literal>10.1</literal> or <literal>11beta1</literal>, and in numeric form, for example <literal>90602</literal> or <literal>100001</literal>. These are set every time you connect to a database (including program start-up), but can be changed or unset.
ru: Номер версии сервера в виде строки, например <literal>9.6.2</literal>, <literal>10.1</literal> или <literal>11beta1</literal>, и в числовом виде, например, <literal>90602</literal> или <literal>100001</literal>. Они устанавливаются при каждом подключении к базе данных (в том числе при запуске программы), но их можно изменить или сбросить.

source: This variable can be set to the values <literal>never</literal>, <literal>errors</literal>, or <literal>always</literal> to control whether <literal>CONTEXT</literal> fields are displayed in messages from the server. The default is <literal>errors</literal> (meaning that context will be shown in error messages, but not in notice or warning messages). This setting has no effect when <varname>VERBOSITY</varname> is set to <literal>terse</literal>. (See also <command>\errverbose</command>, for use when you want a verbose version of the error you just got.)
ru: Этой переменной можно присвоить значения <literal>never</literal> (никогда), <literal>errors</literal> (ошибки) или <literal>always</literal> (всегда), определяющие, когда в сообщениях с сервера будут выводиться поля <literal>КОНТЕКСТ</literal>. По умолчанию выбран вариант <literal>errors</literal> (что означает, что контекст будет выводиться в сообщениях об ошибках, но не в предупреждениях и уведомлениях). Этот параметр не действует, когда установлен уровень <varname>VERBOSITY</varname> <literal>terse</literal>. (Когда вам потребуется подробная версия только что выданной ошибки, может быть полезна команда <command>\errverbose</command>.)

source: Setting this variable to <literal>on</literal> is equivalent to the command line option <option>-S</option>.
ru: Установка значения <literal>on</literal> эквивалентна параметру командной строки <option>-S</option>.

source: Setting this variable to <literal>on</literal> is equivalent to the command line option <option>-s</option>.
ru: Эта переменная эквивалентна параметру командной строки <option>-s</option>.

source: The database user you are currently connected as. This is set every time you connect to a database (including program start-up), but can be changed or unset.
ru: Содержит имя пользователя базы данных, который сейчас подключён. Устанавливается всякий раз при подключении к базе данных (в том числе при старте программы), но эту переменную можно изменить или сбросить.

source: This variable can be set to the values <literal>default</literal>, <literal>verbose</literal>, or <literal>terse</literal> to control the verbosity of error reports. (See also <command>\errverbose</command>, for use when you want a verbose version of the error you just got.)
ru: Этой переменной можно присвоить значения <literal>default</literal>, <literal>verbose</literal> или <literal>terse</literal> для изменения уровня детализации в сообщениях об ошибках. (См. также команду <command>\errverbose</command>, полезную, когда требуется подробная версия только что выданной ошибки.)

source: These variables are set at program start-up to reflect <application>psql</application>'s version, respectively as a verbose string, a short string (e.g., <literal>9.6.2</literal>, <literal>10.1</literal>, or <literal>11beta1</literal>), and a number (e.g., <literal>90602</literal> or <literal>100001</literal>). They can be changed or unset.
ru: Эти переменные устанавливаются при запуске программы и отражают версию <application>psql</application> соответственно в виде развёрнутой строки, краткой строки (например, <literal>9.6.2</literal>, <literal>10.1</literal> или <literal>11beta1</literal>) и числа (например, <literal>90602</literal> или <literal>100001</literal>). Их можно изменить или сбросить.

source: <acronym>SQL</acronym> Interpolation
ru: Интерполяция <acronym>SQL</acronym>

source: A key feature of <application>psql</application> variables is that you can substitute (<quote>interpolate</quote>) them into regular <acronym>SQL</acronym> statements, as well as the arguments of meta-commands. Furthermore, <application>psql</application> provides facilities for ensuring that variable values used as SQL literals and identifiers are properly quoted. The syntax for interpolating a value without any quoting is to prepend the variable name with a colon (<literal>:</literal>). For example, <placeholder-1/> would query the table <literal>my_table</literal>. Note that this may be unsafe: the value of the variable is copied literally, so it can contain unbalanced quotes, or even backslash commands. You must make sure that it makes sense where you put it.
ru: Ключевой особенностью переменных <application>psql</application> является возможность подставлять (<quote>интерполировать</quote>) их в команды <acronym>SQL</acronym>, также как и в аргументы метакоманд. Кроме того, <application>psql</application> предоставляет средства для корректного использования кавычек для значений переменных, которые используются как литералы или идентификаторы SQL. Чтобы подставить значение без кавычек, нужно добавить перед именем переменной двоеточие (<literal>:</literal>). Например: <placeholder-1/> будет запрашивать таблицу <literal>my_table</literal>. Обратите внимание, что это может быть небезопасным: значение переменной копируется буквально, поэтому оно может содержать непарные кавычки или даже метакоманды. При применении необходимо убедиться, что это имеет смысл.

source: When a value is to be used as an SQL literal or identifier, it is safest to arrange for it to be quoted. To quote the value of a variable as an SQL literal, write a colon followed by the variable name in single quotes. To quote the value as an SQL identifier, write a colon followed by the variable name in double quotes. These constructs deal correctly with quotes and other special characters embedded within the variable value. The previous example would be more safely written this way: <placeholder-1/>
ru: Когда значение будет использоваться в качестве SQL литерала или идентификатора, безопаснее заключить его в кавычки. Если значение переменной используется как SQL литерал, то после двоеточия нужно написать имя переменной в одинарных кавычках. Если значение переменной используется как SQL идентификатор, то после двоеточия нужно написать имя переменной в двойных кавычках. Эти конструкции корректно работают с кавычками и другими специальными символами, которые могут содержаться в значении переменной. Предыдущий пример более безопасно выглядит так: <placeholder-1/>

source: Variable interpolation will not be performed within quoted <acronym>SQL</acronym> literals and identifiers. Therefore, a construction such as <literal>':foo'</literal> doesn't work to produce a quoted literal from a variable's value (and it would be unsafe if it did work, since it wouldn't correctly handle quotes embedded in the value).
ru: Подстановка переменных не будет выполняться, если <acronym>SQL</acronym> литералы или идентификаторы заключены в кавычки. Поэтому конструкция <literal>':foo'</literal> не превратится во взятое в кавычки значение переменной (и это было бы небезопасно, если бы работало, так как обработка кавычек внутри значения переменной была бы некорректной).

source: One example use of this mechanism is to copy the contents of a file into a table column. First load the file into a variable and then interpolate the variable's value as a quoted string: <placeholder-1/> (Note that this still won't work if <filename>my_file.txt</filename> contains NUL bytes. <application>psql</application> does not support embedded NUL bytes in variable values.)
ru: Один из примеров использования данного механизма — это копирование содержимого файла в столбец таблицы. Сначала загрузим содержимое файла в переменную, затем подставим значение переменной как строку в кавычках: <placeholder-1/> (Отметим, что это пока не будет работать, если <filename>my_file.txt</filename> содержит байт NUL. <application>psql</application> не поддерживает NUL в значениях переменных.)
