Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/psql-ref.po
Languages: ru

source: This option can only be used in combination with one or more <option>-c</option> and/or <option>-f</option> options. It causes <application>psql</application> to issue a <command>BEGIN</command> command before the first such option and a <command>COMMIT</command> command after the last one, thereby wrapping all the commands into a single transaction. This ensures that either all the commands complete successfully, or no changes are applied.
ru: Этот параметр может применяться только в сочетании с одним или несколькими параметрами <option>-c</option> и/или <option>-f</option>. С ним <application>psql</application> выполняет команду <command>BEGIN</command> перед обработкой первого такого параметра и <command>COMMIT</command> после последнего, заворачивая таким образом все команды в одну транзакцию. Это гарантирует, что либо все команды завершатся успешно, либо никакие изменения не сохранятся.

source: If the commands themselves contain <command>BEGIN</command>, <command>COMMIT</command>, or <command>ROLLBACK</command>, this option will not have the desired effects. Also, if an individual command cannot be executed inside a transaction block, specifying this option will cause the whole transaction to fail.
ru: Если в самих этих командах содержатся операторы <command>BEGIN</command>, <command>COMMIT</command> или <command>ROLLBACK</command>, этот параметр не даст желаемого эффекта. Кроме того, если какая-либо отдельная команда не может выполняться внутри блока транзакции, с этим параметром вся транзакция прервётся с ошибкой.

source: topic
ru: тема

source: Show help about <application>psql</application> and exit. The optional <replaceable class="parameter">topic</replaceable> parameter (defaulting to <literal>options</literal>) selects which part of <application>psql</application> is explained: <literal>commands</literal> describes <application>psql</application>'s backslash commands; <literal>options</literal> describes the command-line options that can be passed to <application>psql</application>; and <literal>variables</literal> shows help about <application>psql</application> configuration variables.
ru: Показать справку по <application>psql</application> и завершиться. Необязательный параметр <replaceable class="parameter">тема</replaceable> (по умолчанию <literal>options</literal>) выбирает описание интересующей части <application>psql</application>: <literal>commands</literal> описывает команды <application>psql</application> с обратной косой чертой; <literal>options</literal> описывает параметры командной строки, которые можно передать <application>psql</application>; а <literal>variables</literal> выдаёт справку по переменным конфигурации <application>psql</application>.

source: Exit Status
ru: Код завершения

source: <application>psql</application> returns 0 to the shell if it finished normally, 1 if a fatal error of its own occurs (e.g. out of memory, file not found), 2 if the connection to the server went bad and the session was not interactive, and 3 if an error occurred in a script and the variable <varname>ON_ERROR_STOP</varname> was set.
ru: При нормальном завершении <application>psql</application> возвращает 0 в командную оболочку ОС, 1 — если произошла фатальная ошибка в самом <application>psql</application> (например, нехватка памяти, файл не найден), 2 — при неудачном соединении с сервером неинтерактивного сеанса, 3 — при ошибке в скрипте и установленной переменной <varname>ON_ERROR_STOP</varname>.

source: Usage
ru: Использование

source: Connecting to a Database
ru: Подключение к базе данных

source: <application>psql</application> is a regular <productname>PostgreSQL</productname> client application. In order to connect to a database you need to know the name of your target database, the host name and port number of the server, and what user name you want to connect as. <application>psql</application> can be told about those parameters via command line options, namely <option>-d</option>, <option>-h</option>, <option>-p</option>, and <option>-U</option> respectively. If an argument is found that does not belong to any option it will be interpreted as the database name (or the user name, if the database name is already given). Not all of these options are required; there are useful defaults. If you omit the host name, <application>psql</application> will connect via a Unix-domain socket to a server on the local host, or via TCP/IP to <literal>localhost</literal> on machines that don't have Unix-domain sockets. The default port number is determined at compile time. Since the database server uses the same default, you will not have to specify the port in most cases. The default user name is your operating-system user name, as is the default database name. Note that you cannot just connect to any database under any user name. Your database administrator should have informed you about your access rights.
ru: <application>psql</application> это клиент для <productname>PostgreSQL</productname>. Для подключения к базе данных нужно знать имя базы данных, имя сервера, номер порта сервера и имя пользователя, под которым вы хотите подключиться. Эти свойства можно задать через аргументы командной строки, а именно <option>-d</option>, <option>-h</option>, <option>-p</option> и <option>-U</option> соответственно. Если в командной строке есть аргумент, который не относится к параметрам <application>psql</application>, то он используется в качестве имени базы данных (или имени пользователя, если база данных уже задана). Задавать все эти аргументы необязательно, у них есть разумные значения по умолчанию. Если опустить имя сервера, <application>psql</application> будет подключаться через доменный сокет Unix к локальному серверу, либо подключаться к <literal>localhost</literal> по TCP/IP в системах, не поддерживающих UNIX-сокеты. Номер порта по умолчанию определяется во время компиляции. Поскольку сервер базы данных использует то же значение по умолчанию, чаще всего указывать номер порта не нужно. Имя пользователя по умолчанию, как и имя базы данных по умолчанию, совпадает с именем пользователя в операционной системе. Заметьте, что просто так подключаться к любой базе данных под любым именем пользователя вы не сможете. Узнать о ваших правах можно у администратора баз данных.

source: When the defaults aren't quite right, you can save yourself some typing by setting the environment variables <envar>PGDATABASE</envar>, <envar>PGHOST</envar>, <envar>PGPORT</envar> and/or <envar>PGUSER</envar> to appropriate values. (For additional environment variables, see <xref linkend="libpq-envars"/>.) It is also convenient to have a <filename>~/.pgpass</filename> file to avoid regularly having to type in passwords. See <xref linkend="libpq-pgpass"/> for more information.
ru: Если значения по умолчанию не подходят, можно сэкономить на вводе параметров подключения, установив переменные среды <envar>PGDATABASE</envar>, <envar>PGHOST</envar>, <envar>PGPORT</envar> и/или <envar>PGUSER</envar>. (Другие переменные среды описаны в <xref remap="6" linkend="libpq-envars"/>.) Также удобно иметь файл <filename>~/.pgpass</filename>, чтобы не вводить пароли снова и снова. За дополнительными сведениями обратитесь к <xref remap="3" linkend="libpq-pgpass"/>.

source: An alternative way to specify connection parameters is in a <parameter>conninfo</parameter> string or a <acronym>URI</acronym>, which is used instead of a database name. This mechanism give you very wide control over the connection. For example: <placeholder-1/> This way you can also use <acronym>LDAP</acronym> for connection parameter lookup as described in <xref linkend="libpq-ldap"/>. See <xref linkend="libpq-paramkeywords"/> for more information on all the available connection options.
ru: Альтернативный способ указать параметры подключения это использование строки <parameter>conninfo</parameter> или <acronym>URI</acronym> вместо имени базы данных. Этот механизм даёт широкие возможности по управлению параметрами подключения. Например: <placeholder-1/> Этот способ также позволяет использовать <acronym>LDAP</acronym> для получения параметров подключения, как описано в <xref remap="6" linkend="libpq-ldap"/>. Более полно все имеющиеся параметры соединения описаны в <xref remap="6" linkend="libpq-paramkeywords"/>.

source: If the connection could not be made for any reason (e.g., insufficient privileges, server is not running on the targeted host, etc.), <application>psql</application> will return an error and terminate.
ru: Если соединение не может быть установлено по любой причине (например, нет прав, сервер не работает и т. д.), <application>psql</application> вернёт ошибку и прекратит работу.

source: If both standard input and standard output are a terminal, then <application>psql</application> sets the client encoding to <quote>auto</quote>, which will detect the appropriate client encoding from the locale settings (<envar>LC_CTYPE</envar> environment variable on Unix systems). If this doesn't work out as expected, the client encoding can be overridden using the environment variable <envar>PGCLIENTENCODING</envar>.
ru: Если и стандартный ввод, и стандартный вывод являются терминалом, то <application>psql</application> установит кодировку клиента в <quote>auto</quote>, и подходящая клиентская кодировка будет определяться из локальных установок (переменная окружения <envar>LC_CTYPE</envar> в Unix). Если это работает не так, как ожидалось, кодировку клиента можно изменить, установив переменную окружения <envar>PGCLIENTENCODING</envar>.

source: Entering SQL Commands
ru: Ввод SQL-команд

source: In normal operation, <application>psql</application> provides a prompt with the name of the database to which <application>psql</application> is currently connected, followed by the string <literal>=&gt;</literal>. For example: <placeholder-1/>
ru: Как правило, приглашение <application>psql</application> состоит из имени базы данных, к которой <application>psql</application> в данный момент подключён, а затем строки <literal>=&gt;</literal>. Например: <placeholder-1/>

source: At the prompt, the user can type in <acronym>SQL</acronym> commands. Ordinarily, input lines are sent to the server when a command-terminating semicolon is reached. An end of line does not terminate a command. Thus commands can be spread over several lines for clarity. If the command was sent and executed without error, the results of the command are displayed on the screen.
ru: В командной строке пользователь может вводить команды <acronym>SQL</acronym>. Обычно введённые строки отправляются на сервер, когда встречается точка с запятой, завершающая команду. Конец строки не завершает команду. Это позволяет разбивать команды на несколько строк для лучшего понимания. Если команда была отправлена и выполнена без ошибок, то результат команды выводится на экран.

source: Whenever a command is executed, <application>psql</application> also polls for asynchronous notification events generated by <xref linkend="sql-listen"/> and <xref linkend="sql-notify"/>.
ru: При каждом выполнении команды <application>psql</application> также проверяет асинхронные уведомления о событиях, генерируемые командами <xref linkend="sql-listen"/> и <xref linkend="sql-notify"/>.

source: While C-style block comments are passed to the server for processing and removal, SQL-standard comments are removed by <application>psql</application>.
ru: Комментарии в стиле C передаются для обработки на сервер, в то время как комментарии в стандарте SQL <application>psql</application> удаляет перед отправкой.

source: Meta-Commands
ru: Метакоманды

source: Anything you enter in <application>psql</application> that begins with an unquoted backslash is a <application>psql</application> meta-command that is processed by <application>psql</application> itself. These commands make <application>psql</application> more useful for administration or scripting. Meta-commands are often called slash or backslash commands.
ru: Всё, что вводится в <application>psql</application> не взятое в кавычки и начинающееся с обратной косой черты, является метакомандой <application>psql</application> и обрабатывается самим <application>psql</application>. Эти команды делают <application>psql</application> полезным для задач администрирования и разработки скриптов.

source: The format of a <application>psql</application> command is the backslash, followed immediately by a command verb, then any arguments. The arguments are separated from the command verb and each other by any number of whitespace characters.
ru: Формат команды <application>psql</application> следующий: обратная косая черта, сразу за ней команда, затем аргументы. Аргументы отделяются от команды и друг от друга любым количеством пробелов.

source: To include whitespace in an argument you can quote it with single quotes. To include a single quote in an argument, write two single quotes within single-quoted text. Anything contained in single quotes is furthermore subject to C-like substitutions for <literal>\n</literal> (new line), <literal>\t</literal> (tab), <literal>\b</literal> (backspace), <literal>\r</literal> (carriage return), <literal>\f</literal> (form feed), <literal>\</literal><replaceable>digits</replaceable> (octal), and <literal>\x</literal><replaceable>digits</replaceable> (hexadecimal). A backslash preceding any other character within single-quoted text quotes that single character, whatever it is.
ru: Чтобы включить пробел в значение аргумента, нужно заключить его в одинарные кавычки. Чтобы включить одинарную кавычку в значение аргумента, нужно написать две одинарные кавычки внутри текста в одинарных кавычках. Всё, что содержится в одинарных кавычках подлежит заменам, принятым в языке C: <literal>\n</literal> (новая строка), <literal>\t</literal> (табуляция), <literal>\b</literal> (backspace), <literal>\r</literal> (возврат каретки), <literal>\f</literal> (подача страницы), <literal>\</literal><replaceable>цифры</replaceable> (восьмеричное число), и <literal>\x</literal><replaceable>цифры</replaceable> (шестнадцатеричное число). Если внутри текста в одинарных кавычках встречается обратная косая перед любым другим символом, то она экранирует этот символ.

source: If an unquoted colon (<literal>:</literal>) followed by a <application>psql</application> variable name appears within an argument, it is replaced by the variable's value, as described in <xref linkend="app-psql-interpolation" endterm="app-psql-interpolation-title"/>. The forms <literal>:'<replaceable>variable_name</replaceable>'</literal> and <literal>:"<replaceable>variable_name</replaceable>"</literal> described there work as well.
ru: Если внутри аргумента не в кавычках встречается имя переменной <application>psql</application> с предшествующим двоеточием (<literal>:</literal>), оно заменяется значением переменной, как описано в <xref remap="6" linkend="app-psql-interpolation" endterm="app-psql-interpolation-title"/>. Также будет работать описанная ниже форма <literal>:'<replaceable>имя_переменной</replaceable>'</literal> и <literal>:"<replaceable>имя_переменной</replaceable>"</literal>.

source: Within an argument, text that is enclosed in backquotes (<literal>`</literal>) is taken as a command line that is passed to the shell. The output of the command (with any trailing newline removed) replaces the backquoted text. Within the text enclosed in backquotes, no special quoting or other processing occurs, except that appearances of <literal>:<replaceable>variable_name</replaceable></literal> where <replaceable>variable_name</replaceable> is a <application>psql</application> variable name are replaced by the variable's value. Also, appearances of <literal>:'<replaceable>variable_name</replaceable>'</literal> are replaced by the variable's value suitably quoted to become a single shell command argument. (The latter form is almost always preferable, unless you are very sure of what is in the variable.) Because carriage return and line feed characters cannot be safely quoted on all platforms, the <literal>:'<replaceable>variable_name</replaceable>'</literal> form prints an error message and does not substitute the variable value when such characters appear in the value.
ru: Текст аргумента, заключённый в обратные кавычки (<literal>`</literal>), считается командной строкой, которая передаётся в командную оболочку ОС. Вывод от этой команды (с удалёнными в конце символами новой строки) заменяет текст в обратных кавычках. В содержимом этого текста не обрабатываются никакие спецпоследовательности или особые знаки, за исключением того, что все вхождения <literal>:<replaceable>имя_переменной</replaceable></literal>, где <replaceable>имя_переменной</replaceable> — это имя переменной <application>psql</application>, заменяются значением этой переменной. Также вхождения <literal>:'<replaceable>имя_переменной</replaceable>'</literal> заменяются значением переменной, заключённым в апострофы с тем, что это было одним аргументом команды оболочки. (Последняя форма почти всегда более предпочтительна, если только вы не абсолютно точно знаете, чего ожидать в переменной.) Так как символы перевода строки и возврата каретки могут быть надёжно экранированы не на всех платформах, форма <literal>:'<replaceable>variable_name</replaceable>'</literal> выводит сообщение об ошибке и подстановка значения переменной не производится, когда это значение содержит такие символы.

source: Some commands take an <acronym>SQL</acronym> identifier (such as a table name) as argument. These arguments follow the syntax rules of <acronym>SQL</acronym>: Unquoted letters are forced to lowercase, while double quotes (<literal>"</literal>) protect letters from case conversion and allow incorporation of whitespace into the identifier. Within double quotes, paired double quotes reduce to a single double quote in the resulting name. For example, <literal>FOO"BAR"BAZ</literal> is interpreted as <literal>fooBARbaz</literal>, and <literal>"A weird"" name"</literal> becomes <literal>A weird" name</literal>.
ru: Некоторые команды принимают идентификатор <acronym>SQL</acronym> (например, имя таблицы) в качестве аргумента. Такие аргументы следуют правилам синтаксиса <acronym>SQL</acronym>: буквы, не взятые в кавычки, преобразуются в нижний регистр, буквы, взятые в двойные кавычки (<literal>"</literal>) предотвращают преобразование регистра и позволяют включать пробелы в идентификатор. Внутри двойных кавычек две двойные кавычки сокращаются до одной. Например, <literal>FOO"BAR"BAZ</literal> интерпретируется как <literal>fooBARbaz</literal>, а <literal>"A weird"" name"</literal> становится <literal>A weird" name</literal>.

source: Parsing for arguments stops at the end of the line, or when another unquoted backslash is found. An unquoted backslash is taken as the beginning of a new meta-command. The special sequence <literal>\\</literal> (two backslashes) marks the end of arguments and continues parsing <acronym>SQL</acronym> commands, if any. That way <acronym>SQL</acronym> and <application>psql</application> commands can be freely mixed on a line. But in any case, the arguments of a meta-command cannot continue beyond the end of the line.
ru: Разбор аргументов останавливается в конце строки или когда встречается другая обратная косая черта, не внутри кавычек. Обратная косая не внутри кавычек рассматривается как начало новой метакоманды. Специальная последовательность <literal>\\</literal> (две обратных косых черты) обозначает окончание аргументов, далее продолжается разбор команд <acronym>SQL</acronym>, если таковые имеются. Таким образом, команды <acronym>SQL</acronym> и <application>psql</application> можно свободно смешивать на одной строке. Но в любом случае, аргументы метакоманды не могут выходить за пределы текущей строки.

source: Many of the meta-commands act on the <firstterm>current query buffer</firstterm>. This is simply a buffer holding whatever SQL command text has been typed but not yet sent to the server for execution. This will include previous input lines as well as any text appearing before the meta-command on the same line.
ru: Многие из метакоманд оперируют с <firstterm>буфером текущего запроса</firstterm>. Этот буфер содержит произвольный текст команд SQL, который был введён, но ещё не отправлен серверу для выполнения. В него будут входить и предыдущие строки, а также текст, расположенный в строке метакоманды перед ней.

source: If the current table output format is unaligned, it is switched to aligned. If it is not unaligned, it is set to unaligned. This command is kept for backwards compatibility. See <command>\pset</command> for a more general solution.
ru: Если текущий режим вывода таблицы невыровненный, то он переключается на выровненный режим. Если текущий режим выровненный, то устанавливается невыровненный. Эта команда поддерживается для обратной совместимости. См. <command>\pset</command> для более общего решения.

source: <literal>\c</literal> or <literal>\connect [ -reuse-previous=<replaceable class="parameter">on|off</replaceable> ] [ <replaceable class="parameter">dbname</replaceable> [ <replaceable class="parameter">username</replaceable> ] [ <replaceable class="parameter">host</replaceable> ] [ <replaceable class="parameter">port</replaceable> ] | <replaceable class="parameter">conninfo</replaceable> ]</literal>
ru: <literal>\c</literal> или <literal>\connect [ -reuse-previous=<replaceable class="parameter">on|off</replaceable> ] [ <replaceable class="parameter">имя_базы</replaceable> [ <replaceable class="parameter">имя_пользователя</replaceable> ] [ <replaceable class="parameter">компьютер</replaceable> ] [ <replaceable class="parameter">порт</replaceable> ] | <replaceable class="parameter">строка_подключения</replaceable> ]</literal>

source: Establishes a new connection to a <productname>PostgreSQL</productname> server. The connection parameters to use can be specified either using a positional syntax, or using <replaceable>conninfo</replaceable> connection strings as detailed in <xref linkend="libpq-connstring"/>.
ru: Устанавливает новое подключение к серверу <productname>PostgreSQL</productname>. Параметры подключения можно указывать как позиционно (в показанном порядке), так и передавая аргумент <replaceable>строка_подключения</replaceable> (подробнее о строках подключения рассказывается в <xref remap="6" linkend="libpq-connstring"/>).
