Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/psql-ref.po
Languages: ru

source: <literal>unaligned</literal> format writes all columns of a row on one line, separated by the currently active field separator. This is useful for creating output that might be intended to be read in by other programs (for example, tab-separated or comma-separated format).
ru: В формате <literal>unaligned</literal> все столбцы размещаются на одной строке и отделяются друг от друга разделителем полей. Это полезно для создания вывода, который будет читаться другими программами (например, формат с выводом значений, разделённых запятыми или табуляцией).

source: <literal>aligned</literal> format is the standard, human-readable, nicely formatted text output; this is the default.
ru: Формат <literal>aligned</literal> это стандартный, удобочитаемый, хорошо отформатированный текстовый вывод. Используется по умолчанию.

source: <literal>wrapped</literal> format is like <literal>aligned</literal> but wraps wide data values across lines to make the output fit in the target column width. The target width is determined as described under the <literal>columns</literal> option. Note that <application>psql</application> will not attempt to wrap column header titles; therefore, <literal>wrapped</literal> format behaves the same as <literal>aligned</literal> if the total width needed for column headers exceeds the target.
ru: Формат <literal>wrapped</literal> похож на <literal>aligned</literal>, но переносит длинные значения столбцов на новые строки, чтобы общий вывод поместился в заданную ширину. Задание ширины вывода описано в параметре <literal>columns</literal>. Обратите внимание, что <application>psql</application> не будет пытаться переносить на новые строки заголовки столбцов. Поэтому формат <literal>wrapped</literal> работает так же, как <literal>aligned</literal> если общая ширина, требуемая для всех заголовков столбцов, превышает установленную максимальную ширину.

source: The <literal>html</literal>, <literal>asciidoc</literal>, <literal>latex</literal>, <literal>latex-longtable</literal>, and <literal>troff-ms</literal> formats put out tables that are intended to be included in documents using the respective mark-up language. They are not complete documents! This might not be necessary in <acronym>HTML</acronym>, but in <application>LaTeX</application> you must have a complete document wrapper. <literal>latex-longtable</literal> also requires the <application>LaTeX</application> <literal>longtable</literal> and <literal>booktabs</literal> packages.
ru: Форматы <literal>html</literal>, <literal>asciidoc</literal>, <literal>latex</literal>, <literal>latex-longtable</literal> и <literal>troff-ms</literal> выводят таблицы, которые предназначены для включения в документы с помощью соответствующего языка разметки. Они не являются полноценными документами! Возможно это необязательно в <acronym>HTML</acronym>, но в <application>LaTeX</application> необходимо иметь полный упаковщик документа. <literal>latex-longtable</literal> также требует наличия пакетов <application>LaTeX</application> <literal>longtable</literal> и <literal>booktabs</literal>.

source: Sets the border line drawing style to one of <literal>ascii</literal>, <literal>old-ascii</literal>, or <literal>unicode</literal>. Unique abbreviations are allowed. (That would mean one letter is enough.) The default setting is <literal>ascii</literal>. This option only affects the <literal>aligned</literal> and <literal>wrapped</literal> output formats.
ru: Задаёт стиль отрисовки линий границы: <literal>ascii</literal>, <literal>old-ascii</literal> или <literal>unicode</literal>. Допускается сокращение слова до уникального значения. (Это значит, что одной буквы будет достаточно.) Значение по умолчанию: <literal>ascii</literal>. Этот параметр действует только в форматах <literal>aligned</literal> и <literal>wrapped</literal>.

source: <literal>ascii</literal> style uses plain <acronym>ASCII</acronym> characters. Newlines in data are shown using a <literal>+</literal> symbol in the right-hand margin. When the <literal>wrapped</literal> format wraps data from one line to the next without a newline character, a dot (<literal>.</literal>) is shown in the right-hand margin of the first line, and again in the left-hand margin of the following line.
ru: Стиль <literal>ascii</literal> использует обычные символы <acronym>ASCII</acronym>. Символы новой строки в данных показываются с использованием символа <literal>+</literal> в правом поле. Когда при формате <literal>wrapped</literal> происходит перенос данных на новую строку (без символа новой строки), ставится точка (<literal>.</literal>) в правом поле первой строки и точка в левом поле следующей строки.

source: <literal>old-ascii</literal> style uses plain <acronym>ASCII</acronym> characters, using the formatting style used in <productname>PostgreSQL</productname> 8.4 and earlier. Newlines in data are shown using a <literal>:</literal> symbol in place of the left-hand column separator. When the data is wrapped from one line to the next without a newline character, a <literal>;</literal> symbol is used in place of the left-hand column separator.
ru: Стиль <literal>old-ascii</literal> использует обычные символы <acronym>ASCII</acronym> в стиле <productname>PostgreSQL</productname> 8.4 и раньше. Символы новой строки в данных отображаются, используя символ <literal>:</literal> вместо левого разделителя полей. Когда происходит перенос данных на новую строку без символа новой строки, символ <literal>;</literal> используется вместо левого разделителя полей.

source: <literal>unicode</literal> style uses Unicode box-drawing characters. Newlines in data are shown using a carriage return symbol in the right-hand margin. When the data is wrapped from one line to the next without a newline character, an ellipsis symbol is shown in the right-hand margin of the first line, and again in the left-hand margin of the following line.
ru: Стиль <literal>unicode</literal> использует символы Юникода для рисования линий. Символы новой строки в данных показываются с использованием символа возврата каретки в правом поле. Когда при формате <literal>wrapped</literal> происходит перенос данных на новую строку (без символа новой строки), ставится символ многоточия в правом поле первой строки и в левом поле следующей строки.

source: When the <literal>border</literal> setting is greater than zero, the <literal>linestyle</literal> option also determines the characters with which the border lines are drawn. Plain <acronym>ASCII</acronym> characters work everywhere, but Unicode characters look nicer on displays that recognize them.
ru: Когда значение <literal>border</literal> больше нуля, параметр <literal>linestyle</literal> также определяет символы, которыми будут рисоваться границы. Обычные символы <acronym>ASCII</acronym> работают везде, но символы Юникода смотрятся лучше на терминалах, распознающих их.

source: Sets the string to be printed in place of a null value. The default is to print nothing, which can easily be mistaken for an empty string. For example, one might prefer <literal>\pset null '(null)'</literal>.
ru: Устанавливает строку, которая будет напечатана вместо значения null. По умолчанию не печатается ничего, что можно ошибочно принять за пустую строку. Например, можно было бы предпочесть <literal>\pset null '(null)'</literal>.

source: If <replaceable class="parameter">value</replaceable> is specified it must be either <literal>on</literal> or <literal>off</literal> which will enable or disable display of a locale-specific character to separate groups of digits to the left of the decimal marker. If <replaceable class="parameter">value</replaceable> is omitted the command toggles between regular and locale-specific numeric output.
ru: Если задаётся <replaceable class="parameter">значение</replaceable>, возможны два варианта: <literal>on</literal> или <literal>off</literal>, которые включают или отключают отображение специфичного для локали символа, разделяющего группы цифр левее десятичной точки. Если <replaceable class="parameter">значение</replaceable> не указано, то команда переключает вывод чисел с локализованного на обычный и обратно.

source: Controls use of a pager program for query and <application>psql</application> help output. If the environment variable <envar>PAGER</envar> is set, the output is piped to the specified program. Otherwise a platform-dependent default (such as <filename>more</filename>) is used.
ru: Управляет использованием постраничника для просмотра результатов запросов и справочной информации <application>psql</application>. Если переменная среды <envar>PAGER</envar> установлена, то данные передаются в указанную программу. В противном случае используется платформозависимая программа по умолчанию (например, <filename>more</filename>).

source: When the <literal>pager</literal> option is <literal>off</literal>, the pager program is not used. When the <literal>pager</literal> option is <literal>on</literal>, the pager is used when appropriate, i.e., when the output is to a terminal and will not fit on the screen. The <literal>pager</literal> option can also be set to <literal>always</literal>, which causes the pager to be used for all terminal output regardless of whether it fits on the screen. <literal>\pset pager</literal> without a <replaceable class="parameter">value</replaceable> toggles pager use on and off.
ru: Если <literal>pager</literal> имеет значение <literal>off</literal>, программа постраничного просмотра (постраничник) не используется. Если <literal>pager</literal> имеет значение <literal>on</literal>, эта программа используется при необходимости, т. е. когда вывод на терминал не помещается на экране. Параметр pager также может иметь значение <literal>always</literal>, при этом постраничник будет использоваться всегда, независимо от того, помещается вывод на экран терминала или нет. Команда <literal>\pset pager</literal> без указания <replaceable class="parameter">значения</replaceable> переключает варианты <literal>on</literal> и <literal>off</literal>.

source: If <literal>pager_min_lines</literal> is set to a number greater than the page height, the pager program will not be called unless there are at least this many lines of output to show. The default setting is 0.
ru: Если в <literal>pager_min_lines</literal> задаётся число, превышающее высоту страницы, программа постраничного вывода не будет вызываться, пока не наберётся заданное число строк для вывода. Значение по умолчанию — 0.

source: Specifies the record (line) separator to use in unaligned output format. The default is a newline character.
ru: Устанавливает разделитель записей (строк) для невыровненного режима вывода. По умолчанию используется символ новой строки.

source: Sets the record separator to use in unaligned output format to a zero byte.
ru: Устанавливает разделитель записей для невыровненного режима вывода в нулевой байт.

source: <literal>tableattr</literal> (or <literal>T</literal>)
ru: <literal>tableattr</literal> (или <literal>T</literal>)

source: In <acronym>HTML</acronym> format, this specifies attributes to be placed inside the <sgmltag>table</sgmltag> tag. This could for example be <literal>cellpadding</literal> or <literal>bgcolor</literal>. Note that you probably don't want to specify <literal>border</literal> here, as that is already taken care of by <literal>\pset border</literal>. If no <replaceable class="parameter">value</replaceable> is given, the table attributes are unset.
ru: Устанавливает атрибуты, которые будут помещены в тег <sgmltag>table</sgmltag>, при формате вывода <acronym>HTML</acronym>. Например, это может быть <literal>cellpadding</literal> или <literal>border</literal>. Заметьте, что, вероятно, не нужно здесь задавать <literal>border</literal>, так как для этого уже есть <literal>\pset border</literal>. Если <replaceable class="parameter">value</replaceable> не задано, атрибуты таблицы удаляются.

source: In <literal>latex-longtable</literal> format, this controls the proportional width of each column containing a left-aligned data type. It is specified as a whitespace-separated list of values, e.g. <literal>'0.2 0.2 0.6'</literal>. Unspecified output columns use the last specified value.
ru: В формате <literal>latex-longtable</literal> этот параметр контролирует пропорциональную ширину каждого столбца, данные которого выровнены по левому краю. Он указывается как список разделённых пробелами значений, например <literal>'0.2 0.2 0.6'</literal>. Для неуказанных столбцов используется последнее из заданных значений.

source: <literal>title</literal> (or <literal>C</literal>)
ru: <literal>title</literal> (или <literal>C</literal>)

source: Sets the table title for any subsequently printed tables. This can be used to give your output descriptive tags. If no <replaceable class="parameter">value</replaceable> is given, the title is unset.
ru: Устанавливает заголовок таблицы для любых впоследствии выводимых таблиц. Это можно использовать для задания описательных тегов при формировании вывода. Если <replaceable class="parameter">value</replaceable> не задано, заголовок таблицы удаляется.

source: <literal>tuples_only</literal> (or <literal>t</literal>)
ru: <literal>tuples_only</literal> (или <literal>t</literal>)

source: If <replaceable class="parameter">value</replaceable> is specified it must be either <literal>on</literal> or <literal>off</literal> which will enable or disable tuples-only mode. If <replaceable class="parameter">value</replaceable> is omitted the command toggles between regular and tuples-only output. Regular output includes extra information such as column headers, titles, and various footers. In tuples-only mode, only actual table data is shown.
ru: Для <replaceable class="parameter">value</replaceable> возможны два значения: <literal>on</literal> или <literal>off</literal>, которые включают или отключают режим вывода только кортежей. Если <replaceable class="parameter">value</replaceable> не указано, то команда переключает с режима вывода только кортежей на обычный режим и обратно. Обычный вывод включает в себя дополнительную информацию, такую как заголовки столбцов и различные колонтитулы. В режиме вывода только кортежей отображаются только фактические табличные данные.

source: Sets the border drawing style for the <literal>unicode</literal> line style to one of <literal>single</literal> or <literal>double</literal>.
ru: Устанавливает стиль рисования границ для стиля линий <literal>unicode</literal>: <literal>single</literal> (одинарный) или <literal>double</literal> (двойной).

source: Sets the column drawing style for the <literal>unicode</literal> line style to one of <literal>single</literal> or <literal>double</literal>.
ru: Устанавливает стиль рисования колонок для стиля линий <literal>unicode</literal>: <literal>single</literal> (одинарный) или <literal>double</literal> (двойной).

source: Sets the header drawing style for the <literal>unicode</literal> line style to one of <literal>single</literal> or <literal>double</literal>.
ru: Устанавливает стиль рисования заголовка для стиля линий <literal>unicode</literal>: <literal>single</literal> (одинарный) или <literal>double</literal> (двойной).

source: Adjustable printing options are: <placeholder-1/>
ru: Имеются следующие параметры: <placeholder-1/>

source: Illustrations of how these different formats look can be seen in the <xref linkend="app-psql-examples" endterm="app-psql-examples-title"/> section.
ru: Иллюстрацию того, как могут выглядеть различные форматы, можно увидеть в разделе <xref linkend="app-psql-examples" endterm="app-psql-examples-title"/>.

source: There are various shortcut commands for <command>\pset</command>. See <command>\a</command>, <command>\C</command>, <command>\f</command>, <command>\H</command>, <command>\t</command>, <command>\T</command>, and <command>\x</command>.
ru: Для некоторых параметров <command>\pset</command> есть короткие команды. См. <command>\a</command>, <command>\C</command>, <command>\f</command>, <command>\H</command>, <command>\t</command>, <command>\T</command> и <command>\x</command>.

source: <literal>\q</literal> or <literal>\quit</literal>
ru: <literal>\q</literal> или <literal>\quit</literal>

source: Quits the <application>psql</application> program. In a script file, only execution of that script is terminated.
ru: Выход из <application>psql</application>. При использовании в скрипте прекращается только выполнение этого скрипта.

source: This command is identical to <command>\echo</command> except that the output will be written to the query output channel, as set by <command>\o</command>.
ru: Эта команда идентична <command>\echo</command> за исключением того, что вывод будет записываться в канал вывода запросов, установленный <command>\o</command>.

source: <literal>\r</literal> or <literal>\reset</literal>
ru: <literal>\r</literal> или <literal>\reset</literal>

source: Resets (clears) the query buffer.
ru: Сбрасывает (очищает) буфер запроса.

source: Print <application>psql</application>'s command line history to <replaceable class="parameter">filename</replaceable>. If <replaceable class="parameter">filename</replaceable> is omitted, the history is written to the standard output (using the pager if appropriate). This command is not available if <application>psql</application> was built without <application>Readline</application> support.
ru: Записывает историю команд <application>psql</application> в файл <replaceable class="parameter">имя_файла</replaceable>. Если <replaceable class="parameter">имя_файла</replaceable> не указано, то история команд выводится на стандартный вывод (с использованием постраничника, когда уместно). Этот параметр недоступен, если <application>psql</application> был собран без поддержки <application>Readline</application>.

source: Sets the <application>psql</application> variable <replaceable class="parameter">name</replaceable> to <replaceable class="parameter">value</replaceable>, or if more than one value is given, to the concatenation of all of them. If only one argument is given, the variable is set to an empty-string value. To unset a variable, use the <command>\unset</command> command.
ru: Задаёт для переменной <application>psql</application> <replaceable class="parameter">имя</replaceable> указанное <replaceable class="parameter">значение</replaceable> или, если указано несколько значений, все эти значения, соединённые вместе. Если присутствует только один аргумент, значением переменной становится пустая строка. Для сброса переменной используйте команду <command>\unset</command>.

source: <command>\set</command> without any arguments displays the names and values of all currently-set <application>psql</application> variables.
ru: <command>\set</command> без аргументов выводит имена и значения всех <application>psql</application> переменных, установленных в настоящее время.

source: Valid variable names can contain letters, digits, and underscores. See the section <xref linkend="app-psql-variables" endterm="app-psql-variables-title"/> below for details. Variable names are case-sensitive.
ru: Имена переменных могут содержать буквы, цифры и знаки подчёркивания. Подробнее см. раздел <xref linkend="app-psql-variables" endterm="app-psql-variables-title"/> ниже. Имена переменных чувствительны к регистру.

source: Certain variables are special, in that they control <application>psql</application>'s behavior or are automatically set to reflect connection state. These variables are documented in <xref linkend="app-psql-variables" endterm="app-psql-variables-title"/>, below.
ru: Некоторые переменные имеют особенности в том, как они управляют поведением <application>psql</application> или автоматически устанавливаются, отражая состояние соединения. Эти переменные документированы ниже, в <xref remap="6" linkend="app-psql-variables" endterm="app-psql-variables-title"/>.

source: This command is unrelated to the <acronym>SQL</acronym> command <xref linkend="sql-set"/>.
ru: Эта команда не имеет отношения к <acronym>SQL</acronym>-команде <xref linkend="sql-set"/>.

source: Sets the environment variable <replaceable class="parameter">name</replaceable> to <replaceable class="parameter">value</replaceable>, or if the <replaceable class="parameter">value</replaceable> is not supplied, unsets the environment variable. Example: <placeholder-1/>
ru: Задаёт для переменной среды <replaceable class="parameter">name</replaceable> значение <replaceable class="parameter">value</replaceable> или, если <replaceable class="parameter">value</replaceable> не задано, удаляет переменную среды. Пример: <placeholder-1/>

source: This command fetches and shows the definition of the named function, in the form of a <command>CREATE OR REPLACE FUNCTION</command> command. The definition is printed to the current query output channel, as set by <command>\o</command>.
ru: Извлекает из базы данных и выводит определение заданной функции в форме команды <command>CREATE OR REPLACE FUNCTION</command>. Определение печатается в текущий канал вывода запросов, установленный <command>\o</command>.

source: If <literal>+</literal> is appended to the command name, then the output lines are numbered, with the first line of the function body being line 1.
ru: При добавлении <literal>+</literal> к имени команды строки вывода нумеруются, первая строка тела функции получит номер 1.

source: Unlike most other meta-commands, the entire remainder of the line is always taken to be the argument(s) of <command>\sf</command>, and neither variable interpolation nor backquote expansion are performed in the arguments.
ru: В отличие от большинства других метакоманд весь остаток строки всегда воспринимается как аргументы <command>\sf</command>, и в этих аргументах не выполняется ни подстановка переменных, ни раскрытие обратных кавычек.

source: This command fetches and shows the definition of the named view, in the form of a <command>CREATE OR REPLACE VIEW</command> command. The definition is printed to the current query output channel, as set by <command>\o</command>.
ru: Извлекает из базы данных и выводит определение указанного представления в форме команды <command>CREATE OR REPLACE VIEW</command>. Определение выводится в текущий канал вывода запросов, установленный <command>\o</command>.

source: If <literal>+</literal> is appended to the command name, then the output lines are numbered from 1.
ru: При добавлении <literal>+</literal> к имени команды строки вывода нумеруются, начиная с 1.

source: Unlike most other meta-commands, the entire remainder of the line is always taken to be the argument(s) of <command>\sv</command>, and neither variable interpolation nor backquote expansion are performed in the arguments.
ru: В отличие от большинства других метакоманд весь остаток строки всегда воспринимается как аргументы <command>\sv</command>, и в этих аргументах не выполняется ни подстановка переменных, ни раскрытие обратных кавычек.

source: Toggles the display of output column name headings and row count footer. This command is equivalent to <literal>\pset tuples_only</literal> and is provided for convenience.
ru: Включает/выключает отображение имён столбцов и результирующей строки с количеством выбранных записей для запросов. Эта команда эквивалентна <literal>\pset tuples_only</literal> и предоставлена для удобства.

source: Specifies attributes to be placed within the <sgmltag>table</sgmltag> tag in <acronym>HTML</acronym> output format. This command is equivalent to <literal>\pset tableattr <replaceable class="parameter">table_options</replaceable></literal>.
ru: Устанавливает атрибуты, которые будут помещены в тег <sgmltag>table</sgmltag> при формате вывода <acronym>HTML</acronym>. Эта команда эквивалентна <literal>\pset tableattr <replaceable class="parameter">table_options</replaceable></literal>.
