Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/reset.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: restore the value of a run-time parameter to the default value
ru: восстановить значение по умолчанию заданного параметра времени выполнения

source: configuration_parameter
ru: параметр_конфигурации

source: Description
ru: Описание

source: <command>RESET</command> restores run-time parameters to their default values. <command>RESET</command> is an alternative spelling for <synopsis> SET <replaceable class="parameter">configuration_parameter</replaceable> TO DEFAULT </synopsis> Refer to <xref linkend="sql-set"/> for details.
ru: <command>RESET</command> сбрасывает параметры времени выполнения к значениям по умолчанию. <command>RESET</command> — альтернативное написание команды <synopsis> SET <replaceable class="parameter">параметр_конфигурации</replaceable> TO DEFAULT </synopsis> За подробностями обратитесь к <xref remap="3" linkend="sql-set"/>.

source: The default value is defined as the value that the parameter would have had, if no <command>SET</command> had ever been issued for it in the current session. The actual source of this value might be a compiled-in default, the configuration file, command-line options, or per-database or per-user default settings. This is subtly different from defining it as <quote>the value that the parameter had at session start</quote>, because if the value came from the configuration file, it will be reset to whatever is specified by the configuration file now. See <xref linkend="runtime-config"/> for details.
ru: Значение по умолчанию определяется как значение, которое имел бы этот параметр, если бы для него не выполнялась команда <command>SET</command> в текущем сеансе. Фактическое значение может быть задано в компилируемом коде, файле конфигурации, параметрах командной строки или в параметрах по умолчанию для базы данных или пользователя. Если определить его как <quote>значение, которое имеет параметр в начале сеанса</quote>, это будет не вполне корректно, так как оно будет сброшено к тому, что задано в файле конфигурации в данный момент. За подробностями обратитесь к <xref remap="3" linkend="runtime-config"/>.

source: The transactional behavior of <command>RESET</command> is the same as <command>SET</command>: its effects will be undone by transaction rollback.
ru: Транзакционное поведение команды <command>RESET</command> не отличается от <command>SET</command>: её действие будет отменено при откате транзакции.

source: Parameters
ru: Параметры

source: Name of a settable run-time parameter. Available parameters are documented in <xref linkend="runtime-config"/> and on the <xref linkend="sql-set"/> reference page.
ru: Имя устанавливаемого параметра конфигурации времени выполнения. Доступные параметры описаны в <xref remap="6" linkend="runtime-config"/> и на справочной странице <xref linkend="sql-set"/>.

source: Resets all settable run-time parameters to default values.
ru: Сбрасывает к значениям по умолчанию все устанавливаемые параметры времени выполнения.

source: Examples
ru: Примеры

source: Set the <varname>timezone</varname> configuration variable to its default value: <screen> RESET timezone; </screen>
ru: Сброс конфигурационной переменной <varname>timezone</varname> к значению по умолчанию: <screen> RESET timezone; </screen>

source: Compatibility
ru: Совместимость

source: <command>RESET</command> is a <productname>PostgreSQL</productname> extension.
ru: <command>RESET</command> является расширением <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
