Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/update.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: update rows of a table
ru: изменить строки таблицы

source: with_query
ru: запрос_WITH

source: table_name
ru: имя_таблицы

source: alias
ru: псевдоним

source: column_name
ru: имя_столбца

source: expression
ru: выражение

source: sub-SELECT
ru: вложенный_SELECT

source: from_list
ru: список_FROM

source: condition
ru: условие

source: cursor_name
ru: имя_курсора

source: output_expression
ru: выражение_результата

source: output_name
ru: имя_результата

source: Description
ru: Описание

source: <command>UPDATE</command> changes the values of the specified columns in all rows that satisfy the condition. Only the columns to be modified need be mentioned in the <literal>SET</literal> clause; columns not explicitly modified retain their previous values.
ru: <command>UPDATE</command> изменяет значения указанных столбцов во всех строках, удовлетворяющих условию. В предложении <literal>SET</literal> должны указываться только те столбцы, которые будут изменены; столбцы, не изменяемые явно, сохраняют свои предыдущие значения.

source: There are two ways to modify a table using information contained in other tables in the database: using sub-selects, or specifying additional tables in the <literal>FROM</literal> clause. Which technique is more appropriate depends on the specific circumstances.
ru: Изменить строки в таблице, используя информацию из других таблиц в базе данных, можно двумя способами: применяя вложенные запросы или указав дополнительные таблицы в предложении <literal>FROM</literal>. Выбор предпочитаемого варианта зависит от конкретных обстоятельств.

source: The optional <literal>RETURNING</literal> clause causes <command>UPDATE</command> to compute and return value(s) based on each row actually updated. Any expression using the table's columns, and/or columns of other tables mentioned in <literal>FROM</literal>, can be computed. The new (post-update) values of the table's columns are used. The syntax of the <literal>RETURNING</literal> list is identical to that of the output list of <command>SELECT</command>.
ru: Предложение <literal>RETURNING</literal> указывает, что команда <command>UPDATE</command> должна вычислить и возвратить значения для каждой фактически изменённой строки. Вычислить в нём можно любое выражение со столбцами целевой таблицы и/или столбцами других таблиц, упомянутых во <literal>FROM</literal>. При этом в выражении будут использоваться новые (изменённые) значения столбцов таблицы. Список <literal>RETURNING</literal> имеет тот же синтаксис, что и список результатов <command>SELECT</command>.

source: You must have the <literal>UPDATE</literal> privilege on the table, or at least on the column(s) that are listed to be updated. You must also have the <literal>SELECT</literal> privilege on any column whose values are read in the <replaceable class="parameter">expressions</replaceable> or <replaceable class="parameter">condition</replaceable>.
ru: Для выполнения этой команды необходимо иметь право <literal>UPDATE</literal> для таблицы, или как минимум для столбцов, перечисленных в списке изменяемых. Также необходимо иметь право <literal>SELECT</literal> для всех столбцов, значения которых считываются в <replaceable class="parameter">выражениях</replaceable> или <replaceable class="parameter">условии</replaceable>.

source: Parameters
ru: Параметры

source: The <literal>WITH</literal> clause allows you to specify one or more subqueries that can be referenced by name in the <command>UPDATE</command> query. See <xref linkend="queries-with"/> and <xref linkend="sql-select"/> for details.
ru: Предложение <literal>WITH</literal> позволяет задать один или несколько подзапросов, на которые затем можно ссылаться по имени в запросе <command>UPDATE</command>. Подробнее об этом см. <xref remap="4" linkend="queries-with"/> и <xref remap="4" linkend="sql-select"/>.

source: The name (optionally schema-qualified) of the table to update. If <literal>ONLY</literal> is specified before the table name, matching rows are updated in the named table only. If <literal>ONLY</literal> is not specified, matching rows are also updated in any tables inheriting from the named table. Optionally, <literal>*</literal> can be specified after the table name to explicitly indicate that descendant tables are included.
ru: Имя (возможно, дополненное схемой) таблицы, строки которой будут изменены. Если перед именем таблицы добавлено <literal>ONLY</literal>, соответствующие строки изменяются только в указанной таблице. Без <literal>ONLY</literal> строки будут также изменены во всех таблицах, унаследованных от указанной. При желании, после имени таблицы можно указать <literal>*</literal>, чтобы явно обозначить, что операция затрагивает все дочерние таблицы.

source: A substitute name for the target table. When an alias is provided, it completely hides the actual name of the table. For example, given <literal>UPDATE foo AS f</literal>, the remainder of the <command>UPDATE</command> statement must refer to this table as <literal>f</literal> not <literal>foo</literal>.
ru: Альтернативное имя целевой таблицы. Когда указывается это имя, оно полностью скрывает фактическое имя таблицы. Например, в запросе <literal>UPDATE foo AS f</literal> дополнительные компоненты оператора <command>UPDATE</command> должны обращаться к целевой таблице по имени <literal>f</literal>, а не <literal>foo</literal>.

source: The name of a column in the table named by <replaceable class="parameter">table_name</replaceable>. The column name can be qualified with a subfield name or array subscript, if needed. Do not include the table's name in the specification of a target column &mdash; for example, <literal>UPDATE table_name SET table_name.col = 1</literal> is invalid.
ru: Имя столбца в таблице <replaceable class="parameter">имя_таблицы</replaceable>. Имя столбца при необходимости может быть дополнено именем вложенного поля или индексом массива. Имя таблицы добавлять к имени целевого столбца не нужно &mdash; например, запись <literal>UPDATE table_name SET table_name.col = 1</literal> ошибочна.

source: An expression to assign to the column. The expression can use the old values of this and other columns in the table.
ru: Выражение, результат которого присваивается столбцу. В этом выражении можно использовать предыдущие значения этого и других столбцов таблицы.

source: Set the column to its default value (which will be NULL if no specific default expression has been assigned to it).
ru: Присвоить столбцу значение по умолчанию (это может быть NULL, если для столбца не определено некоторое выражение по умолчанию).

source: A <literal>SELECT</literal> sub-query that produces as many output columns as are listed in the parenthesized column list preceding it. The sub-query must yield no more than one row when executed. If it yields one row, its column values are assigned to the target columns; if it yields no rows, NULL values are assigned to the target columns. The sub-query can refer to old values of the current row of the table being updated.
ru: Подзапрос <literal>SELECT</literal>, выдающий столько выходных столбцов, сколько перечислено в предшествующем ему списке столбцов в скобках. При выполнении этого подзапроса должна быть получена максимум одна строка. Если он выдаёт одну строку, значения столбцов в нём присваиваются целевым столбцам; если же он не возвращает строку, целевым столбцам присваивается NULL. Этот подзапрос может обращаться к предыдущим значениям текущей изменяемой строки в таблице.

source: A list of table expressions, allowing columns from other tables to appear in the <literal>WHERE</literal> condition and the update expressions. This is similar to the list of tables that can be specified in the <xref linkend="sql-from" endterm="sql-from-title"/> of a <command>SELECT</command> statement. Note that the target table must not appear in the <replaceable>from_list</replaceable>, unless you intend a self-join (in which case it must appear with an alias in the <replaceable>from_list</replaceable>).
ru: Список табличных выражений, позволяющий использовать в условии <literal>WHERE</literal> и выражениях присваивания столбцы из других таблиц. Этот список подобен тому, что задаётся в предложении <xref linkend="sql-from" endterm="sql-from-title"/> оператора <command>SELECT</command>. Заметьте, что целевую таблицу нужно добавлять в <replaceable>список_FROM</replaceable> только при формировании замкнутого соединения (в этом случае она должна фигурировать в <replaceable>списке_FROM</replaceable> под псевдонимом).

source: An expression that returns a value of type <type>boolean</type>. Only rows for which this expression returns <literal>true</literal> will be updated.
ru: Выражение, возвращающее значение типа <type>boolean</type>. Изменены будут только те стоки, для которых это выражение возвращает <literal>true</literal>.

source: The name of the cursor to use in a <literal>WHERE CURRENT OF</literal> condition. The row to be updated is the one most recently fetched from this cursor. The cursor must be a non-grouping query on the <command>UPDATE</command>'s target table. Note that <literal>WHERE CURRENT OF</literal> cannot be specified together with a Boolean condition. See <xref linkend="sql-declare"/> for more information about using cursors with <literal>WHERE CURRENT OF</literal>.
ru: Имя курсора, который будет использоваться в условии <literal>WHERE CURRENT OF</literal>. С таким условием будет изменена строка, выбранная из этого курсора последней. Курсор должен образовываться запросом, не применяющим группировку, к целевой таблице команды <command>UPDATE</command>. Заметьте, что <literal>WHERE CURRENT OF</literal> нельзя задать вместе с булевским условием. За дополнительными сведениями об использовании курсоров с <literal>WHERE CURRENT OF</literal> обратитесь к <xref remap="3" linkend="sql-declare"/>.

source: An expression to be computed and returned by the <command>UPDATE</command> command after each row is updated. The expression can use any column names of the table named by <replaceable class="parameter">table_name</replaceable> or table(s) listed in <literal>FROM</literal>. Write <literal>*</literal> to return all columns.
ru: Выражение, которое будет вычисляться и возвращаться командой <command>UPDATE</command> после изменения каждой строки. В этом выражении можно использовать имена любых столбцов таблицы <replaceable class="parameter">имя_таблицы</replaceable> или таблиц, перечисленных в списке <literal>FROM</literal>. Чтобы получить все столбцы, достаточно написать <literal>*</literal>.

source: A name to use for a returned column.
ru: Имя, назначаемое возвращаемому столбцу.

source: Outputs
ru: Выводимая информация

source: On successful completion, an <command>UPDATE</command> command returns a command tag of the form <screen> UPDATE <replaceable class="parameter">count</replaceable> </screen> The <replaceable class="parameter">count</replaceable> is the number of rows updated, including matched rows whose values did not change. Note that the number may be less than the number of rows that matched the <replaceable class="parameter">condition</replaceable> when updates were suppressed by a <literal>BEFORE UPDATE</literal> trigger. If <replaceable class="parameter">count</replaceable> is 0, no rows were updated by the query (this is not considered an error).
ru: В случае успешного завершения, <command>UPDATE</command> возвращает метку команды в виде <screen> UPDATE <replaceable class="parameter">число</replaceable> </screen> Здесь <replaceable class="parameter">число</replaceable> обозначает количество изменённых строк, включая те подлежащие изменению строки, значения в которых не были изменены. Заметьте, что это число может быть меньше количества строк, удовлетворяющих <replaceable class="parameter">условию</replaceable>, когда изменения отменяются триггером <literal>BEFORE UPDATE</literal>. Если <replaceable class="parameter">число</replaceable> равно 0, данный запрос не изменил ни одной строки (это не считается ошибкой).

source: If the <command>UPDATE</command> command contains a <literal>RETURNING</literal> clause, the result will be similar to that of a <command>SELECT</command> statement containing the columns and values defined in the <literal>RETURNING</literal> list, computed over the row(s) updated by the command.
ru: Если команда <command>UPDATE</command> содержит предложение <literal>RETURNING</literal>, её результат будет похож на результат оператора <command>SELECT</command> (с теми же столбцами и значениями, что содержатся в списке <literal>RETURNING</literal>), полученный для строк, изменённых этой командой.

source: Notes
ru: Замечания

source: When a <literal>FROM</literal> clause is present, what essentially happens is that the target table is joined to the tables mentioned in the <replaceable>from_list</replaceable>, and each output row of the join represents an update operation for the target table. When using <literal>FROM</literal> you should ensure that the join produces at most one output row for each row to be modified. In other words, a target row shouldn't join to more than one row from the other table(s). If it does, then only one of the join rows will be used to update the target row, but which one will be used is not readily predictable.
ru: Когда присутствует предложение <literal>FROM</literal>, целевая таблица по сути соединяется с таблицами, перечисленными в <replaceable>списке_FROM</replaceable>, и каждая выходная строка соединения представляет операцию изменения для целевой таблицы. Применяя предложение <literal>FROM</literal>, необходимо обеспечить, чтобы соединение выдавало максимум одну выходную строку для каждой строки, которую нужно изменить. Другими словами, целевая строка не должна соединяться с более чем одной строкой из других таблиц. Если это условие нарушается, только одна из строк соединения будет использоваться для изменения целевой строки, но какая именно, предсказать нельзя.

source: Because of this indeterminacy, referencing other tables only within sub-selects is safer, though often harder to read and slower than using a join.
ru: Из-за этой неопределённости надёжнее ссылаться на другие таблицы только в подзапросах, хотя такие запросы часто хуже читаются и работают медленнее, чем соединение.

source: In the case of a partitioned table, updating a row might cause it to no longer satisfy the partition constraint. Since there is no provision to move the row to the partition appropriate to the new value of its partitioning key, an error will occur in this case. This can also happen when updating a partition directly.
ru: В случае с секционированной таблицей при изменении строки она может перестать удовлетворять ограничению секции. Ввиду отсутствия средств для переноса строки в другую секцию, соответствующую новому значению ключа секционирования, в этой ситуации произойдёт ошибка. Это также возможно при непосредственном изменении данных в секции.

source: Examples
ru: Примеры

source: Change the word <literal>Drama</literal> to <literal>Dramatic</literal> in the column <structfield>kind</structfield> of the table <structname>films</structname>: <placeholder-1/>
ru: Изменение слова <literal>Drama</literal> на <literal>Dramatic</literal> в столбце <structfield>kind</structfield> таблицы <structname>films</structname>: <placeholder-1/>

source: Adjust temperature entries and reset precipitation to its default value in one row of the table <structname>weather</structname>: <placeholder-1/>
ru: Изменение значений температуры и сброс уровня осадков к значению по умолчанию в одной строке таблицы <structname>weather</structname>: <placeholder-1/>

source: Perform the same operation and return the updated entries: <placeholder-1/>
ru: Выполнение той же операции с получением изменённых записей: <placeholder-1/>

source: Use the alternative column-list syntax to do the same update: <placeholder-1/>
ru: Такое же изменение с применением альтернативного синтаксиса со списком столбцов: <placeholder-1/>

source: Increment the sales count of the salesperson who manages the account for Acme Corporation, using the <literal>FROM</literal> clause syntax: <placeholder-1/>
ru: Увеличение счётчика продаж для менеджера, занимающегося компанией Acme Corporation, с применением предложения <literal>FROM</literal>: <placeholder-1/>

source: Perform the same operation, using a sub-select in the <literal>WHERE</literal> clause: <placeholder-1/>
ru: Выполнение той же операции, с вложенным запросом в предложении <literal>WHERE</literal>: <placeholder-1/>

source: Update contact names in an accounts table to match the currently assigned salesmen: <placeholder-1/> A similar result could be accomplished with a join: <placeholder-2/> However, the second query may give unexpected results if <structname>salesmen</structname>.<structfield>id</structfield> is not a unique key, whereas the first query is guaranteed to raise an error if there are multiple <structfield>id</structfield> matches. Also, if there is no match for a particular <structname>accounts</structname>.<structfield>sales_id</structfield> entry, the first query will set the corresponding name fields to NULL, whereas the second query will not update that row at all.
ru: Изменение имени контакта в таблице счетов (это должно быть имя назначенного менеджера по продажам): <placeholder-1/> Подобный результат можно получить, применив соединение: <placeholder-2/> Однако, если <structname>salesmen</structname>.<structfield>id</structfield> — не уникальный ключ, второй запрос может давать непредсказуемые результаты, тогда как первый запрос гарантированно выдаст ошибку, если найдётся несколько записей с одним <structfield>id</structfield>. Кроме того, если соответствующая запись <structname>accounts</structname>.<structfield>sales_id</structfield> не найдётся, первый запрос запишет в поля имени NULL, а второй вовсе не изменит строку.

source: Update statistics in a summary table to match the current data: <placeholder-1/>
ru: Обновление статистики в сводной таблице в соответствии с текущими данными: <placeholder-1/>

source: BEGIN; -- other operations SAVEPOINT sp1; INSERT INTO wines VALUES('Chateau Lafite 2003', '24'); -- Assume the above fails because of a unique key violation, -- so now we issue these commands: ROLLBACK TO sp1; UPDATE wines SET stock = stock + 24 WHERE winename = 'Chateau Lafite 2003'; -- continue with other operations, and eventually COMMIT;
ru: BEGIN; -- другие операции SAVEPOINT sp1; INSERT INTO wines VALUES('Chateau Lafite 2003', '24'); -- Предполагая, что здесь возникает ошибка из-за нарушения уникальности ключа, -- мы выполняем следующие команды: ROLLBACK TO sp1; UPDATE wines SET stock = stock + 24 WHERE winename = 'Chateau Lafite 2003'; -- Продолжение других операций и в завершение... COMMIT;

source: Attempt to insert a new stock item along with the quantity of stock. If the item already exists, instead update the stock count of the existing item. To do this without failing the entire transaction, use savepoints: <placeholder-1/>
ru: Попытка добавить новый продукт вместе с количеством. Если такая запись уже существует, вместо этого увеличить количество данного продукта в существующей записи. Чтобы реализовать этот подход, не откатывая всю транзакцию, можно использовать точки сохранения: <placeholder-1/>

source: Change the <structfield>kind</structfield> column of the table <structname>films</structname> in the row on which the cursor <literal>c_films</literal> is currently positioned: <placeholder-1/>
ru: Изменение столбца <structfield>kind</structfield> таблицы <structname>films</structname> в строке, на которой в данный момент находится курсор <literal>c_films</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: This command conforms to the <acronym>SQL</acronym> standard, except that the <literal>FROM</literal> and <literal>RETURNING</literal> clauses are <productname>PostgreSQL</productname> extensions, as is the ability to use <literal>WITH</literal> with <command>UPDATE</command>.
ru: Эта команда соответствует стандарту <acronym>SQL</acronym>, за исключением предложений <literal>FROM</literal> и <literal>RETURNING</literal>, которые являются расширениями <productname>PostgreSQL</productname>, как и возможность применять <literal>WITH</literal> с <command>UPDATE</command>.

source: Some other database systems offer a <literal>FROM</literal> option in which the target table is supposed to be listed again within <literal>FROM</literal>. That is not how <productname>PostgreSQL</productname> interprets <literal>FROM</literal>. Be careful when porting applications that use this extension.
ru: В некоторых других СУБД также поддерживается дополнительное предложение <literal>FROM</literal>, но предполагается, что целевая таблица должна ещё раз упоминаться в этом предложении. <productname>PostgreSQL</productname> воспринимает предложение <literal>FROM</literal> не так, поэтому будьте внимательны, портируя приложения, которые используют это расширение языка.

source: According to the standard, the source value for a parenthesized sub-list of column names can be any row-valued expression yielding the correct number of columns. <productname>PostgreSQL</productname> only allows the source value to be a parenthesized list of expressions or a sub-<literal>SELECT</literal>. An individual column's updated value can be specified as <literal>DEFAULT</literal> in the list-of-expressions case, but not inside a sub-<literal>SELECT</literal>.
ru: Согласно стандарту, исходным значением для вложенного списка имён столбцов в скобках может быть любое выражение, выдающее строку с нужным количеством столбцов. <productname>PostgreSQL</productname> принимает в качестве этого значения только список выражений в скобках или вложенный <literal>SELECT</literal>. Изменяемое значение отдельного столбца можно обозначить словом <literal>DEFAULT</literal> в случае со списком выражений, но не внутри вложенного <literal>SELECT</literal>.

source: According to the standard, the source value for a parenthesized sub-list of target column names can be any row-valued expression yielding the correct number of columns. <productname>PostgreSQL</productname> only allows the source value to be a <link linkend="sql-syntax-row-constructors">row constructor</link> or a sub-<literal>SELECT</literal>. An individual column's updated value can be specified as <literal>DEFAULT</literal> in the row-constructor case, but not inside a sub-<literal>SELECT</literal>.
ru: Согласно стандарту, исходным значением для вложенного списка имён столбцов в скобках может быть любое выражение, выдающее строку с нужным количеством столбцов. <productname>PostgreSQL</productname> принимает в качестве этого значения только <link linkend="sql-syntax-row-constructors">конструктор строки</link> или вложенный <literal>SELECT</literal>. Изменяемое значение отдельного столбца можно обозначать словом <literal>DEFAULT</literal> в конструкторе строки, но не внутри вложенного <literal>SELECT</literal>.
