Repository: alexanderlaw/pg-doc-ru
Catalog: postgresql-doc/ref/values.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: compute a set of rows
ru: вычислить набор строк

source: expression
ru: выражение

source: sort_expression
ru: выражение_сортировки

source: operator
ru: оператор

source: count
ru: число

source: start
ru: начало

source: Description
ru: Описание

source: <command>VALUES</command> computes a row value or set of row values specified by value expressions. It is most commonly used to generate a <quote>constant table</quote> within a larger command, but it can be used on its own.
ru: <command>VALUES</command> вычисляет значение строки или множество значений строк, заданное выражениями. Чаще всего эта команда используется для формирования <quote>таблицы констант</quote> в большой команде, но её можно использовать и отдельно.

source: When more than one row is specified, all the rows must have the same number of elements. The data types of the resulting table's columns are determined by combining the explicit or inferred types of the expressions appearing in that column, using the same rules as for <literal>UNION</literal> (see <xref linkend="typeconv-union-case"/>).
ru: Когда указывается больше, чем одна строка, все строки должны иметь одинаковое количество элементов. Типы данных результирующих столбцов таблицы определяются в результате совмещения явных и неявных типов выражений, заданных для этих столбцов, по тем же правилам, что и в <literal>UNION</literal> (см. <xref remap="4" linkend="typeconv-union-case"/>).

source: Within larger commands, <command>VALUES</command> is syntactically allowed anywhere that <command>SELECT</command> is. Because it is treated like a <command>SELECT</command> by the grammar, it is possible to use the <literal>ORDER BY</literal>, <literal>LIMIT</literal> (or equivalently <literal>FETCH FIRST</literal>), and <literal>OFFSET</literal> clauses with a <command>VALUES</command> command.
ru: В составе других команд синтаксис допускает использование <command>VALUES</command> везде, где допускается <command>SELECT</command>. Так как грамматически она воспринимается как <command>SELECT</command>, с командой <command>VALUES</command> можно использовать предложения <literal>ORDER BY</literal>, <literal>LIMIT</literal> (или равнозначное <literal>FETCH FIRST</literal>) и <literal>OFFSET</literal>.

source: Parameters
ru: Параметры

source: A constant or expression to compute and insert at the indicated place in the resulting table (set of rows). In a <command>VALUES</command> list appearing at the top level of an <command>INSERT</command>, an <replaceable class="parameter">expression</replaceable> can be replaced by <literal>DEFAULT</literal> to indicate that the destination column's default value should be inserted. <literal>DEFAULT</literal> cannot be used when <command>VALUES</command> appears in other contexts.
ru: Константа или выражение, которое вычисляется и вставляется в указанное место результирующей таблицы (множества строк). В списке <command>VALUES</command>, находящемся на верхнем уровне оператора <command>INSERT</command>, <replaceable class="parameter">выражение</replaceable> может быть заменено словом <literal>DEFAULT</literal>, указывающим, что в целевой столбец должно быть вставлено значение этого столбца по умолчанию. Когда <command>VALUES</command> употребляется в других контекстах, указание <literal>DEFAULT</literal> использовать нельзя.

source: An expression or integer constant indicating how to sort the result rows. This expression can refer to the columns of the <command>VALUES</command> result as <literal>column1</literal>, <literal>column2</literal>, etc. For more details see <xref linkend="sql-orderby" endterm="sql-orderby-title"/>.
ru: Выражение или целочисленная константа, указывающая, как должны сортироваться строки результата. Это выражение может обращаться к столбцам результата <command>VALUES</command> по именам <literal>column1</literal>, <literal>column2</literal> и т. д. За дополнительными подробностями обратитесь к <xref remap="3" linkend="sql-orderby" endterm="sql-orderby-title"/>.

source: A sorting operator. For details see <xref linkend="sql-orderby" endterm="sql-orderby-title"/>.
ru: Оператор сортировки. За подробностями обратитесь к <xref remap="3" linkend="sql-orderby" endterm="sql-orderby-title"/>.

source: The maximum number of rows to return. For details see <xref linkend="sql-limit" endterm="sql-limit-title"/>.
ru: Максимальное число строк, которое должно быть возвращено. За подробностями обратитесь к <xref remap="3" linkend="sql-limit" endterm="sql-limit-title"/>.

source: The number of rows to skip before starting to return rows. For details see <xref linkend="sql-limit" endterm="sql-limit-title"/>.
ru: Число строк, которые должны быть пропущены, прежде чем начнётся выдача строк. За подробностями обратитесь к <xref remap="3" linkend="sql-limit" endterm="sql-limit-title"/>.

source: Notes
ru: Замечания

source: <command>VALUES</command> lists with very large numbers of rows should be avoided, as you might encounter out-of-memory failures or poor performance. <command>VALUES</command> appearing within <command>INSERT</command> is a special case (because the desired column types are known from the <command>INSERT</command>'s target table, and need not be inferred by scanning the <command>VALUES</command> list), so it can handle larger lists than are practical in other contexts.
ru: Следует избегать составления списков <command>VALUES</command> с очень большим количеством строк, так как при этом можно столкнуться с нехваткой памяти или снижением производительности. Применение <command>VALUES</command> в команде <command>INSERT</command> — особый случай (так как ожидаемые типы столбцов становятся известны из целевой таблицы команды <command>INSERT</command> и их не надо вычислять, сканируя весь список <command>VALUES</command>), так что в этом контексте можно работать с гораздо более объёмными списками, чем в других.

source: Examples
ru: Примеры

source: A bare <command>VALUES</command> command: <placeholder-1/> This will return a table of two columns and three rows. It's effectively equivalent to: <placeholder-2/>
ru: Простейшая команда <command>VALUES</command>: <placeholder-1/> Эта команда выдаст таблицу из двух столбцов и трёх строк. По сути она равнозначна запросу: <placeholder-2/>

source: More usually, <command>VALUES</command> is used within a larger SQL command. The most common use is in <command>INSERT</command>: <placeholder-1/>
ru: Более типично использование <command>VALUES</command> в составе большей команды SQL. Чаще всего она применяется в <command>INSERT</command>: <placeholder-1/>

source: In the context of <command>INSERT</command>, entries of a <command>VALUES</command> list can be <literal>DEFAULT</literal> to indicate that the column default should be used here instead of specifying a value: <placeholder-1/>
ru: В контексте <command>INSERT</command> список <command>VALUES</command> может содержать слово <literal>DEFAULT</literal>, указывающее, что в данном месте вместо некоторого значения должно использоваться значение столбца по умолчанию: <placeholder-1/>

source: <command>VALUES</command> can also be used where a sub-<command>SELECT</command> might be written, for example in a <literal>FROM</literal> clause: <placeholder-1/> Note that an <literal>AS</literal> clause is required when <command>VALUES</command> is used in a <literal>FROM</literal> clause, just as is true for <command>SELECT</command>. It is not required that the <literal>AS</literal> clause specify names for all the columns, but it's good practice to do so. (The default column names for <command>VALUES</command> are <literal>column1</literal>, <literal>column2</literal>, etc in <productname>PostgreSQL</productname>, but these names might be different in other database systems.)
ru: <command>VALUES</command> также может применяться там, где можно написать вложенный <command>SELECT</command>, например в предложении <literal>FROM</literal>: <placeholder-1/> Заметьте, что когда <command>VALUES</command> используется в предложении <literal>FROM</literal>, предложение <literal>AS</literal> становится обязательным, так же, как и для <command>SELECT</command>. При этом не требуется указывать в <literal>AS</literal> имена всех столбцов, но это рекомендуется делать. (По умолчанию <productname>PostgreSQL</productname> даёт столбцам <command>VALUES</command> имена <literal>column1</literal>, <literal>column2</literal> и т. д., но в других СУБД имена могут быть другими.)

source: When <command>VALUES</command> is used in <command>INSERT</command>, the values are all automatically coerced to the data type of the corresponding destination column. When it's used in other contexts, it might be necessary to specify the correct data type. If the entries are all quoted literal constants, coercing the first is sufficient to determine the assumed type for all: <placeholder-1/>
ru: Когда <command>VALUES</command> используется в команде <command>INSERT</command>, значения автоматически приводятся к типу данных соответствующего целевого столбца. Когда оно используется в других контекстах, может потребоваться указать нужный тип данных. Если все записи представлены строковыми константами в кавычках, достаточно привести к нужному типу значения в первой строке, чтобы задать тип для всех: <placeholder-1/>

source: For simple <literal>IN</literal> tests, it's better to rely on the <link linkend="functions-comparisons-in-scalar">list-of-scalars</link> form of <literal>IN</literal> than to write a <command>VALUES</command> query as shown above. The list of scalars method requires less writing and is often more efficient.
ru: Для простых проверок на включение <literal>IN</literal> лучше полагаться на форму <literal>IN</literal> со <link linkend="functions-comparisons-in-scalar">списком скаляров</link>, чем записывать запрос <command>VALUES</command>, как показано выше. Список скаляров проще записать и обрабатывается он зачастую более эффективно.

source: Compatibility
ru: Совместимость

source: <command>VALUES</command> conforms to the SQL standard. <literal>LIMIT</literal> and <literal>OFFSET</literal> are <productname>PostgreSQL</productname> extensions; see also under <xref linkend="sql-select"/>.
ru: <command>VALUES</command> соответствует стандарту SQL. Указания <literal>LIMIT</literal> и <literal>OFFSET</literal> являются расширениями <productname>PostgreSQL</productname>; см. также <xref remap="4" linkend="sql-select"/>.

source: See Also
ru: См. также
