Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/ref/copy.po
Languages: ru

source: if 1, OIDs are included in the data; if 0, not
ru: При 1 в данные включается OID; при 0 — нет

source: 32-bit integer bit mask to denote important aspects of the file format. Bits are numbered from 0 (<acronym>LSB</acronym>) to 31 (<acronym>MSB</acronym>). Note that this field is stored in network byte order (most significant byte first), as are all the integer fields used in the file format. Bits 16-31 are reserved to denote critical file format issues; a reader should abort if it finds an unexpected bit set in this range. Bits 0-15 are reserved to signal backwards-compatible format issues; a reader should simply ignore any unexpected bits set in this range. Currently only one flag bit is defined, and the rest must be zero: <placeholder-1/>
ru: Маска из 32 бит, обозначающая важные аспекты формата файла. Биты нумеруются от 0 (<acronym>LSB</acronym>) до 31 (<acronym>MSB</acronym>). Учтите, что это поле хранится в сетевом порядке байт (наиболее значащий байт первый), как и все целочисленные поля в этом формате. Биты 16-31 зарезервированы для обозначения критичных особенностей формата; обработчик должен прервать чтение, встретив любой неожиданный бит в этом диапазоне. Биты 0-15 зарезервированы для обозначения особенностей, связанных с обратной совместимостью; обработчик может просто игнорировать любые неожиданные биты в этом диапазоне. В настоящее время определён только один битовый флаг, остальные должны быть равны 0: <placeholder-1/>

source: Header extension area length
ru: Длина области расширения заголовка

source: 32-bit integer, length in bytes of remainder of header, not including self. Currently, this is zero, and the first tuple follows immediately. Future changes to the format might allow additional data to be present in the header. A reader should silently skip over any header extension data it does not know what to do with.
ru: Целое 32-битное число, определяющее длину в байтах остального заголовка, не включая само это значение. В настоящее время содержит 0, и сразу за ним следует первая запись. При будущих изменениях формата в заголовок могут быть добавлены дополнительные данные. Обработчик должен просто пропускать все расширенные данные заголовка, о которых ему ничего не известно.

source: The file header consists of 15 bytes of fixed fields, followed by a variable-length header extension area. The fixed fields are: <placeholder-1/>
ru: Заголовок файла содержит 15 байт фиксированных полей, за которыми следует область расширения заголовка переменной длины. Фиксированные поля: <placeholder-1/>

source: The header extension area is envisioned to contain a sequence of self-identifying chunks. The flags field is not intended to tell readers what is in the extension area. Specific design of header extension contents is left for a later release.
ru: Область расширения заголовка предусмотрена для размещения последовательности самоопределяемых блоков. Поле флагов не должно содержать указаний о том, что содержится в области расширения. Точное содержимое области расширения может быть определено в будущих версиях.

source: This design allows for both backwards-compatible header additions (add header extension chunks, or set low-order flag bits) and non-backwards-compatible changes (set high-order flag bits to signal such changes, and add supporting data to the extension area if needed).
ru: При таком подходе возможно как обратно-совместимое дополнение заголовка (добавить блоки расширения заголовка или установить младшие биты флагов), так и не обратно-совместимое (установить старшие биты флагов, сигнализирующие о подобном изменении, и добавить вспомогательные данные в область расширения, если это потребуется).

source: Tuples
ru: Записи

source: Each tuple begins with a 16-bit integer count of the number of fields in the tuple. (Presently, all tuples in a table will have the same count, but that might not always be true.) Then, repeated for each field in the tuple, there is a 32-bit length word followed by that many bytes of field data. (The length word does not include itself, and can be zero.) As a special case, -1 indicates a NULL field value. No value bytes follow in the NULL case.
ru: Каждая запись начинается с 16-битного целого числа, определяющего количество полей в записи. (В настоящее время во всех записях должно быть одинаковое число полей, но так может быть не всегда.) Затем, для каждого поля в записи указывается 32-битная длина поля, за которой следует это количество байт с данными поля. (Значение длины не включает свой размер, и может быть равно нулю.) В качестве особого варианта, -1 обозначает, что в поле содержится NULL. В случае с NULL за длиной не следуют байты данных.

source: There is no alignment padding or any other extra data between fields.
ru: Выравнивание или какие-либо дополнительные данные между полями не вставляются.

source: Presently, all data values in a binary-format file are assumed to be in binary format (format code one). It is anticipated that a future extension might add a header field that allows per-column format codes to be specified.
ru: В настоящее время предполагается, что все значения данных в файле двоичного формата содержатся в двоичном формате (формате под кодом 1). Возможно, в будущем расширении в заголовок будет добавлено поле, позволяющее задавать другие коды форматов для разных столбцов.

source: To determine the appropriate binary format for the actual tuple data you should consult the <productname>PostgreSQL</productname> source, in particular the <function>*send</function> and <function>*recv</function> functions for each column's data type (typically these functions are found in the <filename>src/backend/utils/adt/</filename> directory of the source distribution).
ru: Чтобы определить подходящий двоичный формат для фактических данных, обратитесь к исходному коду <productname>PostgreSQL</productname>, в частности, к функциям <function>*send</function> и <function>*recv</function> для типов данных каждого столбца (обычно эти функции находятся в каталоге <filename>src/backend/utils/adt/</filename> в дереве исходного кода).

source: If OIDs are included in the file, the OID field immediately follows the field-count word. It is a normal field except that it's not included in the field-count. In particular it has a length word &mdash; this will allow handling of 4-byte vs. 8-byte OIDs without too much pain, and will allow OIDs to be shown as null if that ever proves desirable.
ru: Если в файл включается OID, поле OID следует немедленно за числом, определяющим количество полей. Это поле не отличается от других ничем, кроме того, что оно не учитывается в количестве полей. В частности, для него также задаётся длина &mdash; это позволяет обрабатывать и четырёх- и восьмибайтовые OID без особых сложностей, и даже вывести OID, равный NULL, если возникнет потребность в этом.

source: File Trailer
ru: Окончание файла

source: The file trailer consists of a 16-bit integer word containing -1. This is easily distinguished from a tuple's field-count word.
ru: Окончание файла состоит из 16-битного целого, содержащего -1. Это позволяет легко отличить его от счётчика полей в записи.

source: A reader should report an error if a field-count word is neither -1 nor the expected number of columns. This provides an extra check against somehow getting out of sync with the data.
ru: Обработчик, читающий файл, должен выдать ошибку, если число полей в записи не равно -1 или ожидаемому числу столбцов. Это обеспечивает дополнительную проверку синхронизации данных.

source: Examples
ru: Примеры

source: The following example copies a table to the client using the vertical bar (<literal>|</literal>) as the field delimiter: <placeholder-1/>
ru: В следующем примере таблица передаётся клиенту с разделителем полей «вертикальная черта» (<literal>|</literal>): <placeholder-1/>

source: To copy data from a file into the <literal>country</literal> table: <placeholder-1/>
ru: Копирование данных из файла в таблицу <literal>country</literal>: <placeholder-1/>

source: To copy into a file just the countries whose names start with 'A': <placeholder-1/>
ru: Копирование в файл только данных стран, название которых начинается с 'A': <placeholder-1/>

source: To copy into a compressed file, you can pipe the output through an external compression program: <placeholder-1/>
ru: Для копирования данных в сжатый файл можно направить вывод через внешнюю программу сжатия: <placeholder-1/>

source: Here is a sample of data suitable for copying into a table from <literal>STDIN</literal>: <placeholder-1/> Note that the white space on each line is actually a tab character.
ru: Пример данных, подходящих для копирования в таблицу из <literal>STDIN</literal>: <placeholder-1/> Примечание: пробелы в каждой строке на самом деле обозначают символы табуляции.

source: The following is the same data, output in binary format. The data is shown after filtering through the Unix utility <command>od -c</command>. The table has three columns; the first has type <type>char(2)</type>, the second has type <type>text</type>, and the third has type <type>integer</type>. All the rows have a null value in the third column. <placeholder-1/>
ru: Ниже приведены те же данные, но выведенные в двоичном формате. Данные показаны после обработки Unix-утилитой <command>od -c</command>. Таблица содержит три столбца; первый имеет тип <type>char(2)</type>, второй — <type>text</type>, а третий — <type>integer</type>. Последний столбец во всех строках содержит NULL. <placeholder-1/>

source: Compatibility
ru: Совместимость

source: There is no <command>COPY</command> statement in the SQL standard.
ru: Оператор <command>COPY</command> отсутствует в стандарте SQL.

source: The following syntax was used before <productname>PostgreSQL</productname> version 9.0 and is still supported: <synopsis> COPY <replaceable class="parameter">table_name</replaceable> [ ( <replaceable class="parameter">column_name</replaceable> [, ...] ) ] FROM { '<replaceable class="parameter">filename</replaceable>' | STDIN } [ [ WITH ] [ BINARY ] [ OIDS ] [ DELIMITER [ AS ] '<replaceable class="parameter">delimiter</replaceable>' ] [ NULL [ AS ] '<replaceable class="parameter">null string</replaceable>' ] [ CSV [ HEADER ] [ QUOTE [ AS ] '<replaceable class="parameter">quote</replaceable>' ] [ ESCAPE [ AS ] '<replaceable class="parameter">escape</replaceable>' ] [ FORCE NOT NULL <replaceable class="parameter">column_name</replaceable> [, ...] ] ] ] COPY { <replaceable class="parameter">table_name</replaceable> [ ( <replaceable class="parameter">column_name</replaceable> [, ...] ) ] | ( <replaceable class="parameter">query</replaceable> ) } TO { '<replaceable class="parameter">filename</replaceable>' | STDOUT } [ [ WITH ] [ BINARY ] [ OIDS ] [ DELIMITER [ AS ] '<replaceable class="parameter">delimiter</replaceable>' ] [ NULL [ AS ] '<replaceable class="parameter">null string</replaceable>' ] [ CSV [ HEADER ] [ QUOTE [ AS ] '<replaceable class="parameter">quote</replaceable>' ] [ ESCAPE [ AS ] '<replaceable class="parameter">escape</replaceable>' ] [ FORCE QUOTE { <replaceable class="parameter">column_name</replaceable> [, ...] | * } ] ] ] </synopsis> Note that in this syntax, <literal>BINARY</literal> and <literal>CSV</literal> are treated as independent keywords, not as arguments of a <literal>FORMAT</literal> option.
ru: До версии <productname>PostgreSQL</productname> 9.0 использовался и по-прежнему поддерживается следующий синтаксис: <synopsis> COPY <replaceable class="parameter">имя_таблицы</replaceable> [ ( <replaceable class="parameter">имя_столбца</replaceable> [, ...] ) ] FROM { '<replaceable class="parameter">имя_файла</replaceable>' | STDIN } [ [ WITH ] [ BINARY ] [ OIDS ] [ DELIMITER [ AS ] '<replaceable class="parameter">разделитель</replaceable>' ] [ NULL [ AS ] '<replaceable class="parameter">маркер_null</replaceable>' ] [ CSV [ HEADER ] [ QUOTE [ AS ] '<replaceable class="parameter">кавычки</replaceable>' ] [ ESCAPE [ AS ] '<replaceable class="parameter">спецсимвол</replaceable>' ] [ FORCE NOT NULL <replaceable class="parameter">имя_столбца</replaceable> [, ...] ] ] ] COPY { <replaceable class="parameter">имя_таблицы</replaceable> [ ( <replaceable class="parameter">имя_столбца</replaceable> [, ...] ) ] | ( <replaceable class="parameter">запрос</replaceable> ) } TO { '<replaceable class="parameter">имя_файла</replaceable>' | STDOUT } [ [ WITH ] [ BINARY ] [ OIDS ] [ DELIMITER [ AS ] '<replaceable class="parameter">разделитель</replaceable>' ] [ NULL [ AS ] '<replaceable class="parameter">маркер_null</replaceable>' ] [ CSV [ HEADER ] [ QUOTE [ AS ] '<replaceable class="parameter">кавычки</replaceable>' ] [ ESCAPE [ AS ] '<replaceable class="parameter">спецсимвол</replaceable>' ] [ FORCE QUOTE { <replaceable class="parameter">имя_столбца</replaceable> [, ...] | * } ] ] ] </synopsis> Заметьте, что в этом синтаксисе ключевые слова <literal>BINARY</literal> и <literal>CSV</literal> обрабатываются как независимые, а не как аргументы параметра <literal>FORMAT</literal>.

source: The following syntax was used before <productname>PostgreSQL</productname> version 7.3 and is still supported: <synopsis> COPY [ BINARY ] <replaceable class="parameter">table_name</replaceable> [ WITH OIDS ] FROM { '<replaceable class="parameter">filename</replaceable>' | STDIN } [ [USING] DELIMITERS '<replaceable class="parameter">delimiter</replaceable>' ] [ WITH NULL AS '<replaceable class="parameter">null string</replaceable>' ] COPY [ BINARY ] <replaceable class="parameter">table_name</replaceable> [ WITH OIDS ] TO { '<replaceable class="parameter">filename</replaceable>' | STDOUT } [ [USING] DELIMITERS '<replaceable class="parameter">delimiter</replaceable>' ] [ WITH NULL AS '<replaceable class="parameter">null string</replaceable>' ] </synopsis>
ru: До версии <productname>PostgreSQL</productname> 7.3 использовался и по-прежнему поддерживается следующий синтаксис: <synopsis> COPY [ BINARY ] <replaceable class="parameter">table_name</replaceable> [ WITH OIDS ] FROM { '<replaceable class="parameter">имя_файла</replaceable>' | STDIN } [ [USING] DELIMITERS '<replaceable class="parameter">разделитель</replaceable>' ] [ WITH NULL AS '<replaceable class="parameter">маркер_null</replaceable>' ] COPY [ BINARY ] <replaceable class="parameter">имя_таблицы</replaceable> [ WITH OIDS ] TO { '<replaceable class="parameter">имя_файла</replaceable>' | STDOUT } [ [USING] DELIMITERS '<replaceable class="parameter">разделитель</replaceable>' ] [ WITH NULL AS '<replaceable class="parameter">маркер_null</replaceable>' ] </synopsis>
