Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/ref/copy.po
Languages: ru

source: It is recommended that the file name used in <command>COPY</command> always be specified as an absolute path. This is enforced by the server in the case of <command>COPY TO</command>, but for <command>COPY FROM</command> you do have the option of reading from a file specified by a relative path. The path will be interpreted relative to the working directory of the server process (normally the cluster's data directory), not the client's working directory.
ru: Путь файла, указываемый в <command>COPY</command>, рекомендуется всегда задавать как абсолютный, а не относительный. Это обязательное условие для команды <command>COPY TO</command>, но <command>COPY FROM</command> позволяет прочитать файл, заданный и относительным путём. Такой путь будет интерпретироваться относительно рабочего каталога серверного процесса (обычно это каталог данных кластера), а не рабочего каталога клиента.

source: Executing a command with <literal>PROGRAM</literal> might be restricted by the operating system's access control mechanisms, such as SELinux.
ru: Выполнение команды в <literal>PROGRAM</literal> может быть ограничено и другими работающими в ОС механизмами контроля доступа, например SELinux.

source: <command>COPY FROM</command> will invoke any triggers and check constraints on the destination table. However, it will not invoke rules.
ru: <command>COPY FROM</command> вызывает все триггеры и обрабатывает все ограничения-проверки в целевой таблице. Однако правила при загрузке данных не вызываются.

source: <command>COPY</command> input and output is affected by <varname>DateStyle</varname>. To ensure portability to other <productname>PostgreSQL</productname> installations that might use non-default <varname>DateStyle</varname> settings, <varname>DateStyle</varname> should be set to <literal>ISO</literal> before using <command>COPY TO</command>. It is also a good idea to avoid dumping data with <varname>IntervalStyle</varname> set to <literal>sql_standard</literal>, because negative interval values might be misinterpreted by a server that has a different setting for <varname>IntervalStyle</varname>.
ru: При вводе и выводе данных <command>COPY</command> учитывается <varname>DateStyle</varname>. Для обеспечения переносимости на другие инсталляции <productname>PostgreSQL</productname>, в которых могут использоваться нестандартные значения <varname>DateStyle</varname>, значение <varname>DateStyle</varname> следует установить равным <literal>ISO</literal> до вызова <command>COPY TO</command>. Также рекомендуется не выгружать данные с <varname>IntervalStyle</varname> равным <literal>sql_standard</literal>, так как сервер с другим значением <varname>IntervalStyle</varname> может неправильно воспринимать отрицательные интервалы в таких данных.

source: Input data is interpreted according to <literal>ENCODING</literal> option or the current client encoding, and output data is encoded in <literal>ENCODING</literal> or the current client encoding, even if the data does not pass through the client but is read from or written to a file directly by the server.
ru: Входные данные интерпретируются согласно кодировке, заданной параметром <literal>ENCODING</literal>, или текущей кодировке клиента, а выходные кодируются в кодировке <literal>ENCODING</literal> или текущей кодировке клиента, даже если данные не проходят через клиента, а считываются или записываются в файл непосредственно сервером.

source: <command>COPY</command> stops operation at the first error. This should not lead to problems in the event of a <command>COPY TO</command>, but the target table will already have received earlier rows in a <command>COPY FROM</command>. These rows will not be visible or accessible, but they still occupy disk space. This might amount to a considerable amount of wasted disk space if the failure happened well into a large copy operation. You might wish to invoke <command>VACUUM</command> to recover the wasted space.
ru: <command>COPY</command> прекращает операцию при первой ошибке. Это не должно приводить к проблемам в случае с <command>COPY TO</command>, но после <command>COPY FROM</command> в целевой таблице остаются ранее полученные строки. Эти строки не будут видимыми и доступными, но будут занимать место на диске. Если сбой происходит при копировании большого объёма данных, это может приводить к значительным потерям дискового пространства. При желании вернуть потерянный объём, это можно сделать с помощью команды <command>VACUUM</command>.

source: <literal>FORCE_NULL</literal> and <literal>FORCE_NOT_NULL</literal> can be used simultaneously on the same column. This results in converting quoted null strings to null values and unquoted null strings to empty strings.
ru: <literal>FORCE_NULL</literal> и <literal>FORCE_NOT_NULL</literal> можно применить одновременно к одному столбцу. В результате NULL-значения в кавычках будут преобразованы в NULL, а NULL-значения без кавычек — в пустые строки.

source: File Formats
ru: Форматы файлов

source: Text Format
ru: Текстовый формат

source: When the <literal>text</literal> format is used, the data read or written is a text file with one line per table row. Columns in a row are separated by the delimiter character. The column values themselves are strings generated by the output function, or acceptable to the input function, of each attribute's data type. The specified null string is used in place of columns that are null. <command>COPY FROM</command> will raise an error if any line of the input file contains more or fewer columns than are expected. If <literal>OIDS</literal> is specified, the OID is read or written as the first column, preceding the user data columns.
ru: Когда применяется формат <literal>text</literal>, читаемые или записываемые данные представляют собой текстовый файл, строка в котором соответствует строке таблицы. Столбцы в строке разделяются символом-разделителем. Значения самих столбцов — строки, выдаваемые функцией вывода, либо воспринимаемые функцией ввода, соответствующей типу данных столбца. Заданный маркер NULL выводится и считывается вместо столбцов со значением NULL. <command>COPY FROM</command> выдаёт ошибку, если в любой из строк во входном файле оказывается больше или меньше столбцов, чем ожидается. С указанием <literal>OIDS</literal> значение OID считывается или записывается в первом столбце, предшествующем столбцам с основными данными.

source: End of data can be represented by a single line containing just backslash-period (<literal>\.</literal>). An end-of-data marker is not necessary when reading from a file, since the end of file serves perfectly well; it is needed only when copying data to or from client applications using pre-3.0 client protocol.
ru: Конец данных может обозначаться одной строкой, содержащей только обратную косую и точку (<literal>\.</literal>). Маркер конца данных не требуется при чтении из файла, так как его роль вполне выполняет конец файла; он необходим только при передаче данных в/из клиентского приложения по протоколу обмена до версии 3.0.

source: Backslash characters (<literal>\</literal>) can be used in the <command>COPY</command> data to quote data characters that might otherwise be taken as row or column delimiters. In particular, the following characters <emphasis>must</emphasis> be preceded by a backslash if they appear as part of a column value: backslash itself, newline, carriage return, and the current delimiter character.
ru: Символы обратной косой черты (<literal>\</literal>) в данных <command>COPY</command> позволяют экранировать символы данных, которые без них считались бы разделителями строк или столбцов. В частности, предваряться обратной косой <emphasis>должны</emphasis> следующие символы, когда они оказываются в значении столбца: сама обратная косая черта, перевод строки, возврат каретки и текущий разделитель.

source: The specified null string is sent by <command>COPY TO</command> without adding any backslashes; conversely, <command>COPY FROM</command> matches the input against the null string before removing backslashes. Therefore, a null string such as <literal>\N</literal> cannot be confused with the actual data value <literal>\N</literal> (which would be represented as <literal>\\N</literal>).
ru: Маркер NULL передаётся команде <command>COPY TO</command> как есть, без добавления обратной косой; <command>COPY FROM</command>, со своей стороны, ищет во вводимых данных маркеры NULL до удаления обратных косых. Таким образом, маркер NULL, например такой как <literal>\N</literal>, отличается от значения <literal>\N</literal> в данных (оно должно представляться в виде <literal>\\N</literal>).

source: Sequence
ru: Последовательность

source: Represents
ru: Представляет

source: Backspace (ASCII 8)
ru: Забой (ASCII 8)

source: Form feed (ASCII 12)
ru: Подача формы (ASCII 12)

source: Newline (ASCII 10)
ru: Новая строка (ASCII 10)

source: Carriage return (ASCII 13)
ru: Возврат каретки (ASCII 13)

source: Tab (ASCII 9)
ru: Табуляция (ASCII 9)

source: Vertical tab (ASCII 11)
ru: Вертикальная табуляция (ASCII 11)

source: digits
ru: цифры

source: Backslash followed by one to three octal digits specifies the character with that numeric code
ru: Обратная косая с последующими 1-3 восьмеричными цифрами представляет символ с заданным числовым кодом

source: Backslash <literal>x</literal> followed by one or two hex digits specifies the character with that numeric code
ru: Обратная косая с последующим <literal>x</literal> и 1-2 шестнадцатеричными цифрами представляет символ с заданным числовым кодом

source: The following special backslash sequences are recognized by <command>COPY FROM</command>: <placeholder-1/> Presently, <command>COPY TO</command> will never emit an octal or hex-digits backslash sequence, but it does use the other sequences listed above for those control characters.
ru: Команда <command>COPY FROM</command> распознаёт следующие спецпоследовательности: <placeholder-1/> В настоящее время <command>COPY TO</command> никогда не выводит спецпоследовательности с восьмеричными или шестнадцатеричными кодами, однако выводит другие вышеперечисленные спецпоследовательности вместо управляющих символов.

source: Any other backslashed character that is not mentioned in the above table will be taken to represent itself. However, beware of adding backslashes unnecessarily, since that might accidentally produce a string matching the end-of-data marker (<literal>\.</literal>) or the null string (<literal>\N</literal> by default). These strings will be recognized before any other backslash processing is done.
ru: Любой другой символ после обратной косой, отсутствующий в приведённой выше таблице, будет представлять себя. Однако опасайтесь излишнего добавления обратных косых, так как это может привести к случайному образованию строки, обозначающей маркер конца данных (<literal>\.</literal>) или маркер NULL (<literal>\N</literal> по умолчанию). Эти строки будут восприняты прежде, чем обработаются спецпоследовательности с обратной косой.

source: It is strongly recommended that applications generating <command>COPY</command> data convert data newlines and carriage returns to the <literal>\n</literal> and <literal>\r</literal> sequences respectively. At present it is possible to represent a data carriage return by a backslash and carriage return, and to represent a data newline by a backslash and newline. However, these representations might not be accepted in future releases. They are also highly vulnerable to corruption if the <command>COPY</command> file is transferred across different machines (for example, from Unix to Windows or vice versa).
ru: В приложениях, генерирующих данные для <command>COPY</command>, настоятельно рекомендуется преобразовать символы новой строки и возврата каретки в последовательности <literal>\n</literal> и <literal>\r</literal>, соответственно. В настоящее время можно представить возврат каретки в данных как обратная косая и возврат каретки, а перевод строки как обратная косая и перевод строки, однако это может не поддерживаться в будущих версиях. Такие символы также подвержены искажениям, если файл с выводом <command>COPY</command> переносится между разными системами (например, с Unix в Windows и наоборот).

source: <command>COPY TO</command> will terminate each row with a Unix-style newline (<quote><literal>\n</literal></quote>). Servers running on Microsoft Windows instead output carriage return/newline (<quote><literal>\r\n</literal></quote>), but only for <command>COPY</command> to a server file; for consistency across platforms, <command>COPY TO STDOUT</command> always sends <quote><literal>\n</literal></quote> regardless of server platform. <command>COPY FROM</command> can handle lines ending with newlines, carriage returns, or carriage return/newlines. To reduce the risk of error due to un-backslashed newlines or carriage returns that were meant as data, <command>COPY FROM</command> will complain if the line endings in the input are not all alike.
ru: <command>COPY TO</command> завершает каждую строку символом новой строки в стиле Unix (<quote><literal>\n</literal></quote>). Серверы, работающие в Microsoft Windows, вместо этого выводят символы возврат каретки/новая строка (<quote><literal>\r\n</literal></quote>), но только при выводе <command>COPY</command> в файл на сервере; для согласованности на разных платформах, <command>COPY TO STDOUT</command> всегда передаёт <quote><literal>\n</literal></quote>, вне зависимости от платформы сервера. <command>COPY FROM</command> может воспринимать строки, завершающиеся символами новая строка, перевод каретки, либо возврат каретки+новая строка. Чтобы уменьшить риск ошибки из-за неэкранированных символов новой строки и возврата каретки, которые должны были быть данными, <command>COPY FROM</command> сигнализирует о проблеме, если концы строк во входных данных различаются.

source: CSV Format
ru: Формат CSV

source: This format option is used for importing and exporting the Comma Separated Value (<literal>CSV</literal>) file format used by many other programs, such as spreadsheets. Instead of the escaping rules used by <productname>PostgreSQL</productname>'s standard text format, it produces and recognizes the common CSV escaping mechanism.
ru: Этот формат применяется для импорта и экспорта данных в виде списка значений, разделённых запятыми (<literal>CSV</literal>), с которым могут работать многие другие программы, например электронные таблицы. Вместо правил экранирования значений, введённых в <productname>PostgreSQL</productname> для текстового формата, этот формат использует стандартный механизм экранирования CSV.

source: The values in each record are separated by the <literal>DELIMITER</literal> character. If the value contains the delimiter character, the <literal>QUOTE</literal> character, the <literal>NULL</literal> string, a carriage return, or line feed character, then the whole value is prefixed and suffixed by the <literal>QUOTE</literal> character, and any occurrence within the value of a <literal>QUOTE</literal> character or the <literal>ESCAPE</literal> character is preceded by the escape character. You can also use <literal>FORCE_QUOTE</literal> to force quotes when outputting non-<literal>NULL</literal> values in specific columns.
ru: Значения в каждой записи разделяются символами <literal>DELIMITER</literal>. Если значение содержит символ разделителя, символ <literal>QUOTE</literal>, маркер <literal>NULL</literal>, символ возврата каретки или перевода строки, то всё значение дополнятся спереди и сзади символами <literal>QUOTE</literal>, а любое вхождение символа <literal>QUOTE</literal> или спецсимвола (<literal>ESCAPE</literal>) в данных предваряется спецсимволом. С указанием <literal>FORCE_QUOTE</literal> в кавычки будут принудительно заключаться любые значения не <literal>NULL</literal> в указанных столбцах.

source: The <literal>CSV</literal> format has no standard way to distinguish a <literal>NULL</literal> value from an empty string. <productname>PostgreSQL</productname>'s <command>COPY</command> handles this by quoting. A <literal>NULL</literal> is output as the <literal>NULL</literal> parameter string and is not quoted, while a non-<literal>NULL</literal> value matching the <literal>NULL</literal> parameter string is quoted. For example, with the default settings, a <literal>NULL</literal> is written as an unquoted empty string, while an empty string data value is written with double quotes (<literal>""</literal>). Reading values follows similar rules. You can use <literal>FORCE_NOT_NULL</literal> to prevent <literal>NULL</literal> input comparisons for specific columns. You can also use <literal>FORCE_NULL</literal> to convert quoted null string data values to <literal>NULL</literal>.
ru: В формате <literal>CSV</literal> отсутствует стандартный способ отличить значение <literal>NULL</literal> от пустой строки. В <productname>PostgreSQL</productname> команда <command>COPY</command> решает это с помощью кавычек. Значение <literal>NULL</literal> выводится в виде строки, задаваемой параметром <literal>NULL</literal>, и не заключается в кавычки, тогда как значение не <literal>NULL</literal>, со строкой, задаваемой параметром <literal>NULL</literal>, заключается. Например, с параметрами по умолчанию <literal>NULL</literal> записывается в виде пустой строки без кавычек, тогда как пустая строка записывается в двойных кавычках (<literal>""</literal>). При чтении значений действуют похожие правила. Указание <literal>FORCE_NOT_NULL</literal> позволяет избежать сравнений на <literal>NULL</literal> во входных данных в заданных столбцах, а <literal>FORCE_NULL</literal> — преобразовывать в <literal>NULL</literal> маркеры NULL, даже заключённые в кавычки.

source: Because backslash is not a special character in the <literal>CSV</literal> format, <literal>\.</literal>, the end-of-data marker, could also appear as a data value. To avoid any misinterpretation, a <literal>\.</literal> data value appearing as a lone entry on a line is automatically quoted on output, and on input, if quoted, is not interpreted as the end-of-data marker. If you are loading a file created by another application that has a single unquoted column and might have a value of <literal>\.</literal>, you might need to quote that value in the input file.
ru: Так как обратная косая черта не является спецсимволом в формате <literal>CSV</literal>, маркер конца данных <literal>\.</literal> может быть и значением данных. Во избежание ошибок интерпретации данные <literal>\.</literal>, выводимые в виде единственного элемента строки, автоматически заключаются в кавычки при выводе, а при вводе этот маркер, заключённый в кавычки, не воспринимается как маркер конца данных. При загрузке файла, созданного другой программой, в котором в единственном столбце без кавычек оказалось значение <literal>\.</literal>, потребуется дополнительно заключить это значение в кавычки.

source: In <literal>CSV</literal> format, all characters are significant. A quoted value surrounded by white space, or any characters other than <literal>DELIMITER</literal>, will include those characters. This can cause errors if you import data from a system that pads <literal>CSV</literal> lines with white space out to some fixed width. If such a situation arises you might need to preprocess the <literal>CSV</literal> file to remove the trailing white space, before importing the data into <productname>PostgreSQL</productname>.
ru: В формате <literal>CSV</literal> все символы являются значимыми. Заключённое в кавычки значение, дополненное пробелами или любыми другими символами, кроме <literal>DELIMITER</literal>, будет включать и эти символы. Это может приводить к ошибкам при импорте данных из системы, дополняющей строки <literal>CSV</literal> пробельными символами до некоторой фиксированной ширины. В случае возникновения такой проблемы необходимо обработать файл <literal>CSV</literal> и удалить из него замыкающие пробельные символы, прежде чем загружать данные из него в <productname>PostgreSQL</productname>.

source: CSV format will both recognize and produce CSV files with quoted values containing embedded carriage returns and line feeds. Thus the files are not strictly one line per table row like text-format files.
ru: Обработчик формата CSV воспринимает и генерирует файлы CSV со значениями в кавычках, которые могут содержать символы возврата каретки и перевода строки. Таким образом, число строк в этих файлах не строго равно числу строк в таблице, как в файлах текстового формата.

source: Many programs produce strange and occasionally perverse CSV files, so the file format is more a convention than a standard. Thus you might encounter some files that cannot be imported using this mechanism, and <command>COPY</command> might produce files that other programs cannot process.
ru: Многие программы генерируют странные и иногда неприемлемые файлы CSV, так что этот формат используется скорее по соглашению, чем по стандарту. Поэтому вам могут встретиться файлы, которые невозможно импортировать, используя этот механизм, а <command>COPY</command> может сформировать такие файлы, что их не смогут обработать другие программы.

source: Binary Format
ru: Двоичный формат

source: The <literal>binary</literal> format option causes all data to be stored/read as binary format rather than as text. It is somewhat faster than the text and <literal>CSV</literal> formats, but a binary-format file is less portable across machine architectures and <productname>PostgreSQL</productname> versions. Also, the binary format is very data type specific; for example it will not work to output binary data from a <type>smallint</type> column and read it into an <type>integer</type> column, even though that would work fine in text format.
ru: При выборе формата <literal>binary</literal> все данные сохраняются/считываются в двоичном, а не текстовом виде. Иногда этот формат обрабатывается быстрее, чем текстовый и <literal>CSV</literal>, но он может оказаться непереносимым между разными машинными архитектурами и версиями <productname>PostgreSQL</productname>. Кроме того, двоичный формат сильно зависит от типов данных; например, он не позволяет вывести данные из столбца <type>smallint</type>, а затем прочитать их в столбец <type>integer</type>, хотя с текстовым форматом это вполне возможно.

source: The <literal>binary</literal> file format consists of a file header, zero or more tuples containing the row data, and a file trailer. Headers and data are in network byte order.
ru: Формат <literal>binary</literal> включает заголовок файла, ноль или более записей, содержащих данные строк, и окончание файла. Для заголовков и данных принят сетевой порядок байт.

source: <productname>PostgreSQL</productname> releases before 7.4 used a different binary file format.
ru: В <productname>PostgreSQL</productname> до версии 7.4 использовался другой двоичный формат.

source: File Header
ru: Заголовок файла

source: Signature
ru: Сигнатура

source: 11-byte sequence <literal>PGCOPY\n\377\r\n\0</literal> &mdash; note that the zero byte is a required part of the signature. (The signature is designed to allow easy identification of files that have been munged by a non-8-bit-clean transfer. This signature will be changed by end-of-line-translation filters, dropped zero bytes, dropped high bits, or parity changes.)
ru: Последовательность из 11 байт <literal>PGCOPY\n\377\r\n\0</literal> &mdash; заметьте, что нулевой байт является обязательной частью сигнатуры. (Эта сигнатура позволяет легко выявить файлы, испорченные при передаче, не сохраняющей все 8 бит данных. Она изменится при прохождении через фильтры, меняющие концы строк, отбрасывающие нулевые байты или старшие биты, либо добавляющие чётность.)

source: Flags field
ru: Поле флагов

source: Bit 16
ru: Бит 16
