Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/ref/copy.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: copy data between a file and a table
ru: копировать данные между файлом и таблицей

source: table_name
ru: имя_таблицы

source: column_name
ru: имя_столбца

source: filename
ru: имя_файла

source: command
ru: команда

source: option
ru: параметр

source: query
ru: запрос

source: where <placeholder-1/> can be one of:
ru: Здесь допускается <placeholder-1/>:

source: format_name
ru: имя_формата

source: delimiter_character
ru: символ_разделитель

source: null_string
ru: маркер_NULL

source: quote_character
ru: символ_кавычек

source: escape_character
ru: символ_экранирования

source: encoding_name
ru: имя_кодировки

source: Description
ru: Описание

source: <command>COPY</command> moves data between <productname>PostgreSQL</productname> tables and standard file-system files. <command>COPY TO</command> copies the contents of a table <emphasis>to</emphasis> a file, while <command>COPY FROM</command> copies data <emphasis>from</emphasis> a file to a table (appending the data to whatever is in the table already). <command>COPY TO</command> can also copy the results of a <command>SELECT</command> query.
ru: <command>COPY</command> перемещает данные между таблицами <productname>PostgreSQL</productname> и традиционными файлами. <command>COPY TO</command> копирует содержимое таблицы <emphasis>в</emphasis> файл, а <command>COPY FROM</command> — <emphasis>из</emphasis> файла в таблицу (добавляет данные к тем, что уже содержались в таблице). <command>COPY TO</command> может также скопировать результаты запроса <command>SELECT</command>.

source: If a list of columns is specified, <command>COPY</command> will only copy the data in the specified columns to or from the file. If there are any columns in the table that are not in the column list, <command>COPY FROM</command> will insert the default values for those columns.
ru: Если указывается список столбцов, <command>COPY</command> скопирует только данные указанных столбцов. Если в таблице есть столбцы, отсутствующие в этом списке, <command>COPY FROM</command> заполнит эти столбцы значениями по умолчанию.

source: <command>COPY</command> with a file name instructs the <productname>PostgreSQL</productname> server to directly read from or write to a file. The file must be accessible by the <productname>PostgreSQL</productname> user (the user ID the server runs as) and the name must be specified from the viewpoint of the server. When <literal>PROGRAM</literal> is specified, the server executes the given command and reads from the standard output of the program, or writes to the standard input of the program. The command must be specified from the viewpoint of the server, and be executable by the <productname>PostgreSQL</productname> user. When <literal>STDIN</literal> or <literal>STDOUT</literal> is specified, data is transmitted via the connection between the client and the server.
ru: <command>COPY</command> с именем файла указывает серверу <productname>PostgreSQL</productname> читать или записывать непосредственно этот файл. Заданный файл должен быть доступен пользователю <productname>PostgreSQL</productname> (тому пользователю, от имени которого работает сервер), и путь к файлу должен задаваться с точки зрения сервера. Когда указывается параметр <literal>PROGRAM</literal>, сервер выполняет заданную команду и читает данные из стандартного вывода программы, либо записывает их в стандартный ввод. Команда должна определяться с точки зрения сервера и быть доступной для исполнения пользователю <productname>PostgreSQL</productname>. Когда указывается <literal>STDIN</literal> или <literal>STDOUT</literal>, данные передаются через соединение клиента с сервером.

source: Parameters
ru: Параметры

source: The name (optionally schema-qualified) of an existing table.
ru: Имя (возможно, дополненное схемой) существующей таблицы.

source: An optional list of columns to be copied. If no column list is specified, all columns of the table will be copied.
ru: Необязательный список столбцов, данные которых будут копироваться. Если этот список отсутствует, копируются все столбцы таблицы.

source: A <xref linkend="sql-select"/>, <xref linkend="sql-values"/>, <xref linkend="sql-insert"/>, <xref linkend="sql-update"/> or <xref linkend="sql-delete"/> command whose results are to be copied. Note that parentheses are required around the query.
ru: Команда <xref linkend="sql-select"/>, <xref linkend="sql-values"/>, <xref linkend="sql-insert"/>, <xref linkend="sql-update"/> или <xref linkend="sql-delete"/>, результаты которой будут скопированы. Заметьте, что запрос должен заключаться в скобки.

source: For <command>INSERT</command>, <command>UPDATE</command> and <command>DELETE</command> queries a RETURNING clause must be provided, and the target relation must not have a conditional rule, nor an <literal>ALSO</literal> rule, nor an <literal>INSTEAD</literal> rule that expands to multiple statements.
ru: Для запросов <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command> должно задаваться предложение RETURNING и в целевом отношении не должно быть условного правила, правила <literal>ALSO</literal> или правила <literal>INSTEAD</literal>, разворачивающегося в несколько операторов.

source: The path name of the input or output file. An input file name can be an absolute or relative path, but an output file name must be an absolute path. Windows users might need to use an <literal>E''</literal> string and double any backslashes used in the path name.
ru: Путь входного или выходного файла. Путь входного файла может быть абсолютным или относительным, но путь выходного должен быть только абсолютным. Пользователям Windows следует использовать формат <literal>E''</literal> и продублировать каждую обратную черту в пути файла.

source: A command to execute. In <command>COPY FROM</command>, the input is read from standard output of the command, and in <command>COPY TO</command>, the output is written to the standard input of the command.
ru: Выполняемая команда. <command>COPY FROM</command> читает стандартный вывод команды, а <command>COPY TO</command> записывает в её стандартный ввод.

source: Note that the command is invoked by the shell, so if you need to pass any arguments to shell command that come from an untrusted source, you must be careful to strip or escape any special characters that might have a special meaning for the shell. For security reasons, it is best to use a fixed command string, or at least avoid passing any user input in it.
ru: Заметьте, что команда запускается через командную оболочку, так что если требуется передать этой команде какие-либо аргументы, поступающие из недоверенного источника, необходимо аккуратно избавиться от всех спецсимволов, имеющих особое значение в оболочке, либо экранировать их. По соображениям безопасности лучше ограничиться фиксированной строкой команды или как минимум не позволять пользователям вводить в неё произвольное содержимое.

source: Specifies that input comes from the client application.
ru: Указывает, что данные будут поступать из клиентского приложения.

source: Specifies that output goes to the client application.
ru: Указывает, что данные будут выдаваться клиентскому приложению.

source: Specifies whether the selected option should be turned on or off. You can write <literal>TRUE</literal>, <literal>ON</literal>, or <literal>1</literal> to enable the option, and <literal>FALSE</literal>, <literal>OFF</literal>, or <literal>0</literal> to disable it. The <replaceable class="parameter">boolean</replaceable> value can also be omitted, in which case <literal>TRUE</literal> is assumed.
ru: Включает или отключает заданный параметр. Для включения параметра можно написать <literal>TRUE</literal>, <literal>ON</literal> или <literal>1</literal>, а для отключения — <literal>FALSE</literal>, <literal>OFF</literal> или <literal>0</literal>. Значение <replaceable class="parameter">boolean</replaceable> можно опустить, в этом случае подразумевается <literal>TRUE</literal>.

source: Selects the data format to be read or written: <literal>text</literal>, <literal>csv</literal> (Comma Separated Values), or <literal>binary</literal>. The default is <literal>text</literal>.
ru: Выбирает формат чтения или записи данных: <literal>text</literal> (текстовый), <literal>csv</literal> (значения, разделённые запятыми, Comma Separated Values) или <literal>binary</literal> (двоичный). По умолчанию выбирается формат <literal>text</literal>.

source: Specifies copying the OID for each row. (An error is raised if <literal>OIDS</literal> is specified for a table that does not have OIDs, or in the case of copying a <replaceable class="parameter">query</replaceable>.)
ru: Копирует OID каждой строки. (Если присутствует указание <literal>OIDS</literal>, но таблица не содержит столбец oid, либо копируется <replaceable class="parameter">запрос</replaceable>, возникнет ошибка.)

source: Requests copying the data with rows already frozen, just as they would be after running the <command>VACUUM FREEZE</command> command. This is intended as a performance option for initial data loading. Rows will be frozen only if the table being loaded has been created or truncated in the current subtransaction, there are no cursors open and there are no older snapshots held by this transaction.
ru: Запросы копируют данные с уже замороженными строками, как после выполнения команды <command>VACUUM FREEZE</command>. Это позволяет увеличить производительность при начальном добавлении данных. Строки будут замораживаться, только если загружаемая таблица была создана или опустошена в текущей подтранзакции, с ней не связаны открытые курсоры и в данной транзакции нет других снимков.

source: Note that all other sessions will immediately be able to see the data once it has been successfully loaded. This violates the normal rules of MVCC visibility and users specifying should be aware of the potential problems this might cause.
ru: Заметьте, что все другие сеансы будут немедленно видеть данные, как только они будут успешно загружены. Это нарушает принятые правила видимости MVCC, так что пользователи, включающие этот режим, должны понимать, какие проблемы это может вызвать.

source: Specifies the character that separates columns within each row (line) of the file. The default is a tab character in text format, a comma in <literal>CSV</literal> format. This must be a single one-byte character. This option is not allowed when using <literal>binary</literal> format.
ru: Задаёт символ, разделяющий столбцы в строках файла. По умолчанию это символ табуляции в текстовом формате и запятая в формате <literal>CSV</literal>. Задаваемый символ должен быть однобайтовым. Для формата <literal>binary</literal> этот параметр не допускается.

source: Specifies the string that represents a null value. The default is <literal>\N</literal> (backslash-N) in text format, and an unquoted empty string in <literal>CSV</literal> format. You might prefer an empty string even in text format for cases where you don't want to distinguish nulls from empty strings. This option is not allowed when using <literal>binary</literal> format.
ru: Определяет строку, задающую значение NULL. По умолчанию в текстовом формате это <literal>\N</literal> (обратная косая черта и N), а в формате <literal>CSV</literal> — пустая строка без кавычек. Пустую строку можно использовать и в текстовом формате, если не требуется различать пустые строки и NULL. Для формата <literal>binary</literal> этот параметр не допускается.

source: When using <command>COPY FROM</command>, any data item that matches this string will be stored as a null value, so you should make sure that you use the same string as you used with <command>COPY TO</command>.
ru: При выполнении <command>COPY FROM</command> любые значения, совпадающие с этой строкой, сохраняются как значение NULL, так что при переносе данных важно убедиться в том, что это та же строка, что применялась в <command>COPY TO</command>.

source: Specifies that the file contains a header line with the names of each column in the file. On output, the first line contains the column names from the table, and on input, the first line is ignored. This option is allowed only when using <literal>CSV</literal> format.
ru: Указывает, что файл содержит строку заголовка с именами столбцов. При выводе первая строка файла будет содержать имена столбцов таблицы, а при вводе первая строка просто игнорируется. Этот параметр допускается только для формата <literal>CSV</literal>.

source: Specifies the quoting character to be used when a data value is quoted. The default is double-quote. This must be a single one-byte character. This option is allowed only when using <literal>CSV</literal> format.
ru: Указывает символ кавычек, используемый для заключения данных в кавычки. По умолчанию это символ двойных кавычек. Задаваемый символ должен быть однобайтовым. Этот параметр поддерживается только для формата <literal>CSV</literal>.

source: Specifies the character that should appear before a data character that matches the <literal>QUOTE</literal> value. The default is the same as the <literal>QUOTE</literal> value (so that the quoting character is doubled if it appears in the data). This must be a single one-byte character. This option is allowed only when using <literal>CSV</literal> format.
ru: Задаёт символ, который будет выводиться перед символом данных, совпавшим со значением <literal>QUOTE</literal>. По умолчанию это тот же символ, что и <literal>QUOTE</literal> (то есть, при появлении в данных кавычек, они дублируются). Задаваемый символ должен быть однобайтовым. Этот параметр допускается только для режима <literal>CSV</literal>.

source: Forces quoting to be used for all non-<literal>NULL</literal> values in each specified column. <literal>NULL</literal> output is never quoted. If <literal>*</literal> is specified, non-<literal>NULL</literal> values will be quoted in all columns. This option is allowed only in <command>COPY TO</command>, and only when using <literal>CSV</literal> format.
ru: Принудительно заключает в кавычки все значения не <literal>NULL</literal> в указанных столбцах. Выводимое значение <literal>NULL</literal> никогда не заключается в кавычки. Если указано <literal>*</literal>, в кавычки будут заключаться значения не <literal>NULL</literal> во всех столбцах. Этот параметр принимает только команда <command>COPY TO</command> и только для формата <literal>CSV</literal>.

source: Do not match the specified columns' values against the null string. In the default case where the null string is empty, this means that empty values will be read as zero-length strings rather than nulls, even when they are not quoted. This option is allowed only in <command>COPY FROM</command>, and only when using <literal>CSV</literal> format.
ru: Не сопоставлять значения в указанных столбцах с маркером NULL. По умолчанию, когда маркер пуст, это означает, что пустые значения будут считаны как строки нулевой длины, а не NULL, даже когда они не заключены в кавычки. Этот параметр допускается только в команде <command>COPY FROM</command> и только для формата <literal>CSV</literal>.

source: Match the specified columns' values against the null string, even if it has been quoted, and if a match is found set the value to <literal>NULL</literal>. In the default case where the null string is empty, this converts a quoted empty string into NULL. This option is allowed only in <command>COPY FROM</command>, and only when using <literal>CSV</literal> format.
ru: Сопоставлять значения в указанных столбцах с маркером NULL, даже если они заключены в кавычки, и в случае совпадения устанавливать значение <literal>NULL</literal>. По умолчанию, когда этот маркер пуст, пустая строка в кавычках будет преобразовываться в NULL. Этот параметр допускается только в команде <command>COPY FROM</command> и только для формата <literal>CSV</literal>.

source: Specifies that the file is encoded in the <replaceable class="parameter">encoding_name</replaceable>. If this option is omitted, the current client encoding is used. See the Notes below for more details.
ru: Указывает, что файл имеет кодировку <replaceable class="parameter">имя_кодировки</replaceable>. Если этот параметр опущен, выбирается текущая кодировка клиента. Подробнее об этом говорится ниже, в примечаниях.

source: Outputs
ru: Выводимая информация

source: On successful completion, a <command>COPY</command> command returns a command tag of the form <screen> COPY <replaceable class="parameter">count</replaceable> </screen> The <replaceable class="parameter">count</replaceable> is the number of rows copied.
ru: В случае успешного завершения, <command>COPY</command> возвращает метку команды в виде <screen> COPY <replaceable class="parameter">число</replaceable> </screen> Здесь <replaceable class="parameter">число</replaceable> — количество скопированных записей.

source: <application>psql</application> will print this command tag only if the command was not <literal>COPY ... TO STDOUT</literal>, or the equivalent <application>psql</application> meta-command <literal>\copy ... to stdout</literal>. This is to prevent confusing the command tag with the data that was just printed.
ru: <application>psql</application> выводит эту метку, только если выполнялась не команда <literal>COPY ... TO STDOUT</literal> или её аналог в <application>psql</application>, метакоманда <literal>\copy ... to stdout</literal>. Это сделано для того, чтобы метка команды не смешалась с данными, выведенными перед ней.

source: Notes
ru: Замечания

source: <command>COPY</command> can only be used with plain tables, not with views. However, you can write <literal>COPY (SELECT * FROM <replaceable class="parameter">viewname</replaceable>) TO ...</literal>.
ru: <command>COPY</command> может использоваться только с обычными таблицами, но не с представлениями. Однако, при необходимости можно скопировать представление так: <literal>COPY (SELECT * FROM <replaceable class="parameter">имя_представления</replaceable>) TO ...</literal>.

source: <command>COPY</command> only deals with the specific table named; it does not copy data to or from child tables. Thus for example <literal>COPY <replaceable class="parameter">table</replaceable> TO</literal> shows the same data as <literal>SELECT * FROM ONLY <replaceable class="parameter">table</replaceable></literal>. But <literal>COPY (SELECT * FROM <replaceable class="parameter">table</replaceable>) TO ...</literal> can be used to dump all of the data in an inheritance hierarchy.
ru: <command>COPY</command> обрабатывает только явно заданную таблицу, дочерние таблицы при копировании данных не затрагиваются. Поэтому, например <literal>COPY <replaceable class="parameter">таблица</replaceable> TO</literal> выводит те же данные, что и запрос <literal>SELECT * FROM ONLY <replaceable class="parameter">table</replaceable></literal>. Для выгрузки всех данных в иерархии наследования можно применить <literal>COPY (SELECT * FROM <replaceable class="parameter">table</replaceable>) TO ...</literal>.

source: You must have select privilege on the table whose values are read by <command>COPY TO</command>, and insert privilege on the table into which values are inserted by <command>COPY FROM</command>. It is sufficient to have column privileges on the column(s) listed in the command.
ru: В таблице, данные которой читает команда <command>COPY TO</command>, требуется иметь право на выборку данных, а в таблице, куда вставляет значения <command>COPY FROM</command>, требуется право на добавление. При этом, если в команде перечисляются избранные столбцы, достаточно иметь права только для них.

source: If row-level security is enabled for the table, the relevant <command>SELECT</command> policies will apply to <literal>COPY <replaceable class="parameter">table</replaceable> TO</literal> statements. Currently, <command>COPY FROM</command> is not supported for tables with row-level security. Use equivalent <command>INSERT</command> statements instead.
ru: Если для таблицы включена защита на уровне строк, соответствующие политики <command>SELECT</command> будут применяться и к операторам <literal>COPY <replaceable class="parameter">таблица</replaceable> TO</literal>. Операторы <command>COPY FROM</command> для таблиц с защитой строк в настоящее время не поддерживаются. Вместо них следует использовать равнозначные операторы <command>INSERT</command>.

source: Files named in a <command>COPY</command> command are read or written directly by the server, not by the client application. Therefore, they must reside on or be accessible to the database server machine, not the client. They must be accessible to and readable or writable by the <productname>PostgreSQL</productname> user (the user ID the server runs as), not the client. Similarly, the command specified with <literal>PROGRAM</literal> is executed directly by the server, not by the client application, must be executable by the <productname>PostgreSQL</productname> user. <command>COPY</command> naming a file or command is only allowed to database superusers, since it allows reading or writing any file that the server has privileges to access.
ru: Файлы, указанные в команде <command>COPY</command>, читаются или записываются непосредственно сервером, не клиентским приложением. Поэтому они должны располагаться на сервере или быть доступными серверу, а не клиенту. Они должны быть доступны на чтение или запись пользователю <productname>PostgreSQL</productname> (пользователю, от имени которого работает сервер), не клиенту. Аналогично, команда, указанная параметром <literal>PROGRAM</literal>, выполняется непосредственно сервером, а не клиентским приложением, и должна быть доступна на выполнение пользователю <productname>PostgreSQL</productname>. Выполнять команду <command>COPY</command> с файлом (или командой) разрешено только суперпользователям базы данных, так как она позволяет прочитать и записать любой файл, к которому имеет доступ сервер.

source: Do not confuse <command>COPY</command> with the <application>psql</application> instruction <command><link linkend="app-psql-meta-commands-copy">\copy</link></command>. <command>\copy</command> invokes <command>COPY FROM STDIN</command> or <command>COPY TO STDOUT</command>, and then fetches/stores the data in a file accessible to the <application>psql</application> client. Thus, file accessibility and access rights depend on the client rather than the server when <command>\copy</command> is used.
ru: Не путайте команду <command>COPY</command> с реализованной в <application>psql</application> метакомандой <command><link linkend="app-psql-meta-commands-copy">\copy</link></command>. Метакоманда <command>\copy</command> вызывает <command>COPY FROM STDIN</command> или <command>COPY TO STDOUT</command>, а затем работает с данными в файле, доступном клиенту <application>psql</application>. Таким образом, когда применяется команда <command>\copy</command>, доступность файла и права доступа зависят от клиента, а не от сервера.
