Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/ref/create_view.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define a new view
ru: создать представление

source: name
ru: имя

source: column_name
ru: имя_столбца

source: view_option_name
ru: имя_параметра_представления

source: view_option_value
ru: значение_параметра_представления

source: query
ru: запрос

source: Description
ru: Описание

source: <command>CREATE VIEW</command> defines a view of a query. The view is not physically materialized. Instead, the query is run every time the view is referenced in a query.
ru: <command>CREATE VIEW</command> создаёт представление запроса. Создаваемое представление лишено физической материализации, поэтому указанный запрос будет выполняться при каждом обращении к представлению.

source: <command>CREATE OR REPLACE VIEW</command> is similar, but if a view of the same name already exists, it is replaced. The new query must generate the same columns that were generated by the existing view query (that is, the same column names in the same order and with the same data types), but it may add additional columns to the end of the list. The calculations giving rise to the output columns may be completely different.
ru: Команда <command>CREATE OR REPLACE VIEW</command> действует подобным образом, но если представление с этим именем уже существует, оно заменяется. Новый запрос должен выдавать те же столбцы, что выдавал запрос, ранее определённый для этого представления (то есть, столбцы с такими же именами должны иметь те же типы данных и следовать в том же порядке), но может добавить несколько новых столбцов в конце списка. Вычисления, в результате которых формируются столбцы представления, могут быть совершенно другими.

source: If a schema name is given (for example, <literal>CREATE VIEW myschema.myview ...</literal>) then the view is created in the specified schema. Otherwise it is created in the current schema. Temporary views exist in a special schema, so a schema name cannot be given when creating a temporary view. The name of the view must be distinct from the name of any other view, table, sequence, index or foreign table in the same schema.
ru: Если задано имя схемы (например, <literal>CREATE VIEW myschema.myview ...</literal>), представление создаётся в указанной схеме, в противном случае — в текущей. Временные представления существуют в специальной схеме, так что при создании таких представлений имя схемы задать нельзя. Имя представления должно отличаться от имён других представлений, таблиц, последовательностей, индексов или сторонних таблиц в этой схеме.

source: Parameters
ru: Параметры

source: <literal>TEMPORARY</literal> or <literal>TEMP</literal>
ru: <literal>TEMPORARY</literal> или <literal>TEMP</literal>

source: If specified, the view is created as a temporary view. Temporary views are automatically dropped at the end of the current session. Existing permanent relations with the same name are not visible to the current session while the temporary view exists, unless they are referenced with schema-qualified names.
ru: С таким указанием представление создаётся как временное. Временные представления автоматически удаляются в конце сеанса. Существующее постоянное представление с тем же именем не будет видно в текущем сеансе, пока существует временное, однако к нему можно обратиться, дополнив имя указанием схемы.

source: If any of the tables referenced by the view are temporary, the view is created as a temporary view (whether <literal>TEMPORARY</literal> is specified or not).
ru: Если в определении представления задействованы временные таблицы, представление так же создаётся как временное (вне зависимости от присутствия явного указания <literal>TEMPORARY</literal>).

source: Creates a recursive view. The syntax <synopsis> CREATE RECURSIVE VIEW [ <replaceable>schema</replaceable> . ] <replaceable>view_name</replaceable> (<replaceable>column_names</replaceable>) AS SELECT <replaceable>...</replaceable>; </synopsis> is equivalent to <synopsis> CREATE VIEW [ <replaceable>schema</replaceable> . ] <replaceable>view_name</replaceable> AS WITH RECURSIVE <replaceable>view_name</replaceable> (<replaceable>column_names</replaceable>) AS (SELECT <replaceable>...</replaceable>) SELECT <replaceable>column_names</replaceable> FROM <replaceable>view_name</replaceable>; </synopsis> A view column name list must be specified for a recursive view.
ru: Создаёт рекурсивное представление. Синтаксис <synopsis> CREATE RECURSIVE VIEW [ <replaceable>схема</replaceable> . ] <replaceable>имя</replaceable> (<replaceable>имена_столбцов</replaceable>) AS SELECT <replaceable>...</replaceable>; </synopsis> равнозначен <synopsis> CREATE VIEW [ <replaceable>схема</replaceable> . ] <replaceable>имя</replaceable> AS WITH RECURSIVE <replaceable>имя</replaceable> (<replaceable>имена_столбцов</replaceable>) AS (SELECT <replaceable>...</replaceable>) SELECT <replaceable>имена_столбцов</replaceable> FROM <replaceable>имя</replaceable>; </synopsis> Для рекурсивного представления обязательно должен задаваться список с именами столбцов.

source: The name (optionally schema-qualified) of a view to be created.
ru: Имя (возможно, дополненное схемой) создаваемого представления.

source: An optional list of names to be used for columns of the view. If not given, the column names are deduced from the query.
ru: Необязательный список имён, назначаемых столбцам представления. Если отсутствует, имена столбцов формируются из результатов запроса.

source: This parameter may be either <literal>local</literal> or <literal>cascaded</literal>, and is equivalent to specifying <literal>WITH [ CASCADED | LOCAL ] CHECK OPTION</literal> (see below). This option can be changed on existing views using <xref linkend="sql-alterview"/>.
ru: Этот параметр может принимать значение <literal>local</literal> (локально) или <literal>cascaded</literal> (каскадно) и равнозначен указанию <literal>WITH [ CASCADED | LOCAL ] CHECK OPTION</literal> (см. ниже). Изменить этот параметр у существующего представления с помощью <xref linkend="sql-alterview"/> нельзя.

source: This should be used if the view is intended to provide row-level security. See <xref linkend="rules-privileges"/> for full details.
ru: Этот параметр следует использовать, если представление должно обеспечивать безопасность на уровне строк. За дополнительными подробностями обратитесь к <xref remap="3" linkend="rules-privileges"/>.

source: This clause specifies optional parameters for a view; the following parameters are supported: <placeholder-1/>
ru: В этом предложении могут задаваться следующие необязательные параметры представления: <placeholder-1/>

source: A <xref linkend="sql-select"/> or <xref linkend="sql-values"/> command which will provide the columns and rows of the view.
ru: Команда <xref linkend="sql-select"/> или <xref linkend="sql-values"/>, которая выдаёт столбцы и строки представления.

source: New rows are only checked against the conditions defined directly in the view itself. Any conditions defined on underlying base views are not checked (unless they also specify the <literal>CHECK OPTION</literal>).
ru: Новые строки проверяются только по условиям, определённым непосредственно в самом представлении. Любые условия, определённые в нижележащих базовых представлениях, не проверяются (если только в них нет указания <literal>CHECK OPTION</literal>).

source: New rows are checked against the conditions of the view and all underlying base views. If the <literal>CHECK OPTION</literal> is specified, and neither <literal>LOCAL</literal> nor <literal>CASCADED</literal> is specified, then <literal>CASCADED</literal> is assumed.
ru: Новые строки проверяются по условиям данного представления и всех нижележащих базовых. Если указано <literal>CHECK OPTION</literal>, а <literal>LOCAL</literal> и <literal>CASCADED</literal> опущено, подразумевается указание <literal>CASCADED</literal>.

source: This option controls the behavior of automatically updatable views. When this option is specified, <command>INSERT</command> and <command>UPDATE</command> commands on the view will be checked to ensure that new rows satisfy the view-defining condition (that is, the new rows are checked to ensure that they are visible through the view). If they are not, the update will be rejected. If the <literal>CHECK OPTION</literal> is not specified, <command>INSERT</command> and <command>UPDATE</command> commands on the view are allowed to create rows that are not visible through the view. The following check options are supported: <placeholder-1/>
ru: Это указание управляет поведением автоматически изменяемых представлений. Если оно присутствует, при выполнении операций <command>INSERT</command> и <command>UPDATE</command> с этим представлением будет проверяться, удовлетворяют ли новые строки условию, определяющему представление (то есть, проверяется, будут ли новые строки видны через это представление). Если они не удовлетворяют условию, операция не будет выполнена. Если указание <literal>CHECK OPTION</literal> отсутствует, команды <command>INSERT</command> и <command>UPDATE</command> смогут создавать в этом представлении строки, которые не будут видны в нём. Поддерживаются следующие варианты проверки: <placeholder-1/>

source: The <literal>CHECK OPTION</literal> may not be used with <literal>RECURSIVE</literal> views.
ru: Указание <literal>CHECK OPTION</literal> нельзя использовать с рекурсивными представлениями.

source: Note that the <literal>CHECK OPTION</literal> is only supported on views that are automatically updatable, and do not have <literal>INSTEAD OF</literal> triggers or <literal>INSTEAD</literal> rules. If an automatically updatable view is defined on top of a base view that has <literal>INSTEAD OF</literal> triggers, then the <literal>LOCAL CHECK OPTION</literal> may be used to check the conditions on the automatically updatable view, but the conditions on the base view with <literal>INSTEAD OF</literal> triggers will not be checked (a cascaded check option will not cascade down to a trigger-updatable view, and any check options defined directly on a trigger-updatable view will be ignored). If the view or any of its base relations has an <literal>INSTEAD</literal> rule that causes the <command>INSERT</command> or <command>UPDATE</command> command to be rewritten, then all check options will be ignored in the rewritten query, including any checks from automatically updatable views defined on top of the relation with the <literal>INSTEAD</literal> rule.
ru: Заметьте, что <literal>CHECK OPTION</literal> поддерживается только для автоматически изменяемых представлений, не имеющих триггеров <literal>INSTEAD OF</literal> и правил <literal>INSTEAD</literal>. Если автоматически изменяемое представление определено поверх базового представления с триггерами <literal>INSTEAD OF</literal>, то для проверки ограничений автоматически изменяемого представления можно применить указание <literal>LOCAL CHECK OPTION</literal>, хотя условия базового представления с триггерами <literal>INSTEAD OF</literal> при этом проверяться не будут (каскадная проверка не будет спускаться к представлению, модифицируемому триггером, и любые параметры проверки, определённые для такого представления, будут просто игнорироваться). Если для представления или любого из его базовых отношений определено правило <literal>INSTEAD</literal>, приводящее к перезаписи команды <command>INSERT</command> или <command>UPDATE</command>, в перезаписанном запросе все параметры проверки будут игнорироваться, в том числе проверки автоматически изменяемых представлений, определённых поверх отношений с правилом <literal>INSTEAD</literal>.

source: Notes
ru: Замечания

source: Use the <xref linkend="sql-dropview"/> statement to drop views.
ru: Для удаления представлений применяется оператор <xref linkend="sql-dropview"/>.

source: Be careful that the names and types of the view's columns will be assigned the way you want. For example: <placeholder-1/> is bad form in two ways: the column name defaults to <literal>?column?</literal>, and the column data type defaults to <type>unknown</type>. If you want a string literal in a view's result, use something like: <placeholder-2/>
ru: Будьте аккуратны в определении представления, чтобы получить желаемые имена и типы столбцов. Например, такая команда: <placeholder-1/> создаст представление с двумя недостатками: именем столбца по умолчанию будет <literal>?column?</literal>, а типом данных — <type>unknown</type> (неизвестный). Если вы хотите получить в представлении строковую константу, лучше сделать так: <placeholder-2/>

source: Access to tables referenced in the view is determined by permissions of the view owner. In some cases, this can be used to provide secure but restricted access to the underlying tables. However, not all views are secure against tampering; see <xref linkend="rules-privileges"/> for details. Functions called in the view are treated the same as if they had been called directly from the query using the view. Therefore the user of a view must have permissions to call all functions used by the view.
ru: Доступ к таблицам, задействованным в представлении, определяется правами владельца представления. В некоторых случаях это позволяет организовать безопасный, но ограниченный доступ к нижележащим таблицам. Однако учтите, что не все представления могут быть защищёнными; за подробностями обратитесь к <xref remap="3" linkend="rules-privileges"/>. Функции, вызываемые в представлении, выполняются так, как будто они вызываются непосредственно из запроса, обращающегося к представлению. Поэтому пользователь представления должен иметь все права, необходимые для вызова всех функций, задействованных в представлении.

source: When <command>CREATE OR REPLACE VIEW</command> is used on an existing view, only the view's defining SELECT rule is changed. Other view properties, including ownership, permissions, and non-SELECT rules, remain unchanged. You must own the view to replace it (this includes being a member of the owning role).
ru: При выполнении <command>CREATE OR REPLACE VIEW</command> для существующего представления меняется только правило SELECT, определяющее представление. Другие свойства представления, включая владельца, права и правила, кроме SELECT, остаются неизменными. Чтобы изменить определение представления, необходимо быть его владельцем (или членом роли-владельца).

source: Updatable Views
ru: Изменяемые представления

source: <primary>updatable views</primary>
ru: <primary>изменяемые представления</primary>

source: The view must have exactly one entry in its <literal>FROM</literal> list, which must be a table or another updatable view.
ru: Список <literal>FROM</literal> в запросе, определяющем представлении, должен содержать ровно один элемент, и это должна быть таблица или другое изменяемое представление.

source: The view definition must not contain <literal>WITH</literal>, <literal>DISTINCT</literal>, <literal>GROUP BY</literal>, <literal>HAVING</literal>, <literal>LIMIT</literal>, or <literal>OFFSET</literal> clauses at the top level.
ru: Определение представления не должно содержать предложения <literal>WITH</literal>, <literal>DISTINCT</literal>, <literal>GROUP BY</literal>, <literal>HAVING</literal>, <literal>LIMIT</literal> и <literal>OFFSET</literal> на верхнем уровне запроса.

source: The view definition must not contain set operations (<literal>UNION</literal>, <literal>INTERSECT</literal> or <literal>EXCEPT</literal>) at the top level.
ru: Определение представления не должно содержать операции с множествами (<literal>UNION</literal>, <literal>INTERSECT</literal> и <literal>EXCEPT</literal>) на верхнем уровне запроса.

source: The view's select list must not contain any aggregates, window functions or set-returning functions.
ru: Список выборки в запросе не должен содержать агрегатные и оконные функции, а также функции, возвращающие множества.

source: Simple views are automatically updatable: the system will allow <command>INSERT</command>, <command>UPDATE</command> and <command>DELETE</command> statements to be used on the view in the same way as on a regular table. A view is automatically updatable if it satisfies all of the following conditions: <placeholder-1/>
ru: Простые представления становятся изменяемыми автоматически: система позволит выполнять команды <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command> с таким представлением так же, как и с обычной таблицей. Представление будет автоматически изменяемым, если оно удовлетворяют одновременно всем следующим условиям: <placeholder-1/>

source: An automatically updatable view may contain a mix of updatable and non-updatable columns. A column is updatable if it is a simple reference to an updatable column of the underlying base relation; otherwise the column is read-only, and an error will be raised if an <command>INSERT</command> or <command>UPDATE</command> statement attempts to assign a value to it.
ru: Автоматически обновляемое представление может содержать как изменяемые, так и не изменяемые столбцы. Столбец будет изменяемым, если это простая ссылка на изменяемый столбец нижележащего базового отношения; в противном случае, этот столбец будет доступен только для чтения, и если команда <command>INSERT</command> или <command>UPDATE</command> попытается записать значение в него, возникнет ошибка.

source: If the view is automatically updatable the system will convert any <command>INSERT</command>, <command>UPDATE</command> or <command>DELETE</command> statement on the view into the corresponding statement on the underlying base relation. <command>INSERT</command> statements that have an <literal>ON CONFLICT UPDATE</literal> clause are fully supported.
ru: Если представление автоматически изменяемое, система будет преобразовывать обращающиеся к нему операторы <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command> в соответствующие операторы, обращающиеся к нижележащему базовому отношению. При этом в полной мере поддерживаются операторы <command>INSERT</command> с предложением <literal>ON CONFLICT UPDATE</literal>.

source: If an automatically updatable view contains a <literal>WHERE</literal> condition, the condition restricts which rows of the base relation are available to be modified by <command>UPDATE</command> and <command>DELETE</command> statements on the view. However, an <command>UPDATE</command> is allowed to change a row so that it no longer satisfies the <literal>WHERE</literal> condition, and thus is no longer visible through the view. Similarly, an <command>INSERT</command> command can potentially insert base-relation rows that do not satisfy the <literal>WHERE</literal> condition and thus are not visible through the view (<literal>ON CONFLICT UPDATE</literal> may similarly affect an existing row not visible through the view). The <literal>CHECK OPTION</literal> may be used to prevent <command>INSERT</command> and <command>UPDATE</command> commands from creating such rows that are not visible through the view.
ru: Если автоматически изменяемое представление содержит условие <literal>WHERE</literal>, это условие ограничивает набор строк, которые могут быть изменены командой <command>UPDATE</command> и удалены командой <command>DELETE</command> в этом представлении. Однако <command>UPDATE</command> может изменить строку так, что она больше не будет соответствовать условию <literal>WHERE</literal> и, как следствие, больше не будет видна через представление. Команда <command>INSERT</command> подобным образом может вставить в базовое отношение строки, которые не удовлетворят условию <literal>WHERE</literal> и поэтому не будут видны через представление (<literal>ON CONFLICT UPDATE</literal> может подобным образом воздействовать на существующую строку, не видимую через представление). Чтобы запретить командам <command>INSERT</command> и <command>UPDATE</command> создавать такие строки, которые не видны через представление, можно воспользоваться указанием <literal>CHECK OPTION</literal>.

source: If an automatically updatable view is marked with the <literal>security_barrier</literal> property then all the view's <literal>WHERE</literal> conditions (and any conditions using operators which are marked as <literal>LEAKPROOF</literal>) will always be evaluated before any conditions that a user of the view has added. See <xref linkend="rules-privileges"/> for full details. Note that, due to this, rows which are not ultimately returned (because they do not pass the user's <literal>WHERE</literal> conditions) may still end up being locked. <command>EXPLAIN</command> can be used to see which conditions are applied at the relation level (and therefore do not lock rows) and which are not.
ru: Если автоматически изменяемое представление имеет свойство <literal>security_barrier</literal> (барьер безопасности), то все условия <literal>WHERE</literal> этого представления (и все условия с герметичными операторами (<literal>LEAKPROOF</literal>)) будут всегда вычисляться перед условиями, добавленными пользователем представления. За подробностями обратитесь к <xref remap="3" linkend="rules-privileges"/>. Заметьте, что по этой причине строки, которые в конце концов не были выданы (потому что не прошли проверку в пользовательском условии <literal>WHERE</literal>), могут всё же остаться заблокированными. Чтобы определить, какие условия применяются на уровне отношения (и, как следствие, избавляют часть строк от блокировки), можно воспользоваться командой <command>EXPLAIN</command>.

source: A more complex view that does not satisfy all these conditions is read-only by default: the system will not allow an insert, update, or delete on the view. You can get the effect of an updatable view by creating <literal>INSTEAD OF</literal> triggers on the view, which must convert attempted inserts, etc. on the view into appropriate actions on other tables. For more information see <xref linkend="sql-createtrigger"/>. Another possibility is to create rules (see <xref linkend="sql-createrule"/>), but in practice triggers are easier to understand and use correctly.
ru: Более сложные представления, не удовлетворяющие этим условиям, по умолчанию доступны только для чтения: система не позволит выполнить операции добавления, изменения или удаления строк в таком представлении. Создать эффект изменяемого представления для них можно, определив триггеры <literal>INSTEAD OF</literal>, которые будут преобразовывать запросы на изменение данных в соответствующие действия с другими таблицами. За дополнительными сведениями обратитесь к <xref remap="3" linkend="sql-createtrigger"/>. Так же есть возможность создавать правила (см. <xref remap="4" linkend="sql-createrule"/>), но на практике триггеры проще для понимания и применения.

source: Note that the user performing the insert, update or delete on the view must have the corresponding insert, update or delete privilege on the view. In addition the view's owner must have the relevant privileges on the underlying base relations, but the user performing the update does not need any permissions on the underlying base relations (see <xref linkend="rules-privileges"/>).
ru: Учтите, что пользователь, выполняющий операции добавления, изменения или удаления данных в представлении, должен иметь соответствующие права для этого представления. Кроме того, владелец представления должен иметь сопутствующие права в нижележащих базовых отношениях, хотя пользователь, собственно выполняющий эти операции, может этих прав не иметь (см. <xref remap="4" linkend="rules-privileges"/>).

source: Examples
ru: Примеры
