Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/ref/create_view.po
Languages: ru

source: Create a view consisting of all comedy films: <placeholder-1/> This will create a view containing the columns that are in the <literal>film</literal> table at the time of view creation. Though <literal>*</literal> was used to create the view, columns added later to the table will not be part of the view.
ru: Создание представления, содержащего все комедийные фильмы: <placeholder-1/> Эта команда создаст представление со столбцами, которые содержались в таблице <literal>film</literal> в момент выполнения команды. Хотя при создании представления было указано <literal>*</literal>, столбцы, добавляемые в таблицу позже, частью представления не будут.

source: Create a view with <literal>LOCAL CHECK OPTION</literal>: <placeholder-1/> This will create a view based on the <literal>comedies</literal> view, showing only films with <literal>kind = 'Comedy'</literal> and <literal>classification = 'U'</literal>. Any attempt to <command>INSERT</command> or <command>UPDATE</command> a row in the view will be rejected if the new row doesn't have <literal>classification = 'U'</literal>, but the film <literal>kind</literal> will not be checked.
ru: Создание представления с указанием <literal>LOCAL CHECK OPTION</literal>: <placeholder-1/> Эта команда создаст представление на базе представления <literal>comedies</literal>, выдающее только комедии (<literal>kind = 'Comedy'</literal>) универсальной возрастной категории <literal>classification = 'U'</literal>. Любая попытка выполнить в представлении <command>INSERT</command> или <command>UPDATE</command> со строкой, не удовлетворяющей условию <literal>classification = 'U'</literal>, будет отвергнута, но ограничение по полю <literal>kind</literal> (тип фильма) проверяться не будет.

source: Create a view with <literal>CASCADED CHECK OPTION</literal>: <placeholder-1/> This will create a view that checks both the <literal>kind</literal> and <literal>classification</literal> of new rows.
ru: Создание представления с указанием <literal>CASCADED CHECK OPTION</literal>: <placeholder-1/> Это представление будет проверять, удовлетворяют ли новые строки обоим условиям: по столбцу <literal>kind</literal> и по столбцу <literal>classification</literal>.

source: Create a view with a mix of updatable and non-updatable columns: <placeholder-1/> This view will support <command>INSERT</command>, <command>UPDATE</command> and <command>DELETE</command>. All the columns from the <literal>films</literal> table will be updatable, whereas the computed columns <literal>country</literal> and <literal>avg_rating</literal> will be read-only.
ru: Создание представления с изменяемыми и неизменяемыми столбцами: <placeholder-1/> Это представление будет поддерживать операции <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command>. Изменяемыми будут все столбцы из таблицы <literal>films</literal>, тогда как вычисляемые столбцы <literal>country</literal> и <literal>avg_rating</literal> будут доступны только для чтения.

source: Create a recursive view consisting of the numbers from 1 to 100: <placeholder-1/> Notice that although the recursive view's name is schema-qualified in this <command>CREATE</command>, its internal self-reference is not schema-qualified. This is because the implicitly-created CTE's name cannot be schema-qualified.
ru: Создание рекурсивного представления, содержащего числа от 1 до 100: <placeholder-1/> Заметьте, что несмотря на то, что имя рекурсивного представления дополнено схемой в этой команде <command>CREATE</command>, внутренняя ссылка представления на себя же схемой не дополняется. Это связано с тем, что имя неявно создаваемого CTE не может дополняться схемой.

source: Compatibility
ru: Совместимость

source: <command>CREATE OR REPLACE VIEW</command> is a <productname>PostgreSQL</productname> language extension. So is the concept of a temporary view. The <literal>WITH ( ... )</literal> clause is an extension as well.
ru: Команда <command>CREATE OR REPLACE VIEW</command> — языковое расширение <productname>PostgreSQL</productname>. Так же расширением является предложение <literal>WITH ( ... )</literal> и концепция временного представления.

source: See Also
ru: См. также
