Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/ref/grant.po
Languages: ru

source: It should be noted that database superusers can access all objects regardless of object privilege settings. This is comparable to the rights of <literal>root</literal> in a Unix system. As with <literal>root</literal>, it's unwise to operate as a superuser except when absolutely necessary.
ru: Следует отметить, что суперпользователи баз данных могут обращаться к любым объектам, вне зависимости от наличия каких-либо прав. Это сравнимо с привилегиями пользователя <literal>root</literal> в системе Unix. И так же, как <literal>root</literal>, роль суперпользователя следует использовать только когда это абсолютно необходимо.

source: If a superuser chooses to issue a <command>GRANT</command> or <command>REVOKE</command> command, the command is performed as though it were issued by the owner of the affected object. In particular, privileges granted via such a command will appear to have been granted by the object owner. (For role membership, the membership appears to have been granted by the containing role itself.)
ru: Если суперпользователь решит выполнить команду <command>GRANT</command> или <command>REVOKE</command>, она будет выполнена, как если бы её выполнял владелец заданного объекта. В частности, права, назначенные такой командой, будут представлены как права, назначенные владельцем объекта. (Если так же установить членство в роли, оно будет представлено как назначенное самой ролью.)

source: <command>GRANT</command> and <command>REVOKE</command> can also be done by a role that is not the owner of the affected object, but is a member of the role that owns the object, or is a member of a role that holds privileges <literal>WITH GRANT OPTION</literal> on the object. In this case the privileges will be recorded as having been granted by the role that actually owns the object or holds the privileges <literal>WITH GRANT OPTION</literal>. For example, if table <literal>t1</literal> is owned by role <literal>g1</literal>, of which role <literal>u1</literal> is a member, then <literal>u1</literal> can grant privileges on <literal>t1</literal> to <literal>u2</literal>, but those privileges will appear to have been granted directly by <literal>g1</literal>. Any other member of role <literal>g1</literal> could revoke them later.
ru: <command>GRANT</command> и <command>REVOKE</command> также могут быть выполнены ролью, которая не является владельцем заданного объекта, но является членом роли-владельца, либо членом роли, имеющей права <literal>WITH GRANT OPTION</literal> для этого объекта. В этом случае, права будут записаны как назначенные ролью, которая действительно владеет объектом, либо имеет право <literal>WITH GRANT OPTION</literal>. Например, если таблица <literal>t1</literal> принадлежит роли <literal>g1</literal>, членом которой является <literal>u1</literal>, то <literal>u1</literal> может дать права на использование <literal>t1</literal> роли <literal>u2</literal>, но эти права будут представлены, как назначенные непосредственно ролью <literal>g1</literal>. Отозвать эти права позже сможет любой член роли <literal>g1</literal>.

source: If the role executing <command>GRANT</command> holds the required privileges indirectly via more than one role membership path, it is unspecified which containing role will be recorded as having done the grant. In such cases it is best practice to use <command>SET ROLE</command> to become the specific role you want to do the <command>GRANT</command> as.
ru: Если роль, выполняющая команду <command>GRANT</command>, получает требуемое право по нескольким путям членства, какая именно роль будет выбрана в качестве назначающей право, не определено. Если это важно, в таких случаях рекомендуется воспользоваться командой <command>SET ROLE</command> и переключиться на роль, которую хочется видеть в качестве выполняющей <command>GRANT</command>.

source: Granting permission on a table does not automatically extend permissions to any sequences used by the table, including sequences tied to <type>SERIAL</type> columns. Permissions on sequences must be set separately.
ru: При назначении прав для доступа к таблице они автоматически не распространяются на последовательности, используемые этой таблицей, в том числе, на последовательности, связанные со столбцами <type>SERIAL</type>. Права доступа к последовательностям нужно назначать отдельно.

source: Use <xref linkend="app-psql"/>'s <command>\dp</command> command to obtain information about existing privileges for tables and columns. For example: <placeholder-1/> The entries shown by <command>\dp</command> are interpreted thus: <literallayout class="monospaced"> rolename=xxxx -- privileges granted to a role =xxxx -- privileges granted to PUBLIC r -- SELECT ("read") w -- UPDATE ("write") a -- INSERT ("append") d -- DELETE D -- TRUNCATE x -- REFERENCES t -- TRIGGER X -- EXECUTE U -- USAGE C -- CREATE c -- CONNECT T -- TEMPORARY arwdDxt -- ALL PRIVILEGES (for tables, varies for other objects) * -- grant option for preceding privilege /yyyy -- role that granted this privilege </literallayout> The above example display would be seen by user <literal>miriam</literal> after creating table <literal>mytable</literal> and doing: <placeholder-2/>
ru: Чтобы получить информацию о существующих правах, назначенных для таблиц и столбцов, воспользуйтесь командой <command>\dp</command> в <xref linkend="app-psql"/>. Например: <placeholder-1/> Записи, выводимые командой <command>\dp</command>, интерпретируются так: <literallayout class="monospaced"> имя_роли=xxxx -- права, назначенные роли =xxxx -- права, назначенные PUBLIC r -- SELECT ("read", чтение) w -- UPDATE ("write", запись) a -- INSERT ("append", добавление) d -- DELETE D -- TRUNCATE x -- REFERENCES t -- TRIGGER X -- EXECUTE U -- USAGE C -- CREATE c -- CONNECT T -- TEMPORARY arwdDxt -- ALL PRIVILEGES (все права для таблиц; для других объектов другие) * -- право передачи заданного права /yyyy -- роль, назначившая это право </literallayout> В примере выше показано, что увидит пользователь <literal>miriam</literal>, если создаст таблицу <literal>mytable</literal> и выполнит: <placeholder-2/>

source: For non-table objects there are other <command>\d</command> commands that can display their privileges.
ru: Для других объектов есть другие команды <command>\d</command>, которые также позволяют просмотреть назначенные права.

source: If the <quote>Access privileges</quote> column is empty for a given object, it means the object has default privileges (that is, its privileges column is null). Default privileges always include all privileges for the owner, and can include some privileges for <literal>PUBLIC</literal> depending on the object type, as explained above. The first <command>GRANT</command> or <command>REVOKE</command> on an object will instantiate the default privileges (producing, for example, <literal>{miriam=arwdDxt/miriam}</literal>) and then modify them per the specified request. Similarly, entries are shown in <quote>Column access privileges</quote> only for columns with nondefault privileges. (Note: for this purpose, <quote>default privileges</quote> always means the built-in default privileges for the object's type. An object whose privileges have been affected by an <command>ALTER DEFAULT PRIVILEGES</command> command will always be shown with an explicit privilege entry that includes the effects of the <command>ALTER</command>.)
ru: Если столбец <quote>Права доступа</quote> для данного объекта пуст, это значит, что для объекта действуют стандартные права (то есть столбец прав содержит NULL). Права по умолчанию всегда включают все права для владельца и могут также включать некоторые права для <literal>PUBLIC</literal> в зависимости от типа объекта, как разъяснялось выше. Первая команда <command>GRANT</command> или <command>REVOKE</command> для объекта приводит к проявлению записи прав по умолчанию (например, <literal>{miriam=arwdDxt/miriam}</literal>), а затем изменяет эту запись в соответствии с заданным запросом. Подобным образом, строки, показанные в столбце <quote>Права доступа к столбцам</quote>, выводятся только для столбцов с нестандартными правами доступа. (Заметьте, что в данном контексте под <quote>стандартными правами</quote> всегда подразумевается встроенный набор прав, предопределённый для типа объекта. Если с объектом связан набор прав по умолчанию, полученный после изменения в результате <command>ALTER DEFAULT PRIVILEGES</command>, изменённые права будут всегда выводиться явно, показывая эффект команды <command>ALTER</command>.)

source: Notice that the owner's implicit grant options are not marked in the access privileges display. A <literal>*</literal> will appear only when grant options have been explicitly granted to someone.
ru: Заметьте, что право распоряжения правами, которое имеет владелец, не отмечается в выводимой сводке. Знаком <literal>*</literal> отмечаются только те права с правом передачи, которые были явно назначены кому-либо.

source: Examples
ru: Примеры

source: Grant insert privilege to all users on table <literal>films</literal>: <placeholder-1/>
ru: Следующая команда разрешает всем добавлять записи в таблицу <literal>films</literal>: <placeholder-1/>

source: Grant all available privileges to user <literal>manuel</literal> on view <literal>kinds</literal>: <placeholder-1/> Note that while the above will indeed grant all privileges if executed by a superuser or the owner of <literal>kinds</literal>, when executed by someone else it will only grant those permissions for which the someone else has grant options.
ru: Эта команда даёт пользователю <literal>manuel</literal> все права для представления <literal>kinds</literal>: <placeholder-1/> Учтите, что если её выполнит суперпользователь или владелец представления <literal>kinds</literal>, эта команда действительно даст субъекту все права, но если её выполнит обычный пользователь, субъект получит только те права, которые даны этому пользователю с правом передачи.

source: Grant membership in role <literal>admins</literal> to user <literal>joe</literal>: <placeholder-1/>
ru: Включение в роль <literal>admins</literal> пользователя <literal>joe</literal>: <placeholder-1/>

source: Compatibility
ru: Совместимость

source: According to the SQL standard, the <literal>PRIVILEGES</literal> key word in <literal>ALL PRIVILEGES</literal> is required. The SQL standard does not support setting the privileges on more than one object per command.
ru: Согласно стандарту SQL, слово <literal>PRIVILEGES</literal> в указании <literal>ALL PRIVILEGES</literal> является обязательным. Стандарт SQL не позволяет назначать права сразу для нескольких объектов одной командой.

source: <productname>PostgreSQL</productname> allows an object owner to revoke their own ordinary privileges: for example, a table owner can make the table read-only to themselves by revoking their own <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal>, and <literal>TRUNCATE</literal> privileges. This is not possible according to the SQL standard. The reason is that <productname>PostgreSQL</productname> treats the owner's privileges as having been granted by the owner to themselves; therefore they can revoke them too. In the SQL standard, the owner's privileges are granted by an assumed entity <quote>_SYSTEM</quote>. Not being <quote>_SYSTEM</quote>, the owner cannot revoke these rights.
ru: <productname>PostgreSQL</productname> позволяет владельцу объекта лишить себя своих обычных прав: например, владелец таблицы может разрешить себе только чтение таблицы, отозвав собственные права <literal>INSERT</literal>, <literal>UPDATE</literal>, <literal>DELETE</literal> и <literal>TRUNCATE</literal>. В стандарте SQL это невозможно. Это объясняется тем, что <productname>PostgreSQL</productname> воспринимает права владельца как назначенные им же себе; поэтому их можно и отозвать. В стандарте SQL права владельца даются ему предполагаемой сущностью <quote>_SYSTEM</quote>. Так как владелец объекта отличается от <quote>_SYSTEM</quote>, лишить себя этих прав он не может.

source: According to the SQL standard, grant options can be granted to <literal>PUBLIC</literal>; PostgreSQL only supports granting grant options to roles.
ru: Согласно стандарту SQL, право с правом передачи можно дать субъекту <literal>PUBLIC</literal>; однако PostgreSQL может давать право с правом передачи только ролям.

source: The SQL standard provides for a <literal>USAGE</literal> privilege on other kinds of objects: character sets, collations, translations.
ru: В стандарте SQL право <literal>USAGE</literal> распространяется и на другие типы объектов: наборы символов, правила сортировки и преобразования.

source: In the SQL standard, sequences only have a <literal>USAGE</literal> privilege, which controls the use of the <literal>NEXT VALUE FOR</literal> expression, which is equivalent to the function <function>nextval</function> in PostgreSQL. The sequence privileges <literal>SELECT</literal> and <literal>UPDATE</literal> are PostgreSQL extensions. The application of the sequence <literal>USAGE</literal> privilege to the <literal>currval</literal> function is also a PostgreSQL extension (as is the function itself).
ru: В стандарте SQL право <literal>USAGE</literal> для последовательностей управляет использованием выражения <literal>NEXT VALUE FOR</literal>, которое равнозначно функции <function>nextval</function> в PostgreSQL. Права <literal>SELECT</literal> и <literal>UPDATE</literal> для последовательностей являются расширениями PostgreSQL. То, что право <literal>USAGE</literal> для последовательностей управляет использованием функции <literal>currval</literal>, так же относится к расширениям PostgreSQL (как и сама функция).

source: Privileges on databases, tablespaces, schemas, and languages are <productname>PostgreSQL</productname> extensions.
ru: Права для баз данных, табличных пространств, схем и языков относятся к расширениям <productname>PostgreSQL</productname>.

source: See Also
ru: См. также
