Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/ref/grant.po
Languages: ru

source: SQL - Language Statements
ru: Операторы языка SQL

source: define access privileges
ru: определить права доступа

source: table_name
ru: имя_таблицы

source: schema_name
ru: имя_схемы

source: role_specification
ru: указание_роли

source: column_name
ru: имя_столбца

source: sequence_name
ru: имя_последовательности

source: database_name
ru: имя_бд

source: domain_name
ru: имя_домена

source: fdw_name
ru: имя_обёртки_сторонних_данных

source: server_name
ru: имя_сервера

source: function_name
ru: имя_функции

source: argmode
ru: режим_аргумента

source: arg_name
ru: имя_аргумента

source: arg_type
ru: тип_аргумента

source: lang_name
ru: имя_языка

source: loid
ru: oid_БО

source: tablespace_name
ru: табл_пространство

source: type_name
ru: имя_типа

source: where <placeholder-1/> can be:
ru: Здесь <placeholder-1/>:

source: role_name
ru: имя_роли

source: Description
ru: Описание

source: The <command>GRANT</command> command has two basic variants: one that grants privileges on a database object (table, column, view, foreign table, sequence, database, foreign-data wrapper, foreign server, function, procedural language, schema, or tablespace), and one that grants membership in a role. These variants are similar in many ways, but they are different enough to be described separately.
ru: Команда <command>GRANT</command> имеет две основные разновидности: первая назначает права для доступа к объектам баз данных (таблицам, столбцам, представлениям, сторонним таблицам, последовательностям, базам данных, обёрткам сторонних данных, сторонним серверам, функциям, процедурным языкам, схемам или табличным пространствам), а вторая назначает одни роли членами других. Эти разновидности во многом похожи, но имеют достаточно отличий, чтобы рассматривать их отдельно.

source: GRANT on Database Objects
ru: GRANT для объектов баз данных

source: This variant of the <command>GRANT</command> command gives specific privileges on a database object to one or more roles. These privileges are added to those already granted, if any.
ru: Эта разновидность команды <command>GRANT</command> даёт одной или нескольким ролям определённые права для доступа к объекту базы данных. Эти права добавляются к списку имеющихся, если роль уже наделена какими-то правами.

source: There is also an option to grant privileges on all objects of the same type within one or more schemas. This functionality is currently supported only for tables, sequences, and functions (but note that <literal>ALL TABLES</literal> is considered to include views and foreign tables).
ru: Также можно дать роли некоторое право для всех объектов одного типа в одной или нескольких схемах. Эта функциональность в настоящее время поддерживается только для таблиц, последовательностей и функций (но заметьте, что указание <literal>ALL TABLES</literal> распространяется также на представления и сторонние таблицы).

source: The key word <literal>PUBLIC</literal> indicates that the privileges are to be granted to all roles, including those that might be created later. <literal>PUBLIC</literal> can be thought of as an implicitly defined group that always includes all roles. Any particular role will have the sum of privileges granted directly to it, privileges granted to any role it is presently a member of, and privileges granted to <literal>PUBLIC</literal>.
ru: Ключевое слово <literal>PUBLIC</literal> означает, что права даются всем ролям, включая те, что могут быть созданы позже. <literal>PUBLIC</literal> можно воспринимать как неявно определённую группу, в которую входят все роли. Любая конкретная роль получит в сумме все права, данные непосредственно ей и ролям, членом которых она является, а также права, данные роли <literal>PUBLIC</literal>.

source: If <literal>WITH GRANT OPTION</literal> is specified, the recipient of the privilege can in turn grant it to others. Without a grant option, the recipient cannot do that. Grant options cannot be granted to <literal>PUBLIC</literal>.
ru: Если указано <literal>WITH GRANT OPTION</literal>, получатель права, в свою очередь, может давать его другим. Без этого указания распоряжаться своим правом он не сможет. Группе <literal>PUBLIC</literal> право передачи права дать нельзя.

source: There is no need to grant privileges to the owner of an object (usually the user that created it), as the owner has all privileges by default. (The owner could, however, choose to revoke some of their own privileges for safety.)
ru: Нет необходимости явно давать права для доступа к объекту его владельцу (обычно это пользователь, создавший объект), так как по умолчанию он имеет все права. (Однако владелец может лишить себя прав в целях безопасности.)

source: The right to drop an object, or to alter its definition in any way, is not treated as a grantable privilege; it is inherent in the owner, and cannot be granted or revoked. (However, a similar effect can be obtained by granting or revoking membership in the role that owns the object; see below.) The owner implicitly has all grant options for the object, too.
ru: Право удалять объект или изменять его определение произвольным образом не считается назначаемым; оно неотъемлемо связано с владельцем, так что отозвать это право или дать его кому-то другому нельзя. (Однако похожий эффект можно получить, управляя членством в роли, владеющей объектом; см. ниже.) Владелец также неявно получает право распоряжения всеми правами для своего объекта.

source: PostgreSQL grants default privileges on some types of objects to <literal>PUBLIC</literal>. No privileges are granted to <literal>PUBLIC</literal> by default on tables, columns, schemas or tablespaces. For other types, the default privileges granted to <literal>PUBLIC</literal> are as follows: <literal>CONNECT</literal> and <literal>CREATE TEMP TABLE</literal> for databases; <literal>EXECUTE</literal> privilege for functions; and <literal>USAGE</literal> privilege for languages. The object owner can, of course, <command>REVOKE</command> both default and expressly granted privileges. (For maximum security, issue the <command>REVOKE</command> in the same transaction that creates the object; then there is no window in which another user can use the object.) Also, these initial default privilege settings can be changed using the <xref linkend="sql-alterdefaultprivileges"/> command.
ru: PostgreSQL по умолчанию назначает группе <literal>PUBLIC</literal> определённые права для некоторых типов объектов. Для таблиц, столбцов, схем и табличных пространств <literal>PUBLIC</literal> по умолчанию никаких прав не имеет. Для других типов объектов <literal>PUBLIC</literal> имеет следующие права: <literal>CONNECT</literal> и <literal>CREATE TEMP TABLE</literal> — для баз данных; <literal>EXECUTE</literal> — для функций; <literal>USAGE</literal> — для языков. Владелец объекта, конечно же, может отозвать (с помощью <command>REVOKE</command>) как явно назначенные права, так и права, назначаемые по умолчанию. (Для максимальной безопасности команду <command>REVOKE</command> нужно выполнять в транзакции, создающей объект; тогда не образуется окно, в котором другой пользователь смог бы обратиться к объекту.) Кроме того, эти изначально назначаемые права по умолчанию можно изменить, воспользовавшись командой <xref linkend="sql-alterdefaultprivileges"/>.

source: Allows <xref linkend="sql-select"/> from any column, or the specific columns listed, of the specified table, view, or sequence. Also allows the use of <xref linkend="sql-copy"/> TO. This privilege is also needed to reference existing column values in <xref linkend="sql-update"/> or <xref linkend="sql-delete"/>. For sequences, this privilege also allows the use of the <function>currval</function> function. For large objects, this privilege allows the object to be read.
ru: Позволяет выполнять <xref linkend="sql-select"/> для любого столбца или перечисленных столбцов в заданной таблице, представлении или последовательности. Также позволяет выполнять <xref linkend="sql-copy"/> TO. Помимо того, это право требуется для обращения к существующим значениям столбцов в <xref linkend="sql-update"/> или <xref linkend="sql-delete"/>. Для последовательностей это право позволяет пользоваться функцией <function>currval</function>. Для больших объектов это право позволяет читать содержимое объекта.

source: Allows <xref linkend="sql-insert"/> of a new row into the specified table. If specific columns are listed, only those columns may be assigned to in the <command>INSERT</command> command (other columns will therefore receive default values). Also allows <xref linkend="sql-copy"/> FROM.
ru: Позволяет вставлять строки в заданную таблицу с помощью <xref linkend="sql-insert"/>. Если право ограничивается несколькими столбцами, только их значение можно будет задать в команде <command>INSERT</command> (другие столбцы получат значения по умолчанию). Также позволяет выполнять <xref linkend="sql-copy"/> FROM.

source: Allows <xref linkend="sql-update"/> of any column, or the specific columns listed, of the specified table. (In practice, any nontrivial <command>UPDATE</command> command will require <literal>SELECT</literal> privilege as well, since it must reference table columns to determine which rows to update, and/or to compute new values for columns.) <literal>SELECT ... FOR UPDATE</literal> and <literal>SELECT ... FOR SHARE</literal> also require this privilege on at least one column, in addition to the <literal>SELECT</literal> privilege. For sequences, this privilege allows the use of the <function>nextval</function> and <function>setval</function> functions. For large objects, this privilege allows writing or truncating the object.
ru: Позволяет изменять (с помощью <xref linkend="sql-update"/>) данные во всех, либо только перечисленных, столбцах в заданной таблице. (На практике для любой нетривиальной команды <command>UPDATE</command> потребуется и право <literal>SELECT</literal>, так как она должна обратиться к столбцам таблицы, чтобы определить, какие строки подлежат изменению, и/или вычислить новые значения столбцов.) Для <literal>SELECT ... FOR UPDATE</literal> и <literal>SELECT ... FOR SHARE</literal> также необходимо это право как минимум для одного столбца, помимо права <literal>SELECT</literal>. Для последовательностей это право позволяет пользоваться функциями <function>nextval</function> и <function>setval</function>. Для больших объектов это право позволяет записывать данные в объект или обрезать его.

source: Allows <xref linkend="sql-delete"/> of a row from the specified table. (In practice, any nontrivial <command>DELETE</command> command will require <literal>SELECT</literal> privilege as well, since it must reference table columns to determine which rows to delete.)
ru: Позволяет удалять строки из заданной таблицы с помощью <xref linkend="sql-delete"/>. (На практике для любой нетривиальной команды <command>DELETE</command> потребуется также право <literal>SELECT</literal>, так как она должна обратиться к столбцам таблицы, чтобы определить, какие строки подлежат удалению.)

source: Allows <xref linkend="sql-truncate"/> on the specified table.
ru: Позволяет опустошить заданную таблицу с помощью <xref linkend="sql-truncate"/>.

source: To create a foreign key constraint, it is necessary to have this privilege on both the referencing and referenced columns. The privilege may be granted for all columns of a table, or just specific columns.
ru: Это право требуется для создания ограничений внешнего ключа, как для ссылающихся, так и для целевых столбцов. Дать это право можно для всех, либо только для некоторых столбцов таблицы.

source: Allows the creation of a trigger on the specified table. (See the <xref linkend="sql-createtrigger"/> statement.)
ru: Позволяет создавать триггеры в заданной таблице. (См. описание оператора <xref linkend="sql-createtrigger"/>.)

source: For databases, allows new schemas to be created within the database.
ru: Для баз данных это право позволяет создавать схемы в заданной базе.

source: For schemas, allows new objects to be created within the schema. To rename an existing object, you must own the object <emphasis>and</emphasis> have this privilege for the containing schema.
ru: Для схем это право позволяет создавать новые объекты в заданной схеме. Чтобы переименовать существующий объект, необходимо быть владельцем этого объекта <emphasis>и</emphasis> иметь это право для схемы, содержащей его.

source: For tablespaces, allows tables, indexes, and temporary files to be created within the tablespace, and allows databases to be created that have the tablespace as their default tablespace. (Note that revoking this privilege will not alter the placement of existing objects.)
ru: Для табличных пространств это право позволяет создавать таблицы, индексы и временные файлы в заданном табличном пространстве, а также создавать базы данных, для которых это пространство будет основным. (Учтите, что когда это право отзывается, существующие объекты остаются в прежнем расположении.)

source: Allows the user to connect to the specified database. This privilege is checked at connection startup (in addition to checking any restrictions imposed by <filename>pg_hba.conf</filename>).
ru: Позволяет пользователю подключаться к указанной базе данных. Это право проверяется при установлении соединения (в дополнение к условиям, определённым в конфигурации <filename>pg_hba.conf</filename>).

source: Allows temporary tables to be created while using the specified database.
ru: Позволяет создавать временные таблицы в заданной базе данных.

source: Allows the use of the specified function and the use of any operators that are implemented on top of the function. This is the only type of privilege that is applicable to functions. (This syntax works for aggregate functions, as well.)
ru: Позволяет выполнять заданную функцию и применять любые определённые поверх неё операторы. Это единственный тип прав, применимый к функциям. (Этот синтаксис распространяется и на агрегатные функции.)

source: For procedural languages, allows the use of the specified language for the creation of functions in that language. This is the only type of privilege that is applicable to procedural languages.
ru: Для процедурных языков это право позволяет создавать функции на заданном языке. Это единственный тип прав, применимый к процедурным языкам.

source: For schemas, allows access to objects contained in the specified schema (assuming that the objects' own privilege requirements are also met). Essentially this allows the grantee to <quote>look up</quote> objects within the schema. Without this permission, it is still possible to see the object names, e.g. by querying the system tables. Also, after revoking this permission, existing backends might have statements that have previously performed this lookup, so this is not a completely secure way to prevent object access.
ru: Для схем это право даёт доступ к объектам, содержащимся в заданной схеме (предполагается, что при этом имеются права, необходимые для доступа к самим объектам). По сути это право позволяет субъекту <quote>просматривать</quote> объекты внутри схемы. Без этого разрешения имена объектов всё же можно будет узнать, например, обратившись к системным таблицам. Кроме того, если отозвать это право, в существующих сеансах могут оказаться операторы, для которых просмотр имён объектов был выполнен ранее, так что это право не позволяет абсолютно надёжно перекрыть доступ к объектам.

source: For sequences, this privilege allows the use of the <function>currval</function> and <function>nextval</function> functions.
ru: Для последовательностей это право позволяет использовать функции <function>currval</function> и <function>nextval</function>.

source: For types and domains, this privilege allow the use of the type or domain in the creation of tables, functions, and other schema objects. (Note that it does not control general <quote>usage</quote> of the type, such as values of the type appearing in queries. It only prevents objects from being created that depend on the type. The main purpose of the privilege is controlling which users create dependencies on a type, which could prevent the owner from changing the type later.)
ru: Для типов и доменов это право позволяет использовать заданный тип или домен при создании таблиц, функций или других объектов схемы. (Заметьте, что это право не ограничивает общее <quote>использование</quote> типа, например, обращение к значениям типа в запросах. Не имея этого права, субъект лишается только возможности создавать объекты, зависящие от заданного типа. Основное предназначение этого права в том, чтобы ограничить круг пользователей, способных создавать зависимости от типа, которые могут впоследствии помешать владельцу типа изменить его.)

source: For foreign-data wrappers, this privilege enables the grantee to create new servers using that foreign-data wrapper.
ru: Для обёрток сторонних данных это право позволяет субъекту создавать определения сторонних серверов, использующих заданную обёртку сторонних данных.

source: For servers, this privilege enables the grantee to create foreign tables using the server, and also to create, alter, or drop their own user's user mappings associated with that server.
ru: Для серверов это право позволяет субъекту создавать определения сторонних таблиц на заданном сервере, а также создавать, изменять и удалять сопоставление для собственного имени пользователя, связанное с этим сервером.

source: Grant all of the available privileges at once. The <literal>PRIVILEGES</literal> key word is optional in <productname>PostgreSQL</productname>, though it is required by strict SQL.
ru: Даёт целевой роли все права сразу. Ключевое слово <literal>PRIVILEGES</literal> является необязательным в <productname>PostgreSQL</productname>, хотя в строгом SQL оно требуется.

source: The possible privileges are: <placeholder-1/> The privileges required by other commands are listed on the reference page of the respective command.
ru: Все возможные права перечислены ниже: <placeholder-1/> Права, требующиеся для других команд, указаны на страницах справки этих команд.

source: GRANT on Roles
ru: GRANT для ролей

source: This variant of the <command>GRANT</command> command grants membership in a role to one or more other roles. Membership in a role is significant because it conveys the privileges granted to a role to each of its members.
ru: Эта разновидность команды <command>GRANT</command> включает роль в члены одной или нескольких других ролей. Членство в ролях играет важную роль, так как права, данные роли, распространяются и на всех её членов.

source: If <literal>WITH ADMIN OPTION</literal> is specified, the member can in turn grant membership in the role to others, and revoke membership in the role as well. Without the admin option, ordinary users cannot do that. A role is not considered to hold <literal>WITH ADMIN OPTION</literal> on itself, but it may grant or revoke membership in itself from a database session where the session user matches the role. Database superusers can grant or revoke membership in any role to anyone. Roles having <literal>CREATEROLE</literal> privilege can grant or revoke membership in any role that is not a superuser.
ru: С указанием <literal>WITH ADMIN OPTION</literal> новоиспечённый член роли сможет, в свою очередь, включать в члены этой роли, а также исключать из неё другие роли. Без этого указания обычные пользователи не могут это делать. Считается, что роль не имеет права <literal>WITH ADMIN OPTION</literal> для самой себя, но ей позволено управлять своими членами из сеанса, в котором пользователь сеанса соответствует данной роли. Суперпользователи баз данных могут включать или исключать любые роли из любых ролей. Роли с правом <literal>CREATEROLE</literal> могут управлять членством в любых ролях, кроме ролей суперпользователей.

source: Unlike the case with privileges, membership in a role cannot be granted to <literal>PUBLIC</literal>. Note also that this form of the command does not allow the noise word <literal>GROUP</literal>.
ru: В отличие от прав, членство в ролях нельзя назначить группе <literal>PUBLIC</literal>. Заметьте также, что эта форма команды не принимает избыточное слово <literal>GROUP</literal>.

source: Notes
ru: Замечания

source: The <xref linkend="sql-revoke"/> command is used to revoke access privileges.
ru: Для лишения субъектов прав доступа применяется команда <xref linkend="sql-revoke"/>.

source: Since <productname>PostgreSQL</productname> 8.1, the concepts of users and groups have been unified into a single kind of entity called a role. It is therefore no longer necessary to use the keyword <literal>GROUP</literal> to identify whether a grantee is a user or a group. <literal>GROUP</literal> is still allowed in the command, but it is a noise word.
ru: Начиная с <productname>PostgreSQL</productname> версии 8.1, концепции пользователей и групп объединены в единую сущность, названную ролью. Таким образом, теперь нет необходимости добавлять ключевое слово <literal>GROUP</literal>, чтобы показать, что субъект является группой, а не пользователем. Слово <literal>GROUP</literal> всё ещё принимается этой командой, но оно лишено смысловой нагрузки.

source: A user may perform <command>SELECT</command>, <command>INSERT</command>, etc. on a column if they hold that privilege for either the specific column or its whole table. Granting the privilege at the table level and then revoking it for one column will not do what one might wish: the table-level grant is unaffected by a column-level operation.
ru: Пользователь может выполнять <command>SELECT</command>, <command>INSERT</command> и подобные команды со столбцом таблицы, если он имеет такое право для данного столбца или для всей таблицы. Если назначить пользователю требуемое право на уровне таблицы, а затем отозвать его для одного из столбцов, это не даст эффекта, которого можно было бы ожидать: операция с правами на уровне столбцов не затронет право на уровне таблицы.

source: When a non-owner of an object attempts to <command>GRANT</command> privileges on the object, the command will fail outright if the user has no privileges whatsoever on the object. As long as some privilege is available, the command will proceed, but it will grant only those privileges for which the user has grant options. The <command>GRANT ALL PRIVILEGES</command> forms will issue a warning message if no grant options are held, while the other forms will issue a warning if grant options for any of the privileges specifically named in the command are not held. (In principle these statements apply to the object owner as well, but since the owner is always treated as holding all grant options, the cases can never occur.)
ru: Если назначить право доступа к объекту (с помощью <command>GRANT</command>) попытается не владелец объекта, команда завершится ошибкой, если пользователь не имеет никаких прав для этого объекта. Если же пользователь имеет какие-то права, команда будет выполняться, но пользователь сможет давать другим только те права, которые даны ему с правом передачи. Формы <command>GRANT ALL PRIVILEGES</command> будут выдавать предупреждение, если у него вовсе нет таких прав, тогда как другие формы будут выдавать предупреждения, если пользователь не имеет прав распоряжаться именно правами, указанными в команде. (В принципе, эти утверждения применимы и к владельцу объекта, но ему разрешено распоряжаться всеми правами, поэтому такие ситуации невозможны.)
