Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/ref/select.po
Languages: ru

source: <primary>TABLE command</primary>
ru: <primary>команда TABLE</primary>

source: <primary>WITH</primary> <secondary>in SELECT</secondary>
ru: <primary>WITH</primary> <secondary>внутри SELECT</secondary>

source: SQL - Language Statements
ru: Операторы языка SQL

source: retrieve rows from a table or view
ru: получить строки из таблицы или представления

source: with_query
ru: запрос_WITH

source: expression
ru: выражение

source: output_name
ru: имя_результата

source: from_item
ru: элемент_FROM

source: condition
ru: условие

source: grouping_element
ru: элемент_группирования

source: window_name
ru: имя_окна

source: window_definition
ru: определение_окна

source: select
ru: выборка

source: operator
ru: оператор

source: count
ru: число

source: start
ru: начало

source: table_name
ru: имя_таблицы

source: where <placeholder-1/> can be one of:
ru: Здесь допускается <placeholder-1/>:

source: alias
ru: псевдоним

source: column_alias
ru: псевдоним_столбца

source: sampling_method
ru: метод_выборки

source: argument
ru: аргумент

source: seed
ru: затравка

source: with_query_name
ru: имя_запроса_WITH

source: function_name
ru: имя_функции

source: column_definition
ru: определение_столбца

source: join_type
ru: тип_соединения

source: join_condition
ru: условие_соединения

source: join_column
ru: столбец_соединения

source: and <placeholder-1/> can be one of:
ru: и <placeholder-1/> может быть следующим:

source: and <placeholder-1/> is:
ru: и <placeholder-1/>:

source: column_name
ru: имя_столбца

source: Description
ru: Описание

source: All queries in the <literal>WITH</literal> list are computed. These effectively serve as temporary tables that can be referenced in the <literal>FROM</literal> list. A <literal>WITH</literal> query that is referenced more than once in <literal>FROM</literal> is computed only once. (See <xref linkend="sql-with" endterm="sql-with-title"/> below.)
ru: Выполняются все запросы в списке <literal>WITH</literal>. По сути они формируют временные таблицы, к которым затем можно обращаться в списке <literal>FROM</literal>. Запрос в <literal>WITH</literal> выполняется только один раз, даже если он фигурирует в списке <literal>FROM</literal> неоднократно. (См. <xref remap="4" linkend="sql-with" endterm="sql-with-title"/> ниже.)

source: All elements in the <literal>FROM</literal> list are computed. (Each element in the <literal>FROM</literal> list is a real or virtual table.) If more than one element is specified in the <literal>FROM</literal> list, they are cross-joined together. (See <xref linkend="sql-from" endterm="sql-from-title"/> below.)
ru: Вычисляются все элементы в списке <literal>FROM</literal>. (Каждый элемент в списке <literal>FROM</literal> представляет собой реальную или виртуальную таблицу.) Если список <literal>FROM</literal> содержит несколько элементов, они объединяются перекрёстным соединением. (См. <xref remap="4" linkend="sql-from" endterm="sql-from-title"/> ниже.)

source: If the <literal>WHERE</literal> clause is specified, all rows that do not satisfy the condition are eliminated from the output. (See <xref linkend="sql-where" endterm="sql-where-title"/> below.)
ru: Если указано предложение <literal>WHERE</literal>, все строки, не удовлетворяющие условию, исключаются из результата. (См. <xref remap="4" linkend="sql-where" endterm="sql-where-title"/> ниже.)

source: If the <literal>GROUP BY</literal> clause is specified, or if there are aggregate function calls, the output is combined into groups of rows that match on one or more values, and the results of aggregate functions are computed. If the <literal>HAVING</literal> clause is present, it eliminates groups that do not satisfy the given condition. (See <xref linkend="sql-groupby" endterm="sql-groupby-title"/> and <xref linkend="sql-having" endterm="sql-having-title"/> below.)
ru: Если присутствует указание <literal>GROUP BY</literal>, либо в запросе вызываются агрегатные функции, вывод разделяется по группам строк, соответствующим одному или нескольким значениям, а затем вычисляются результаты агрегатных функций. Если добавлено предложение <literal>HAVING</literal>, оно исключает группы, не удовлетворяющие заданному условию. (См. <xref remap="4" linkend="sql-groupby" endterm="sql-groupby-title"/> и <xref remap="4" linkend="sql-having" endterm="sql-having-title"/> ниже.)

source: The actual output rows are computed using the <command>SELECT</command> output expressions for each selected row or row group. (See <xref linkend="sql-select-list" endterm="sql-select-list-title"/> below.)
ru: Вычисляются фактические выходные строки по заданным в <command>SELECT</command> выражениям для каждой выбранной строки или группы строк. (См. <xref remap="4" linkend="sql-select-list" endterm="sql-select-list-title"/> ниже.)

source: <literal>SELECT DISTINCT</literal> eliminates duplicate rows from the result. <literal>SELECT DISTINCT ON</literal> eliminates rows that match on all the specified expressions. <literal>SELECT ALL</literal> (the default) will return all candidate rows, including duplicates. (See <xref linkend="sql-distinct" endterm="sql-distinct-title"/> below.)
ru: <literal>SELECT DISTINCT</literal> исключает из результата повторяющиеся строки. <literal>SELECT DISTINCT ON</literal> исключает строки, совпадающие по всем указанным выражениям. <literal>SELECT ALL</literal> (по умолчанию) возвращает все строки результата, включая дубликаты. (См. <xref remap="4" linkend="sql-distinct" endterm="sql-distinct-title"/> ниже.)

source: Using the operators <literal>UNION</literal>, <literal>INTERSECT</literal>, and <literal>EXCEPT</literal>, the output of more than one <command>SELECT</command> statement can be combined to form a single result set. The <literal>UNION</literal> operator returns all rows that are in one or both of the result sets. The <literal>INTERSECT</literal> operator returns all rows that are strictly in both result sets. The <literal>EXCEPT</literal> operator returns the rows that are in the first result set but not in the second. In all three cases, duplicate rows are eliminated unless <literal>ALL</literal> is specified. The noise word <literal>DISTINCT</literal> can be added to explicitly specify eliminating duplicate rows. Notice that <literal>DISTINCT</literal> is the default behavior here, even though <literal>ALL</literal> is the default for <command>SELECT</command> itself. (See <xref linkend="sql-union" endterm="sql-union-title"/>, <xref linkend="sql-intersect" endterm="sql-intersect-title"/>, and <xref linkend="sql-except" endterm="sql-except-title"/> below.)
ru: Операторы <literal>UNION</literal>, <literal>INTERSECT</literal> и <literal>EXCEPT</literal> объединяют вывод нескольких команд <command>SELECT</command> в один результирующий набор. Оператор <literal>UNION</literal> возвращает все строки, представленные в одном, либо обоих наборах результатов. Оператор <literal>INTERSECT</literal> возвращает все строки, представленные строго в обоих наборах. Оператор <literal>EXCEPT</literal> возвращает все строки, представленные в первом наборе, но не во втором. Во всех трёх случаях повторяющиеся строки исключаются из результата, если явно не указано <literal>ALL</literal>. Чтобы явно обозначить, что выдаваться должны только неповторяющиеся строки, можно добавить избыточное слово <literal>DISTINCT</literal>. Заметьте, что в данном контексте по умолчанию подразумевается <literal>DISTINCT</literal>, хотя в самом <command>SELECT</command> по умолчанию подразумевается <literal>ALL</literal>. (См. <xref remap="4" linkend="sql-union" endterm="sql-union-title"/>, <xref remap="4" linkend="sql-intersect" endterm="sql-intersect-title"/> и <xref remap="4" linkend="sql-except" endterm="sql-except-title"/> ниже.)

source: If the <literal>ORDER BY</literal> clause is specified, the returned rows are sorted in the specified order. If <literal>ORDER BY</literal> is not given, the rows are returned in whatever order the system finds fastest to produce. (See <xref linkend="sql-orderby" endterm="sql-orderby-title"/> below.)
ru: Если присутствует предложение <literal>ORDER BY</literal>, возвращаемые строки сортируются в указанном порядке. В отсутствие <literal>ORDER BY</literal> строки возвращаются в том порядке, в каком системе будет проще их выдать. (См. <xref remap="4" linkend="sql-orderby" endterm="sql-orderby-title"/> ниже.)

source: If the <literal>LIMIT</literal> (or <literal>FETCH FIRST</literal>) or <literal>OFFSET</literal> clause is specified, the <command>SELECT</command> statement only returns a subset of the result rows. (See <xref linkend="sql-limit" endterm="sql-limit-title"/> below.)
ru: Если указано предложение <literal>LIMIT</literal> (или <literal>FETCH FIRST</literal>) либо <literal>OFFSET</literal>, оператор <command>SELECT</command> возвращает только подмножество строк результата. (См. <xref remap="4" linkend="sql-limit" endterm="sql-limit-title"/> ниже.)

source: If <literal>FOR UPDATE</literal>, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR SHARE</literal> or <literal>FOR KEY SHARE</literal> is specified, the <command>SELECT</command> statement locks the selected rows against concurrent updates. (See <xref linkend="sql-for-update-share" endterm="sql-for-update-share-title"/> below.)
ru: Если указано <literal>FOR UPDATE</literal>, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR SHARE</literal> или <literal>FOR KEY SHARE</literal>, оператор <command>SELECT</command> блокирует выбранные строки, защищая их от одновременных изменений. (См. <xref remap="4" linkend="sql-for-update-share" endterm="sql-for-update-share-title"/> ниже.)

source: <command>SELECT</command> retrieves rows from zero or more tables. The general processing of <command>SELECT</command> is as follows: <placeholder-1/>
ru: <command>SELECT</command> получает строки из множества таблиц (возможно, пустого). Общая процедура выполнения <command>SELECT</command> следующая: <placeholder-1/>

source: You must have <literal>SELECT</literal> privilege on each column used in a <command>SELECT</command> command. The use of <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> or <literal>FOR KEY SHARE</literal> requires <literal>UPDATE</literal> privilege as well (for at least one column of each table so selected).
ru: Для всех столбцов, задействованных в команде <command>SELECT</command>, необходимо иметь право <literal>SELECT</literal>. Применение блокировок <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> или <literal>FOR KEY SHARE</literal> требует также права <literal>UPDATE</literal> (как минимум для одного столбца в каждой выбранной для блокировки таблице).

source: Parameters
ru: Параметры

source: <literal>WITH</literal> Clause
ru: Предложение <literal>WITH</literal>

source: The <literal>WITH</literal> clause allows you to specify one or more subqueries that can be referenced by name in the primary query. The subqueries effectively act as temporary tables or views for the duration of the primary query. Each subquery can be a <command>SELECT</command>, <command>TABLE</command>, <command>VALUES</command>, <command>INSERT</command>, <command>UPDATE</command> or <command>DELETE</command> statement. When writing a data-modifying statement (<command>INSERT</command>, <command>UPDATE</command> or <command>DELETE</command>) in <literal>WITH</literal>, it is usual to include a <literal>RETURNING</literal> clause. It is the output of <literal>RETURNING</literal>, <emphasis>not</emphasis> the underlying table that the statement modifies, that forms the temporary table that is read by the primary query. If <literal>RETURNING</literal> is omitted, the statement is still executed, but it produces no output so it cannot be referenced as a table by the primary query.
ru: Предложение <literal>WITH</literal> позволяет задать один или несколько подзапросов, к которым затем можно обратиться по имени в основном запросе. Эти подзапросы по сути действуют как временные таблицы или представления в процессе выполнения главного запроса. Каждый подзапрос может представлять собой оператор <command>SELECT</command>, <command>TABLE</command>, <command>VALUES</command>, <command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>. При использовании в <literal>WITH</literal> оператора, изменяющего данные, (<command>INSERT</command>, <command>UPDATE</command> или <command>DELETE</command>) обычно добавляется предложение <literal>RETURNING</literal>. Заметьте, что именно результат <literal>RETURNING</literal>, а <emphasis>не</emphasis> нижележащая таблица, изменяемая запросом, формирует временную таблицу, которую затем читает основной запрос. Если <literal>RETURNING</literal> опущено, оператор, тем не менее, выполняется, но не выдаёт никакого результата, так что на него нельзя сослаться как на таблицу в основном запросе.

source: A name (without schema qualification) must be specified for each <literal>WITH</literal> query. Optionally, a list of column names can be specified; if this is omitted, the column names are inferred from the subquery.
ru: Имя (без схемы) должно быть указано для каждого запроса <literal>WITH</literal>. Также можно задать необязательный список с именами столбцов; если он опущен, имена столбцов формируются из результата подзапроса.

source: If <literal>RECURSIVE</literal> is specified, it allows a <command>SELECT</command> subquery to reference itself by name. Such a subquery must have the form <synopsis> <replaceable class="parameter">non_recursive_term</replaceable> UNION [ ALL | DISTINCT ] <replaceable class="parameter">recursive_term</replaceable> </synopsis> where the recursive self-reference must appear on the right-hand side of the <literal>UNION</literal>. Only one recursive self-reference is permitted per query. Recursive data-modifying statements are not supported, but you can use the results of a recursive <command>SELECT</command> query in a data-modifying statement. See <xref linkend="queries-with"/> for an example.
ru: Если указано <literal>RECURSIVE</literal>, подзапрос <command>SELECT</command> может ссылаться сам на себя по имени. Такой подзапрос должен иметь форму <synopsis> <replaceable class="parameter">нерекурсивная_часть</replaceable> UNION [ ALL | DISTINCT ] <replaceable class="parameter">рекурсивная_часть</replaceable> </synopsis>, где рекурсивная ссылка на сам запрос может находиться только справа от <literal>UNION</literal>. Для одного запроса допускается только одна рекурсивная ссылка на него же. Операторы, изменяющие данные, не могут быть рекурсивными, но результат рекурсивного запроса <command>SELECT</command> в таких операторах можно использовать. За примером обратитесь к <xref remap="3" linkend="queries-with"/>.

source: Another effect of <literal>RECURSIVE</literal> is that <literal>WITH</literal> queries need not be ordered: a query can reference another one that is later in the list. (However, circular references, or mutual recursion, are not implemented.) Without <literal>RECURSIVE</literal>, <literal>WITH</literal> queries can only reference sibling <literal>WITH</literal> queries that are earlier in the <literal>WITH</literal> list.
ru: Ещё одна особенность <literal>RECURSIVE</literal> в том, что запросы <literal>WITH</literal> могут быть неупорядоченными: запрос может ссылаться на другой, идущий в списке после него. (Однако циклические ссылки или взаимная рекурсия не поддерживаются.) Без <literal>RECURSIVE</literal> запрос в <literal>WITH</literal> может ссылаться только на запросы того же уровня в <literal>WITH</literal>, предшествующие ему в списке <literal>WITH</literal>.

source: A key property of <literal>WITH</literal> queries is that they are evaluated only once per execution of the primary query, even if the primary query refers to them more than once. In particular, data-modifying statements are guaranteed to be executed once and only once, regardless of whether the primary query reads all or any of their output.
ru: Ключевое свойство запросов <literal>WITH</literal> состоит в том, что они вычисляются один раз для всего основного запроса, даже если в основном запросе содержатся несколько ссылок на них. В частности, гарантируется, что операторы, изменяющие данные, будут выполняться ровно один раз, вне зависимости от того, будет ли их результат прочитан основным запросом и в каком объёме.

source: The primary query and the <literal>WITH</literal> queries are all (notionally) executed at the same time. This implies that the effects of a data-modifying statement in <literal>WITH</literal> cannot be seen from other parts of the query, other than by reading its <literal>RETURNING</literal> output. If two such data-modifying statements attempt to modify the same row, the results are unspecified.
ru: Основной запрос и все запросы <literal>WITH</literal>, условно говоря, выполняются одновременно. Это значит, что действие оператора, изменяющего данные в <literal>WITH</literal>, не будут видеть другие части запроса, кроме как прочитав его вывод <literal>RETURNING</literal>. Если два таких оператора попытаются изменить одну строку, результат будет неопределённым.

source: See <xref linkend="queries-with"/> for additional information.
ru: За дополнительными сведениями обратитесь к <xref remap="3" linkend="queries-with"/>.

source: <literal>FROM</literal> Clause
ru: Предложение <literal>FROM</literal>

source: The <literal>FROM</literal> clause specifies one or more source tables for the <command>SELECT</command>. If multiple sources are specified, the result is the Cartesian product (cross join) of all the sources. But usually qualification conditions are added (via <literal>WHERE</literal>) to restrict the returned rows to a small subset of the Cartesian product.
ru: В предложении <literal>FROM</literal> перечисляются одна или несколько таблиц, служащих источниками данных для <command>SELECT</command>. Если указано несколько источников, результатом будет декартово произведение (перекрёстное соединение) всех их строк. Но обычно в запрос добавляются уточняющие условия (в предложении <literal>WHERE</literal>), которые ограничивают набор строк небольшим подмножеством этого произведения.

source: The name (optionally schema-qualified) of an existing table or view. If <literal>ONLY</literal> is specified before the table name, only that table is scanned. If <literal>ONLY</literal> is not specified, the table and all its descendant tables (if any) are scanned. Optionally, <literal>*</literal> can be specified after the table name to explicitly indicate that descendant tables are included.
ru: Имя (возможно, дополненное схемой) существующей таблицы или представления. Если перед именем таблицы указано <literal>ONLY</literal>, считывается только заданная таблица. Без <literal>ONLY</literal> считывается и заданная таблица, и все её потомки (если таковые есть). После имени таблицы можно также добавить необязательное указание <literal>*</literal>, чтобы явно обозначить, что блокировка затрагивает и все дочерние таблицы.

source: A substitute name for the <literal>FROM</literal> item containing the alias. An alias is used for brevity or to eliminate ambiguity for self-joins (where the same table is scanned multiple times). When an alias is provided, it completely hides the actual name of the table or function; for example given <literal>FROM foo AS f</literal>, the remainder of the <command>SELECT</command> must refer to this <literal>FROM</literal> item as <literal>f</literal> not <literal>foo</literal>. If an alias is written, a column alias list can also be written to provide substitute names for one or more columns of the table.
ru: Альтернативное имя для элемента списка <literal>FROM</literal>. Этот псевдоним используется для краткости или для исключения неоднозначности с замкнутыми соединениями (когда одна таблица читается неоднократно). Когда задаётся псевдоним, он полностью скрывает настоящее имя таблицы или функции; например, при записи <literal>FROM foo AS f</literal>, в продолжении запроса <command>SELECT</command> к этому элементу <literal>FROM</literal> нужно обращаться по имени <literal>f</literal>, а не <literal>foo</literal>. Если задан псевдоним таблицы, за ним можно также написать список псевдонимов столбцов, который определит альтернативные имена для столбцов таблицы.

source: A <literal>TABLESAMPLE</literal> clause after a <replaceable class="parameter">table_name</replaceable> indicates that the specified <replaceable class="parameter">sampling_method</replaceable> should be used to retrieve a subset of the rows in that table. This sampling precedes the application of any other filters such as <literal>WHERE</literal> clauses. The standard <productname>PostgreSQL</productname> distribution includes two sampling methods, <literal>BERNOULLI</literal> and <literal>SYSTEM</literal>, and other sampling methods can be installed in the database via extensions.
ru: Предложение <literal>TABLESAMPLE</literal>, сопровождающее <replaceable class="parameter">имя_таблицы</replaceable>, показывает, что для получения подмножества строк в этой таблице должен применяться указанный <replaceable class="parameter">метод_выборки</replaceable>. Эта выборка предшествует применению любых других фильтров, например, в предложении <literal>WHERE</literal>. В стандартный дистрибутив <productname>PostgreSQL</productname> включены два метода выборки, <literal>BERNOULLI</literal> и <literal>SYSTEM</literal>; другие методы выборки можно установить в базу данных через расширения.

source: The <literal>BERNOULLI</literal> and <literal>SYSTEM</literal> sampling methods each accept a single <replaceable class="parameter">argument</replaceable> which is the fraction of the table to sample, expressed as a percentage between 0 and 100. This argument can be any <type>real</type>-valued expression. (Other sampling methods might accept more or different arguments.) These two methods each return a randomly-chosen sample of the table that will contain approximately the specified percentage of the table's rows. The <literal>BERNOULLI</literal> method scans the whole table and selects or ignores individual rows independently with the specified probability. The <literal>SYSTEM</literal> method does block-level sampling with each block having the specified chance of being selected; all rows in each selected block are returned. The <literal>SYSTEM</literal> method is significantly faster than the <literal>BERNOULLI</literal> method when small sampling percentages are specified, but it may return a less-random sample of the table as a result of clustering effects.
ru: Методы выборки <literal>BERNOULLI</literal> и <literal>SYSTEM</literal> принимают единственный <replaceable class="parameter">аргумент</replaceable>, определяющий, какой процент таблицы должен попасть в выборку, от 0 до 100. Этот аргумент может задаваться любым выражением со значением типа <type>real</type>. (Другие методы выборки могут принимать дополнительные или другие параметры.) Оба этих метода возвращают случайную выборку таблицы, содержащую примерно указанный процент строк таблицы. Метод <literal>BERNOULLI</literal> сканирует всю таблицу и выбирает или игнорирует отдельные строки независимо, с заданной вероятностью. Метод <literal>SYSTEM</literal> строит выборку на уровне блоков, определяя для каждого блока шанс его задействовать, и возвращает все строки из каждого задействуемого блока. Метод <literal>SYSTEM</literal> работает значительно быстрее <literal>BERNOULLI</literal>, когда выбирается небольшой процент строк, но он может выдавать менее случайную выборку таблицу из-за эффектов кучности.
