Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/ref/select.po
Languages: ru

source: Previous releases failed to preserve a lock which is upgraded by a later savepoint. For example, this code: <placeholder-1/> would fail to preserve the <literal>FOR UPDATE</literal> lock after the <command>ROLLBACK TO</command>. This has been fixed in release 9.3.
ru: Предыдущие версии не могли сохранить блокировку, которая была повышена последующей точкой сохранения. Например, этот код: <placeholder-1/> не мог сохранить блокировку <literal>FOR UPDATE</literal> после <command>ROLLBACK TO</command>. Это было исправлено в версии 9.3.

source: It is possible for a <command>SELECT</command> command running at the <literal>READ COMMITTED</literal> transaction isolation level and using <literal>ORDER BY</literal> and a locking clause to return rows out of order. This is because <literal>ORDER BY</literal> is applied first. The command sorts the result, but might then block trying to obtain a lock on one or more of the rows. Once the <literal>SELECT</literal> unblocks, some of the ordering column values might have been modified, leading to those rows appearing to be out of order (though they are in order in terms of the original column values). This can be worked around at need by placing the <literal>FOR UPDATE/SHARE</literal> clause in a sub-query, for example <placeholder-1/> Note that this will result in locking all rows of <structname>mytable</structname>, whereas <literal>FOR UPDATE</literal> at the top level would lock only the actually returned rows. This can make for a significant performance difference, particularly if the <literal>ORDER BY</literal> is combined with <literal>LIMIT</literal> or other restrictions. So this technique is recommended only if concurrent updates of the ordering columns are expected and a strictly sorted result is required.
ru: Возможно, что команда <command>SELECT</command>, работающая на уровне изоляции <literal>READ COMMITTED</literal> и применяющая предложение <literal>ORDER BY</literal> вместе с блокировкой, будет возвращать строки не по порядку. Это связано с тем, что <literal>ORDER BY</literal> выполняется в первую очередь. Эта команда отсортирует результат, но затем может быть заблокирована, пытаясь получить блокировку одной или нескольких строк. К моменту, когда блокировка <literal>SELECT</literal> будет снята, некоторые из сортируемых столбцов могут уже измениться, в результате чего их порядок может быть нарушен (хотя они были упорядочены для исходных значений). При необходимости обойти эту проблему, можно поместить <literal>FOR UPDATE/SHARE</literal> в подзапрос, например так: <placeholder-1/> Заметьте, что в результате это приведёт к блокированию всех строк в <structname>mytable</structname>, тогда как указание <literal>FOR UPDATE</literal> на верхнем уровне могло бы заблокировать только фактически возвращаемые строки. Это может значительно повлиять на производительность, особенно в сочетании <literal>ORDER BY</literal> с <literal>LIMIT</literal> или другими ограничениями. Таким образом, этот приём рекомендуется, только если ожидается параллельное изменение сортируемых столбцов, а результат должен быть строго отсортирован.

source: At the <literal>REPEATABLE READ</literal> or <literal>SERIALIZABLE</literal> transaction isolation level this would cause a serialization failure (with a <literal>SQLSTATE</literal> of <literal>'40001'</literal>), so there is no possibility of receiving rows out of order under these isolation levels.
ru: На уровнях изоляции <literal>REPEATABLE READ</literal> и <literal>SERIALIZABLE</literal> это приведёт к ошибке сериализации (с <literal>SQLSTATE</literal> равным <literal>'40001'</literal>), так что на этих уровнях получить строки не по порядку невозможно.

source: <literal>TABLE</literal> Command
ru: Команда <literal>TABLE</literal>

source: TABLE <replaceable class="parameter">name</replaceable>
ru: TABLE <replaceable class="parameter">имя</replaceable>

source: SELECT * FROM <replaceable class="parameter">name</replaceable>
ru: SELECT * FROM <replaceable class="parameter">имя</replaceable>

source: The command <placeholder-1/> is equivalent to <placeholder-2/> It can be used as a top-level command or as a space-saving syntax variant in parts of complex queries. Only the <literal>WITH</literal>, <literal>UNION</literal>, <literal>INTERSECT</literal>, <literal>EXCEPT</literal>, <literal>ORDER BY</literal>, <literal>LIMIT</literal>, <literal>OFFSET</literal>, <literal>FETCH</literal> and <literal>FOR</literal> locking clauses can be used with <command>TABLE</command>; the <literal>WHERE</literal> clause and any form of aggregation cannot be used.
ru: Команда <placeholder-1/> равнозначна <placeholder-2/> Её можно применять в качестве команды верхнего уровня или как более краткую запись внутри сложных запросов. С командой <command>TABLE</command> могут использоваться только предложения <literal>WITH</literal>, <literal>UNION</literal>, <literal>INTERSECT</literal>, <literal>EXCEPT</literal>, <literal>ORDER BY</literal>, <literal>LIMIT</literal>, <literal>OFFSET</literal>, <literal>FETCH</literal> и предложения блокировки <literal>FOR</literal>; предложение <literal>WHERE</literal> и какие-либо формы агрегирования не поддерживаются.

source: Examples
ru: Примеры

source: To join the table <literal>films</literal> with the table <literal>distributors</literal>: <placeholder-1/>
ru: Соединение таблицы <literal>films</literal> с таблицей <literal>distributors</literal>: <placeholder-1/>

source: To sum the column <literal>len</literal> of all films and group the results by <literal>kind</literal>: <placeholder-1/>
ru: Суммирование значений столбца <literal>len</literal> (продолжительность) для всех фильмов и группирование результатов по столбцу <literal>kind</literal> (типу фильма): <placeholder-1/>

source: To sum the column <literal>len</literal> of all films, group the results by <literal>kind</literal> and show those group totals that are less than 5 hours: <placeholder-1/>
ru: Суммирование значений столбца <literal>len</literal> для всех фильмов, группирование результатов по столбцу <literal>kind</literal> и вывод только тех групп, общая продолжительность которых меньше 5 часов: <placeholder-1/>

source: The following two examples are identical ways of sorting the individual results according to the contents of the second column (<literal>name</literal>): <placeholder-1/>
ru: Следующие два запроса демонстрируют равнозначные способы сортировки результатов по содержимому второго столбца (<literal>name</literal>): <placeholder-1/>

source: The next example shows how to obtain the union of the tables <literal>distributors</literal> and <literal>actors</literal>, restricting the results to those that begin with the letter W in each table. Only distinct rows are wanted, so the key word <literal>ALL</literal> is omitted. <placeholder-1/>
ru: Следующий пример показывает объединение таблиц <literal>distributors</literal> и <literal>actors</literal>, ограниченное именами, начинающимися с буквы W в каждой таблице. Интерес представляют только неповторяющиеся строки, поэтому ключевое слово <literal>ALL</literal> опущено. <placeholder-1/>

source: This example shows how to use a function in the <literal>FROM</literal> clause, both with and without a column definition list: <placeholder-1/>
ru: Этот пример показывает, как использовать функцию в предложении <literal>FROM</literal>, со списком определений столбцов и без него: <placeholder-1/>

source: Here is an example of a function with an ordinality column added: <placeholder-1/>
ru: Пример функции с добавленным столбцом нумерации: <placeholder-1/>

source: This example shows how to use a simple <literal>WITH</literal> clause: <placeholder-1/> Notice that the <literal>WITH</literal> query was evaluated only once, so that we got two sets of the same three random values.
ru: Этот пример показывает, как использовать простое предложение <literal>WITH</literal>: <placeholder-1/> Заметьте, что запрос <literal>WITH</literal> выполняется всего один раз, поэтому мы получаем два одинаковых набора по три случайных значения.

source: This example uses <literal>WITH RECURSIVE</literal> to find all subordinates (direct or indirect) of the employee Mary, and their level of indirectness, from a table that shows only direct subordinates: <placeholder-1/> Notice the typical form of recursive queries: an initial condition, followed by <literal>UNION</literal>, followed by the recursive part of the query. Be sure that the recursive part of the query will eventually return no tuples, or else the query will loop indefinitely. (See <xref linkend="queries-with"/> for more examples.)
ru: В этом примере <literal>WITH RECURSIVE</literal> применяется для поиска всех подчинённых Мери (непосредственных или косвенных) и вывода их уровня косвенности в таблице с информацией только о непосредственных подчинённых: <placeholder-1/> Заметьте, что это типичная форма рекурсивных запросов: начальное условие, последующий <literal>UNION</literal>, а затем рекурсивная часть запроса. Убедитесь в том, что рекурсивная часть запроса в конце концов перестанет возвращать строки, иначе запрос окажется в бесконечном цикле. (За другими примерами обратитесь к <xref remap="3" linkend="queries-with"/>.)

source: This example uses <literal>LATERAL</literal> to apply a set-returning function <function>get_product_names()</function> for each row of the <structname>manufacturers</structname> table: <placeholder-1/> Manufacturers not currently having any products would not appear in the result, since it is an inner join. If we wished to include the names of such manufacturers in the result, we could do: <placeholder-2/>
ru: В этом примере используется <literal>LATERAL</literal> для применения функции <function>get_product_names()</function>, возвращающей множество, для каждой строки таблицы <structname>manufacturers</structname>: <placeholder-1/> Производители, с которыми в данный момент не связаны никакие продукты, не попадут в результат, так как это внутреннее соединение. Если бы мы захотели включить названия и этих производителей, мы могли бы сделать так: <placeholder-2/>

source: Compatibility
ru: Совместимость

source: Of course, the <command>SELECT</command> statement is compatible with the SQL standard. But there are some extensions and some missing features.
ru: Разумеется, оператор <command>SELECT</command> совместим со стандартом SQL. Однако не все описанные в стандарте возможности реализованы, а некоторые, наоборот, являются расширениями.

source: Omitted <literal>FROM</literal> Clauses
ru: Необязательное предложение <literal>FROM</literal>

source: <productname>PostgreSQL</productname> allows one to omit the <literal>FROM</literal> clause. It has a straightforward use to compute the results of simple expressions: <placeholder-1/> Some other <acronym>SQL</acronym> databases cannot do this except by introducing a dummy one-row table from which to do the <command>SELECT</command>.
ru: <productname>PostgreSQL</productname> разрешает опустить предложение <literal>FROM</literal>. Это позволяет очень легко вычислять результаты простых выражений: <placeholder-1/> Некоторые другие базы данных <acronym>SQL</acronym> не допускают этого, требуя задействовать в <command>SELECT</command> фиктивную таблицу с одной строкой.

source: Note that if a <literal>FROM</literal> clause is not specified, the query cannot reference any database tables. For example, the following query is invalid: <placeholder-1/> <productname>PostgreSQL</productname> releases prior to 8.1 would accept queries of this form, and add an implicit entry to the query's <literal>FROM</literal> clause for each table referenced by the query. This is no longer allowed.
ru: Заметьте, что если предложение <literal>FROM</literal> не указано, запрос не может обращаться ни к каким таблицам базы данных. Например, следующий запрос недопустим: <placeholder-1/> До версии 8.1 <productname>PostgreSQL</productname> мог принимать запросы такого вида, неявно добавляя каждую таблицу, задействованную в запросе, в предложение <literal>FROM</literal> этого запроса. Теперь это не допускается.

source: Empty <literal>SELECT</literal> Lists
ru: Пустые списки <literal>SELECT</literal>

source: The list of output expressions after <literal>SELECT</literal> can be empty, producing a zero-column result table. This is not valid syntax according to the SQL standard. <productname>PostgreSQL</productname> allows it to be consistent with allowing zero-column tables. However, an empty list is not allowed when <literal>DISTINCT</literal> is used.
ru: Список выходных выражений после <literal>SELECT</literal> может быть пустым, что в результате даст таблицу без столбцов. Стандарт SQL не считает такой синтаксис допустимым, но <productname>PostgreSQL</productname> допускает его, так как это согласуется с возможностью иметь таблицы с нулём столбцов. Однако, когда используется <literal>DISTINCT</literal>, пустой список не допускается.

source: Omitting the <literal>AS</literal> Key Word
ru: Необязательное ключевое слово <literal>AS</literal>

source: In the SQL standard, the optional key word <literal>AS</literal> can be omitted before an output column name whenever the new column name is a valid column name (that is, not the same as any reserved keyword). <productname>PostgreSQL</productname> is slightly more restrictive: <literal>AS</literal> is required if the new column name matches any keyword at all, reserved or not. Recommended practice is to use <literal>AS</literal> or double-quote output column names, to prevent any possible conflict against future keyword additions.
ru: В стандарте SQL необязательное ключевое слово <literal>AS</literal> можно опустить перед именем выходного столбца, если это имя является допустимым именем столбца (то есть не совпадает с каким-либо зарезервированным ключевым словом). <productname>PostgreSQL</productname> несколько более строг: <literal>AS</literal> требуется, если имя столбца совпадает с любым ключевым словом, зарезервированным или нет. Тем не менее, рекомендуется использовать <literal>AS</literal> или заключать имена выходных столбцов в кавычки, во избежание конфликтов, возможных при появлении в будущем новых ключевых слов.

source: In <literal>FROM</literal> items, both the standard and <productname>PostgreSQL</productname> allow <literal>AS</literal> to be omitted before an alias that is an unreserved keyword. But this is impractical for output column names, because of syntactic ambiguities.
ru: В списке <literal>FROM</literal> и стандарт, и <productname>PostgreSQL</productname> позволяют опускать <literal>AS</literal> перед псевдонимом, который является незарезервированным ключевым словом. Но для имён выходных столбцов это не подходит из-за синтаксической неоднозначности.

source: <literal>ONLY</literal> and Inheritance
ru: <literal>ONLY</literal> и наследование

source: The SQL standard requires parentheses around the table name when writing <literal>ONLY</literal>, for example <literal>SELECT * FROM ONLY (tab1), ONLY (tab2) WHERE ...</literal>. <productname>PostgreSQL</productname> considers these parentheses to be optional.
ru: Стандарт SQL требует заключать в скобки имя таблицы после <literal>ONLY</literal>, например <literal>SELECT * FROM ONLY (tab1), ONLY (tab2) WHERE ...</literal>. <productname>PostgreSQL</productname> считает эти скобки необязательными.

source: <productname>PostgreSQL</productname> allows a trailing <literal>*</literal> to be written to explicitly specify the non-<literal>ONLY</literal> behavior of including child tables. The standard does not allow this.
ru: <productname>PostgreSQL</productname> позволяет добавлять в конце <literal>*</literal>, чтобы явно обозначить, что дочерние таблицы включаются в рассмотрение, в отличие от поведения с <literal>ONLY</literal>. Стандарт не позволяет этого.

source: (These points apply equally to all SQL commands supporting the <literal>ONLY</literal> option.)
ru: (Эти соображения в равной степени касаются всех SQL-команд, поддерживающих параметр <literal>ONLY</literal>.)

source: <literal>TABLESAMPLE</literal> Clause Restrictions
ru: Ограничения предложения <literal>TABLESAMPLE</literal>

source: The <literal>TABLESAMPLE</literal> clause is currently accepted only on regular tables and materialized views. According to the SQL standard it should be possible to apply it to any <literal>FROM</literal> item.
ru: Предложение <literal>TABLESAMPLE</literal> в настоящий момент принимается только для обычных таблиц и материализованных представлений. Однако согласно стандарту SQL оно должно применяться к любым элементам списка <literal>FROM</literal>.

source: Function Calls in <literal>FROM</literal>
ru: Вызовы функций в предложении <literal>FROM</literal>

source: <productname>PostgreSQL</productname> allows a function call to be written directly as a member of the <literal>FROM</literal> list. In the SQL standard it would be necessary to wrap such a function call in a sub-<command>SELECT</command>; that is, the syntax <literal>FROM <replaceable>func</replaceable>(...) <replaceable>alias</replaceable></literal> is approximately equivalent to <literal>FROM LATERAL (SELECT <replaceable>func</replaceable>(...)) <replaceable>alias</replaceable></literal>. Note that <literal>LATERAL</literal> is considered to be implicit; this is because the standard requires <literal>LATERAL</literal> semantics for an <literal>UNNEST()</literal> item in <literal>FROM</literal>. <productname>PostgreSQL</productname> treats <literal>UNNEST()</literal> the same as other set-returning functions.
ru: <productname>PostgreSQL</productname> позволяет записать вызов функции непосредственно в виде элемента списка <literal>FROM</literal>. В стандарте SQL такой вызов функции требуется помещать во вложенный <command>SELECT</command>; то есть, запись <literal>FROM <replaceable>функция</replaceable>(...) <replaceable>псевдоним</replaceable></literal> примерно равнозначна записи <literal>FROM LATERAL (SELECT <replaceable>функция</replaceable>(...)) <replaceable>псевдоним</replaceable></literal>. Заметьте, что указание <literal>LATERAL</literal> считается неявным; это связано с тем, что стандарт требует поведения <literal>LATERAL</literal> для элемента <literal>UNNEST()</literal> в предложении <literal>FROM</literal>. <productname>PostgreSQL</productname> обрабатывает <literal>UNNEST()</literal> так же, как и другие функции, возвращающие множества.

source: Namespace Available to <literal>GROUP BY</literal> and <literal>ORDER BY</literal>
ru: Пространства имён в <literal>GROUP BY</literal> и <literal>ORDER BY</literal>

source: In the SQL-92 standard, an <literal>ORDER BY</literal> clause can only use output column names or numbers, while a <literal>GROUP BY</literal> clause can only use expressions based on input column names. <productname>PostgreSQL</productname> extends each of these clauses to allow the other choice as well (but it uses the standard's interpretation if there is ambiguity). <productname>PostgreSQL</productname> also allows both clauses to specify arbitrary expressions. Note that names appearing in an expression will always be taken as input-column names, not as output-column names.
ru: В стандарте SQL-92 предложение <literal>ORDER BY</literal> может содержать ссылки только на выходные столбцы по именам или номерам, тогда как <literal>GROUP BY</literal> может содержать выражения с именами только входных столбцов. <productname>PostgreSQL</productname> расширяет оба эти предложения, позволяя также применять другие варианты (но если возникает неоднозначность, он разрешает её согласно стандарту). <productname>PostgreSQL</productname> также позволяет задавать произвольные выражения в обоих предложениях. Заметьте, что имена, фигурирующие в выражениях, всегда будут восприниматься как имена входных, а не выходных столбцов.

source: SQL:1999 and later use a slightly different definition which is not entirely upward compatible with SQL-92. In most cases, however, <productname>PostgreSQL</productname> will interpret an <literal>ORDER BY</literal> or <literal>GROUP BY</literal> expression the same way SQL:1999 does.
ru: В SQL:1999 и более поздних стандартах введено несколько другое определение, которое не полностью совместимо с SQL-92. Однако в большинстве случаев <productname>PostgreSQL</productname> будет интерпретировать выражение <literal>ORDER BY</literal> или <literal>GROUP BY</literal> так, как требует SQL:1999.

source: Functional Dependencies
ru: Функциональные зависимости

source: <productname>PostgreSQL</productname> recognizes functional dependency (allowing columns to be omitted from <literal>GROUP BY</literal>) only when a table's primary key is included in the <literal>GROUP BY</literal> list. The SQL standard specifies additional conditions that should be recognized.
ru: <productname>PostgreSQL</productname> распознаёт функциональную зависимость (что позволяет опускать столбцы в <literal>GROUP BY</literal>), только когда первичный ключ таблицы присутствует в списке <literal>GROUP BY</literal>. В стандарте SQL оговариваются дополнительные условия, которые следует учитывать.

source: <literal>WINDOW</literal> Clause Restrictions
ru: Ограничения предложения <literal>WINDOW</literal>

source: The SQL standard provides additional options for the window <replaceable class="parameter">frame_clause</replaceable>. <productname>PostgreSQL</productname> currently supports only the options listed above.
ru: Стандарт SQL предоставляет дополнительные возможности для указания <replaceable class="parameter">предложения_рамки</replaceable> окна. <productname>PostgreSQL</productname> в настоящее время поддерживает только варианты, описанные выше.

source: <literal>LIMIT</literal> and <literal>OFFSET</literal>
ru: <literal>LIMIT</literal> и <literal>OFFSET</literal>

source: The clauses <literal>LIMIT</literal> and <literal>OFFSET</literal> are <productname>PostgreSQL</productname>-specific syntax, also used by <productname>MySQL</productname>. The SQL:2008 standard has introduced the clauses <literal>OFFSET ... FETCH {FIRST|NEXT} ...</literal> for the same functionality, as shown above in <xref linkend="sql-limit" endterm="sql-limit-title"/>. This syntax is also used by <productname>IBM DB2</productname>. (Applications written for <productname>Oracle</productname> frequently use a workaround involving the automatically generated <literal>rownum</literal> column, which is not available in PostgreSQL, to implement the effects of these clauses.)
ru: Предложения <literal>LIMIT</literal> и <literal>OFFSET</literal> относятся к специфическим особенностям <productname>PostgreSQL</productname> и поддерживаются также в <productname>MySQL</productname>. В стандарте SQL:2008 для той же цели вводятся предложения <literal>OFFSET ... FETCH {FIRST|NEXT} ...</literal>, рассмотренные ранее в <xref remap="6" linkend="sql-limit" endterm="sql-limit-title"/>. Этот синтаксис также используется в <productname>IBM DB2</productname>. (Приложения, написанные для <productname>Oracle</productname>, часто применяют обходной способ и получают эффект этих предложений, задействуя автоматически генерируемый столбец <literal>rownum</literal>, который отсутствует в PostgreSQL.)
