Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/ref/select.po
Languages: ru

source: The optional <literal>REPEATABLE</literal> clause specifies a <replaceable class="parameter">seed</replaceable> number or expression to use for generating random numbers within the sampling method. The seed value can be any non-null floating-point value. Two queries that specify the same seed and <replaceable class="parameter">argument</replaceable> values will select the same sample of the table, if the table has not been changed meanwhile. But different seed values will usually produce different samples. If <literal>REPEATABLE</literal> is not given then a new random sample is selected for each query, based upon a system-generated seed. Note that some add-on sampling methods do not accept <literal>REPEATABLE</literal>, and will always produce new samples on each use.
ru: В необязательном предложении <literal>REPEATABLE</literal> задаётся <replaceable class="parameter">затравка</replaceable> — число или выражение, задающее отправное значение для генератора случайных чисел в методе выборки. Значением затравки может быть любое отличное от NULL число с плавающей точкой. Два запроса, в которых указаны одинаковые значения затравки и <replaceable class="parameter">аргумента</replaceable>, выдадут одну и ту же выборку таблицы при условии неизменности содержимого таблицы. Но с разными значениями затравки выборки обычно получаются разными. В отсутствие предложения <literal>REPEATABLE</literal> для каждого запроса выдаётся новая случайная выборка, в зависимости от затравки, сгенерированной системой. Заметьте, что некоторые дополнительные методы выборки не принимают предложение <literal>REPEATABLE</literal> и выдают разные выборки при каждом использовании.

source: A sub-<command>SELECT</command> can appear in the <literal>FROM</literal> clause. This acts as though its output were created as a temporary table for the duration of this single <command>SELECT</command> command. Note that the sub-<command>SELECT</command> must be surrounded by parentheses, and an alias <emphasis>must</emphasis> be provided for it. A <xref linkend="sql-values"/> command can also be used here.
ru: Предложение <literal>FROM</literal> может содержать вложенный запрос <command>SELECT</command>. Можно считать, что из его результата создаётся временная таблица на время выполнения основной команды <command>SELECT</command>. Заметьте, что вложенный запрос <command>SELECT</command> должен заключаться в скобки и для него <emphasis>должен</emphasis> задаваться псевдоним. Здесь также можно использовать команду <xref linkend="sql-values"/>.

source: A <literal>WITH</literal> query is referenced by writing its name, just as though the query's name were a table name. (In fact, the <literal>WITH</literal> query hides any real table of the same name for the purposes of the primary query. If necessary, you can refer to a real table of the same name by schema-qualifying the table's name.) An alias can be provided in the same way as for a table.
ru: На запрос <literal>WITH</literal> можно ссылаться по имени, как если бы имя запроса представляло имя таблицы. (На самом деле запрос <literal>WITH</literal> скрывает любую реальную таблицу с тем же именем для основного запроса. Если необходимо обратиться к одноимённой реальной таблице, можно дополнить имя этой таблицы именем схемы.) Для этого имени можно задать псевдоним, так же, как и для имени таблицы.

source: Function calls can appear in the <literal>FROM</literal> clause. (This is especially useful for functions that return result sets, but any function can be used.) This acts as though the function's output were created as a temporary table for the duration of this single <command>SELECT</command> command. When the optional <command>WITH ORDINALITY</command> clause is added to the function call, a new column is appended after all the function's output columns with numbering for each row.
ru: В предложении <literal>FROM</literal> могут содержаться вызовы функций. (Это особенно полезно для функций, возвращающих множества, но в принципе можно использовать любые функции.) Можно считать, что из результата функции создаётся временная таблица на время выполнения основной команды <command>SELECT</command>. Если вызов функции сопровождается необязательным предложением <command>WITH ORDINALITY</command>, после всех выдаваемых функцией столбцов в вывод добавляется ещё один столбец с номерами строк.

source: An alias can be provided in the same way as for a table. If an alias is written, a column alias list can also be written to provide substitute names for one or more attributes of the function's composite return type, including the column added by <literal>ORDINALITY</literal> if present.
ru: Псевдоним для функции можно задать так же, как и для таблицы. Если этот псевдоним задан, за ним можно также написать список псевдонимов столбцов, который определит альтернативные имена для атрибутов составного типа результата функции, включая имя столбца, который может быть добавлен предложением <literal>ORDINALITY</literal>.

source: Multiple function calls can be combined into a single <literal>FROM</literal>-clause item by surrounding them with <literal>ROWS FROM( ... )</literal>. The output of such an item is the concatenation of the first row from each function, then the second row from each function, etc. If some of the functions produce fewer rows than others, null values are substituted for the missing data, so that the total number of rows returned is always the same as for the function that produced the most rows.
ru: Несколько вызовов функций можно объединить в одном элементе предложения <literal>FROM</literal>, заключив их в конструкцию <literal>ROWS FROM( ... )</literal>. Выводом такого элемента будет соединение первых строк всех функций, затем вторых строк и т. д. Если одни функции выдают меньше строк, чем другие, недостающие данные заменяются значениями NULL, так что общее число возвращаемых строк всегда будет равняться максимальному числу строк из возвращённых всеми функциями.

source: If the function has been defined as returning the <type>record</type> data type, then an alias or the key word <literal>AS</literal> must be present, followed by a column definition list in the form <literal>( <replaceable class="parameter">column_name</replaceable> <replaceable class="parameter">data_type</replaceable> <optional>, ... </optional>)</literal>. The column definition list must match the actual number and types of columns returned by the function.
ru: Если функция определена как возвращающая тип данных <type>record</type>, для неё нужно указать псевдоним или ключевое слово <literal>AS</literal>, за которым должен идти список определений столбцов в форме <literal>( <replaceable class="parameter">имя_столбца</replaceable> <replaceable class="parameter">тип_данных</replaceable> <optional>, ... </optional>)</literal>. Список определений столбцов должен соответствовать фактическому количеству и типу столбцов, возвращаемых функцией.

source: When using the <literal>ROWS FROM( ... )</literal> syntax, if one of the functions requires a column definition list, it's preferred to put the column definition list after the function call inside <literal>ROWS FROM( ... )</literal>. A column definition list can be placed after the <literal>ROWS FROM( ... )</literal> construct only if there's just a single function and no <literal>WITH ORDINALITY</literal> clause.
ru: Если при использовании синтаксиса <literal>ROWS FROM( ... )</literal> одна из функций требует наличия списка определений столбцов, этот список лучше разместить после вызова функции внутри <literal>ROWS FROM( ... )</literal>. Список определений столбцов можно поместить после конструкции <literal>ROWS FROM( ... )</literal>, только если вызывается всего одна функция, а предложение <literal>WITH ORDINALITY</literal> отсутствует.

source: To use <literal>ORDINALITY</literal> together with a column definition list, you must use the <literal>ROWS FROM( ... )</literal> syntax and put the column definition list inside <literal>ROWS FROM( ... )</literal>.
ru: Чтобы использовать <literal>ORDINALITY</literal> со списком определений столбцов, необходимо применить запись <literal>ROWS FROM( ... )</literal> и поместить список с определениями столбцов внутрь <literal>ROWS FROM( ... )</literal>.

source: One of <placeholder-1/> For the <literal>INNER</literal> and <literal>OUTER</literal> join types, a join condition must be specified, namely exactly one of <literal>NATURAL</literal>, <literal>ON <replaceable class="parameter">join_condition</replaceable></literal>, or <literal>USING (<replaceable class="parameter">join_column</replaceable> [, ...])</literal>. See below for the meaning. For <literal>CROSS JOIN</literal>, none of these clauses can appear.
ru: Один из следующих вариантов: <placeholder-1/> Для типов соединений <literal>INNER</literal> и <literal>OUTER</literal> необходимо указать условие соединения, а именно одно из предложений <literal>NATURAL</literal>, <literal>ON <replaceable class="parameter">условие_соединения</replaceable></literal> или <literal>USING (<replaceable class="parameter">столбец_соединения</replaceable> [, ...])</literal>. Эти предложения описываются ниже. Для <literal>CROSS JOIN</literal> ни одно из этих предложений не допускается.

source: A <literal>JOIN</literal> clause combines two <literal>FROM</literal> items, which for convenience we will refer to as <quote>tables</quote>, though in reality they can be any type of <literal>FROM</literal> item. Use parentheses if necessary to determine the order of nesting. In the absence of parentheses, <literal>JOIN</literal>s nest left-to-right. In any case <literal>JOIN</literal> binds more tightly than the commas separating <literal>FROM</literal>-list items.
ru: Предложение <literal>JOIN</literal> объединяет два элемента списка <literal>FROM</literal>, которые мы для простоты дальше будем называть <quote>таблицами</quote>, хотя на самом деле это может быть любой объект, допустимый в качестве элемента <literal>FROM</literal>. Для определения порядка вложенности при необходимости следует использовать скобки. В отсутствие скобок предложения <literal>JOIN</literal> обрабатывается слева направо. В любом случае, <literal>JOIN</literal> связывает элементы сильнее, чем запятые, разделяющие элементы в списке <literal>FROM</literal>.

source: <literal>CROSS JOIN</literal> and <literal>INNER JOIN</literal> produce a simple Cartesian product, the same result as you get from listing the two tables at the top level of <literal>FROM</literal>, but restricted by the join condition (if any). <literal>CROSS JOIN</literal> is equivalent to <literal>INNER JOIN ON (TRUE)</literal>, that is, no rows are removed by qualification. These join types are just a notational convenience, since they do nothing you couldn't do with plain <literal>FROM</literal> and <literal>WHERE</literal>.
ru: <literal>CROSS JOIN</literal> и <literal>INNER JOIN</literal> формируют простое декартово произведение, то же, что можно получить, указав две таблицы на верхнем уровне <literal>FROM</literal>, но ограниченное возможным условием соединения. Предложение <literal>CROSS JOIN</literal> равнозначно <literal>INNER JOIN ON (TRUE)</literal>, то есть, никакие строки по условию не удаляются. Эти типы соединений введены исключительно для удобства записи, они не дают ничего такого, что нельзя было бы получить, используя просто <literal>FROM</literal> и <literal>WHERE</literal>.

source: <literal>LEFT OUTER JOIN</literal> returns all rows in the qualified Cartesian product (i.e., all combined rows that pass its join condition), plus one copy of each row in the left-hand table for which there was no right-hand row that passed the join condition. This left-hand row is extended to the full width of the joined table by inserting null values for the right-hand columns. Note that only the <literal>JOIN</literal> clause's own condition is considered while deciding which rows have matches. Outer conditions are applied afterwards.
ru: <literal>LEFT OUTER JOIN</literal> возвращает все строки ограниченного декартова произведения (т. е. все объединённые строки, удовлетворяющие условию соединения) плюс все строки в таблице слева, для которых не находится строк в таблице справа, удовлетворяющих условию. Строка, взятая из таблицы слева, дополняется до полной ширины объединённой таблицы значениями NULL в столбцах таблицы справа. Заметьте, что для определения, какие строки двух таблиц соответствуют друг другу, проверяется только условие самого предложения <literal>JOIN</literal>. Внешние условия проверяются позже.

source: Conversely, <literal>RIGHT OUTER JOIN</literal> returns all the joined rows, plus one row for each unmatched right-hand row (extended with nulls on the left). This is just a notational convenience, since you could convert it to a <literal>LEFT OUTER JOIN</literal> by switching the left and right tables.
ru: <literal>RIGHT OUTER JOIN</literal>, напротив, возвращает все соединённые строки плюс одну строку для каждой строки справа, не имеющей соответствия слева (эта строка дополняется значениями NULL влево). Это предложение введено исключительно для удобства записи, так как его можно легко свести к <literal>LEFT OUTER JOIN</literal>, поменяв левую и правую таблицы местами.

source: <literal>FULL OUTER JOIN</literal> returns all the joined rows, plus one row for each unmatched left-hand row (extended with nulls on the right), plus one row for each unmatched right-hand row (extended with nulls on the left).
ru: <literal>FULL OUTER JOIN</literal> возвращает все соединённые строки плюс все строки слева, не имеющие соответствия справа, (дополненные значениями NULL вправо) плюс все строки справа, не имеющие соответствия слева (дополненные значениями NULL влево).

source: <replaceable class="parameter">join_condition</replaceable> is an expression resulting in a value of type <type>boolean</type> (similar to a <literal>WHERE</literal> clause) that specifies which rows in a join are considered to match.
ru: Задаваемое <replaceable class="parameter">условие_соединения</replaceable> представляет собой выражение, выдающее значение типа <type>boolean</type> (как в предложении <literal>WHERE</literal>), которое определяет, какие строки считаются соответствующими при соединении.

source: A clause of the form <literal>USING ( a, b, ... )</literal> is shorthand for <literal>ON left_table.a = right_table.a AND left_table.b = right_table.b ...</literal>. Also, <literal>USING</literal> implies that only one of each pair of equivalent columns will be included in the join output, not both.
ru: Предложение вида <literal>USING ( a, b, ... )</literal> представляет собой сокращённую форму записи <literal>ON таблица_слева.a = таблица_справа.a AND таблица_слева.b = таблица_справа.b ...</literal>. Кроме того, <literal>USING</literal> подразумевает, что в результат соединения будет включён только один из пары равных столбцов, но не оба.

source: The <literal>LATERAL</literal> key word can precede a sub-<command>SELECT</command> <literal>FROM</literal> item. This allows the sub-<command>SELECT</command> to refer to columns of <literal>FROM</literal> items that appear before it in the <literal>FROM</literal> list. (Without <literal>LATERAL</literal>, each sub-<command>SELECT</command> is evaluated independently and so cannot cross-reference any other <literal>FROM</literal> item.)
ru: Ключевое слово <literal>LATERAL</literal> может предварять вложенный запрос <command>SELECT</command> в списке <literal>FROM</literal>. Оно позволяет обращаться в этом вложенном <command>SELECT</command> к столбцам элементов <literal>FROM</literal>, предшествующим ему в списке <literal>FROM</literal>. (Без <literal>LATERAL</literal> все вложенные подзапросы <command>SELECT</command> обрабатываются независимо и не могут ссылаться на другие элементы списка <literal>FROM</literal>.)

source: <literal>LATERAL</literal> can also precede a function-call <literal>FROM</literal> item, but in this case it is a noise word, because the function expression can refer to earlier <literal>FROM</literal> items in any case.
ru: Слово <literal>LATERAL</literal> можно также добавить перед вызовом функции в списке <literal>FROM</literal>, но в этом случае оно будет избыточным, так как выражения с функциями могут ссылаться на предыдущие элементы списка <literal>FROM</literal> в любом случае.

source: A <literal>LATERAL</literal> item can appear at top level in the <literal>FROM</literal> list, or within a <literal>JOIN</literal> tree. In the latter case it can also refer to any items that are on the left-hand side of a <literal>JOIN</literal> that it is on the right-hand side of.
ru: Элемент <literal>LATERAL</literal> может находиться на верхнем уровне списка <literal>FROM</literal> или в дереве <literal>JOIN</literal>. В последнем случае он может также ссылаться на любые элементы в левой части <literal>JOIN</literal>, справа от которого он находится.

source: When a <literal>FROM</literal> item contains <literal>LATERAL</literal> cross-references, evaluation proceeds as follows: for each row of the <literal>FROM</literal> item providing the cross-referenced column(s), or set of rows of multiple <literal>FROM</literal> items providing the columns, the <literal>LATERAL</literal> item is evaluated using that row or row set's values of the columns. The resulting row(s) are joined as usual with the rows they were computed from. This is repeated for each row or set of rows from the column source table(s).
ru: Когда элемент <literal>FROM</literal> содержит ссылки <literal>LATERAL</literal>, запрос выполняется следующим образом: сначала для строки элемента <literal>FROM</literal> с целевыми столбцами, или набора строк из нескольких элементов <literal>FROM</literal>, содержащих целевые столбцы, вычисляется элемент <literal>LATERAL</literal> со значениями этих столбцов. Затем результирующие строки обычным образом соединяются со строками, из которых они были вычислены. Эта процедура повторяется для всех строк исходных таблиц.

source: The column source table(s) must be <literal>INNER</literal> or <literal>LEFT</literal> joined to the <literal>LATERAL</literal> item, else there would not be a well-defined set of rows from which to compute each set of rows for the <literal>LATERAL</literal> item. Thus, although a construct such as <literal><replaceable>X</replaceable> RIGHT JOIN LATERAL <replaceable>Y</replaceable></literal> is syntactically valid, it is not actually allowed for <replaceable>Y</replaceable> to reference <replaceable>X</replaceable>.
ru: Таблица, служащая источником столбцов, должна быть связана с элементом <literal>LATERAL</literal> соединением <literal>INNER</literal> или <literal>LEFT</literal>, в противном случае не образуется однозначно определяемый набор строк, из которого можно будет получать наборы строк для элемента <literal>LATERAL</literal>. Таким образом, хотя конструкция <literal><replaceable>X</replaceable> RIGHT JOIN LATERAL <replaceable>Y</replaceable></literal> синтаксически правильная, <replaceable>Y</replaceable> в ней не может обращаться к <replaceable>X</replaceable>.

source: The <literal>FROM</literal> clause can contain the following elements: <placeholder-1/>
ru: Предложение <literal>FROM</literal> может содержать следующие элементы: <placeholder-1/>

source: <literal>WHERE</literal> Clause
ru: Предложение <literal>WHERE</literal>

source: The optional <literal>WHERE</literal> clause has the general form <synopsis> WHERE <replaceable class="parameter">condition</replaceable> </synopsis> where <replaceable class="parameter">condition</replaceable> is any expression that evaluates to a result of type <type>boolean</type>. Any row that does not satisfy this condition will be eliminated from the output. A row satisfies the condition if it returns true when the actual row values are substituted for any variable references.
ru: Необязательное предложение <literal>WHERE</literal> имеет общую форму <synopsis> WHERE <replaceable class="parameter">условие</replaceable> </synopsis>, где <replaceable class="parameter">условие</replaceable> — любое выражение, выдающее результат типа <type>boolean</type>. Любая строка, не удовлетворяющая этому условию, исключается из результата. Строка удовлетворяет условию, если оно возвращает true при подстановке вместо ссылок на переменные фактических значений из этой строки.

source: <literal>GROUP BY</literal> Clause
ru: Предложение <literal>GROUP BY</literal>

source: The optional <literal>GROUP BY</literal> clause has the general form <synopsis> GROUP BY <replaceable class="parameter">grouping_element</replaceable> [, ...] </synopsis>
ru: Необязательное предложение <literal>GROUP BY</literal> имеет общую форму <synopsis> GROUP BY <replaceable class="parameter">элемент_группирования</replaceable> [, ...] </synopsis>

source: <literal>GROUP BY</literal> will condense into a single row all selected rows that share the same values for the grouped expressions. An <replaceable class="parameter">expression</replaceable> used inside a <replaceable class="parameter">grouping_element</replaceable> can be an input column name, or the name or ordinal number of an output column (<command>SELECT</command> list item), or an arbitrary expression formed from input-column values. In case of ambiguity, a <literal>GROUP BY</literal> name will be interpreted as an input-column name rather than an output column name.
ru: <literal>GROUP BY</literal> собирает в одну строку все выбранные строки, выдающие одинаковые значения для выражений группировки. В качестве <replaceable class="parameter">выражения</replaceable> внутри <replaceable class="parameter">элемента_группирования</replaceable> может выступать имя входного столбца, либо имя или порядковый номер выходного столбца (из списка элементов <command>SELECT</command>), либо произвольное значение, вычисляемое по значениям входных столбцов. В случае неоднозначности имя в <literal>GROUP BY</literal> будет восприниматься как имя входного, а не выходного столбца.

source: If any of <literal>GROUPING SETS</literal>, <literal>ROLLUP</literal> or <literal>CUBE</literal> are present as grouping elements, then the <literal>GROUP BY</literal> clause as a whole defines some number of independent <replaceable>grouping sets</replaceable>. The effect of this is equivalent to constructing a <literal>UNION ALL</literal> between subqueries with the individual grouping sets as their <literal>GROUP BY</literal> clauses. For further details on the handling of grouping sets see <xref linkend="queries-grouping-sets"/>.
ru: Если в элементе группирования задаётся <literal>GROUPING SETS</literal>, <literal>ROLLUP</literal> или <literal>CUBE</literal>, предложение <literal>GROUP BY</literal> в целом определяет некоторое число независимых <replaceable>наборов группирования</replaceable>. Это даёт тот же эффект, что и объединение подзапросов (с <literal>UNION ALL</literal>) с отдельными наборами группирования в их предложениях <literal>GROUP BY</literal>. Подробнее использование наборов группирования описывается в <xref remap="6" linkend="queries-grouping-sets"/>.
