Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/ref/select.po
Languages: ru

source: Although <literal>FOR UPDATE</literal> appears in the SQL standard, the standard allows it only as an option of <command>DECLARE CURSOR</command>. <productname>PostgreSQL</productname> allows it in any <command>SELECT</command> query as well as in sub-<command>SELECT</command>s, but this is an extension. The <literal>FOR NO KEY UPDATE</literal>, <literal>FOR SHARE</literal> and <literal>FOR KEY SHARE</literal> variants, as well as the <literal>NOWAIT</literal> and <literal>SKIP LOCKED</literal> options, do not appear in the standard.
ru: Хотя указание <literal>FOR UPDATE</literal> есть в стандарте SQL, стандарт позволяет использовать его только в предложении <command>DECLARE CURSOR</command>. <productname>PostgreSQL</productname> допускает его использование в любом запросе <command>SELECT</command>, а также в подзапросах <command>SELECT</command>, но это является расширением. Варианты <literal>FOR NO KEY UPDATE</literal>, <literal>FOR SHARE</literal> и <literal>FOR KEY SHARE</literal>, а также указания <literal>NOWAIT</literal> и <literal>SKIP LOCKED</literal> в стандарте отсутствуют.

source: Data-Modifying Statements in <literal>WITH</literal>
ru: Изменение данных в <literal>WITH</literal>

source: <productname>PostgreSQL</productname> allows <command>INSERT</command>, <command>UPDATE</command>, and <command>DELETE</command> to be used as <literal>WITH</literal> queries. This is not found in the SQL standard.
ru: <productname>PostgreSQL</productname> разрешает использовать <command>INSERT</command>, <command>UPDATE</command> и <command>DELETE</command> в качестве запросов <literal>WITH</literal>. Стандарт SQL этого не предусматривает.

source: Nonstandard Clauses
ru: Нестандартные предложения

source: <literal>DISTINCT ON ( ... )</literal> is an extension of the SQL standard.
ru: <literal>DISTINCT ON ( ... )</literal> — расширение стандарта SQL.

source: <literal>ROWS FROM( ... )</literal> is an extension of the SQL standard.
ru: <literal>ROWS FROM( ... )</literal> — расширение стандарта SQL.
