Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/ref/select.po
Languages: ru

source: Aggregate functions, if any are used, are computed across all rows making up each group, producing a separate value for each group. (If there are aggregate functions but no <literal>GROUP BY</literal> clause, the query is treated as having a single group comprising all the selected rows.) The set of rows fed to each aggregate function can be further filtered by attaching a <literal>FILTER</literal> clause to the aggregate function call; see <xref linkend="syntax-aggregates"/> for more information. When a <literal>FILTER</literal> clause is present, only those rows matching it are included in the input to that aggregate function.
ru: Агрегатные функции, если они используются, вычисляются по всем строкам, составляющим каждую группу, и в итоге выдают отдельное значение для каждой группы. (Если агрегатные функции используются без предложения <literal>GROUP BY</literal>, запрос выполняется как с одной группой, включающей все выбранные строки.) Набор строк, поступающих в каждую агрегатную функцию, можно дополнительно отфильтровать, добавив предложение <literal>FILTER</literal> к вызову агрегатной функции; за дополнительными сведениями обратитесь к <xref remap="3" linkend="syntax-aggregates"/>. С предложением <literal>FILTER</literal> на вход агрегатной функции поступают только те строки, которые соответствуют заданному фильтру.

source: When <literal>GROUP BY</literal> is present, or any aggregate functions are present, it is not valid for the <command>SELECT</command> list expressions to refer to ungrouped columns except within aggregate functions or when the ungrouped column is functionally dependent on the grouped columns, since there would otherwise be more than one possible value to return for an ungrouped column. A functional dependency exists if the grouped columns (or a subset thereof) are the primary key of the table containing the ungrouped column.
ru: Когда в запросе присутствует предложение <literal>GROUP BY</literal> или какая-либо агрегатная функция, выражения в списке <command>SELECT</command> не могут обращаться к негруппируемым столбцам, кроме как в агрегатных функциях или в случае функциональной зависимости, так как иначе в негруппируемом столбце нужно было бы вернуть более одного возможного значения. Функциональная зависимость образуется, если группируемые столбцы (или их подмножество) составляют первичный ключ таблицы, содержащей негруппируемый столбец.

source: Keep in mind that all aggregate functions are evaluated before evaluating any <quote>scalar</quote> expressions in the <literal>HAVING</literal> clause or <literal>SELECT</literal> list. This means that, for example, a <literal>CASE</literal> expression cannot be used to skip evaluation of an aggregate function; see <xref linkend="syntax-express-eval"/>.
ru: Имейте в виду, что все агрегатные функции вычисляются перед <quote>скалярными</quote> выражениями в предложении <literal>HAVING</literal> или списке <literal>SELECT</literal>. Это значит, что например, с помощью выражения <literal>CASE</literal> нельзя обойти вычисление агрегатной функции; см. <xref remap="4" linkend="syntax-express-eval"/>.

source: Currently, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> and <literal>FOR KEY SHARE</literal> cannot be specified with <literal>GROUP BY</literal>.
ru: В настоящее время указания <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> и <literal>FOR KEY SHARE</literal> нельзя задать вместе с <literal>GROUP BY</literal>.

source: <literal>HAVING</literal> Clause
ru: Предложение <literal>HAVING</literal>

source: The optional <literal>HAVING</literal> clause has the general form <synopsis> HAVING <replaceable class="parameter">condition</replaceable> </synopsis> where <replaceable class="parameter">condition</replaceable> is the same as specified for the <literal>WHERE</literal> clause.
ru: Необязательное предложение <literal>HAVING</literal> имеет общую форму <synopsis> HAVING <replaceable class="parameter">условие</replaceable> </synopsis> Здесь <replaceable class="parameter">условие</replaceable> задаётся так же, как и для предложения <literal>WHERE</literal>.

source: <literal>HAVING</literal> eliminates group rows that do not satisfy the condition. <literal>HAVING</literal> is different from <literal>WHERE</literal>: <literal>WHERE</literal> filters individual rows before the application of <literal>GROUP BY</literal>, while <literal>HAVING</literal> filters group rows created by <literal>GROUP BY</literal>. Each column referenced in <replaceable class="parameter">condition</replaceable> must unambiguously reference a grouping column, unless the reference appears within an aggregate function or the ungrouped column is functionally dependent on the grouping columns.
ru: <literal>HAVING</literal> исключает из результата строки групп, не удовлетворяющих условию. <literal>HAVING</literal> отличается от <literal>WHERE</literal>: <literal>WHERE</literal> фильтрует отдельные строки до применения <literal>GROUP BY</literal>, а <literal>HAVING</literal> фильтрует строки групп, созданных предложением <literal>GROUP BY</literal>. Каждый столбец, фигурирующий в <replaceable class="parameter">условии</replaceable>, должен однозначно ссылаться на группируемый столбец, за исключением случаев, когда эта ссылка находится внутри агрегатной функции или негруппируемый столбец функционально зависит от группируемых.

source: The presence of <literal>HAVING</literal> turns a query into a grouped query even if there is no <literal>GROUP BY</literal> clause. This is the same as what happens when the query contains aggregate functions but no <literal>GROUP BY</literal> clause. All the selected rows are considered to form a single group, and the <command>SELECT</command> list and <literal>HAVING</literal> clause can only reference table columns from within aggregate functions. Such a query will emit a single row if the <literal>HAVING</literal> condition is true, zero rows if it is not true.
ru: В присутствие <literal>HAVING</literal> запрос превращается в группируемый, даже если <literal>GROUP BY</literal> отсутствует. То же самое происходит, когда запрос содержит агрегатные функции, но не предложение <literal>GROUP BY</literal>. Все выбранные строки считаются формирующими одну группу, а в списке <command>SELECT</command> и предложении <literal>HAVING</literal> можно обращаться к столбцам таблицы только из агрегатных функций. Такой запрос будет выдавать единственную строку, если результат условия <literal>HAVING</literal> — true, и ноль строк в противном случае.

source: Currently, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> and <literal>FOR KEY SHARE</literal> cannot be specified with <literal>HAVING</literal>.
ru: В настоящее время указания <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> и <literal>FOR KEY SHARE</literal> нельзя задать вместе с <literal>HAVING</literal>.

source: <literal>WINDOW</literal> Clause
ru: Предложение <literal>WINDOW</literal>

source: The optional <literal>WINDOW</literal> clause has the general form <synopsis> WINDOW <replaceable class="parameter">window_name</replaceable> AS ( <replaceable class="parameter">window_definition</replaceable> ) [, ...] </synopsis> where <replaceable class="parameter">window_name</replaceable> is a name that can be referenced from <literal>OVER</literal> clauses or subsequent window definitions, and <replaceable class="parameter">window_definition</replaceable> is <synopsis> [ <replaceable class="parameter">existing_window_name</replaceable> ] [ PARTITION BY <replaceable class="parameter">expression</replaceable> [, ...] ] [ ORDER BY <replaceable class="parameter">expression</replaceable> [ ASC | DESC | USING <replaceable class="parameter">operator</replaceable> ] [ NULLS { FIRST | LAST } ] [, ...] ] [ <replaceable class="parameter">frame_clause</replaceable> ] </synopsis>
ru: Необязательное предложение <literal>WINDOW</literal> имеет общую форму <synopsis> WINDOW <replaceable class="parameter">имя_окна</replaceable> AS ( <replaceable class="parameter">определение_окна</replaceable> ) [, ...] </synopsis> Здесь <replaceable class="parameter">имя_окна</replaceable> — это имя, на которое можно ссылаться из предложений <literal>OVER</literal> или последующих определений окон, а <replaceable class="parameter">определение_окна</replaceable> имеет следующий вид: <synopsis> [ <replaceable class="parameter">имя_существующего_окна</replaceable> ] [ PARTITION BY <replaceable class="parameter">выражение</replaceable> [, ...] ] [ ORDER BY <replaceable class="parameter">выражение</replaceable> [ ASC | DESC | USING <replaceable class="parameter">оператор</replaceable> ] [ NULLS { FIRST | LAST } ] [, ...] ] [ <replaceable class="parameter">предложение_рамки</replaceable> ] </synopsis>

source: If an <replaceable class="parameter">existing_window_name</replaceable> is specified it must refer to an earlier entry in the <literal>WINDOW</literal> list; the new window copies its partitioning clause from that entry, as well as its ordering clause if any. In this case the new window cannot specify its own <literal>PARTITION BY</literal> clause, and it can specify <literal>ORDER BY</literal> only if the copied window does not have one. The new window always uses its own frame clause; the copied window must not specify a frame clause.
ru: Если указано <replaceable class="parameter">имя_существующего_окна</replaceable>, оно должно ссылаться на предшествующую запись в списке <literal>WINDOW</literal>; новое окно копирует предложение разбиения из этой записи, а также предложение сортировки, если оно присутствует. В этом случае для нового окна нельзя задать собственное предложение <literal>PARTITION BY</literal>, а <literal>ORDER BY</literal> можно указать, только если его не было у копируемого окна. Новое окно всегда использует собственное предложение рамки; в копируемом окне оно задаваться не должно.

source: The elements of the <literal>PARTITION BY</literal> list are interpreted in much the same fashion as elements of a <xref linkend="sql-groupby" endterm="sql-groupby-title"/>, except that they are always simple expressions and never the name or number of an output column. Another difference is that these expressions can contain aggregate function calls, which are not allowed in a regular <literal>GROUP BY</literal> clause. They are allowed here because windowing occurs after grouping and aggregation.
ru: Элементы списка <literal>PARTITION BY</literal> интерпретируется во многом так же, как и элементы <xref remap="2" linkend="sql-groupby" endterm="sql-groupby-title"/>, за исключением того, что это всегда простые выражения, но не имя или номер выходного столбца. Другое различие состоит в том, что эти выражения могут содержать вызовы агрегатных функций, которые не допускаются в обычном предложении <literal>GROUP BY</literal>. Здесь они допускаются потому, что формирование окна происходит после группировки и агрегирования.

source: Similarly, the elements of the <literal>ORDER BY</literal> list are interpreted in much the same fashion as elements of an <xref linkend="sql-orderby" endterm="sql-orderby-title"/>, except that the expressions are always taken as simple expressions and never the name or number of an output column.
ru: Подобным образом, элементы списка <literal>ORDER BY</literal> интерпретируются во многом так же, как и элементы <xref remap="2" linkend="sql-orderby" endterm="sql-orderby-title"/>, за исключением того, что выражения в нём всегда принимаются как простые выражения, но не как имя или номер выходного столбца.

source: The optional <replaceable class="parameter">frame_clause</replaceable> defines the <firstterm>window frame</firstterm> for window functions that depend on the frame (not all do). The window frame is a set of related rows for each row of the query (called the <firstterm>current row</firstterm>). The <replaceable class="parameter">frame_clause</replaceable> can be one of <synopsis> { RANGE | ROWS } <replaceable>frame_start</replaceable> { RANGE | ROWS } BETWEEN <replaceable>frame_start</replaceable> AND <replaceable>frame_end</replaceable> </synopsis> where <replaceable>frame_start</replaceable> and <replaceable>frame_end</replaceable> can be one of <synopsis> UNBOUNDED PRECEDING <replaceable>value</replaceable> PRECEDING CURRENT ROW <replaceable>value</replaceable> FOLLOWING UNBOUNDED FOLLOWING </synopsis> If <replaceable>frame_end</replaceable> is omitted it defaults to <literal>CURRENT ROW</literal>. Restrictions are that <replaceable>frame_start</replaceable> cannot be <literal>UNBOUNDED FOLLOWING</literal>, <replaceable>frame_end</replaceable> cannot be <literal>UNBOUNDED PRECEDING</literal>, and the <replaceable>frame_end</replaceable> choice cannot appear earlier in the above list than the <replaceable>frame_start</replaceable> choice &mdash; for example <literal>RANGE BETWEEN CURRENT ROW AND <replaceable>value</replaceable> PRECEDING</literal> is not allowed.
ru: Необязательное <replaceable class="parameter">предложение_рамки</replaceable> определяет <firstterm>рамку окна</firstterm> для оконных функций, которые зависят от рамки (не все функции таковы). Рамка окна — это набор связанных строк для каждой строки запроса (называемой <firstterm>текущей строкой</firstterm>). В качестве <replaceable class="parameter">предложения_рамки</replaceable> может задаваться <synopsis> { RANGE | ROWS } <replaceable>начало_рамки</replaceable> { RANGE | ROWS } BETWEEN <replaceable>начало_рамки</replaceable> AND <replaceable>конец_рамки</replaceable> </synopsis> Здесь <replaceable>начало_рамки</replaceable> и <replaceable>конец_рамки</replaceable> может задаваться как <synopsis> UNBOUNDED PRECEDING <replaceable>значение</replaceable> PRECEDING CURRENT ROW <replaceable>значение</replaceable> FOLLOWING UNBOUNDED FOLLOWING </synopsis> Если <replaceable>конец_рамки</replaceable> опущен, по умолчанию подразумевается <literal>CURRENT ROW</literal>. В качестве <replaceable>начала_рамки</replaceable> нельзя задать <literal>UNBOUNDED FOLLOWING</literal>, а в качестве <replaceable>конца_рамки</replaceable> — <literal>UNBOUNDED PRECEDING</literal>, к тому же выбранный вариант <replaceable>конца_рамки</replaceable> не может стоять в приведённом списке выше варианта <replaceable>начала_рамки</replaceable> &mdash; например, комбинация <literal>RANGE BETWEEN CURRENT ROW AND <replaceable>значение</replaceable> PRECEDING</literal> не допускается.

source: The default framing option is <literal>RANGE UNBOUNDED PRECEDING</literal>, which is the same as <literal>RANGE BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW</literal>; it sets the frame to be all rows from the partition start up through the current row's last peer (a row that <literal>ORDER BY</literal> considers equivalent to the current row, or all rows if there is no <literal>ORDER BY</literal>). In general, <literal>UNBOUNDED PRECEDING</literal> means that the frame starts with the first row of the partition, and similarly <literal>UNBOUNDED FOLLOWING</literal> means that the frame ends with the last row of the partition (regardless of <literal>RANGE</literal> or <literal>ROWS</literal> mode). In <literal>ROWS</literal> mode, <literal>CURRENT ROW</literal> means that the frame starts or ends with the current row; but in <literal>RANGE</literal> mode it means that the frame starts or ends with the current row's first or last peer in the <literal>ORDER BY</literal> ordering. The <replaceable>value</replaceable> <literal>PRECEDING</literal> and <replaceable>value</replaceable> <literal>FOLLOWING</literal> cases are currently only allowed in <literal>ROWS</literal> mode. They indicate that the frame starts or ends with the row that many rows before or after the current row. <replaceable>value</replaceable> must be an integer expression not containing any variables, aggregate functions, or window functions. The value must not be null or negative; but it can be zero, which selects the current row itself.
ru: По умолчанию рамка образуется предложением <literal>RANGE UNBOUNDED PRECEDING</literal>, что по сути то же, что <literal>RANGE BETWEEN UNBOUNDED PRECEDING AND CURRENT ROW</literal>; оно устанавливает рамку так, что она включает все строки от начала раздела до последней строки, родственной текущей (строки, которую <literal>ORDER BY</literal> считает равной текущей), либо все строки раздела, если <literal>ORDER BY</literal> отсутствует. Вообще <literal>UNBOUNDED PRECEDING</literal> означает, что рамка начинается с первой строки раздела, а <literal>UNBOUNDED FOLLOWING</literal> означает, что рамка заканчивается на последней строке раздела (вне зависимости от режима <literal>RANGE</literal> или <literal>ROWS</literal>). В режиме <literal>ROWS</literal> указание <literal>CURRENT ROW</literal> означает, что рамка начинается или заканчивается текущей строкой; но в режиме <literal>RANGE</literal> оно означает, что рамка начинается или заканчивается первой или последней строкой, родственной текущей, согласно порядку <literal>ORDER BY</literal>. Варианты <replaceable>значение</replaceable> <literal>PRECEDING</literal> и <replaceable>значение</replaceable> <literal>FOLLOWING</literal> в настоящее время допускаются только в режиме <literal>ROWS</literal>. Они показывают, что рамка начинается или заканчивается со сдвигом на заданное количество строк назад или вперёд от текущей. Здесь <replaceable>значение</replaceable> должно быть целочисленным выражением, не содержащим никакие переменные, агрегатные или оконные функции. Это значение не может быть отрицательным или равным NULL, но может быть равно 0 (при этом выбирается текущая строка).

source: Beware that the <literal>ROWS</literal> options can produce unpredictable results if the <literal>ORDER BY</literal> ordering does not order the rows uniquely. The <literal>RANGE</literal> options are designed to ensure that rows that are peers in the <literal>ORDER BY</literal> ordering are treated alike; all peer rows will be in the same frame.
ru: Учтите, что варианты <literal>ROWS</literal> могут выдавать непредсказуемые результаты, если согласно порядку, заданному в <literal>ORDER BY</literal>, строки сортируются неоднозначно. Варианты <literal>RANGE</literal> предусмотрены для того, чтобы строки, являющиеся родственными в порядке <literal>ORDER BY</literal>, обрабатывались одинаково; все родственные строки будут находиться в одной рамке.

source: The purpose of a <literal>WINDOW</literal> clause is to specify the behavior of <firstterm>window functions</firstterm> appearing in the query's <xref linkend="sql-select-list" endterm="sql-select-list-title"/> or <xref linkend="sql-orderby" endterm="sql-orderby-title"/>. These functions can reference the <literal>WINDOW</literal> clause entries by name in their <literal>OVER</literal> clauses. A <literal>WINDOW</literal> clause entry does not have to be referenced anywhere, however; if it is not used in the query it is simply ignored. It is possible to use window functions without any <literal>WINDOW</literal> clause at all, since a window function call can specify its window definition directly in its <literal>OVER</literal> clause. However, the <literal>WINDOW</literal> clause saves typing when the same window definition is needed for more than one window function.
ru: Предложение <literal>WINDOW</literal> применяется для управления поведением <firstterm>оконных функций</firstterm>, фигурирующих в запросе, в <xref remap="6" linkend="sql-select-list" endterm="sql-select-list-title"/> или <xref remap="6" linkend="sql-orderby" endterm="sql-orderby-title"/>. Эти функции могут обращаться к элементам <literal>WINDOW</literal> по именам в своих предложениях <literal>OVER</literal>. При этом элементы <literal>WINDOW</literal> не обязательно задействовать в запросе; если они не используются, они просто игнорируются. Оконные функции можно использовать вовсе без элементов <literal>WINDOW</literal>, так как в вызове оконной функции можно задать определение окна непосредственно в предложении <literal>OVER</literal>. Однако предложение <literal>WINDOW</literal> позволяет сократить текст запроса, когда одно и то же определение окна применяется при вызове нескольких оконных функций.

source: Currently, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> and <literal>FOR KEY SHARE</literal> cannot be specified with <literal>WINDOW</literal>.
ru: В настоящее время указания <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> и <literal>FOR KEY SHARE</literal> нельзя задать вместе с <literal>WINDOW</literal>.

source: Window functions are described in detail in <xref linkend="tutorial-window"/>, <xref linkend="syntax-window-functions"/>, and <xref linkend="queries-window"/>.
ru: Оконные функции подробно описываются в <xref remap="6" linkend="tutorial-window"/>, <xref remap="6" linkend="syntax-window-functions"/> и <xref remap="6" linkend="queries-window"/>.

source: <command>SELECT</command> List
ru: Список <command>SELECT</command>

source: The <command>SELECT</command> list (between the key words <literal>SELECT</literal> and <literal>FROM</literal>) specifies expressions that form the output rows of the <command>SELECT</command> statement. The expressions can (and usually do) refer to columns computed in the <literal>FROM</literal> clause.
ru: Список <command>SELECT</command> (между ключевыми словами <literal>SELECT</literal> и <literal>FROM</literal>) содержит выражения, которые формируют выходные строки оператора <command>SELECT</command>. Эти выражения могут обращаться (и обычно обращаются) к столбцам, вычисленным в предложении <literal>FROM</literal>.
