Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/ref/select.po
Languages: ru

source: Just as in a table, every output column of a <command>SELECT</command> has a name. In a simple <command>SELECT</command> this name is just used to label the column for display, but when the <command>SELECT</command> is a sub-query of a larger query, the name is seen by the larger query as the column name of the virtual table produced by the sub-query. To specify the name to use for an output column, write <literal>AS</literal> <replaceable class="parameter">output_name</replaceable> after the column's expression. (You can omit <literal>AS</literal>, but only if the desired output name does not match any <productname>PostgreSQL</productname> keyword (see <xref linkend="sql-keywords-appendix"/>). For protection against possible future keyword additions, it is recommended that you always either write <literal>AS</literal> or double-quote the output name.) If you do not specify a column name, a name is chosen automatically by <productname>PostgreSQL</productname>. If the column's expression is a simple column reference then the chosen name is the same as that column's name. In more complex cases a function or type name may be used, or the system may fall back on a generated name such as <literal>?column?</literal>.
ru: Так же, как в таблице, каждый выходной столбец <command>SELECT</command> имеет имя. В простом предложении <command>SELECT</command> это имя просто помечает столбец при выводе, но когда <command>SELECT</command> представляет собой подзапрос большого запроса, это имя большой запрос видит как имя столбца виртуальной таблицы, созданной подзапросом. Чтобы задать имя для выходного столбца, нужно написать <literal>AS</literal> <replaceable class="parameter">выходное_имя</replaceable> после выражения столбца. (Слово <literal>AS</literal> можно опустить, но только если желаемое выходное имя не совпадает с каким-либо ключевым словом <productname>PostgreSQL</productname> (см. <xref remap="4" linkend="sql-keywords-appendix"/>). Чтобы не зависеть от появления новых ключевых слов в будущем, рекомендуется всегда писать <literal>AS</literal>, либо заключать имя в двойные кавычки.) Если имя столбца не задать, <productname>PostgreSQL</productname> выберет его автоматически. Если выражение столбца представляет собой просто ссылку на столбец, то выбранное таким образом имя будет совпадать с именем столбца. В более сложных случаях может использоваться имя функции или типа, либо в отсутствие других вариантов система может сгенерировать имя вроде <literal>?column?</literal>.

source: An output column's name can be used to refer to the column's value in <literal>ORDER BY</literal> and <literal>GROUP BY</literal> clauses, but not in the <literal>WHERE</literal> or <literal>HAVING</literal> clauses; there you must write out the expression instead.
ru: По имени выходного столбца можно обратиться к его значению в предложениях <literal>ORDER BY</literal> и <literal>GROUP BY</literal>, но не в <literal>WHERE</literal> или <literal>HAVING</literal>; в них вместо имени надо записывать всё выражение.

source: Instead of an expression, <literal>*</literal> can be written in the output list as a shorthand for all the columns of the selected rows. Also, you can write <literal><replaceable class="parameter">table_name</replaceable>.*</literal> as a shorthand for the columns coming from just that table. In these cases it is not possible to specify new names with <literal>AS</literal>; the output column names will be the same as the table columns' names.
ru: Вместо выражения в выходном списке можно указать <literal>*</literal>, что будет обозначать все столбцы выбранных строк. Кроме того, можно записать <literal><replaceable class="parameter">имя_таблицы</replaceable>.*</literal> как краткое обозначение всех столбцов, получаемых из данной таблицы. В этих случаях нельзя задать новые имена столбцов с помощью <literal>AS</literal>; именами выходных столбцов будут имена столбцов в таблице.

source: According to the SQL standard, the expressions in the output list should be computed before applying <literal>DISTINCT</literal>, <literal>ORDER BY</literal>, or <literal>LIMIT</literal>. This is obviously necessary when using <literal>DISTINCT</literal>, since otherwise it's not clear what values are being made distinct. However, in many cases it is convenient if output expressions are computed after <literal>ORDER BY</literal> and <literal>LIMIT</literal>; particularly if the output list contains any volatile or expensive functions. With that behavior, the order of function evaluations is more intuitive and there will not be evaluations corresponding to rows that never appear in the output. <productname>PostgreSQL</productname> will effectively evaluate output expressions after sorting and limiting, so long as those expressions are not referenced in <literal>DISTINCT</literal>, <literal>ORDER BY</literal> or <literal>GROUP BY</literal>. (As a counterexample, <literal>SELECT f(x) FROM tab ORDER BY 1</literal> clearly must evaluate <function>f(x)</function> before sorting.) Output expressions that contain set-returning functions are effectively evaluated after sorting and before limiting, so that <literal>LIMIT</literal> will act to cut off the output from a set-returning function.
ru: Согласно стандарту SQL, выражения в выходном списке должны вычисляться до применения <literal>DISTINCT</literal>, <literal>ORDER BY</literal> или <literal>LIMIT</literal>. Это, очевидно, необходимо для <literal>DISTINCT</literal>, так как иначе не будет ясно, какие значения должны выдаваться как уникальные. Однако во многих случаях выходные выражения удобнее вычислять после <literal>ORDER BY</literal> и <literal>LIMIT</literal>; в частности, если в выходном списке содержатся изменчивые или дорогостоящие функции. В этом случае порядок вычисления функций оказывается более интуитивным, а для строк, которые не попадут в результат, не будут производиться вычисления. <productname>PostgreSQL</productname> фактически будет вычислять выходные выражения после сортировки и ограничения их количества, если эти выражения не фигурируют в <literal>DISTINCT</literal>, <literal>ORDER BY</literal> или <literal>GROUP BY</literal>. (Например, в запросе <literal>SELECT f(x) FROM tab ORDER BY 1</literal> функция <function>f(x)</function>, несомненно, должна вычисляться перед сортировкой.) Выходные выражения, содержащие функции, возвращающие множества, фактически вычисляются после сортировки и до ограничения количества строк, так что <literal>LIMIT</literal> будет отбрасывать строки, выдаваемые функцией, возвращающей множество.

source: <productname>PostgreSQL</productname> versions before 9.6 did not provide any guarantees about the timing of evaluation of output expressions versus sorting and limiting; it depended on the form of the chosen query plan.
ru: В <productname>PostgreSQL</productname> до версии 9.6 никакой порядок вычисления выходных выражений по отношению к сортировке или ограничениям количества не гарантировался; он зависел от формы выбранного плана запроса.

source: <literal>DISTINCT</literal> Clause
ru: Предложение <literal>DISTINCT</literal>

source: If <literal>SELECT DISTINCT</literal> is specified, all duplicate rows are removed from the result set (one row is kept from each group of duplicates). <literal>SELECT ALL</literal> specifies the opposite: all rows are kept; that is the default.
ru: Если указано <literal>SELECT DISTINCT</literal>, все повторяющиеся строки исключаются из результирующего набора (из каждой группы дубликатов остаётся одна строка). <literal>SELECT ALL</literal> делает противоположное: сохраняет все строки; это поведение по умолчанию.

source: <literal>SELECT DISTINCT ON ( <replaceable class="parameter">expression</replaceable> [, ...] )</literal> keeps only the first row of each set of rows where the given expressions evaluate to equal. The <literal>DISTINCT ON</literal> expressions are interpreted using the same rules as for <literal>ORDER BY</literal> (see above). Note that the <quote>first row</quote> of each set is unpredictable unless <literal>ORDER BY</literal> is used to ensure that the desired row appears first. For example: <placeholder-1/> retrieves the most recent weather report for each location. But if we had not used <literal>ORDER BY</literal> to force descending order of time values for each location, we'd have gotten a report from an unpredictable time for each location.
ru: <literal>SELECT DISTINCT ON ( <replaceable class="parameter">выражение</replaceable> [, ...] )</literal> сохраняет только первую строку из каждого набора строк, для которого данное выражение даёт одинаковые значения. Выражения <literal>DISTINCT ON</literal> обрабатываются по тем же правилам, что и выражения <literal>ORDER BY</literal> (см. выше). Заметьте, что <quote>первая строка</quote> каждого набора непредсказуема, если только не применяется предложение <literal>ORDER BY</literal>, определяющее, какие строки должны быть первыми. Например: <placeholder-1/> возвращает самую последнюю сводку погоды для каждого местоположения. Но если бы мы не добавили <literal>ORDER BY</literal>, чтобы значения времени убывали, мы бы получили сводки по местоположениям от непредсказуемого времени.

source: The <literal>DISTINCT ON</literal> expression(s) must match the leftmost <literal>ORDER BY</literal> expression(s). The <literal>ORDER BY</literal> clause will normally contain additional expression(s) that determine the desired precedence of rows within each <literal>DISTINCT ON</literal> group.
ru: Выражения <literal>DISTINCT ON</literal> должны соответствовать самым левым выражениям в <literal>ORDER BY</literal>. Предложение <literal>ORDER BY</literal> обычно содержит и другие выражения, которые определяют желаемый порядок строк в каждой группе <literal>DISTINCT ON</literal>.

source: Currently, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> and <literal>FOR KEY SHARE</literal> cannot be specified with <literal>DISTINCT</literal>.
ru: В настоящее время указания <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> и <literal>FOR KEY SHARE</literal> нельзя задать вместе с <literal>DISTINCT</literal>.

source: <literal>UNION</literal> Clause
ru: Предложение <literal>UNION</literal>+

source: The <literal>UNION</literal> clause has this general form: <synopsis> <replaceable class="parameter">select_statement</replaceable> UNION [ ALL | DISTINCT ] <replaceable class="parameter">select_statement</replaceable> </synopsis><replaceable class="parameter">select_statement</replaceable> is any <command>SELECT</command> statement without an <literal>ORDER BY</literal>, <literal>LIMIT</literal>, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal>, or <literal>FOR KEY SHARE</literal> clause. (<literal>ORDER BY</literal> and <literal>LIMIT</literal> can be attached to a subexpression if it is enclosed in parentheses. Without parentheses, these clauses will be taken to apply to the result of the <literal>UNION</literal>, not to its right-hand input expression.)
ru: Предложение <literal>UNION</literal> имеет следующую общую форму: <synopsis> <replaceable class="parameter">оператор_SELECT</replaceable> UNION [ ALL | DISTINCT ] <replaceable class="parameter">оператор_SELECT</replaceable> </synopsis> Здесь <replaceable class="parameter">оператор_SELECT</replaceable> — это любой подзапрос <command>SELECT</command> без предложений <literal>ORDER BY</literal>, <literal>LIMIT</literal>, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> и <literal>FOR KEY SHARE</literal>. (<literal>ORDER BY</literal> и <literal>LIMIT</literal> можно добавить к вложенному выражению, если оно заключено в скобки. Без скобок эти предложения будут восприняты как применяемые к результату <literal>UNION</literal>, а не к выражению в его правой части.)

source: The <literal>UNION</literal> operator computes the set union of the rows returned by the involved <command>SELECT</command> statements. A row is in the set union of two result sets if it appears in at least one of the result sets. The two <command>SELECT</command> statements that represent the direct operands of the <literal>UNION</literal> must produce the same number of columns, and corresponding columns must be of compatible data types.
ru: Оператор <literal>UNION</literal> вычисляет объединение множеств всех строк, возвращённых заданными запросами <command>SELECT</command>. Строка оказывается в объединении двух наборов результатов, если она присутствует минимум в одном наборе. Два оператора <command>SELECT</command>, представляющие прямые операнды <literal>UNION</literal>, должны выдавать одинаковое число столбцов, а типы соответствующих столбцов должны быть совместимыми.

source: The result of <literal>UNION</literal> does not contain any duplicate rows unless the <literal>ALL</literal> option is specified. <literal>ALL</literal> prevents elimination of duplicates. (Therefore, <literal>UNION ALL</literal> is usually significantly quicker than <literal>UNION</literal>; use <literal>ALL</literal> when you can.) <literal>DISTINCT</literal> can be written to explicitly specify the default behavior of eliminating duplicate rows.
ru: Результат <literal>UNION</literal> не будет содержать повторяющихся строк, если не указан параметр <literal>ALL</literal>. <literal>ALL</literal> предотвращает исключение дубликатов. (Таким образом, <literal>UNION ALL</literal> обычно работает значительно быстрее, чем <literal>UNION</literal>; поэтому, везде, где возможно, следует указывать <literal>ALL</literal>.) <literal>DISTINCT</literal> можно записать явно, чтобы обозначить, что дублирующиеся строки должны удаляться (это поведение по умолчанию).

source: Multiple <literal>UNION</literal> operators in the same <command>SELECT</command> statement are evaluated left to right, unless otherwise indicated by parentheses.
ru: При использовании в одном запросе <command>SELECT</command> нескольких операторов <literal>UNION</literal> они вычисляются слева направо, если иной порядок не определяется скобками.

source: Currently, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> and <literal>FOR KEY SHARE</literal> cannot be specified either for a <literal>UNION</literal> result or for any input of a <literal>UNION</literal>.
ru: В настоящее время указания <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> и <literal>FOR KEY SHARE</literal> нельзя задать ни для результата <literal>UNION</literal>, ни для любого из подзапросов <literal>UNION</literal>.

source: <literal>INTERSECT</literal> Clause
ru: Предложение <literal>INTERSECT</literal>

source: The <literal>INTERSECT</literal> clause has this general form: <synopsis> <replaceable class="parameter">select_statement</replaceable> INTERSECT [ ALL | DISTINCT ] <replaceable class="parameter">select_statement</replaceable> </synopsis><replaceable class="parameter">select_statement</replaceable> is any <command>SELECT</command> statement without an <literal>ORDER BY</literal>, <literal>LIMIT</literal>, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal>, or <literal>FOR KEY SHARE</literal> clause.
ru: Предложение <literal>INTERSECT</literal> имеет следующую общую форму: <synopsis> <replaceable class="parameter">оператор_SELECT</replaceable> INTERSECT [ ALL | DISTINCT ] <replaceable class="parameter">оператор_SELECT</replaceable> </synopsis> Здесь <replaceable class="parameter">оператор_SELECT</replaceable> — это любой подзапрос <command>SELECT</command> без предложений <literal>ORDER BY</literal>, <literal>LIMIT</literal>, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> и <literal>FOR KEY SHARE</literal>.

source: The <literal>INTERSECT</literal> operator computes the set intersection of the rows returned by the involved <command>SELECT</command> statements. A row is in the intersection of two result sets if it appears in both result sets.
ru: Оператор <literal>INTERSECT</literal> вычисляет пересечение множеств всех строк, возвращённых заданными запросами <command>SELECT</command>. Строка оказывается в пересечении двух наборов результатов, если она присутствует в обоих наборах.

source: The result of <literal>INTERSECT</literal> does not contain any duplicate rows unless the <literal>ALL</literal> option is specified. With <literal>ALL</literal>, a row that has <replaceable>m</replaceable> duplicates in the left table and <replaceable>n</replaceable> duplicates in the right table will appear min(<replaceable>m</replaceable>,<replaceable>n</replaceable>) times in the result set. <literal>DISTINCT</literal> can be written to explicitly specify the default behavior of eliminating duplicate rows.
ru: Результат <literal>INTERSECT</literal> не будет содержать повторяющихся строк, если не указан параметр <literal>ALL</literal>. С параметром <literal>ALL</literal> строка, повторяющаяся <replaceable>m</replaceable> раз в левой таблице и <replaceable>n</replaceable> раз в правой, будет выдана в результирующем наборе min(<replaceable>m</replaceable>,<replaceable>n</replaceable>) раз. <literal>DISTINCT</literal> можно записать явно, чтобы обозначить, что дублирующиеся строки должны удаляться (это поведение по умолчанию).

source: Multiple <literal>INTERSECT</literal> operators in the same <command>SELECT</command> statement are evaluated left to right, unless parentheses dictate otherwise. <literal>INTERSECT</literal> binds more tightly than <literal>UNION</literal>. That is, <literal>A UNION B INTERSECT C</literal> will be read as <literal>A UNION (B INTERSECT C)</literal>.
ru: При использовании в одном запросе <command>SELECT</command> нескольких операторов <literal>INTERSECT</literal> они вычисляются слева направо, если иной порядок не диктуется скобками. <literal>INTERSECT</literal> связывает свои подзапросы сильнее, чем <literal>UNION</literal>. Другими словами, <literal>A UNION B INTERSECT C</literal> будет восприниматься как <literal>A UNION (B INTERSECT C)</literal>.

source: Currently, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> and <literal>FOR KEY SHARE</literal> cannot be specified either for an <literal>INTERSECT</literal> result or for any input of an <literal>INTERSECT</literal>.
ru: В настоящее время указания <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> и <literal>FOR KEY SHARE</literal> нельзя задать ни для результата <literal>INTERSECT</literal>, ни для любого из подзапросов <literal>INTERSECT</literal>.

source: <literal>EXCEPT</literal> Clause
ru: Предложение <literal>EXCEPT</literal>

source: The <literal>EXCEPT</literal> clause has this general form: <synopsis> <replaceable class="parameter">select_statement</replaceable> EXCEPT [ ALL | DISTINCT ] <replaceable class="parameter">select_statement</replaceable> </synopsis><replaceable class="parameter">select_statement</replaceable> is any <command>SELECT</command> statement without an <literal>ORDER BY</literal>, <literal>LIMIT</literal>, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal>, or <literal>FOR KEY SHARE</literal> clause.
ru: Предложение <literal>EXCEPT</literal> имеет следующую общую форму: <synopsis> <replaceable class="parameter">оператор_SELECT</replaceable> EXCEPT [ ALL | DISTINCT ] <replaceable class="parameter">оператор_SELECT</replaceable> </synopsis> Здесь <replaceable class="parameter">оператор_SELECT</replaceable> — это любой подзапрос <command>SELECT</command> без предложений <literal>ORDER BY</literal>, <literal>LIMIT</literal>, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> и <literal>FOR KEY SHARE</literal>.

source: The <literal>EXCEPT</literal> operator computes the set of rows that are in the result of the left <command>SELECT</command> statement but not in the result of the right one.
ru: Оператор <literal>EXCEPT</literal> вычисляет набор строк, которые присутствуют в результате левого запроса <command>SELECT</command>, но отсутствуют в результате правого.

source: The result of <literal>EXCEPT</literal> does not contain any duplicate rows unless the <literal>ALL</literal> option is specified. With <literal>ALL</literal>, a row that has <replaceable>m</replaceable> duplicates in the left table and <replaceable>n</replaceable> duplicates in the right table will appear max(<replaceable>m</replaceable>-<replaceable>n</replaceable>,0) times in the result set. <literal>DISTINCT</literal> can be written to explicitly specify the default behavior of eliminating duplicate rows.
ru: Результат <literal>EXCEPT</literal> не будет содержать повторяющихся строк, если не указан параметр <literal>ALL</literal>. С параметром <literal>ALL</literal> строка, повторяющаяся <replaceable>m</replaceable> раз в левой таблице и <replaceable>n</replaceable> раз в правой, будет выдана в результирующем наборе max(<replaceable>m</replaceable>-<replaceable>n</replaceable>,0) раз. <literal>DISTINCT</literal> можно записать явно, чтобы обозначить, что дублирующиеся строки должны удаляться (это поведение по умолчанию).

source: Multiple <literal>EXCEPT</literal> operators in the same <command>SELECT</command> statement are evaluated left to right, unless parentheses dictate otherwise. <literal>EXCEPT</literal> binds at the same level as <literal>UNION</literal>.
ru: При использовании в одном запросе <command>SELECT</command> нескольких операторов <literal>EXCEPT</literal> они вычисляются слева направо, если иной порядок не диктуется скобками. <literal>EXCEPT</literal> связывает свои подзапросы так же сильно, как <literal>UNION</literal>.

source: Currently, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> and <literal>FOR KEY SHARE</literal> cannot be specified either for an <literal>EXCEPT</literal> result or for any input of an <literal>EXCEPT</literal>.
ru: В настоящее время указания <literal>FOR NO KEY UPDATE</literal>, <literal>FOR UPDATE</literal>, <literal>FOR SHARE</literal> и <literal>FOR KEY SHARE</literal> нельзя задать ни для результата <literal>EXCEPT</literal>, ни для любого из подзапросов <literal>EXCEPT</literal>.

source: <literal>ORDER BY</literal> Clause
ru: Предложение <literal>ORDER BY</literal>

source: The optional <literal>ORDER BY</literal> clause has this general form: <synopsis> ORDER BY <replaceable class="parameter">expression</replaceable> [ ASC | DESC | USING <replaceable class="parameter">operator</replaceable> ] [ NULLS { FIRST | LAST } ] [, ...] </synopsis> The <literal>ORDER BY</literal> clause causes the result rows to be sorted according to the specified expression(s). If two rows are equal according to the leftmost expression, they are compared according to the next expression and so on. If they are equal according to all specified expressions, they are returned in an implementation-dependent order.
ru: Необязательное предложение <literal>ORDER BY</literal> имеет следующую общую форму: <synopsis> ORDER BY <replaceable class="parameter">выражение</replaceable> [ ASC | DESC | USING <replaceable class="parameter">оператор</replaceable> ] [ NULLS { FIRST | LAST } ] [, ...] </synopsis> Предложение <literal>ORDER BY</literal> указывает, что строки результата должны сортироваться согласно заданным выражениям. Если две строки дают равные значения для самого левого выражения, проверяется следующее выражение и т. д. Если их значения оказываются равными для всех заданных выражений, строки возвращаются в порядке, определяемом реализацией.
