Repository: alexanderlaw/pg-doc-ru
Catalog: 9.6/ref/select.po
Languages: ru

source: Each <replaceable class="parameter">expression</replaceable> can be the name or ordinal number of an output column (<command>SELECT</command> list item), or it can be an arbitrary expression formed from input-column values.
ru: В качестве <replaceable class="parameter">выражения</replaceable> может задаваться имя или порядковый номер выходного столбца (элемента списка <command>SELECT</command>), либо произвольное выражение со значениями входных столбцов.

source: The ordinal number refers to the ordinal (left-to-right) position of the output column. This feature makes it possible to define an ordering on the basis of a column that does not have a unique name. This is never absolutely necessary because it is always possible to assign a name to an output column using the <literal>AS</literal> clause.
ru: Порядковым номером в данном случае считается последовательный номер (при нумерации слева направо) позиции выходного столбца. Возможность указать порядковый номер позволяет выполнить сортировку по столбцу, не имеющему уникального имени. В принципе это не абсолютно необходимо, так как выходному столбцу всегда можно присвоить имя, воспользовавшись предложением <literal>AS</literal>.

source: It is also possible to use arbitrary expressions in the <literal>ORDER BY</literal> clause, including columns that do not appear in the <command>SELECT</command> output list. Thus the following statement is valid: <placeholder-1/> A limitation of this feature is that an <literal>ORDER BY</literal> clause applying to the result of a <literal>UNION</literal>, <literal>INTERSECT</literal>, or <literal>EXCEPT</literal> clause can only specify an output column name or number, not an expression.
ru: В предложении <literal>ORDER BY</literal> также можно использовать произвольные выражения, в том числе, и со столбцами, отсутствующими в списке результатов <command>SELECT</command>. Таким образом, следующий оператор вполне корректен: <placeholder-1/> Однако, если <literal>ORDER BY</literal> применяется к результату <literal>UNION</literal>, <literal>INTERSECT</literal> или <literal>EXCEPT</literal>, в нём можно задать только имя или номер выходного столбца, но не выражение.

source: If an <literal>ORDER BY</literal> expression is a simple name that matches both an output column name and an input column name, <literal>ORDER BY</literal> will interpret it as the output column name. This is the opposite of the choice that <literal>GROUP BY</literal> will make in the same situation. This inconsistency is made to be compatible with the SQL standard.
ru: Если в качестве выражения <literal>ORDER BY</literal> задано простое имя, которому соответствует и выходной, и входной столбец, то <literal>ORDER BY</literal> будет воспринимать его как имя выходного столбца. Этот выбор противоположен тому, что делает <literal>GROUP BY</literal> в такой же ситуации. Такая несогласованность допущена для соответствия стандарту SQL.

source: Optionally one can add the key word <literal>ASC</literal> (ascending) or <literal>DESC</literal> (descending) after any expression in the <literal>ORDER BY</literal> clause. If not specified, <literal>ASC</literal> is assumed by default. Alternatively, a specific ordering operator name can be specified in the <literal>USING</literal> clause. An ordering operator must be a less-than or greater-than member of some B-tree operator family. <literal>ASC</literal> is usually equivalent to <literal>USING &lt;</literal> and <literal>DESC</literal> is usually equivalent to <literal>USING &gt;</literal>. (But the creator of a user-defined data type can define exactly what the default sort ordering is, and it might correspond to operators with other names.)
ru: Дополнительно после любого выражения в предложении <literal>ORDER BY</literal> можно добавить ключевое слово <literal>ASC</literal> (по возрастанию) или <literal>DESC</literal> (по убыванию). По умолчанию подразумевается <literal>ASC</literal>. Кроме того, можно задать имя специфического оператора сортировки в предложении <literal>USING</literal>. Оператор сортировки должен быть членом &laquo;меньше&raquo; или &laquo;больше&raquo; некоторого семейства операторов B-дерева. <literal>ASC</literal> обычно равнозначно <literal>USING &lt;</literal> и <literal>DESC</literal> обычно равнозначно <literal>USING &gt;</literal>. (Хотя создатель нестандартного типа данных может определить по-другому порядок сортировки по умолчанию и поставить ему в соответствие операторы с другими именами.)

source: If <literal>NULLS LAST</literal> is specified, null values sort after all non-null values; if <literal>NULLS FIRST</literal> is specified, null values sort before all non-null values. If neither is specified, the default behavior is <literal>NULLS LAST</literal> when <literal>ASC</literal> is specified or implied, and <literal>NULLS FIRST</literal> when <literal>DESC</literal> is specified (thus, the default is to act as though nulls are larger than non-nulls). When <literal>USING</literal> is specified, the default nulls ordering depends on whether the operator is a less-than or greater-than operator.
ru: Если указано <literal>NULLS LAST</literal>, значения NULL при сортировке оказываются после значений не NULL; с указанием <literal>NULLS FIRST</literal> значения NULL оказываются перед значениями не NULL. Если не указано ни то, ни другое, по умолчанию подразумевается <literal>NULLS LAST</literal> при явно или неявно выбранном порядке <literal>ASC</literal>, либо <literal>NULLS FIRST</literal> при порядке <literal>DESC</literal> (то есть по умолчанию считается, что значения NULL больше значений не NULL). С предложением <literal>USING</literal> порядок NULL по умолчанию зависит от того, является ли указанный оператор оператором &laquo;меньше&raquo; или &laquo;больше&raquo;.

source: Note that ordering options apply only to the expression they follow; for example <literal>ORDER BY x, y DESC</literal> does not mean the same thing as <literal>ORDER BY x DESC, y DESC</literal>.
ru: Заметьте, что параметры сортировки применяются только к тому выражению, за которым они следуют; в частности, <literal>ORDER BY x, y DESC</literal> означает не то же самое, что <literal>ORDER BY x DESC, y DESC</literal>.

source: Character-string data is sorted according to the collation that applies to the column being sorted. That can be overridden at need by including a <literal>COLLATE</literal> clause in the <replaceable class="parameter">expression</replaceable>, for example <literal>ORDER BY mycolumn COLLATE "en_US"</literal>. For more information see <xref linkend="sql-syntax-collate-exprs"/> and <xref linkend="collation"/>.
ru: Данные символьных строк сортируются согласно правилу сортировки, установленному для сортируемого столбца. При необходимости это правило можно переопределить, добавив предложение <literal>COLLATE</literal> в <replaceable class="parameter">выражение</replaceable>, например так: <literal>ORDER BY mycolumn COLLATE "en_US"</literal>. За дополнительными сведениями обратитесь к <xref remap="3" linkend="sql-syntax-collate-exprs"/> и <xref remap="3" linkend="collation"/>.

source: <literal>LIMIT</literal> Clause
ru: Предложение <literal>LIMIT</literal>

source: The <literal>LIMIT</literal> clause consists of two independent sub-clauses: <synopsis> LIMIT { <replaceable class="parameter">count</replaceable> | ALL } OFFSET <replaceable class="parameter">start</replaceable> </synopsis> <replaceable class="parameter">count</replaceable> specifies the maximum number of rows to return, while <replaceable class="parameter">start</replaceable> specifies the number of rows to skip before starting to return rows. When both are specified, <replaceable class="parameter">start</replaceable> rows are skipped before starting to count the <replaceable class="parameter">count</replaceable> rows to be returned.
ru: Предложение <literal>LIMIT</literal> состоит из двух независимых вложенных предложений: <synopsis> LIMIT { <replaceable class="parameter">число</replaceable> | ALL } OFFSET <replaceable class="parameter">начало</replaceable> </synopsis> Здесь <replaceable class="parameter">число</replaceable> определяет максимальное количество строк, которое должно быть выдано, тогда как <replaceable class="parameter">начало</replaceable> определяет, сколько строк нужно пропустить, прежде чем начать выдавать строки. Когда указаны оба значения, сначала строки пропускаются в количестве, заданном значением <replaceable class="parameter">начало</replaceable>, а затем следующие строки выдаются в количестве, не превышающем значения <replaceable class="parameter">число</replaceable>.

source: If the <replaceable class="parameter">count</replaceable> expression evaluates to NULL, it is treated as <literal>LIMIT ALL</literal>, i.e., no limit. If <replaceable class="parameter">start</replaceable> evaluates to NULL, it is treated the same as <literal>OFFSET 0</literal>.
ru: Если результатом выражения <replaceable class="parameter">число</replaceable> оказывается NULL, предложение воспринимается как <literal>LIMIT ALL</literal>, т. е. число строк не ограничивается. Если <replaceable class="parameter">начало</replaceable> принимает значение NULL, предложение воспринимается как <literal>OFFSET 0</literal>.

source: SQL:2008 introduced a different syntax to achieve the same result, which <productname>PostgreSQL</productname> also supports. It is: <synopsis> OFFSET <replaceable class="parameter">start</replaceable> { ROW | ROWS } FETCH { FIRST | NEXT } [ <replaceable class="parameter">count</replaceable> ] { ROW | ROWS } ONLY </synopsis> In this syntax, to write anything except a simple integer constant for <replaceable class="parameter">start</replaceable> or <replaceable class="parameter">count</replaceable>, you must write parentheses around it. If <replaceable class="parameter">count</replaceable> is omitted in a <literal>FETCH</literal> clause, it defaults to 1. <literal>ROW</literal> and <literal>ROWS</literal> as well as <literal>FIRST</literal> and <literal>NEXT</literal> are noise words that don't influence the effects of these clauses. According to the standard, the <literal>OFFSET</literal> clause must come before the <literal>FETCH</literal> clause if both are present; but <productname>PostgreSQL</productname> is laxer and allows either order.
ru: SQL:2008 вводит другой синтаксис для получения того же результата, и его так же поддерживает <productname>PostgreSQL</productname>. Он выглядит так: <synopsis> OFFSET <replaceable class="parameter">начало</replaceable> { ROW | ROWS } FETCH { FIRST | NEXT } [ <replaceable class="parameter">число</replaceable> ] { ROW | ROWS } ONLY </synopsis> В этом синтаксисе, чтобы подставить в <replaceable class="parameter">начало</replaceable> или <replaceable class="parameter">число</replaceable> что-либо сложнее простой целочисленной константы, необходимо заключить это выражение в скобки. Если <replaceable class="parameter">число</replaceable> опускается в предложении <literal>FETCH</literal>, оно принимает значение 1. <literal>ROW</literal> и <literal>ROWS</literal> так же, как и <literal>FIRST</literal> и <literal>NEXT</literal> являются избыточными словами, которые не влияют не действие этих предложений. Согласно стандарту, предложение <literal>OFFSET</literal> должно предшествовать предложению <literal>FETCH</literal>, если присутствуют они оба; но <productname>PostgreSQL</productname> менее строг и допускает любой порядок.

source: When using <literal>LIMIT</literal>, it is a good idea to use an <literal>ORDER BY</literal> clause that constrains the result rows into a unique order. Otherwise you will get an unpredictable subset of the query's rows &mdash; you might be asking for the tenth through twentieth rows, but tenth through twentieth in what ordering? You don't know what ordering unless you specify <literal>ORDER BY</literal>.
ru: Применяя <literal>LIMIT</literal>, имеет смысл использовать также предложение <literal>ORDER BY</literal>, чтобы строки результата выдавались в определённом порядке. Иначе будут возвращаться непредсказуемые подмножества строк запроса &mdash; вы можете запросить строки с десятой по двадцатую, но какой порядок вы имеете в виду? Порядок будет неизвестен, если не добавить <literal>ORDER BY</literal>.

source: The query planner takes <literal>LIMIT</literal> into account when generating a query plan, so you are very likely to get different plans (yielding different row orders) depending on what you use for <literal>LIMIT</literal> and <literal>OFFSET</literal>. Thus, using different <literal>LIMIT</literal>/<literal>OFFSET</literal> values to select different subsets of a query result <emphasis>will give inconsistent results</emphasis> unless you enforce a predictable result ordering with <literal>ORDER BY</literal>. This is not a bug; it is an inherent consequence of the fact that SQL does not promise to deliver the results of a query in any particular order unless <literal>ORDER BY</literal> is used to constrain the order.
ru: Планировщик запроса учитывает ограничение <literal>LIMIT</literal>, строя план выполнения запроса, поэтому, вероятнее всего, планы (а значит и порядок строк) будут меняться при разных <literal>LIMIT</literal> и <literal>OFFSET</literal>. Таким образом, различные значения <literal>LIMIT</literal>/<literal>OFFSET</literal>, выбирающие разные подмножества результатов запроса, <emphasis>приведут к несогласованности результатов</emphasis>, если не установить предсказуемую сортировку с помощью <literal>ORDER BY</literal>. Это не ошибка, а неизбежное следствие того, что SQL не гарантирует вывод результатов запроса в некотором порядке, если порядок не определён явно предложением <literal>ORDER BY</literal>.

source: It is even possible for repeated executions of the same <literal>LIMIT</literal> query to return different subsets of the rows of a table, if there is not an <literal>ORDER BY</literal> to enforce selection of a deterministic subset. Again, this is not a bug; determinism of the results is simply not guaranteed in such a case.
ru: Возможно даже, что при повторном выполнении одного и того же запроса с <literal>LIMIT</literal> будут получены разные подмножества строк таблицы, если предложение <literal>ORDER BY</literal> не диктует выбор определённого подмножества. Опять же, это не ошибка; в данном случае детерминированность результата просто не гарантируется.

source: The Locking Clause
ru: Предложение блокировки

source: <literal>FOR UPDATE</literal>, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR SHARE</literal> and <literal>FOR KEY SHARE</literal> are <firstterm>locking clauses</firstterm>; they affect how <literal>SELECT</literal> locks rows as they are obtained from the table.
ru: <firstterm>Предложения блокировки</firstterm> включают в себя <literal>FOR UPDATE</literal>, <literal>FOR NO KEY UPDATE</literal>, <literal>FOR SHARE</literal> и <literal>FOR KEY SHARE</literal>; они влияют на то, как <literal>SELECT</literal> блокирует строки, получаемые из таблицы.

source: The locking clause has the general form <synopsis> FOR <replaceable>lock_strength</replaceable> [ OF <replaceable class="parameter">table_name</replaceable> [, ...] ] [ NOWAIT | SKIP LOCKED ] </synopsis> where <replaceable>lock_strength</replaceable> can be one of <synopsis> UPDATE NO KEY UPDATE SHARE KEY SHARE </synopsis>
ru: Предложение блокировки имеет следующую общую форму: <synopsis> FOR <replaceable>вариант_блокировки</replaceable> [ OF <replaceable class="parameter">имя_таблицы</replaceable> [, ...] ] [ NOWAIT | SKIP LOCKED ] </synopsis> Здесь <replaceable>вариант_блокировки</replaceable> может быть следующим: <synopsis> UPDATE NO KEY UPDATE SHARE KEY SHARE </synopsis>

source: For more information on each row-level lock mode, refer to <xref linkend="locking-rows"/>.
ru: Подробнее о каждом режиме блокировки на уровне строк можно узнать в <xref remap="6" linkend="locking-rows"/>.

source: To prevent the operation from waiting for other transactions to commit, use either the <literal>NOWAIT</literal> or <literal>SKIP LOCKED</literal> option. With <literal>NOWAIT</literal>, the statement reports an error, rather than waiting, if a selected row cannot be locked immediately. With <literal>SKIP LOCKED</literal>, any selected rows that cannot be immediately locked are skipped. Skipping locked rows provides an inconsistent view of the data, so this is not suitable for general purpose work, but can be used to avoid lock contention with multiple consumers accessing a queue-like table. Note that <literal>NOWAIT</literal> and <literal>SKIP LOCKED</literal> apply only to the row-level lock(s) &mdash; the required <literal>ROW SHARE</literal> table-level lock is still taken in the ordinary way (see <xref linkend="mvcc"/>). You can use <xref linkend="sql-lock"/> with the <literal>NOWAIT</literal> option first, if you need to acquire the table-level lock without waiting.
ru: Чтобы операция не ждала завершения других транзакций, к блокировке можно добавить указание <literal>NOWAIT</literal> или <literal>SKIP LOCKED</literal>. С <literal>NOWAIT</literal> оператор выдаёт ошибку, а не ждёт, если выбранную строку нельзя заблокировать немедленно. С указанием <literal>SKIP LOCKED</literal> выбранные строки, которые нельзя заблокировать немедленно, пропускаются. При этом формируется несогласованное представление данных, так что этот вариант не подходит для общего применения, но может использоваться для исключения блокировок при обращении множества потребителей к таблице типа очереди. Заметьте, что указания <literal>NOWAIT</literal> и <literal>SKIP LOCKED</literal> применяются только к блокировкам на уровне строк &mdash; необходимая блокировка <literal>ROW SHARE</literal> уровня таблицы запрашивается обычным способом (см. <xref remap="4" linkend="mvcc"/>). Если требуется запросить блокировку уровня таблицы без ожидания, можно сначала выполнить <xref linkend="sql-lock"/> с указанием <literal>NOWAIT</literal>.

source: If specific tables are named in a locking clause, then only rows coming from those tables are locked; any other tables used in the <command>SELECT</command> are simply read as usual. A locking clause without a table list affects all tables used in the statement. If a locking clause is applied to a view or sub-query, it affects all tables used in the view or sub-query. However, these clauses do not apply to <literal>WITH</literal> queries referenced by the primary query. If you want row locking to occur within a <literal>WITH</literal> query, specify a locking clause within the <literal>WITH</literal> query.
ru: Если в предложении блокировки указаны определённые таблицы, блокироваться будут только строки, получаемые из этих таблиц; другие таблицы, задействованные в <command>SELECT</command>, будут прочитаны как обычно. Предложение блокировки без списка таблиц затрагивает все таблицы, задействованные в этом операторе. Если предложение блокировки применяется к представлению или подзапросу, оно затрагивает все таблицы, которые используются в представлении или подзапросе. Однако эти предложения не применяются к запросам <literal>WITH</literal>, к которым обращается основной запрос. Если требуется установить блокировку строк в запросе <literal>WITH</literal>, предложение блокировки нужно указать непосредственно в этом запросе <literal>WITH</literal>.

source: Multiple locking clauses can be written if it is necessary to specify different locking behavior for different tables. If the same table is mentioned (or implicitly affected) by more than one locking clause, then it is processed as if it was only specified by the strongest one. Similarly, a table is processed as <literal>NOWAIT</literal> if that is specified in any of the clauses affecting it. Otherwise, it is processed as <literal>SKIP LOCKED</literal> if that is specified in any of the clauses affecting it.
ru: В случае необходимости задать для разных таблиц разное поведение блокировки, в запрос можно добавить несколько предложений. Если при этом одна и та же таблица упоминается (или неявно затрагивается) в нескольких предложениях блокировки, блокировка устанавливается так, как если бы было указано только одно, самое сильное из них. Подобным образом, если в одном из предложений указано <literal>NOWAIT</literal>, для этой таблицы блокировка будет запрашиваться без ожидания. В противном случае она будет обработана в режиме <literal>SKIP LOCKED</literal>, если он выбран в любом из затрагивающих её предложений.

source: The locking clauses cannot be used in contexts where returned rows cannot be clearly identified with individual table rows; for example they cannot be used with aggregation.
ru: Предложения блокировки не могут применяться в контекстах, где возвращаемые строки нельзя чётко связать с отдельными строками таблицы; например, блокировка неприменима при агрегировании.

source: When a locking clause appears at the top level of a <command>SELECT</command> query, the rows that are locked are exactly those that are returned by the query; in the case of a join query, the rows locked are those that contribute to returned join rows. In addition, rows that satisfied the query conditions as of the query snapshot will be locked, although they will not be returned if they were updated after the snapshot and no longer satisfy the query conditions. If a <literal>LIMIT</literal> is used, locking stops once enough rows have been returned to satisfy the limit (but note that rows skipped over by <literal>OFFSET</literal> will get locked). Similarly, if a locking clause is used in a cursor's query, only rows actually fetched or stepped past by the cursor will be locked.
ru: Когда предложение блокировки находится на верхнем уровне запроса <command>SELECT</command>, блокируются именно те строки, которые возвращаются запросом; в случае с запросом объединения, блокировке подлежат строки, из которых составляются возвращаемые строки объединения. В дополнение к этому, заблокированы будут строки, удовлетворяющие условиям запроса на момент создания снимка запроса, хотя они не будут возвращены, если с момента снимка они изменятся и перестанут удовлетворять условиям. Если применяется <literal>LIMIT</literal>, блокировка прекращается, как только будет получено достаточное количество строк для удовлетворения лимита (но заметьте, что строки, пропускаемые указанием <literal>OFFSET</literal>, будут блокироваться). Подобным образом, если предложение блокировки применяется в запросе курсора, блокироваться будут только строки, фактически полученные или пройденные курсором.

source: When a locking clause appears in a sub-<command>SELECT</command>, the rows locked are those returned to the outer query by the sub-query. This might involve fewer rows than inspection of the sub-query alone would suggest, since conditions from the outer query might be used to optimize execution of the sub-query. For example, <placeholder-1/> will lock only rows having <literal>col1 = 5</literal>, even though that condition is not textually within the sub-query.
ru: Когда предложение блокировки находится в подзапросе <command>SELECT</command>, блокировке подлежат те строки, которые будет получены внешним запросом от подзапроса. Таких строк может оказаться меньше, чем можно было бы предположить, проанализировав только сам подзапрос, так как условия из внешнего запроса могут способствовать оптимизации выполнения подзапроса. Например, запрос <placeholder-1/> заблокирует только строки, в которых <literal>col1 = 5</literal>, при том, что в такой записи условие не относится к подзапросу.
